{
  "name": "Mariusz Jan Skobel",
  "role_name": "Senior Backend Engineer",
  "email": "mariuszskobel15@outlook.com",
  "phone": "+48 735 343 548",
  "address": "Katowice, Poland",
  "linkedin": "https://www.linkedin.com/in/mariusz-skobel-927764397/",
  "profile_summary": "Senior Backend Engineer with 10+ years of experience specializing in **Python**, **FastAPI**, and **microservices** architecture. Expert in designing and implementing **APIs** and ensuring **performance optimization** for high-performance software solutions. Demonstrated ability to build fault-tolerant systems leveraging **PostgreSQL** and **Redis** for real-time data handling. Proven track record in developing scalable applications that integrate with **Kubernetes** for seamless deployment in cloud environments.\n\nSkilled in **JavaScript/TypeScript**, **Flutter**, and full-stack development with hands-on expertise in **React**, **Next.js**, **Vue**, **Node.js**, and **Django**. Experienced in cloud-native deployment on Azure and AWS, leading the development of enterprise platforms with integrated AI/ML capabilities for enhanced analytics and automation. Strong focus on CI/CD automation processes and adherence to compliance standards like HIPAA, FHIR, PCI DSS, and SOC 2. Passionate about building impactful, maintainable systems that drive meaningful solutions.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2012",
      "to_year": "2015",
      "location": "UK",
      "university": "University of Bristol"
    }
  ],
  "experience": [
    {
      "role": "Senior Backend Engineer",
      "company": "EitBiz",
      "from_date": "Oct 2022",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "•\tDeveloped and maintained high-performance, scalable backend systems utilizing **Python** and **FastAPI** for streamlined communication between services, effectively implementing **microservices** architecture to enhance application flexibility.\n•\tImplemented robust, fault-tolerant solutions leveraging **Kubernetes** for container orchestration, optimizing resource management, and ensuring high availability across services.\n•\tDesigned relational database schemas and optimized queries in **PostgreSQL** and **Redis** for efficient data storage and retrieval, supporting applications with large datasets and high transactional volumes.\n•\tUsed real-time APIs to facilitate seamless integration and communication between various platform components, ensuring constant data flow and interactivity across services.\n•\tConducted performance optimization on critical components, resulting in a **30%** increase in response time efficiency and improved resource utilization.\n•\tLed initiatives to migrate legacy monolithic applications to cloud-native frameworks, reducing deployment time by **40%** and improving scalability.\n•\tCollaborated with cross-functional teams to understand server-side requirements and implement innovative solutions that enhanced user experience and met business goals.\n•\tUtilized extensive knowledge of CI/CD pipelines and DevOps practices to improve deployment workflows and minimize downtime, achieving **99.9%** uptime in production environments.\n•\tImplemented comprehensive testing strategies using automated tools to enhance code reliability and reduce time-to-market for new features."
    },
    {
      "role": "Software Engineer",
      "company": "Tvn S.A.",
      "from_date": "Oct 2019",
      "to_date": "Sep 2022",
      "location": "Poland",
      "responsibilities": "Designed and implemented **microservices** architecture leveraging **Python** and **FastAPI**, enhancing fault-tolerance and performance optimization for robust backend systems.\nUtilized **Kubernetes** for container orchestration, ensuring seamless deployment and scalability of services, reducing downtime by **30%** during upgrades.\nManaged database operations with **PostgreSQL**, optimizing query performance which resulted in a **25%** improvement in application response times under high-load situations.\nIntegrated **Redis** for caching strategies, minimizing data retrieval times and improving overall system performance, achieving a **40%** reduction in API response latency.\nBuilt RESTful **APIs** to support various frontend applications, facilitating real-time communication and data exchange, ensuring synchronization across multiple services.\nLed efforts in performance optimization, identifying bottlenecks in the existing system by conducting thorough analysis that resulted in a **50%** enhancement in throughput for transaction processing.\nCollaborated with cross-functional teams to create engineering solutions that align with business goals, ensuring the high availability and reliability of services.\nMaintained and updated existing **APIs** to accommodate new features while ensuring continuous integration and deployment, leading to better agility in delivering client-requested enhancements."
    },
    {
      "role": "Software Engineer",
      "company": "Timspark",
      "from_date": "Sep 2015",
      "to_date": "Aug 2019",
      "location": "UK",
      "responsibilities": "Utilized **Python** with **FastAPI** to design and optimize backend microservices for a global e-commerce platform, ensuring high availability and performance optimization across key modules like checkout and order fulfillment.\nImplemented scalable architectures with **Kubernetes** to manage deployment and orchestration, ensuring fault-tolerant services capable of handling over **1 million** transactions daily.\nDeveloped and maintained robust **APIs** facilitating communication between services, resulting in a **30%** reduction in response times through performance optimizations and efficient resource allocation.\nLeveraged **PostgreSQL** and **Redis** for distributed data storage, ensuring high-speed data access and implementing caching strategies that improved application responsiveness by **50%**.\nEngineered real-time features through WebSocket implementation, enhancing customer interactions with real-time order updates and dynamic inventory tracking, pivotal for a responsive user experience.\nExecuted comprehensive monitoring and logging strategies to ensure service uptime above **99.9%**, supporting mission-critical operations in the e-commerce sector.\nCreated efficient microservices that interact seamlessly in a distributed architecture, optimizing workflows and improving fault tolerance across the platform.\nParticipated in code reviews and automated testing to maintain high standards of quality and reliability, facilitating continuous integration and deployment practices.\nCollaborated with cross-functional teams to gather requirements and translate them into technical specifications, driving effective backlog refinement and prioritization of features."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython\n\n **Backend Frameworks:**\n\tFastAPI\n\n **Frontend Frameworks:**\n\tJavaScript/TypeScript (React, Vue, Angular)\n\n **API Technologies:**\n\tAPIs\n\n **Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n **Databases:**\n\tPostgreSQL, MySQL (Healthcare), MongoDB (Gaming), Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:**\n\tAWS, Azure\n\n **Other:**\n\tMLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, microservices, fault-tolerant, real-time audio, performance optimization",
  "apply_company": "Hams.AI"
}