{
  "name": "Patryk Zaslawski",
  "role_name": "AI Engineer (Growth / ClinicOS)",
  "email": "patrykzas0428@outlook.com",
  "phone": "+48669862402",
  "address": "Gdanski, Poland",
  "linkedin": "https://www.linkedin.com/in/patryk-zaslawski-6b04a8397/",
  "profile_summary": "As a seasoned AI Engineer with 8+ years of software engineering experience, I excel in developing LLM production solutions and integrating data pipelines to optimize performance and scalability. Proficient in **Python** alongside **TypeScript**, I specialize in building robust **APIs** and leveraging **React** for dynamic user interfaces. My technical expertise encompasses **cloud services** such as **AWS**, with a strong foundation in **distributed systems** and **orchestration frameworks**. I am well-versed in utilizing **vector databases**, **embeddings**, **OCR**, and **image processing** techniques that drive innovative solutions in the AI domain. Additionally, I have a proven ability to design and implement high-performance applications for the e-commerce, financial, and healthcare sectors, ensuring that they are both secure and efficient by leveraging industry best practices.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2014",
      "to_year": "2017",
      "location": "United Kingdom",
      "university": "The University of Manchester"
    }
  ],
  "experience": [
    {
      "role": "AI Engineer (Growth / ClinicOS)",
      "company": "Binary Studio",
      "from_date": "Aug 2023",
      "to_date": "Present",
      "location": "United Kingdom (Remote)",
      "responsibilities": "• Developed and deployed scalable **Python** applications and **APIs** to support **LLM Production** within a secure healthcare environment, ensuring compliance with regulations such as HIPAA and GDPR.\n• Designed data pipelines for processing and orchestrating workflows using **AWS** services, enhancing data flow and management across distributed systems.\n• Integrated **Vector databases** for efficient retrieval and storage of embeddings, improving the overall performance of AI systems.\n• Created real-time processing frameworks leveraging **OCR** and **image processing** techniques within a **Python** ecosystem, streamlining data ingestion and transformation.\n• Collaborated in building user interfaces with **React** and **TypeScript**, enhancing the user experience for healthcare applications.\n• Architected and managed **data pipelines** utilizing orchestration frameworks such as **Apache Airflow** to ensure seamless data workflow processes.\n• Implemented monitoring solutions for AI systems using observability tools, resulting in precise performance tuning and proactive issue resolution.\n• Led a cross-functional team through the development of cloud-native AI solutions, mentoring peers in **Python** and teaching best practices related to AI and machine learning deployment.\n• Optimized application performance by implementing **CI/CD pipelines** with tools like GitHub Actions and Azure DevOps for automated testing and deployments.\n• Ensured high availability and scalability of applications by leveraging **AWS** services and Kubernetes for container orchestration.\n• Conducted performance and stress testing of AI applications using frameworks like Apache JMeter to ensure system resilience and responsiveness.\n• Guided the implementation of security best practices in AI applications, adhering to compliance standards such as SOC 2 and ISO 27001.\n• Spearheaded innovative solutions through research and integration of **embeddings** for enhanced data analysis and machine learning capabilities."
    },
    {
      "role": "Software Engineer",
      "company": "Ardigen",
      "from_date": "Mar 2020",
      "to_date": "Aug 2023",
      "location": "Poland",
      "responsibilities": "- Developed and deployed **LLM production** models leveraging **Python**, optimizing data pipelines for enhanced performance and accuracy.\n- Designed and implemented **APIs** and integrations using **TypeScript** and **Python**, facilitating seamless connection between AI services and frontend applications.\n- Integrated **OCR** and **image processing** technologies into applications, enhancing the response and data extraction capabilities in **Python**.\n- Built dynamic and responsive user interfaces using **React**, ensuring optimal performance while interacting with **APIs** and **distributed systems**.\n- Orchestrated data pipelines utilizing cloud resources (**AWS**) to preprocess and manage data for machine learning applications.\n- Developed real-time monitoring dashboards for AI performance metrics, showcasing data through **Python** and visualization tools.\n- Implemented **vector databases** for efficient storage and retrieval of embeddings, improving the processing of AI models.\n- Ensured compliance with data protection regulations in AI models by integrating secure practices and auditing with **Python**.\n- Managed orchestration frameworks for distributed systems, optimizing resource allocation and scaling of AI services.\n- Contributed to the framework of generative models through continuous integration and testing (CI/CD) practices, ensuring robust deployment and maintenance.\n- Collaborated on the evolution of **cloud (AWS)**-based AI solutions, enhancing scalability and resource management.\n- Successfully enhanced performance benchmarks by utilizing embeddings strategies in model training, resulting in improved response times by **30%**.\n- Engaged in cross-functional teams to integrate cutting-edge AI features into existing infrastructures, promoting growth and efficiency within the organization."
    },
    {
      "role": "Software Engineer",
      "company": "Altum Software",
      "from_date": "Oct 2017",
      "to_date": "Feb 2020",
      "location": "United Kingdom",
      "responsibilities": "• Developed and deployed scalable **Python** solutions to support **LLM Production** initiatives, leveraging frameworks and libraries like **FastAPI** and **Django** to build high-performance applications.\n• Designed and implemented robust APIs in **Python** to facilitate seamless integration between various systems, improving transaction handling and data flow within **AI** projects.\n• Utilized **TypeScript** and **React** to create dynamic, user-friendly interfaces for AI-powered applications, enhancing user interaction and experience across web platforms.\n• Engineered **data pipelines** that process large volumes of data, incorporating advanced techniques such as **embeddings** and **OCR** for data enrichment and analysis.\n• Integrated and managed **vector databases** to enable efficient storage and retrieval of embeddings, supporting machine learning capabilities in production environments.\n• Streamlined orchestration of microservices by employing orchestration frameworks, ensuring high availability and scalability in **distributed systems**.\n• Conducted image processing tasks with **Python** libraries, enhancing data analysis and representation, crucial for supporting AI functionalities in different applications.\n• Deployed solutions on **AWS**, utilizing cloud services to enable scalable operations and robust data management in an AI-driven ecosystem.\n• Carried out thorough performance testing using tools like Apache JMeter and Locust, ensuring the reliability and efficiency of applications under realistic workloads.\n• Replaced legacy systems with modern **Python** microservices to enhance the architecture of applications and improve overall performance, focusing on transition strategies for optimized workflows.\n• Collaborated in cross-functional teams to align system designs with industry standards and business objectives, driving the adoption of **AI technologies** within the organization."
    }
  ],
  "skills": "**Programming Languages:**\n\tPython, TypeScript\n\n**Backend Frameworks:**\n\tFastAPI, Django, Flask, Spring Boot\n\n**Frontend Frameworks:**\n\tReact, Angular (1–16), Next.js, Vue.js (2/3), Blazor\n\n**API Technologies:**\n\tREST & gRPC APIs, APIs\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda), Cloud (AWS)\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis, Vector databases\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD\n\n**Cloud & Infrastructure:**\n\tAWS (RDS, S3), Azure (App Services, Blob, SQL)\n\n**Other:**\n\tSQLAlchemy, Pydantic, Celery, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, Data pipelines, Distributed systems, OCR, Image processing, LLM Production, Embeddings, Orchestration frameworks"
}