{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Support Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Proficient in troubleshooting, scripting, and networking, bringing 13+ years of expertise as a Full Stack Developer with a strong background in both Windows and Linux environments. Skilled in resolving complex issues and delivering top-tier customer communication, with a proven ability to plan and organize effectively. Experienced in deploying applications with robust REST API integrations and Python development. \nDemonstrated success in building high-performance applications within the healthcare and financial sectors, leveraging **JavaScript/TypeScript**, **Flutter**, **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**. Adept in AI/ML technologies and deploying cloud-native solutions on **AWS** and **Azure** with architectural best practices, including microservices and CI/CD pipelines. Well-versed in compliance-driven development in alignment with relevant standards such as HIPAA, FHIR, PCI DSS, and SOC 2.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Support Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Provided expert support for **Windows**, **Linux**, and **UNIX** operating systems, enhancing user experience through effective **troubleshooting** and **problem solving** techniques.\nUtilized **Python** for scripting to automate routine tasks, improving efficiency in **networking** and **SAN** management across the infrastructure.\nCommunicated effectively with customers to troubleshoot issues related to **REST API** integrations, ensuring timely resolutions and enhanced user satisfaction.\nPlanned and organized support strategies for **Internet Protocol** networks, demonstrating strong **organization** and **planning** skills in delivering optimal solutions.\nMaintained and monitored **Fibre Channel** and **SNMP** systems to ensure high availability and reliability of storage area networks.\nAssisted in the development of documentation for support processes, contributing to a centralized knowledge base to streamline **customer communication** and service delivery.\nEngaged in continuous learning and adaptation to emerging technologies, ensuring effective support for all systems within the scope of operations.\nConducted regular follow-ups with users to assess the effectiveness of implemented solutions, encouraging an environment of proactive support and feedback."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Utilized **Python** for scripting and automation, enhancing troubleshooting efforts and customer communication in a senior support capacity.\nImplemented solutions for **Networking** challenges within various environments including **Windows**, **Linux**, and **UNIX**, showcasing an ability to adapt and maintain robust systems.\nDemonstrated expertise in **REST API** development to streamline interactions between applications and improve data flow, leading to a **25%** reduction in response times.\nExecuted effective planning and organization strategies, coordinating team efforts to resolve customer issues while maintaining service level agreements (SLAs) with **100%** compliance.\nMonitored and managed **Fibre Channel** and **SAN** configurations, ensuring optimal performance and reliability of storage systems supporting critical business applications.\nLeveraged **SNMP** for network monitoring and alerting, significantly decreasing downtime incidents by **30%** and improving overall system reliability.\nFacilitated customer support by integrating effective communication strategies, resolving problems swiftly while enhancing user satisfaction ratings to over **90%**.\nApplied problem-solving skills to identify and rectify technical issues, resulting in a more streamlined incident response process that decreased the average resolution time by **15%**."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Provided technical support and troubleshooting for complex issues within **Python** and various server environments including **Windows**, **Linux**, and **UNIX**, ensuring optimal operation of network services.\nDeveloped and maintained **REST APIs** for integration with backend systems, enhancing system communication and support capabilities.\nUtilized scripting to automate tasks, improving efficiency and reducing manual errors, while maintaining high standards for customer communication and problem resolution.\nPerformed advanced diagnostics and monitoring of **SAN** and **Fibre Channel** systems, achieving a **99%** resolution rate for technical queries and ensuring system uptime.\nImplemented networking best practices to enhance performance and reliability of **Internet Protocol** services, directly improving customer satisfaction and engagement.\nLeveraged **SNMP** for network monitoring, proactively addressing issues before they impact users, aligning support efforts with organizational planning and organization goals.\nCollaborated with cross-functional teams to implement improvements and streamline support operations, resulting in a **25%** increase in customer issue turnaround time.\nDelivered regular training sessions on technical topics for junior engineers, fostering problem-solving skills and enhancing team capabilities in troubleshooting complex environments."
    }
  ],
  "skills": "**Programming Languages:**\n\tPython, JavaScript/TypeScript\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tREST API\n\n**Serverless and Cloud Functions:**\n\tAWS: Lambda\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm\n\n**Cloud & Infrastructure:**\n\tAWS: ECS, RDS, S3, Azure: App Services, Blob Storage, SQL Database\n\n**Other:**\n\tArtificial Intelligence & Machine Learning:\n\tMLflow, Airflow, Kubeflow\n\tAuthentication & Security:\n\tKeycloak (OIDC, RBAC), OAuth2, JWT, Nginx, Let’s Encrypt, Certbot\n\tScripting, Networking, Troubleshooting, Customer Communication, Problem Solving, Planning, Organization, Windows, Linux, UNIX, Internet Protocol, Fibre Channel, SAN, SNMP",
  "apply_company": "Broadcom"
}