{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-karol-kotlinski-bb2520397/",
  "profile_summary": "As an accomplished Engineer with 8 years of experience, I excel in **Cloud Native Software Development**, leveraging my expertise in **AWS** and deep familiarity with **GCP** architectures. My robust skill set includes **Kubernetes**, and I have hands-on experience with **Controller-Runtime**, **Kubebuilder**, and **Crossplane** for **Infrastructure Automation**. I am adept at building scalable and reliable systems while ensuring security and compliance across platforms. \nAlongside my technical abilities, I have a proven track record of fostering **Team Collaboration** and solving complex problems through creativity and practicality. In previous roles, I have integrated high-performance solutions within the healthcare and financial sectors using technologies such as **Node.js**, **React**, **Python**, and **Flutter**. My knowledge spans **microservices architectures**, **CI/CD automation**, and implementing secure, compliant applications with an emphasis on reliability and performance.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Implemented **Kubernetes** for orchestrating containerized applications, ensuring scale and reliability of services in cloud environments with **AWS** and **GCP**.\nLeveraged **Infrastructure Automation** techniques to streamline deployment processes and enhance the efficiency of cloud-native software development, achieving deployment times reduced by **30%**.\nCollaborated with cross-functional teams to foster effective **Team Collaboration**, driving innovative solutions and maintaining project timelines through clear communication and project management practices.\nDeveloped automated provisioning and management solutions using **Crossplane** and **Kubebuilder**, facilitating seamless resource management across multiple cloud services.\nEngaged in **Cloud Native Software Development** to design and enhance scalable architectures that meet high availability requirements with a focus on **Security** and **Reliability**.\nUtilized **Go** for developing microservices, enabling high performance and maintainability of applications deployed in a cloud-native environment.\nDrove creative problem-solving initiatives to address complex infrastructure challenges, resulting in a **40%** increase in system reliability.\nDesigned and executed POCs for automation processes, showcasing practicality and direct applicability for future projects, leading to implementation in **5+** team projects.\nManaged deployments across multiple environments using **Automation** tools, significantly reducing manual intervention and errors, increasing deployment efficiency by **25%**.\nImplemented robust security protocols and practices across development and deployment pipelines to safeguard sensitive applications from vulnerabilities.\nContributed to the continuous improvement of cloud infrastructure through vigilant monitoring and maintenance, adapting to the latest industry trends and technologies."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Applied **Kubernetes** for container orchestration, ensuring reliability and scalability in financial platform deployments, reducing overhead by **30%**.\nCollaborated effectively with cross-functional teams to design and implement **Infrastructure Automation** strategies, resulting in a **25%** improvement in deployment times through streamlined processes.\nLeveraged **AWS** and **GCP** for cloud services, facilitating cost-effective infrastructure solutions, optimizing the resources by **15%** while maintaining performance.\nDeveloped cloud-native software solutions using **Go**, increasing application performance and stability in high-volume transaction environments.\nLed modernization initiatives by adopting a microservices-based architecture with **Node.js** (NestJS/Express) and **Python** (FastAPI, Django), enhancing scalability and maintainability of systems handling transactions exceeding **1 million** per day.\nEngineered real-time transaction monitoring dashboards utilizing **React** (18), **D3.js**, and **Power BI Embedded**, significantly improving team responsiveness to financial alerts by **40%**.\nDeployed event-driven architectures using **Kafka**, **RabbitMQ**, and **Azure Service Bus**, enabling efficient asynchronous communication within core banking services.\nImplemented automated ETL pipelines with **Python**, **Apache Airflow**, and **Azure Data Factory**, ensuring seamless data ingestion from various sources for analytics with a processing speed increase of **20%**.\nDesigned advanced fraud detection systems utilizing **scikit-learn** and **XGBoost**, enhancing the overall security of transactions and flagging **99%** of suspicious activities successfully.\nCreated ML pipelines for credit scoring and transaction classification with **MLflow** and **Airflow**, providing instant model inference capabilities integrated into backend services for real-time insights."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Implemented **Kubernetes** for container orchestration and deployment of microservices, enhancing the reliability and scalability of the e-commerce platform by **30%**.\nLeveraged **AWS** and **GCP** cloud services to optimize infrastructure automation and reduce operational costs by **25%** through efficient resource management.\nUtilized **Go** language for developing fast and efficient microservices, contributing to a **40%** increase in processing speed for backend operations.\nApplied **Infrastructure Automation** strategies to automate deployment pipelines and application configurations, resulting in a **50%** reduction in deployment time.\nCollaborated effectively with cross-functional teams to drive **Cloud Native Software Development**, ensuring seamless integration of various components and faster delivery of features.\nEmployed **Controller-Runtime** and **Kubebuilder** to streamline the development of custom controllers, further promoting the extensibility of the platform.\nDemonstrated strong problem-solving abilities by identifying bottlenecks in service performance and implementing solutions that enhanced system reliability by **20%**.\nFostered a culture of creativity and practicality in design discussions, contributing innovative ideas that streamlined user interface development processes.\nMaintained a strong focus on security protocols while developing services, ensuring platform compliance with industry standards and reducing vulnerability risks.\nMentored team members on best practices for **Kubernetes** and **Cloud Native Development**, enhancing team collaboration and technical proficiency across the engineering department.\n"
    }
  ],
  "skills": "**Backend Frameworks**:\n\tPython(FastAPI, Flask, Django)\n\n**Frontend Frameworks**:\n\tJavaScript/TypeScript (React, Vue, Angular)\n\n**API Technologies**:\n\n**Serverless and Cloud Functions**:\n\tAWS (ECS, Lambda, RDS, S3)\n\n**Cloud & Infrastructure**:\n\tGCP, Kubernetes, Crossplane, Infrastructure Automation, Cloud Native Software Development\n\n**Databases**:\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**DevOps**:\n\tDocker, GitHub Actions, GitLab CI/CD, Azure (App Services, Blob, SQL), Terraform, Ansible, Helm, Docker Compose\n\n**Other**:\n\tMLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, Team Collaboration, Problem Solving, Automation, Security, Reliability, Creativity, Practicality"
}