{
  "name": "Patryk Zaslawski",
  "role_name": "Principle Software Engineer",
  "email": "patrykzas0428@outlook.com",
  "phone": "+48669862402",
  "address": "Gdanski, Poland",
  "linkedin": "https://www.linkedin.com/in/patryk-zaslawski-6b04a8397/",
  "profile_summary": "As a Principle Software Engineer with expertise in End-to-End Development, I bring 8+ years of experience in software engineering, focusing on building robust solutions in e-commerce, financial, and healthcare sectors. I am proficient in **Go**, **TypeScript**, PostgreSQL, and **Redis**, leveraging cutting-edge technologies to create high-performance applications. My strong foundation in algorithms and data structures, particularly in Graph Algorithms, enhances my ability to engineer efficient solutions. I have experience in developing secure and scalable applications, drawing from my background in **Python** (FastAPI, Django, Flask, SQLAlchemy) and modern frontend frameworks like **Angular**, **Vue**, **React**, and **Next.js**. Additionally, I am well-versed in utilizing cloud services such as **AWS** and **Azure**, and optimizing databases like PostgreSQL, MySQL, and MongoDB for superior system performance and reliability, all while adhering to best practices in microservices architecture and REST/gRPC API development.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2014",
      "to_year": "2017",
      "location": "United Kingdom",
      "university": "The University of Manchester"
    }
  ],
  "experience": [
    {
      "role": "Principle Software Engineer",
      "company": "Binary Studio",
      "from_date": "Aug 2023",
      "to_date": "Present",
      "location": "United Kingdom (Remote)",
      "responsibilities": "• Led the architectural design and development of a scalable, cloud-native platform using **Go** and **TypeScript**, enhancing performance and reliability in delivering digital healthcare experiences.\n• Developed and optimized algorithms for efficient data processing and real-time transactions within the system, ensuring robust end-to-end functionality.\n• Created and maintained databases using **PostgreSQL** and **Redis**, implementing effective data structures for improved query performance and system scalability.\n• Guided the integration of **Go** microservices into existing workflows, ensuring seamless communication across automated healthcare and financial processes.\n• Architected solutions employing **RESTful APIs** and **gRPC** in **TypeScript**, enabling secure and efficient data exchange between healthcare providers and services.\n• Spearheaded the compliance of solutions with industry standards such as HIPAA and PCI DSS, embedding security best practices across all layers of development.\n• Developed comprehensive test strategies using Python test frameworks alongside **TypeScript** to ensure high-quality and reliable software delivery.\n• Mentored a team of 10+ engineers on best practices in **Go**, **TypeScript**, algorithms, and end-to-end development methodologies, fostering a culture of innovation and excellence.\n• Conducted extensive performance analysis using monitoring tools to evaluate the efficiency of algorithms and system performance, leading to a 30% increase in response times.\n• Implemented observability techniques across **Go** and **TypeScript** services, employing tools like Prometheus and Grafana to ensure proactive monitoring and rapid issue resolution.\n• Championed the development of modular and scalable codebases, adhering to best practices in software architecture and design patterns for robust healthcare applications.\n• Streamlined deployment processes for microservices via CI/CD pipelines, reducing deployment times by 40% while enhancing operational efficiency and code quality.\n• Pioneered data structures and graph algorithms to optimize data retrieval processes, significantly enhancing system performance under heavy loads."
    },
    {
      "role": "Software Engineer",
      "company": "Ardigen",
      "from_date": "Mar 2020",
      "to_date": "Aug 2023",
      "location": "Poland",
      "responsibilities": "- Led the development and migration of microservices-based backend architecture using **Go** and **TypeScript**, enhancing scalability, maintainability, and performance with a focus on **PostgreSQL** and **Redis** for efficient data storage.\n- Designed and implemented secure RESTful APIs in **Go**, facilitating seamless communication between front-end applications and backend services with improved transaction management.\n- Managed the integration of diverse databases, including **PostgreSQL** and **Redis**, effectively optimizing data access and storage strategies to ensure high uptime and responsiveness.\n- Spearheaded end-to-end development of user-centric applications utilizing **TypeScript** frameworks, ensuring enhanced user experience and engagement.\n- Developed and maintained algorithms and data structures optimized for performance, directly contributing to application efficiency and faster processing times.\n- Leveraged advanced graph algorithms for data analysis and visualization, enhancing the insights derived from application datasets.\n- Implemented CI/CD pipelines using **GitHub Actions** and **Azure DevOps**, streamlining the development process to ensure efficient and timely delivery of software updates.\n- Advocated for and applied rigorous software engineering practices, including code reviews and automated testing, guaranteeing a high-quality codebase and facilitating team knowledge sharing.\n- Partnered closely with cross-functional teams to define technical requirements and align development efforts with business objectives, enhancing overall project delivery.\n- Conducted performance analyses and optimizations within existing systems, leading to a **30%** increase in processing speeds and improved system reliability.\n- Mentored junior engineers in **Go** and **TypeScript** best practices, contributing to team skill development and fostering a culture of continuous learning.\n- Contributed to architectural design and strategy discussions, helping steer technical vision towards innovative solutions and modern technologies."
    },
    {
      "role": "Software Engineer",
      "company": "Altum Software",
      "from_date": "Oct 2017",
      "to_date": "Feb 2020",
      "location": "United Kingdom",
      "responsibilities": "Utilized **Go** for building efficient backend services, enhancing performance and scalability in line with industry standards.\nDeveloped and optimized system algorithms and data structures to improve application efficiency and effectiveness, resulting in a **30%** increase in processing speed for critical operations.\nLeveraged **TypeScript** in full-stack development to create maintainable and scalable applications, ensuring enhanced code quality and team collaboration.\nDesigned, optimized, and managed relational databases using **PostgreSQL**, successfully reducing query latency by **40%** through effective indexing and optimization strategies.\nImplemented caching strategies using **Redis** to improve application response times, achieving a **25%** reduction in server load during peak usage.\nConducted end-to-end development for key application modules, improving the overall user experience and satisfaction metrics by **15%**.\nPerformed rigorous testing with unit, integration, and end-to-end methods, bolstering code quality and reducing bug counts by **20%** prior to deployment.\nMentored junior engineers on best practices in algorithms and data structures, fostering a culture of excellence within the team.\nArchitected solutions leveraging **C++** and **Rust** for performance-critical components, ensuring efficient resource management and improved application performance.\nCollaborated on cross-functional teams to align technology strategies with business objectives, ensuring robust and scalable platform solutions."
    }
  ],
  "skills": "Programming Languages:\n\tPython, Go, TypeScript, C++, Rust\n\n**Backend Frameworks:**\n\tFastAPI, Django, Flask, Spring Boot\n\n**Frontend Frameworks:**\n\tAngular (1–16), React (15–18), Next.js, Vue.js (2/3), Blazor\n\n**API Technologies:**\n\tREST & gRPC APIs\n\n**Serverless and Cloud Functions:**\n\tAWS (Lambda), Azure (App Services)\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD\n\n**Cloud & Infrastructure:**\n\tAWS (ECS, RDS, S3), Azure (Blob, SQL)\n\n**Other:**\n\tSQLAlchemy, Pydantic, Celery, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, Algorithms, Data Structures, Graph Algorithms, End-to-End Development"
}