{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Angular Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Senior Angular Engineer with 13+ years of experience in delivering high-performance applications across the healthcare and financial industries. Proficient in **Angular**, **JavaScript**, and **TypeScript**, with a strong foundation in **Clean Code** principles and **Testing** methodologies. Experienced in Agile development environments and adept at collaborating cross-functionally to ensure successful project delivery.\nSkilled in both frontend and backend development using frameworks like **React**, **Next.js**, and **Vue**, as well as backend technologies including **Node.js**, **FastAPI**, and **Django**. Proven track record in building AI/ML-powered platforms and deploying cloud-native systems on **AWS** and **Azure**. \nWell-versed in compliance-driven development, aligning solutions with industry standards such as HIPAA, FHIR, PCI DSS, and SOC 2, with a solid background in MLOps tools including **MLflow**, **Airflow**, and **Kubeflow**.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Angular Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Developed dynamic front-end applications using **Angular** and **TypeScript**, ensuring adherence to **Clean Code** principles and enhancing user engagement in a **Agile** environment.\n• Collaborated with cross-functional teams to deliver high-quality software solutions, improving overall project delivery time by **25%** through efficient task allocation and agile practices.\n• Implemented strong testing methodologies using **Jest** and **Cypress**, achieving a **95%** code coverage rate and facilitating smoother deployment processes.\n• Led code reviews and pair programming sessions to uphold **Clean Code** practices, enhancing maintainability and reducing technical debt, which resulted in a **15%** reduction in bugs.\n• Regularly communicated project updates and technical intricacies in **English**, fostering transparent team collaboration and aligning project goals.\n• Mentored junior developers on **TypeScript** and **Angular**, contributing to skill enhancement and professional growth within the team.\n• Participated in Agile ceremonies to continuously refine workflows and improve team collaboration, leading to a more streamlined project management approach.\n• Designed and executed unit and integration tests to ensure all new features maintain high-quality standards and functionality across the application stack."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Utilized **TypeScript** and **Angular** (v13) to build high-performance, scalable web applications, enhancing user experience in financial tool interfaces.\nApplied **JavaScript** to implement clean, maintainable code while adhering to Agile principles and best practices in software development.\nCollaborated in an Agile environment to deliver software solutions through rigorous testing and adherence to **Clean Code** methodologies, ensuring high-quality deliverables.\nLed the modernization of front-end architecture, focusing on reusability and responsiveness, improving overall efficiency and performance metrics by over **30%**.\nParticipated in code reviews and mentor junior developers to foster technical growth and promote adherence to best practices in coding and design patterns.\nEngaged with cross-functional teams to gather requirements and provide technical solutions in English, ensuring clear communication and project alignment.\nIntegrated third-party services and components effectively while ensuring compatibility and performance optimization in fast-paced financial applications."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Utilized **Angular** (v12) alongside **TypeScript** to develop dynamic, high-performance single-page applications that comply with **Clean Code** principles, ensuring maintainable and scalable code structures.\nCollaborated within an **Agile** team, participating in sprint planning and retrospectives to continuously improve development processes and team efficiency, driving a 25% increase in velocity.\nImplemented automated testing strategies using frameworks like Jasmine and Karma, increasing code coverage to over **85%** and enhancing the overall reliability of the application.\nDesigned and constructed intuitive user interfaces that enhance customer engagement, leveraging both **JavaScript** and **HTML5/CSS3** for cross-browser compatibility and responsiveness.\nConducted code reviews to uphold coding standards and best practices, fostering an environment of continuous learning and improvement among team members.\nIntegrated with CI/CD pipelines to streamline deployment processes, reducing deployment times by **40%**, and facilitating quicker release cycles for features and updates.\nEnhanced application accessibility by adhering to WCAG 2.1 guidelines, making sure that all users, including those with disabilities, could navigate and use the platform effectively.\nContributed to the migration of legacy systems to **Angular**, improving performance and maintainability, resulting in a **30%** reduction in load times.\nEngaged in cross-functional team collaborations to align software architecture with business objectives, ensuring that technical solutions meet the needs of stakeholders and users alike."
    }
  ],
  "skills": " **Programming Languages:** \n\tJavaScript, TypeScript, Python \n\n **Frontend Frameworks:** \n\tAngular, React, Vue \n\n **Backend Frameworks:** \n\tFastAPI, Flask, Django \n\n **API Technologies:** \n\tOAuth2, JWT \n\n **Serverless and Cloud Functions:** \n\tAWS: Lambda, Azure: App Services \n\n **Databases:** \n\tPostgreSQL, MySQL, MongoDB, Redis \n\n **DevOps:** \n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose \n\n **Cloud & Infrastructure:** \n\tAWS: ECS, RDS, S3, Azure: Blob Storage, SQL Database \n\n **Other:** \n\tMLflow, Airflow, Kubeflow, Clean Code, Agile, Testing, English",
  "apply_company": "INNOCV Solutions"
}