{
  "name": "Mariusz Jan Skobel",
  "role_name": "Senior Backend Engineer",
  "email": "mariuszskobel15@outlook.com",
  "phone": "+48 735 343 548",
  "address": "Katowice, Poland",
  "linkedin": "https://www.linkedin.com/in/mariusz-skobel-927764397/",
  "profile_summary": "Senior Backend Engineer with a robust 10+ years of experience in crafting high-performance software solutions, particularly in the realms of healthcare and finance. Proficient in **C#**, **.NET**, and cloud technologies, including **Azure** and associated services like **Azure DevOps**. Skilled in database management with **SQL**, **CosmosDB**, and **MongoDB**, along with API development and documentation utilizing **Swagger**.\n\nExperienced in implementing CI/CD practices through tools like **Pulumi** and **Terraform**, and dedicated to following industry standards such as **OWASP** for security compliance. Demonstrates a strong foundation in microservices architecture, event-driven systems, and cloud-native application deployment. Additionally, possesses comprehensive knowledge of modern frameworks like **React**, **Next.js**, **Vue**, and backend technologies like **Node.js**, **FastAPI**, and **Django**. Brings a passion for mentoring and a proven track record of leading enterprise-level projects, ensuring the development of secure and maintainable solutions that enhance business operations.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2012",
      "to_year": "2015",
      "location": "UK",
      "university": "University of Bristol"
    }
  ],
  "experience": [
    {
      "role": "Senior Backend Engineer",
      "company": "EitBiz",
      "from_date": "Oct 2022",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "•\tEngineered and optimized backend solutions using **C#** and **.NET**, ensuring robust API integrations and adherence to **OWASP** security standards across applications.\n•\tImplemented database management strategies with **SQL**, **CosmosDB**, and **MongoDB**, facilitating efficient data storage and retrieval for scalable applications.\n•\tDeveloped and maintained CI/CD pipelines utilizing **Azure DevOps**, improving deployment speed by **30%** and ensuring consistent integration across environments.\n•\tLeveraged Infrastructure as Code with **Pulumi** and **Terraform** to automate cloud resource deployment in **Azure**, reducing manual configuration errors by **40%**.\n•\tIntegrated comprehensive documentation for API services through **Swagger**, enhancing developer experience and onboarding efficiency for new team members.\n•\tEmployed advanced cloud services in **Azure** to establish data architecture that supports high-availability and resiliency for mission-critical applications.\n•\tPerformed system audits and vulnerability assessments to align with **OWASP** guidelines, enhancing security posture by mitigating risks of potential threats.\n•\tCollaborated effectively with cross-functional teams, ensuring seamless communication between backend and frontend developers for improved project delivery timelines.\n•\tEstablished strong coding standards and best practices that increased code maintainability, reducing technical debt by **20%** over a span of **6 months**.\n•\tMentored junior engineers on best practices in backend development, API design, and database optimization, fostering a culture of continuous learning and improvement."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Tvn S.A.",
      "from_date": "Oct 2019",
      "to_date": "Sep 2022",
      "location": "Poland",
      "responsibilities": "Designed and implemented RESTful APIs leveraging **C#** and **.NET** frameworks, ensuring secure and efficient communication between client and server for high-traffic financial applications.\nManaged database solutions using **SQL**, **CosmosDB**, and **MongoDB** to store and retrieve financial data, ensuring data integrity and quickly scaling storage for over **1 million** transactions per day.\nUtilized **Azure** cloud services for deploying applications, optimizing resources through **Terraform** and **Pulumi** to enhance infrastructure as code principles, achieving deployment times reduced by **30%**.\nEstablished continuous integration and delivery pipelines using **Azure DevOps**, enabling automated testing and deployment processes that led to **90%** reduction in deployment-related errors.\nApplied security best practices defined by **OWASP** throughout the development cycle to protect sensitive data and maintain compliance with financial regulations.\nLed team workshops on API documentation using **Swagger**, improving clarity and aiding faster comprehension for other developers and stakeholders.\nConducted performance optimization strategies that resulted in response time improvements of **25%** for backend services over a period of **6 months**."
    },
    {
      "role": "Software Engineer",
      "company": "Timspark",
      "from_date": "Sep 2015",
      "to_date": "Aug 2019",
      "location": "UK",
      "responsibilities": "• Developed and optimized backend services using **C#** and **.NET**, ensuring high availability, low latency, and scalability across critical APIs for a global e-commerce platform.\n• Integrated cloud solutions on **Azure** for deployment and management, ensuring seamless scalability and efficient resource management through tools like **Terraform** and **Pulumi**.\n• Leveraged **SQL**, **CosmosDB**, and **MongoDB** for data storage and retrieval, ensuring fault-tolerant data access for high-traffic workflows, improving query performance by **30%**.\n• Implemented CI/CD pipelines using **Azure DevOps** to facilitate rapid development cycles and automate testing, deployments, and rollbacks by **50%**, enhancing overall software delivery.\n• Employed **Swagger** for API documentation, ensuring well-defined interfaces for seamless integration with frontend applications and third-party services.\n• Established security best practices following **OWASP** guidelines to protect sensitive data and user interactions, achieving a **100%** compliance score in security audits.\n• Engineered server-side components and microservices, optimizing response times, improving throughput by **20%**, and enhancing maintainability through modular architecture.\n• Collaborated on cross-functional teams to design secure, scalable solutions, driving significant performance improvements, including a **25%** reduction in downtime during peak traffic periods.\n• Developed robust testing strategies to cover all aspects of the software, ensuring a **99%** test coverage rate and reducing the incidence of post-deployment issues.\n• Engaged in continuous performance tuning and optimization of back-end systems, enhancing system reliability and efficiency while supporting business growth targets."
    }
  ],
  "skills": "**Programming Languages:**\n\tC#, Python, JavaScript, TypeScript\n\n**Backend Frameworks:**\n\t.NET, FastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tAPI, Swagger\n\n**Serverless and Cloud Functions:**\n\tAWS (Lambda), Azure (App Services)\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, CosmosDB\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Azure DevOps, CI/CD, Terraform, Ansible, Helm, Pulumi\n\n**Cloud & Infrastructure:**\n\tAWS (ECS, RDS, S3), Azure (Blob, SQL)\n\n**Authentication & Security:**\n\tKeycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, OWASP\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, Redis",
  "apply_company": "Danfoss"
}