{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Implementation Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "As a Senior Implementation Engineer with 8 years of experience, I specialize in leveraging **JavaScript**, **APIs**, and **Cloud** technologies, particularly **AWS** and **GCP**, to create efficient and scalable solutions for diverse industries. I excel in web analytics, utilizing tools like **Adobe Analytics**, **Google Ads**, and **Amazon Quicksight** to deliver actionable insights and drive digital marketing strategies. My technical acumen includes experience with **Tealium**, **Salesforce**, and integration platforms like **Workato**, allowing me to facilitate seamless interactions across systems.\nIn addition to my implementation skills, I have built high-performance solutions within healthcare and financial sectors using **React**, **Node.js**, **FastAPI**, and **Django**. I possess a strong foundation in microservices architecture and CI/CD automation, ensuring robust and compliant applications that adhere to standards like HIPAA and PCI DSS. My background in machine learning encompasses developing and deploying ML pipelines, utilizing tools like **MLflow** and **Kubeflow**, supported by a proven ability to solve complex problems and communicate effectively across teams.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Implementation Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Implemented and optimized **APIs** for seamless data access and integration using **JavaScript** frameworks and services.\n- Designed and developed robust solutions utilizing **cloud** platforms such as **AWS** and **GCP**, ensuring efficient scalability and high availability.\n- Collaborated with stakeholders to translate business requirements into technical specifications for **Digital Marketing** strategies and **Web Analytics** solutions.\n- Leveraged **SQL** databases for data retrieval and manipulation, enhancing reporting capabilities and facilitating **BI Tools** like **Amazon Quicksight** for comprehensive business insights.\n- Developed integrations with **Salesforce** and marketing tools like **Adobe Analytics** and **Google Ads** to streamline customer engagement and analytics workflows.\n- Utilized **Mobile Frameworks** such as **Flutter** and **React Native** to build user-centric mobile applications, focusing on performance and user experience across platforms.\n- Employed tools like **Browser Developer Tools** and **Charles Proxy** for debugging and performance optimization of applications, ensuring optimal user interactions.\n- Integrated advanced features using **Tealium**, **Workato**, and **EventStream**, enhancing real-time data accessibility and audience targeting.\n- Conducted thorough testing strategies utilizing **Jest**, **Cypress**, and other tools to ensure quality and reliability of digital solutions, achieving up to **99%** test coverage.\n- Collaborated with cross-functional teams to troubleshoot integration issues and optimize processes, demonstrating strong **Problem Solving** skills and effective **Communication**.\n- Analyzed and visualized marketing data through advanced analytics dashboards, driving decision-making and campaign effectiveness, leveraging tools and methodologies that ensured accurate insights."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Utilized **JavaScript** and **APIs** to develop and integrate user-centric solutions within financial platforms, ensuring seamless interaction with **AWS** and **GCP** services for enhanced cloud capabilities.\nImplemented comprehensive solutions with a focus on financial data via **SQL**, to ensure accurate data access and reporting for decision-making processes.\nConducted thorough data analysis and reporting using **Adobe Analytics** and **Google Ads** integrations, leading to improved campaign performance and optimized user engagement.\nLeveraged **Tealium**, **AudienceStream**, and **EventStream** to enhance marketing technology stacks, effectively streamlining user data access and enhancing targeting strategies.\nCreated efficient ETL workflows utilizing **Python**, **Apache Airflow**, and **Workato** for reliable data ingestion and transformation, supporting a real-time operational framework for high-volume transaction data.\nExecuted real-time monitoring systems with **React** for user interface development, incorporating **D3.js** to visualize analytics and streamline operations for team collaboration.\nEnsured cross-platform compatibility by employing **Mobile Frameworks** and responsive design principles, improving accessibility and user engagement by **30%**.\nApplied **Problem Solving** techniques to troubleshoot integration challenges across third-party tools and cloud services, achieving a **95%** increase in issue resolution speed.\nEngaged in regular communication with stakeholders and technical teams to align project objectives, significantly improving project delivery timelines by **20%**."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Utilized **Tealium** for enhanced data orchestration and audience targeting to optimize digital marketing strategies and improve customer engagement.\nCollaborated with diverse teams to integrate third-party **APIs** with **JavaScript**, facilitating seamless connectivity and data exchange across platforms.\nLeveraged **AWS** and **GCP** for cloud-based solutions, ensuring scalable infrastructure and high availability for critical applications.\nAnalyzed customer behavior and engagement metrics using **Adobe Analytics** and **Google Ads**, driving actionable insights to enhance digital marketing campaigns.\nImplemented data storage solutions using **SQL**, incorporating efficient database management for reliable data access and reporting.\nExploited **Workato** for workflow automation, streamlining processes and integrations across various systems and third-party tools.\nApplied advanced **Problem Solving** skills to troubleshoot and resolve implementation challenges, ensuring successful project delivery within deadlines.\nConfigured analytics tools like **Amazon Quicksight** for real-time business intelligence insights, facilitating data-driven decision-making.\nUtilized **Browser Developer Tools** and **Charles Proxy** for effective debugging and performance monitoring, enhancing user experience across web applications.\nDemonstrated strong **Communication** skills while coordinating with cross-functional teams to ensure smooth project execution and alignment with business goals."
    }
  ],
  "skills": "Programming Languages:\n\tJavaScript, Python(FastAPI, Flask, Django)\n\n**Backend Frameworks:**\n\tFlask, Django\n\n**Frontend Frameworks:**\n\tJavaScript/TypeScript (React, Vue, Angular)\n\n**API Technologies:**\n\tAPIs\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis, SQL\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS, GCP\n\n**Other:**\n\tTealium, Adobe Analytics, Google Ads, Salesforce, Browser Developer Tools, Charles Proxy, Workato, EventStream, AudienceStream, Predict, DataAccess, Digital Marketing, Web Analytics, Mobile Frameworks, Amazon Quicksight, BI Tools, Problem Solving, Communication",
  "apply_company": "Tealium"
}