{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Back End Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-kotlinski-08ba40390/",
  "profile_summary": "Results-oriented Back End Engineer with 8 years of experience in software engineering and design, specializing in building secure, scalable solutions using **Java**, **Spring Boot**, and **Micronaut** frameworks. Proficient in containerization with **Docker** and orchestration using **Kubernetes**, ensuring seamless deployment and management of applications in cloud environments like **AWS**. Solid understanding of message-driven architectures and event sourcing principles, enabling enhanced data processing and integration.\nI am committed to implementing robust security practices and leveraging data-driven insights to optimize performance. My background includes developing high-performance applications in the healthcare and financial sectors while complying with industry standards. Additionally, I possess hands-on experience with **Kafka** for real-time data processing and am skilled in database design and architecture for efficient data management.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Back End Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Designed and implemented robust **microservices-based** architectures utilizing **Spring Boot**, **Kubernetes**, and **Docker**, ensuring scalable and maintainable back-end solutions.\nConfigured and deployed cloud services on **AWS** to support high-demand applications, facilitating seamless scalability and reliability for back-end operations.\nDeveloped and integrated event-driven systems leveraging **Kafka**, implementing **event sourcing** strategies for efficient data processing and seamless microservices communication.\nExecuted software engineering best practices, focusing on **software design** and **database design**, optimizing performance and maintainability.\nCollaborated in securing applications by enforcing **security practices** to protect sensitive data across various platforms.\nLeveraged data-driven insights to improve application functionality and user experiences by analyzing real-time metrics and system telemetry.\nParticipated in architecture discussions to drive forward-looking decisions on technology and development methodologies, aligning with project goals and timelines.\nMaintained high standards of code quality through peer reviews and adherence to a well-defined coding standard, ensuring robust application development.\nProvided guidance and mentorship to junior team members, fostering knowledge-sharing and enhancing team skill sets in **Java** and **software engineering** principles."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Designed and implemented robust, scalable backend systems using **Java**, **Spring Boot**, and **Micronaut**, ensuring high availability and performance for mission-critical applications.\nDeveloped and maintained containerized services with **Docker** and **Kubernetes**, enhancing deployment efficiency and system reliability across diverse environments.\nUtilized **AWS** cloud services to optimize application infrastructure, supporting horizontal scaling and resource management, leading to a **30%** reduction in operational costs.\nImplemented **Kafka** and **event sourcing** strategies to enable seamless data flow and real-time processing, boosting system responsiveness by **50%**.\nApplied best practices in **software engineering** and **software design** to create maintainable and efficient code, contributing to a **40%** decrease in bug reports over releases.\nCollaborated on **database design** initiatives, ensuring data integrity and optimizing query performance in a high-transaction environment, resulting in improved application speed.\nEngaged in **security practices** throughout the development lifecycle to protect sensitive financial data, adhering to compliance regulations and reducing vulnerabilities by **60%**.\nLeveraged **data driven insights** to inform architectural decisions and enhance user experiences, resulting in a significant increase in customer satisfaction scores."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Utilized **Java** with **Spring Boot** and **Micronaut** to design and optimize backend services, ensuring high availability, low latency, and scalability across critical modules with responsiveness metrics improving by **30%**.\nImplemented **Kubernetes** and **Docker** for container orchestration, enabling seamless deployment across varied environments and improving deployment efficiency by **50%**.\nEngineered message-driven architectures using **Kafka** and event sourcing for the development of real-time features, enhancing order processing speed by **25%** through asynchronous communication.\nApplied best practices in software engineering and design to create robust solutions, focusing on security practices to safeguard sensitive data and meet compliance standards.\nConducted thorough database design and architecture planning utilizing AWS-based solutions, resulting in a highly scalable and efficient data storage strategy.\nEmployed data-driven insights to enhance application performance, using analytics to inform decisions on feature development and system improvements.\nDeveloped scalable microservices architecture, facilitating independent deployments and minimal downtime during updates.\nCollaborated with cross-functional teams to ensure cohesive integration of software solutions, directly contributing to improved team efficiency and workflow consistency.\nPromoted security best practices, including role-based access control (RBAC) and OAuth 2.0 for user authentication, ensuring data protection within applications."
    }
  ],
  "skills": " **Programming Languages:**\n\tJava, Python, JavaScript, TypeScript\n\n **Backend Frameworks:**\n\tSpring Boot, Micronaut, FastAPI, Flask, Django\n\n **Frontend Frameworks:**\n\tReact, Vue, Angular\n\n **API Technologies:**\n\tKafka, OIDC, JWT, OAuth2\n\n **Serverless and Cloud Functions:**\n\tAWS, Azure, Lambda, ECS\n\n **Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:**\n\tAWS (RDS, S3), Azure (App Services, Blob, SQL)\n\n **Other:**\n\tMLflow, Airflow, Kubeflow, event sourcing, software engineering, software design, data driven insights, architecture, message-driven architectures, security practices, Keycloak, Let’s Encrypt, Nginx, Certbot"
}