{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Salesforce Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Results-driven Senior Salesforce Engineer with over 13 years of Full Stack Development experience, specializing in **Salesforce**, **Flow Builder**, **n8n**, and automation solutions. Demonstrated expertise in integrating diverse systems and enhancing functionality through **Lightning** components, ensuring seamless user experiences and streamlined processes. Strong analytical thinking and exceptional communication skills facilitate effective team collaboration and project execution. Proven capability in leveraging **AI** technologies to enhance platform capabilities, integrating advanced features to optimize workflows. Comprehensive background in delivering high-performance applications across the healthcare and financial sectors, with proficiency in **JavaScript/TypeScript**, **Python**, **React**, **Node.js**, and cloud deployment strategies on **AWS** and **Azure**. Adept at compliance-driven development, adhering to industry standards such as HIPAA and PCI DSS.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Salesforce Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Utilized **Salesforce** to design and implement automation solutions, improving operational efficiency across projects by **25%** through strategic use of **Flow Builder** and **n8n**.\nConducted integration of sales processes with existing systems, leveraging **Lightning** components to enable seamless data flow and enhance user experience for approximately **150** users.\nCollaborated with cross-functional teams to analyze data and develop AI-driven insights, resulting in actionable strategies that increased revenue growth by **30%**.\nLed training sessions for team members on effective use of **Salesforce automation** tools, improving user adoption rates by **40%**.\nImplemented best practices for data management in **Salesforce**, ensuring data integrity and compliance with company standards across **10+** projects.\nDeveloped custom applications and dashboards within **Salesforce** to provide analytical insights, enhancing real-time decision-making capabilities for stakeholders.\nFostered a collaborative team environment by using strong **communication** and **analytical thinking** skills, ensuring project goals were consistently met on time.\nManaged project timelines and deliverables effectively using agile methodologies, improving overall project completion time by **20%**.\nActively participated in problem-solving discussions, providing innovative solutions and enhancing team performance and productivity.\nMonitored and evaluated system performance, identifying areas for improvement and automation that led to a **15%** reduction in errors and manual work."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Leveraged **Salesforce** and **Lightning** to automate business processes, enhancing operational efficiency and reducing manual errors by **30%**.\nUtilized AI technologies for predictive analytics, transforming customer data into actionable insights that improved sales strategies and forecasting accuracy by **25%**.\nDesigned and implemented integration solutions using **Flow Builder** and **n8n**, streamlining data flow between Salesforce and third-party applications, resulting in a **40%** reduction in processing time.\nConducted regular communication and collaboration sessions with cross-functional teams to ensure alignment on project goals and deliverables, fostering an environment of teamwork and innovation.\nApplied analytical thinking to troubleshoot and resolve issues within systems swiftly, leading to a **20%** improvement in system uptime.\nDeveloped comprehensive documentation and training materials to facilitate team collaboration and ensure knowledge transfer among stakeholders, increasing team efficiency.\nImproved user adoption of Salesforce functionalities through tailored training sessions and ongoing support, promoting effective utilization of the platform across departments."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Utilized **Salesforce** with advanced features like **Flow Builder** and **Lightning** to design automated workflows, improving operational efficiency by **30%**.\nImplemented data integration solutions utilizing **n8n** for seamless application connectivity, enhancing real-time data synchronization by **25%**.\nApplied AI strategies to develop predictive models and business automation tools, ensuring improved decision-making processes and enhanced customer engagement.\nConducted analytical assessments, utilizing analytical thinking to troubleshoot and resolve integration errors, improving data accuracy by **20%**.\nFacilitated clear communication with cross-functional teams, overseeing project timelines and deliverables while fostering team collaboration to achieve a high-performance work environment.\nDeveloped and optimized automation processes that eliminated repetitive tasks, saving approximately **15 hours** per week across departments.\nCreated detailed documentation and provided training sessions on new Salesforce features and integrations, enhancing user adoption rates by **40%**.\nAnalyzed user feedback and performance metrics to iteratively improve automation solutions, leading to a **10%** increase in user satisfaction scores."
    }
  ],
  "skills": " **Programming Languages:** \n\tPython: FastAPI, Flask, Django, JavaScript/TypeScript: React, Vue, Angular, AI\n\n **Backend Frameworks:** \n\tFlask, Django\n\n **Frontend Frameworks:** \n\tReact, Vue, Angular\n\n **API Technologies:** \n\tn8n, Salesforce, Flow Builder, integration, automation\n\n **Serverless and Cloud Functions:** \n\tAWS: ECS, Lambda, Azure: App Services\n\n **Databases:** \n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n **DevOps:** \n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:** \n\tAWS: RDS, S3, Azure: Blob Storage, SQL Database\n\n **Other:** \n\tKeycloak (OIDC, RBAC), OAuth2, JWT, Nginx, Let’s Encrypt, Certbot, analytical thinking, communication, team collaboration",
  "apply_company": "DataGuard"
}