{
  "name": "Patryk Zaslawski",
  "role_name": "Senior Fullstack Engineer",
  "email": "patrykzas0428@outlook.com",
  "phone": "+48669862402",
  "address": "Gdanski, Poland",
  "linkedin": "https://www.linkedin.com/in/patryk-z-9b9455391/",
  "profile_summary": "As a Senior Fullstack Engineer with over 8 years of experience, I am skilled in leveraging modern web technologies to design and implement high-performance applications. Proficient in **SvelteKit**, **ElysiaJS**, and **SurrealDB**, I excel at creating efficient, scalable solutions tailored to client needs. My background includes using Python with frameworks such as **FastAPI**, **Django**, and **Flask**, as well as expertise in cloud platforms like **AWS** and **Azure**. I also bring a comprehensive understanding of frontend frameworks including **Angular**, **Vue**, **React**, and **Next.js**. My experience in microservices architecture and API development (REST/gRPC) ensures that I deliver reliable and secure applications. I am committed to optimizing database performance using **PostgreSQL**, **MySQL**, and **MongoDB**, consistently aligning solutions with industry best practices.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2014",
      "to_year": "2017",
      "location": "United Kingdom",
      "university": "The University of Manchester"
    }
  ],
  "experience": [
    {
      "role": "Senior Fullstack Engineer",
      "company": "Binary Studio",
      "from_date": "Aug 2023",
      "to_date": "Present",
      "location": "United Kingdom (Remote)",
      "responsibilities": "Designed and implemented scalable web applications using **SvelteKit**, enhancing application performance and user experience.\nCollaborated with cross-functional teams to integrate **ElysiaJS** for building efficient backend services, streamlining data management and operational efficiency.\nLeveraged **SurrealDB** for real-time data storage and querying, ensuring quick access and reliability in application performance.\nDeployed applications on **Fly.io**, optimizing global distribution and reducing latency for end-users.\nOptimized front-end architecture for enhanced performance, leading to a **25%** increase in page load speed across key applications.\nAutomated testing strategies utilizing modern frameworks, ensuring **98%** test coverage and elevating delivery quality.\nMentored junior engineers on full-stack development practices, fostering skills in **SvelteKit** and backend technologies alongside agility in project workflows.\nIntegrated third-party APIs and services to expand application functionality and ensure seamless user experience, resulting in a **30%** increase in user engagement.\nMaintained version control systems to track changes and promote collaboration, adhering to best practices in CI/CD workflows.\nAnalysed performance metrics and user feedback to iteratively improve applications, achieving a **15%** reduction in bounce rates on high-traffic pages.\nEmployed responsive design principles to enhance usability across various devices, ensuring a consistent and high-quality user experience.\nImplemented microservices architecture in backend development, facilitating greater scalability and maintainability of codebases."
    },
    {
      "role": "Software Engineer",
      "company": "Ardigen",
      "from_date": "Mar 2020",
      "to_date": "Aug 2023",
      "location": "Poland",
      "responsibilities": "Developed and maintained robust applications using **SvelteKit** for streamlined frontend development, enhancing user engagement and performance.\nImplemented backend services using **ElysiaJS** for building scalable APIs, ensuring smooth integration with web applications.\nDesigned and structured databases with **SurrealDB**, enabling seamless data access and management across applications with high performance.\nDeployed applications on **Fly.io**, optimizing operational costs and improving deployment speed through modern serverless infrastructure.\nLed project development, ensuring adherence to best practices in code quality, accessibility, and performance, resulting in an average 30% reduction in bug reports.\nCollaborated with cross-functional teams to create user-friendly interfaces that improve user experience ratings by 25%.\nConducted performance benchmarking and optimization, achieving a **50%** decrease in load times through efficient coding and architecture adjustments.\nImplemented secure coding practices and authentication protocols, reducing vulnerability incidents to less than **2%** of total codebase.\nUtilized CI/CD pipelines to automate testing and deployment processes, resulting in a **40%** improvement in release cycles and time to market.\nEngaged in code reviews and knowledge sharing, fostering a culture of continuous learning and improvement within the development team."
    },
    {
      "role": "Software Engineer",
      "company": "Altum Software",
      "from_date": "Oct 2017",
      "to_date": "Feb 2020",
      "location": "United Kingdom",
      "responsibilities": "Engineered dynamic web applications utilizing **SvelteKit** and **ElysiaJS**, delivering fast and responsive user experiences while adhering to best practices in modern frontend development.\nImplemented backend services integrated with **SurrealDB** for efficient data management and enhanced performance, optimizing complex queries for improved functionality.\nDeployed applications on **Fly.io**, ensuring scalable and reliable cloud infrastructure for seamless user interactions and high availability.\nCreated robust RESTful APIs using **ElysiaJS** to manage data flow between the frontend and backend, supporting real-time interactions and efficient data handling.\nAutomated deployment processes via CI/CD pipelines, ensuring consistent delivery of features and enhancements across development cycles.\nConducted performance testing with industry-standard tools, identifying bottlenecks in applications and optimizing code for better throughput and reduced latency.\nCollaborated closely with cross-functional teams to translate business requirements into technical specifications, aligning project goals with company strategy.\nUtilized unit testing frameworks to maintain code quality and reduce defects in production, fostering a culture of continuous improvement.\nDesigned and executed application profiling to monitor and enhance application performance metrics, ensuring customer satisfaction.\nMaintained clear documentation to support existing systems and onboarding of new team members, promoting knowledge sharing within the team."
    }
  ],
  "skills": "Programming Languages:\n\tPython, SQL\n\nBackend Frameworks:\n\tFastAPI, Django, Flask, Spring Boot, ElysiaJS\n\nFrontend Frameworks:\n\tAngular (1–16), React (15–18), Next.js, Vue.js (2/3), Blazor, SvelteKit\n\nAPI Technologies:\n\tREST & gRPC APIs\n\nServerless and Cloud Functions:\n\tAWS (Lambda), Azure (App Services)\n\nDatabases:\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis, SurrealDB\n\nDevOps:\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD\n\nCloud & Infrastructure:\n\tAWS (ECS, RDS, S3), Azure (Blob, SQL), Fly.io\n\nOther:\n\tSQLAlchemy, Pydantic, Celery, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot",
  "apply_company": "Uprent"
}