{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Advanced Software Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-187801395/",
  "profile_summary": "Advanced Software Engineer with 13+ years of experience in delivering high-performance applications across the healthcare and financial industries. Proficient in **.NET**, **C#**, **SQL**, **Microsoft SQL Server**, **Azure**, along with strong skills in **JavaScript** and **ASP.NET**. Experienced in CI/CD practices utilizing **GitHub**, **Jenkins**, and **Git**, driving quality assurance through unit testing and process improvements. Expertise in **Cloud Native Patterns** aligns with modern software engineering principles to deliver innovative solutions.\n\nProficient in building and deploying applications leveraging modern frameworks and technologies, such as **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**. Hands-on experience in developing AI/ML-powered platforms for predictive analytics and real-time processing. Committed to compliance-driven development, ensuring alignment with standards such as HIPAA, FHIR, PCI DSS, and SOC 2. Strong background in MLOps, including model training, serving, and orchestration using **MLflow**, **Airflow**, and **Kubeflow**. Adept problem solver with a proven ability to innovate and troubleshoot complex issues in engineering design.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Advanced Software Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Developed and maintained high-quality software solutions leveraging **.NET**, **C#**, and **ASP.NET**, optimizing existing processes and building innovative applications.\n- Implemented robust **CI/CD** practices using **GitHub** and **Jenkins**, facilitating speedier deployments and enhancing code quality through automated testing and validation.\n- Executed comprehensive **Unit Testing** and **Quality Assurance (QA)** measures using frameworks like **Jest** and **Cypress** to ensure application reliability across various environments.\n- Designed architecture for cloud-native applications deploying on **Azure**, utilizing services such as **Microsoft SQL Server** for secure data management and rapid access to structured datasets.\n- Collaborated closely on **System Designs**, generating technical documentation to ensure compliance with best practices while addressing system requirements and improvements.\n- Partnered with cross-functional teams on hardware integration projects, translating innovative ideas into practical software solutions, resulting in a measurable increase in system efficiency.\n- Played a key role in process improvements across the development lifecycle, enabling faster troubleshooting and operational excellence.\n- Enhanced data processing capabilities through effective application of **Cloud Native Patterns**, leading to a **30%** reduction in data retrieval times.\n- Successfully integrated AJAX methods to improve user experience by delivering real-time data updates without refreshing, increasing engagement by **15%**.\n- Conducted in-depth research and development initiatives, identifying emerging technologies and trends, which informed strategic decision-making and long-term planning."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Utilized **.NET** and **C#** to modernize core financial platforms, enhancing scalability and performance for high-volume transactional systems.\nImplemented **CI/CD** practices using **GitHub** and **Jenkins** to streamline deployment processes and improve operational efficiency by **25%**.\nEnhanced backend services with **SQL** and **Microsoft SQL Server**, ensuring data integrity and optimizing query performance, which resulted in a **30%** reduction in response times.\nDeveloped interactive web applications using **JavaScript** frameworks, ensuring responsive and user-friendly interfaces, contributing to an **increase in user engagement by 40%**.\nCreated technical documents and system designs that facilitated clear communication among teams and supported the **launch of 5** major software releases.\nConducted thorough unit testing to ensure software quality and reliability, which reduced defect rates in production by **15%**.\nEngaged in research and development to innovate new solutions, spearheading process improvements that enhanced overall product performance and team productivity.\nTroubleshot and resolved complex engineering issues, leveraging strong problem-solving skills to maintain seamless operation of financial applications and services."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Utilized **.NET**, **C#**, and **ASP.NET** to design and optimize backend services for a global e-commerce platform, ensuring high availability, low latency, and scalability across key modules, achieving response times under **100ms**.\nAdopted **Cloud Native Patterns** to architect and deploy microservices on **Azure**, enhancing the system's overall resilience and enabling seamless updates without downtime.\nImplemented CI/CD pipelines with **Jenkins** and **GitHub**, increasing deployment frequency by **30%** while maintaining high code quality through automated **unit testing** and **quality assurance (QA)** practices.\nEngineered frontend applications using **JavaScript**, enhancing user experiences and ensuring rapid load times of less than **3 seconds** on both web and mobile platforms.\nCreated technical documents outlining system designs and service integrations, enhancing team collaboration and knowledge sharing, which improved onboarding times for new developers by **40%**.\nApplied troubleshooting techniques and innovative problem-solving to maintain the e-commerce platform's performance during high traffic periods, reducing incident response times by **25%**.\nCollaborated with cross-functional teams to drive process improvements and leverage **hardware integration** for enhanced system performance, ensuring all solutions met **GDPR compliance**.\nConducted research and development on emerging technologies to improve existing systems and recommend new tools, contributing to an overall **15%** increase in system efficiency."
    }
  ],
  "skills": " **Programming Languages:**\n\t•\tPython\n\t•\tC#\n\t•\tJavaScript\n\n **Backend Frameworks:**\n\t•\tFastAPI\n\t•\tFlask\n\t•\tDjango\n\t•\tASP.NET\n\n **Frontend Frameworks:**\n\t•\tReact\n\t•\tVue\n\t•\tAngular\n\n **API Technologies:**\n\t•\tAJAX\n\n **Serverless and Cloud Functions:**\n\t•\tAWS: Lambda\n\t•\tAzure: App Services\n\n **Databases:**\n\t•\tPostgreSQL\n\t•\tMySQL\n\t•\tMongoDB\n\t•\tSQL Server\n\n **DevOps:**\n\t•\tDocker\n\t•\tKubernetes\n\t•\tGitHub Actions\n\t•\tGitLab CI/CD\n\t•\tJenkins\n\n **Cloud & Infrastructure:**\n\t•\tAWS: ECS, RDS, S3\n\t•\tAzure: Blob Storage, SQL Database\n\t•\tTerraform\n\t•\tAnsible\n\t•\tHelm\n\t•\tDocker Compose\n\n **Other:**\n\t•\tMLflow\n\t•\tAirflow\n\t•\tKubeflow\n\t•\tKeycloak (OIDC, RBAC)\n\t•\tOAuth2\n\t•\tJWT\n\t•\tNginx\n\t•\tLet’s Encrypt\n\t•\tCertbot\n\t•\tRedis\n\t•\tUnit Testing\n\t•\tEngineering Principle\n\t•\tHardware Integration\n\t•\tInnovation\n\t•\tProblem Solving\n\t•\tProcess Improvements\n\t•\tQuality Assurance (QA)\n\t•\tResearch and Development\n\t•\tSystem Designs\n\t•\tTechnical Documents\n\t•\tTroubleshooting\n"
}