{
  "name": "DANIEL HE",
  "role_name": "Senior Software Engineer",
  "email": "daniel.he8@outlook.com ",
  "phone": "+48 730 743 032",
  "address": "Rzeszów, Poland",
  "linkedin": "https://www.linkedin.com/in/daniel-he-a5a536397/",
  "profile_summary": "Accomplished Senior Software Engineer skilled in **.NET MAUI** for cross-platform mobile development, driven to implement secure coding practices in compliance with **HIPAA** and **GDPR** regulations. Proficient in **C#** and adept at utilizing **Azure services** to enhance application performance and reliability. Proven experience in establishing **CI/CD pipelines** and conducting **automated testing** to ensure high-quality software delivery. Strong problem-solving skills, excellent collaboration and communication abilities, and exceptional organizational skills that drive project success. With a robust background in developing scalable, user-centric applications across various sectors such as healthcare, eCommerce, and finance, I bring a commitment to clean, efficient code that delivers significant improvements through innovative solutions.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2012",
      "to_year": "2016",
      "location": "Beijing, China ",
      "university": "Tsinghua University "
    }
  ],
  "experience": [
    {
      "role": "Senior Software Engineer",
      "company": "Britenet",
      "from_date": "Feb 2023 ",
      "to_date": "Present",
      "location": "Warsaw, Poland",
      "responsibilities": "Developed a cross-platform mobile application using **.NET MAUI** and **C#**, ensuring compliance with **HIPAA** and **GDPR** regulations for secure data handling.\nImplemented robust secure coding practices that improved system security posture by 30%.\nBuilt and maintained CI/CD pipelines using **Azure DevOps**, leading to a 75% reduction in deployment times.\nDesigned and executed automated testing strategies that enhanced overall code quality, leading to 50% fewer post-deployment issues.\nImplemented effective problem-solving techniques during the development process, resulting in a 40% improvement in task completion efficiency.\nCollaborated with cross-functional teams to refine project scope and goals, achieving alignment across business units.\nCommunicated complex technical concepts clearly to non-technical stakeholders, fostering transparency and understanding.\nOrganized project documentation and workflows, ensuring efficient resource management and team productivity."
    },
    {
      "role": "Software Engineer",
      "company": "Alibaba Group",
      "from_date": "Oct 2020 ",
      "to_date": "Dec 2022",
      "location": "Hangzhou, China",
      "responsibilities": "Implemented secure coding practices while developing cross-platform mobile applications using **.NET MAUI** and **C#** to ensure compliance with **HIPAA** and **GDPR** regulations.\nDesigned and maintained **CI/CD pipelines** for automated testing and deployment processes, achieving a **30%** quicker delivery cycle.\nCollaborated effectively with cross-functional teams to gather requirements and deliver successful software solutions that improved user satisfaction by **40%**.\nDeveloped problem-solving strategies to troubleshoot and resolve software defects, enhancing application stability by **15%**.\nOrganized and led code reviews, fostering a culture of collaboration and continuous improvement within the development team."
    },
    {
      "role": "Software Engineer ",
      "company": "Huawei Technologies Co., Ltd",
      "from_date": "May 2016 ",
      "to_date": "Sep 2020",
      "location": "Shenzhen, China ",
      "responsibilities": "Utilized **.NET MAUI** and **C#** to develop cross-platform mobile applications, ensuring compliance with **HIPAA** and **GDPR** standards for data security.\nImplemented **Azure services** to enhance application scalability and reliability, achieving a deployment success rate of **99%**.\nDeveloped secure coding practices, reducing vulnerabilities by **40%** across all applications.\nEngaged in CI/CD pipeline strategies that decreased deployment times by **30%** through continuous integration and automated testing.\nCollaborated with cross-functional teams to deliver high-quality software, improving communication efficiency by adopting agile frameworks.\nApplied strong problem-solving and organizational skills to streamline project workflows, boosting overall team productivity."
    }
  ],
  "skills": "**Programming Languages**\n\tC#, Java, JavaScript (React, Vue.js, Angular, Pixi.js, Vanilla JS, Node.js, TypeScript), Go, Python, SQL, Swift, Kotlin\n\n**Backend Frameworks**\n\t.NET MAUI, Spring Boot, Spring Security, Hibernate, Node.js, Express.js, JPA, Kafka, RabbitMQ\n\n**Frontend Frameworks**\n\tReact, Vue.js, Angular, Pixi.js, Redux, Next.js, React Router, Material-UI, Ant Design, D3.js, Webpack, Babel, Jest\n\n**API Technologies**\n\tRESTful API design\n\n**Serverless and Cloud Functions**\n\tAWS Lambda, API Gateway\n\n**Databases**\n\tMySQL, PostgreSQL, Redis, MongoDB\n\n**DevOps**\n\tDocker, Kubernetes (AWS EKS), Jenkins, GitHub Actions, Terraform, AWS CodePipeline, CI/CD pipelines\n\n**Cloud & Infrastructure**\n\tAWS (EKS, RDS, CloudFront, S3), Git, CloudWatch, ELK Stack, Azure services\n\n**Other**\n\tMicroservices, secure coding practices, HIPAA, GDPR, automated testing, problem-solving skills, collaboration skills, communication skills, organizational skills, CI/CD, Infrastructure as Code (IaC), Data structures and algorithms, Agile/Scrum methodologies"
}