{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Frontend Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Senior Frontend Engineer with 13+ years of experience adept at creating high-performance applications utilizing **React**, **TypeScript**, and **Next.js**. Proficient in implementing design principles such as **Tailwind** for streamlined UX design and employing A/B testing and feature flags to enhance user engagement. Solid experience in full stack development ensures a comprehensive understanding of system architecture. Demonstrates a track record of delivering compliant solutions in alignment with industry standards. Committed to continuous improvement in UX through data-driven decisions.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Frontend Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Utilized **React** (17–18), **TypeScript**, and **Next.js** to design and implement user interfaces, enhancing user experience through effective **UX design** practices.\n• Collaborated with cross-functional teams to leverage **A/B testing** and **feature flags** for optimizing feature rollout and user engagement, achieving a **25%** increase in user satisfaction scores.\n• Developed responsive components with **Tailwind CSS** for a modern, visually appealing design across multiple devices, ensuring compatibility and accessibility.\n• Integrated state management solutions for efficient data handling, resulting in a **30%** faster rendering time on complex frontend elements.\n• Worked on enhancing application performance and scalability, maintaining a focus on best practices in coding standards, and consistently meeting project deadlines.\n• Participated in code reviews and pair programming to foster knowledge sharing and maintain high code quality within the development team.\n• Actively engaged in troubleshooting and resolving frontend issues, ensuring a seamless user experience and minimal downtime.\n"
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Developed interactive front-end applications using **React (18)**, **Next.js**, and **TypeScript**, ensuring a seamless user experience through strategic **UX design** methodologies.\nUtilized **Tailwind CSS** for designing responsive and visually appealing interfaces, contributing to enhanced user engagement and satisfaction scores by **30%**.\nImplemented feature flags and conducted A/B testing to optimize user interactions, resulting in improved performance metrics and adaptability of new features across **90%** of the user base.\nCollaborated with backend teams to integrate APIs that powered dynamic features, ensuring consistent data flows and user functionality across applications.\nPartnered with design teams to iterate on user feedback, improving UI/UX elements and facilitating *5 user testing sessions* that informed successful design pivoting.\nMaintained documentation and training materials for new features, streamlining onboarding and reducing the average time to proficiency for new hires by **15%**."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Utilized **React (18)**, **TypeScript**, and **Tailwind CSS** to craft high-performance frontend applications, enhancing user experience through intuitive UX design and ensuring mobile responsiveness.\nImplemented A/B testing strategies and feature flags for data-driven decision-making, leading to an increase in user engagement and conversion rates by **25%**.\nEngineered responsive, SEO-friendly e-commerce user interfaces using **Next.js** and **Vue 3 + Nuxt**, emphasizing mobile-first principles and accessibility compliance (WCAG **2.1**).\nCollaborated with backend developers to integrate secure payment systems, ensuring application integrity and user trust through established protocols in sensitive transaction processes.\nDesigned UX workflows that streamlined interactions, continually iterating based on user feedback and analytics, improving overall site performance and customer satisfaction metrics.\nApplied best practices in frontend performance optimization, achieving load times reduced to under **3 seconds** across platforms.\nMaintained updated knowledge of industry trends and technologies, continually pushing the boundaries of user experience and frontend architecture."
    }
  ],
  "skills": " **Frontend Frameworks**\n\t React, TypeScript, Next.js, Tailwind\n\n **Programming Languages**\n\t Python, JavaScript\n\n **Backend Frameworks**\n\t FastAPI, Flask, Django\n\n **API Technologies**\n\t Nginx, OAuth2, JWT, Keycloak (OIDC, RBAC)\n\n **Serverless and Cloud Functions**\n\t AWS: ECS, Lambda, RDS, S3, Azure: App Services, Blob Storage, SQL Database\n\n **Databases**\n\t PostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n **DevOps**\n\t Docker, Kubernetes, GitHub Actions, GitLab CI/CD\n\n **Cloud & Infrastructure**\n\t Terraform, Ansible, Helm, Docker Compose\n\n **Other**\n\t A/B testing, Feature flags, UX design, MLflow, Airflow, Kubeflow",
  "apply_company": "Relocify"
}