{
  "name": "Tomasz Lee",
  "role_name": "Senior PHP Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Results-driven Senior PHP Engineer with 9+ years of hands-on experience in developing high-performance web applications using **PHP**, **JavaScript**, and **Node.js**. Proficient in testing frameworks such as **PHPUnit** and adept at implementing **End-to-End testing** strategies to ensure code quality and reliability. Strong familiarity with **GitLab** for version control and integration processes, and experienced in utilizing **AWS CloudWatch** for monitoring and optimizing application performance. Demonstrated ability to leverage **AI Tools** for enhancing application capabilities and driving continuous improvement. Proven track record of collaborating effectively across teams and leading successful development projects while optimizing workflows and delivering robust, scalable solutions.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Senior PHP Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Developed and maintained web applications utilizing **PHP** and **JavaScript**, ensuring high performance and responsiveness for various services.\nDesigned and implemented user interfaces using **React**, enhancing user engagement and satisfaction metrics.\nConducted End-to-End testing utilizing **PHPUnit**, leading to a decrease in bug rates by 30% in software releases.\nOptimized application code quality by implementing code reviews and continuous improvement practices, resulting in a 20% reduction in technical debt.\nImplemented version control strategies using **GitLab**, improving collaboration and deployment efficiencies across the development team.\nLeveraged **Node.js** to build scalable network applications, improving server response time by 15%.\nMonitored application performance and logs using **AWS CloudWatch**, helping to proactively address performance bottlenecks.\nCollaborated closely with cross-functional teams to integrate AI tools and enhance application capabilities, boosting feature adoption rates by 25%.\nExecuted comprehensive testing protocols to ensure high code quality, increasing the stability of deployments by 40%.\nStrategized development workflows for continuous delivery, reducing overall time-to-market for new features by 20%."
    },
    {
      "role": "Full Stack Developer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "• Developed and maintained high-quality PHP applications with **PHP** and **JavaScript**, leading to a measurable improvement in code quality and overall system performance.\n• Created and executed End-to-End testing strategies using **PHPUnit** to ensure application reliability and functionality, achieving a **30% reduction** in bugs before production.\n• Led collaborative projects utilizing **React** and **Node.js** for dynamic user interfaces, resulting in a **20% increase** in user satisfaction ratings.\n• Implemented CI/CD practices with **GitLab**, enhancing deployment efficiency and reducing integration issues by **25%**.\n• Leveraged **AWS CloudWatch** to monitor application performance and optimize server utilization, contributing to a **15% reduction** in operational costs.\n• Utilized AI Tools to automate repetitive tasks and improve workflow, enabling team members to focus on higher-value tasks.\n• Advocated for continuous improvement through regular code reviews and mentoring sessions, improving team productivity by **10%**.\n• Ensured adherence to code quality standards and implemented best practices for scalable software solutions.\n• Collaborated with cross-functional teams to define project requirements and timelines, ensuring successful and timely project delivery."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "Utilized **PHP** and **JavaScript** to develop and maintain high-performance applications, improving code efficiency by **30%**.\nImplemented **React** for dynamic user interfaces, resulting in a **40%** enhancement in user engagement metrics.\nConducted **End-to-End testing** using **PHPUnit**, ensuring robust application functionality and reducing bug reports by **25%**.\nDeveloped automated testing frameworks and performed regular code reviews, significantly boosting **Code Quality** and compliance with best practices.\nIntegrated **Node.js** services with existing architectures to optimize backend processes, achieving a **15%** reduction in server response times.\nUtilized **GitLab** for version control and CI/CD pipelines, streamlining application deployment and collaboration among team members.\nMonitored application performance and logs using **AWS CloudWatch**, leading to proactive adjustments and increased system reliability by **20%**.\nLeveraged **AI Tools** to enhance predictive analytics features, improving decision-making capabilities within applications.\nFostered a culture of **Continuous Improvement** by identifying areas for enhancement in application processes and team workflow.\nEngaged in daily standups and collaborative sessions to align project goals and share insights, promoting team cohesion."
    }
  ],
  "skills": " **Programming Languages**\n\t JavaScript, PHP, Python\n\n **Backend Frameworks**\n\t Node.js, ExpressJS, NestJS, C#, .NET, Entity Framework, Microservices\n\n **Frontend Frameworks**\n\t ReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n **API Technologies**\n\t RESTful API, GraphQL\n\n **Serverless and Cloud Functions**\n\t AWS, Azure, AWS CloudWatch\n\n **Databases**\n\t MSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB\n\n **DevOps**\n\t CI/CD pipelines, Git, GitHub, GitLab\n\n **Cloud & Infrastructure**\n\t AWS, Azure\n\n **Other**\n\t UX/UI Design, Testing, PHPUnit, NUnit, xUnit, Selenium, Moq, End-to-End testing, Postman, Cypress, JMeter, Jest, Apache Kafka, RabbitMQ, Redis, AI Tools, Code Quality, Continuous Improvement, Blockchain, Solidity, Ether.js, Web3.js, Ethereum",
  "apply_company": "OnTheGoSystems"
}