{
  "name": "Rei Taro",
  "role_name": "Senior Backend Engineer",
  "email": "rei515@outlook.com",
  "phone": "+48732529451",
  "address": "Warszawa, Poland",
  "linkedin": "https://www.linkedin.com/in/rei-taro-81a410391/",
  "profile_summary": "Results-driven Senior Backend Engineer with over 10 years of experience in developing robust backend systems, with a strong emphasis on using **C#**, **.NET**, **.NET Core**, and **ASP.NET** to deliver high-quality applications. Proficient in implementing **REST**ful services and utilizing **MS SQL Server**, **Redis**, and **ElasticSearch** for data management and retrieval. Experienced in using **RabbitMQ** for message queuing and integrating frontend frameworks like **Vue.js** and **jQuery** to enhance user experience. Demonstrated ability to apply design patterns and algorithms to solve complex problems efficiently. Fluent in English and committed to maintaining high standards in project delivery, evidenced by a successful track record at organizations such as VISA, Sii Poland, and Reply Polska. Adept at collaborating within agile teams using tools like **GitLab** and **Atlassian** for project management and code versioning.",
  "education": [
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2010",
      "to_year": "2015",
      "location": "Japan",
      "university": "Keio University"
    }
  ],
  "experience": [
    {
      "role": "Senior Backend Engineer",
      "company": "Leobit",
      "from_date": "Aug 2022",
      "to_date": "Present",
      "location": "Poland",
      "responsibilities": "• Developed robust backend services utilizing **C#** and **.NET Core** to enhance system performance and scalability across applications.\n• Implemented API endpoints following **REST** principles, ensuring smooth communication and data exchange between services.\n• Managed databases effectively using **MS SQL Server**, optimizing queries for performance and reliability, achieving an increase in data retrieval speed by **25%**.\n• Leveraged **Redis** for caching purposes to reduce data load times by **40%**, enhancing user experience during peak traffic.\n• Designed event-driven microservices architecture employing **RabbitMQ** for asynchronous messaging, increasing the throughput of transactions by **30%**.\n• Incorporated modern frontend technologies such as **Vue.js**, **jQuery**, and **Knockout.js** for dynamic user interfaces, improving the overall usability.\n• Collaborated using tools like **GitLab** and **Atlassian** to maintain efficient project management and version control, ensuring streamlined workflows and transparency.\n• Applied sound software development methodologies by utilizing algorithms and design patterns to solve complex programming challenges, resulting in improved code maintainability."
    },
    {
      "role": "Software Engineer",
      "company": "Innovature",
      "from_date": "Nov 2018",
      "to_date": "Jun 2022",
      "location": "Japan",
      "responsibilities": "• Developed backend systems in **C#**, **.NET**, and **.NET Core** to automate document workflows, streamline user onboarding, and enhance complex reporting processes.\n• Created event-driven microservices using **RabbitMQ** and **Redis**, enabling asynchronous processing of financial data and transaction requests.\n• Managed the deployment of microservices on **Azure App Services**, leveraging **Terraform** for infrastructure automation to maintain consistent and scalable environments, with a focus on **eco-system versions** like **1.0.0**.\n• Engineered data pipelines for the secure exchange of regulatory data, using **Apache Airflow** and **Azure Functions** to automate and streamline the data flow while ensuring high throughput of **1000+ transactions/min**.\n• Performed security audits ensuring compliance with industry standards, integrating **OAuth2** and **Azure AD B2C** to manage authentication and secure access controls, achieving a **99% reduction in security incidents**.\n• Collaborated with cross-functional teams to ensure smooth system integration, regulatory compliance, and successful release management using agile methodologies and tools like **GitLab** and **Atlassian**."
    },
    {
      "role": "Software Developer",
      "company": "Wizcorp",
      "from_date": "Apr 2015",
      "to_date": "Nov 2018",
      "location": "Japan",
      "responsibilities": "• Developed robust backend services utilizing **C#**, **.NET Core**, and **MS SQL Server** to optimize trade execution and portfolio management systems, achieving a processing speed improvement of **30%**.\n• Engineered high-performance REST APIs and integrated **Redis** for efficient data caching, enhancing response times for user transactions by **25%**.\n• Collaborated with frontend teams employing **Vue.js** and **jQuery** to ensure seamless user experiences, successfully delivering features in alignment with project timelines by **15%**.\n• Adhered to regulatory compliance such as MiFID II and GDPR while maintaining high standards of internal data security protocols to protect sensitive user information.\n• Implemented comprehensive testing frameworks using **PyTest** and **mock servers**, leading to a **20%** reduction in bugs during the QA process and expediting CI workflows.\n• Introduced job queuing and scheduling solutions with **RabbitMQ** and **Celery**, optimizing backend task execution and achieving a **40%** increase in task throughput.\n• Employed design patterns and algorithms to enhance the code maintainability and scalability of backend systems, aligning with best software engineering practices."
    }
  ],
  "skills": "**Programming Languages**\n\tC#, Python (3.8+), SQL, Bash, JavaScript\n\n**Backend Frameworks**\n\t.NET, .NET Core, ASP.NET, MVC, FastAPI, Flask, Django, Celery\n\n**Frontend Frameworks**\n\tVue.js, jQuery, Knockout.js\n\n**API Technologies**\n\tREST, HTTP, REST/gRPC APIs\n\n**Serverless and Cloud Functions**\n\tAWS (EC2, S3, Lambda), Azure\n\n**Databases**\n\tMS SQL Server, PostgreSQL, MySQL, MongoDB, Redis, ElasticSearch\n\n**DevOps**\n\tDocker, Kubernetes, GitHub Actions, GitLab, Azure DevOps, CI/CD\n\n**Cloud & Infrastructure**\n\tAWS, Azure\n\n**Other**\n\tMicroservices, Kafka, RabbitMQ, algorithms, design patterns, Pandas, NumPy, scikit-learn, TensorFlow, Airflow, MLflow, PyTest, Git, English",
  "apply_company": "Kaizen Gaming"
}