{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Implementation Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Results-driven Senior Implementation Engineer with 13+ years of experience in full stack development and delivering high-performance applications in the healthcare and financial sectors. Proficient in **JavaScript**, **SQL**, and cloud services **AWS** and **GCP**. Skilled in implementing and integrating APIs, with a strong focus on web analytics solutions like **Adobe Analytics** and **Google Ads**. Proven experience with digital marketing tools including **Tealium IQ**, **AudienceStream**, and **EventStream**.\nExpert in data access and predictive analytics platforms, leveraging **Amazon Quicksight** for visualization and insights. Strong background in user-centric communication and customer support, ensuring seamless collaboration with stakeholders. Additional expertise in **Python**, **Flutter**, and cloud-native development using microservices, emphasizing compliance with frameworks such as HIPAA and PCI DSS. Recognized for adopting robust CI/CD pipelines and MLOps practices to enhance project delivery efficiency.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Implementation Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Utilized **JavaScript** to create robust **APIs** for seamless data access and integration, ensuring efficient implementation of digital marketing strategies across platforms.\nLeveraged **AWS** and **GCP** to enhance cloud services, enabling scalable solutions for web analytics and customer support initiatives.\nDesigned and implemented data pipelines leveraging **SQL** for extracting insights from marketing campaigns, optimizing performance metrics across multiple channels, including **Adobe Analytics** and **Google Ads**.\nCollaborated with stakeholders to enhance audience segmentation using tools like **Tealium IQ**, **AudienceStream**, and **EventStream**, achieving a **30%** increase in user engagement through personalized marketing strategies.\nFacilitated troubleshooting and debugging processes using **Browser Developer Tools** and **Charles Proxy**, leading to a **25%** reduction in issue resolution time for real-time data analytics.\nCreated interactive dashboards powered by **Amazon Quicksight** to visualize key metrics and campaign performance, contributing to data-driven decision-making across departments.\nCommunicated complex technical concepts effectively to both technical and non-technical teams, enhancing collaboration and project outcomes within a **5-member** implementation team.\nUtilized **Workato** for automation of repetitive tasks, streamlining workflows, and improving overall efficiency for digital marketing operations.\nProvided exceptional customer support during product implementations, ensuring a smooth transition and immediate responsiveness to client needs, achieving a **95%** satisfaction rate based on feedback.\nDeveloped comprehensive testing strategies to ensure the reliability of implementation processes and marketing campaigns, including rigorous quality checks and performance validation."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Leveraged **JavaScript** skills to modernize core financial platforms by migrating to microservices architecture using **Node.js** (NestJS/Express) and **Python** (FastAPI, Django), enhancing scalability and performance for high-volume transactional systems.\nImplemented APIs to support system integrations, improving interoperability and overall efficiency in financial operations.\nUtilized **Adobe Analytics** and **Google Ads** for comprehensive digital marketing strategies, optimizing user engagement and tracking performance metrics.\nDeveloped and maintained real-time analytics dashboards with **React** (18), **D3.js**, and **Power BI Embedded**, providing operations teams with instant insights into transactions and anomalies which improved decision-making processes by **30%**.\nDesigned and deployed a robust event-driven architecture using **Kafka**, **RabbitMQ**, and **Azure Service Bus**, ensuring asynchronous communication across critical workflows such as payments, alerts, and compliance, increasing operational efficiency by **25%**.\nCreated and optimized ETL pipelines for ingesting financial data from internal and third-party sources using **Python**, **Apache Airflow**, and **Azure Data Factory**, supporting both batch and real-time processing to handle data volumes exceeding **10 TB** weekly.\nBuilt and deployed machine learning models for fraud detection with **scikit-learn**, **XGBoost**, and **Azure ML**, enabling proactive detection of suspicious activities based on user behavior and transaction patterns, reducing fraudulent transactions by **40%**.\nDeveloped ML pipelines for real-time credit scoring, churn prediction, and transaction classification, leveraging **MLflow** and **Airflow** to integrate model inference into backend services, facilitating timely interventions and customer insights."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Leveraged **JavaScript** frameworks and libraries to develop robust APIs facilitating seamless communication between frontend and backend systems, enhancing user engagement and data flow.\nImplemented **Adobe Analytics**, **Google Ads**, and other **digital marketing** tools to track user interactions, providing actionable insights for marketing campaigns and improving customer targeting strategies.\nConducted thorough Web Analytics using **AWS** and **GCP**, optimizing data storage and retrieval processes, leading to a **30%** increase in data processing efficiency.\nUtilized **SQL** for database management, ensuring integration with various data sources and enabling real-time reporting for stakeholders, achieving **99%** data accuracy across reporting metrics.\nDeveloped customer support functionalities leveraging **Tealium IQ**, **AudienceStream**, and **EventStream**, facilitating personalized user experiences and timely responses, which increased customer satisfaction scores by **25%**.\nIntegrated and automated workflows using **Workato** to enhance operational efficiency, reducing manual processing time by **40%**.\nEmployed **Amazon Quicksight** for data visualization and reporting, allowing stakeholders to make informed decisions based on real-time analytics and performance metrics.\nApplied **Browser Developer Tools** and **Charles Proxy** for mobile debugging, ensuring high performance and user experience across multiple devices and browsers, leading to a **15%** reduction in load times.\nCommunicated effectively with teams across departments to gather requirements and provide updates on project milestones, improving project delivery times.\nGuaranteed compliance with GDPR and user data protection policies while implementing solutions, fortifying system security and user trust."
    }
  ],
  "skills": "**Programming Languages:**\n\tJavaScript,\n\tPython,\n\tTypeScript,\n\tSQL\n\n**Backend Frameworks:**\n\tFastAPI,\n\tFlask,\n\tDjango\n\n**Frontend Frameworks:**\n\tReact,\n\tVue,\n\tAngular\n\n**API Technologies:**\n\tAPIs,\n\tTealium IQ,\n\tAudienceStream,\n\tEventStream,\n\tPredict,\n\tDataAccess\n\n**Serverless and Cloud Functions:**\n\tAWS: ECS, Lambda, RDS, S3,\n\tGCP\n\n**Databases:**\n\tPostgreSQL (Fintech),\n\tMySQL (Healthcare),\n\tMongoDB (Gaming),\n\tRedis,\n\tSQL\n\n**DevOps:**\n\tDocker,\n\tKubernetes,\n\tGitHub Actions,\n\tGitLab CI/CD\n\n**Cloud & Infrastructure:**\n\tAWS,\n\tAzure: App Services, Blob Storage, SQL Database,\n\tTerraform,\n\tAnsible,\n\tHelm,\n\tDocker Compose\n\n**Other:**\n\tArtificial Intelligence & Machine Learning,\n\tMLflow,\n\tAirflow,\n\tKubeflow,\n\tDigital Marketing,\n\tWeb Analytics,\n\tAdobe Analytics,\n\tGoogle Ads,\n\tBrowser Developer Tools,\n\tCharles Proxy,\n\tMobile Debugging,\n\tAmazon Quicksight,\n\tWorkato,\n\tCustomer Support,\n\tCommunication",
  "apply_company": "Tealium"
}