{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Node.js Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Senior Node.js Engineer with 13+ years of experience specializing in high-performance application development. Proficient in **Node.js**, **API** design, and implementing **REST**ful services, with hands-on expertise in **React** for frontend development. Skilled in deploying cloud-native systems using **Docker** and integrating **OAuth2**, **SAML**, and **SSO** for secure authentication. Experienced in establishing **CI/CD** pipelines and leveraging **infrastructure-as-code** practices to enhance development workflows. \nStrong communicator adept at documentation and debugging, ensuring a seamless development process. Previously developed AI/ML platforms with predictive analytics capabilities and deep expertise in **Golang**. Committed to implementing compliance-driven solutions aligned with standards such as HIPAA and PCI DSS.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Node.js Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Developed robust APIs and microservices using **Node.js**, ensuring seamless integration with third-party services and adherence to best practices for **OAuth2**, **SAML**, and **SSO** authentication protocols.\n• Constructed responsive user interfaces with **React** (versions 17-18), enabling efficient user communication and interaction, while optimizing module bundling techniques for performance enhancements.\n• Automated CD/CI processes leveraging **Docker** containers, simplifying deployment workflows and enhancing infrastructure management via **infrastructure-as-code** principles.\n• Integrated and maintained RESTful services, ensuring high availability and performance through effective debugging and documentation practices.\n• Collaborated with cross-functional teams to improve code quality and enhance communication across projects, achieving a **20% reduction** in deployment time with improved CI pipelines.\n• Implemented comprehensive testing frameworks for APIs using **Node.js**, ensuring reliable application performance through automated testing processes.\n• Delivered tutorials and documentation for best practices in **Node.js** development, fostering a culture of continuous learning within the team.\n• Led troubleshooting efforts for production issues, resulting in a **30% decrease** in resolution times by utilizing effective debugging practices and team communication.\n"
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Utilized **Node.js** for developing scalable APIs, ensuring seamless communication and integration across microservices architecture in financial platforms.\nImplemented **Docker** for containerization, facilitating a consistent development and production environment, which increased deployment speed by **30%**.\nDesigned and maintained RESTful services adhering to **OAuth2** and **SAML** protocols for secure user authentication and Single Sign-On (SSO) capabilities.\nDeveloped interactive front-end applications using **React (18)**, **Next.js**, and **TypeScript** with a focus on responsive UI, improving user engagement metrics by **25%**.\nEstablished CI/CD pipelines to enhance software delivery and integrations, reducing release cycles from weekly to **daily** deployments.\nIntegrated module bundling techniques for efficient asset management and code splitting, leading to a decrease in load times by **15%**.\nCollaborated with cross-functional teams to ensure smooth communication and documentation of project requirements and progress.\nApplied infrastructure-as-code practices to streamline deployment processes in cloud environments, optimizing resource management and scalability.\nParticipated in debugging sessions to identify and resolve issues efficiently, enhancing system reliability and performance across the platform.\n"
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Developed and optimized RESTful APIs using **Node.js** and **Golang**, ensuring high performance for a global e-commerce platform with **99.99%** uptime and **low-latency** connections across key services.\nEngineered scalable microservices architecture facilitated by **Docker** and **CI/CD** strategies, allowing for rapid development cycles and streamlined deployment processes impacting **3 major** modules: checkout, cart, and order fulfillment.\nUtilized **OAuth 2.0** for secure authentication and authorization, including **SAML** and **SSO** implementations, ensuring data protection and compliance with GDPR standards for over **10,000** user accounts.\nCreated and maintained comprehensive documentation for APIs and system designs, enhancing team communication and onboarding efficiency across development teams.\nImplemented infrastructure-as-code strategies to manage cloud resources, reducing provisioning time by **50%** and enhancing infrastructure reliability.\nLeveraged **React** for building dynamic user interfaces, achieving a user experience score improvement of **30%** through responsive design and module bundling techniques.\nConducted thorough debugging processes, resolving critical application issues swiftly, resulting in a **40%** reduction in the time taken to resolve production incidents.\nCollaborated effectively with cross-functional teams to improve APIs and implement feedback mechanisms, enhancing overall application performance and reliability.\nImplemented comprehensive CI/CD pipelines ensuring automated testing and deployment on various environments, boosting developer productivity by **25%** across the team.\nMonitored server performance and health using various **cloud** tools, allowing for proactive troubleshooting and infrastructure management, keeping downtime to less than **1%** annually."
    }
  ],
  "skills": "Programming Languages:\n\tPython: FastAPI, Flask, Django\n\tJavaScript/TypeScript: React, Vue, Angular\n\tGolang\n\n**Backend Frameworks:**\n\tNode.js\n\n**Frontend Frameworks:**\n\tReact\n\n**API Technologies:**\n\tAPI\n\tOAuth2\n\tSAML\n\tSSO\n\tREST\n\n**Serverless and Cloud Functions:**\n\tAWS: ECS, Lambda, RDS, S3\n\tAzure: App Services, Blob Storage, SQL Database\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare)\n\tMongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker\n\tKubernetes\n\tCI/CD\n\tGitHub Actions, GitLab CI/CD\n\n**Cloud & Infrastructure:**\n\tTerraform, Ansible, Helm, Docker Compose\n\n**Other:**\n\tMLflow, Airflow, Kubeflow\n\tNginx, Let’s Encrypt, Certbot\n\tcommunication\n\tdebugging\n\tdocumentation\n\tmodule bundling\n\tinfrastructure-as-code\n",
  "apply_company": "Bonapolia"
}