{
  "name": "Mariusz Jan Skobel",
  "role_name": "Senior Software Engineer",
  "email": "mariuszskobel15@outlook.com",
  "phone": "+48 735 343 548",
  "address": "Katowice, Poland",
  "linkedin": "https://www.linkedin.com/in/mariusz-skobel-927764397/",
  "profile_summary": "Senior Software Engineer with 10+ years of experience in delivering high-performance software solutions, specializing in **JavaScript**, **Python**, and incorporating AI methodologies for innovative software development. Proven expertise in the full development lifecycle, collaborating on projects that enhance software verification, documentation, and communication practices. Demonstrated proficiency in modern frameworks including **React**, **Next.js**, and **FastAPI**, complemented by knowledge of programming languages such as **Go**, **C++**, and **Ruby**.\n\nExperienced in building and deploying cloud-native applications on **Azure** and **AWS**, with a strong focus on security and compliance in highly regulated environments. Comprehensive background in developing enterprise platforms that leverage AI for real-time analytics, automation, and intelligent decision-making. Knowledgeable in microservices architecture, event-driven systems, and CI/CD automation, ensuring maintainable and efficient software solutions tailored for impactful results.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2012",
      "to_year": "2015",
      "location": "UK",
      "university": "University of Bristol"
    }
  ],
  "experience": [
    {
      "role": "Senior Software Engineer",
      "company": "EitBiz",
      "from_date": "Oct 2022",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Designed and implemented scalable software solutions leveraging **JavaScript** and **Python** to drive optimal performance and ensure high-quality verification in code.\n• Developed comprehensive documentation to facilitate effective communication across teams and stakeholders, ensuring clarity in project goals and progress.\n• Collaborated with cross-functional teams to ensure adherence to best practices in code verification and software documentation, fostering a culture of transparency and knowledge sharing.\n• Conducted thorough testing and validation of software components using strong verification techniques, ensuring robustness and reliability in critical applications.\n• Engaged in proactive communication with project managers and team leads, participating in regular updates and feedback sessions to drive project success and align with business goals.\n• Championed the integration of AI-based solutions across various projects, streamlining processes and enhancing user experiences by leveraging cutting-edge technologies.\n• Designed and maintained efficient workflows using state-of-the-art programming practices and languages including **Go**, **C++**, and **Ruby** to optimize development operations and reduce technical debt.\n• Implemented agile methodologies to promote transparency and optimize team performance, achieving project milestones on time and within budget, with a 95% adherence rate to deadlines.\n• Mentored junior developers in software best practices, fostering an environment of continuous improvement and skill development within the engineering team."
    },
    {
      "role": "Software Engineer",
      "company": "Tvn S.A.",
      "from_date": "Oct 2019",
      "to_date": "Sep 2022",
      "location": "Poland",
      "responsibilities": "• Developed robust software solutions using **JavaScript** and **Python**, emphasizing scalability and maintainability in financial platforms through modern architectural practices.\n• Maintained comprehensive documentation and effective communication strategies to ensure clarity and alignment across cross-functional teams during the software development cycle.\n• Enhanced existing systems and functionalities utilizing other programming languages, such as **Go**, **C++**, and **Ruby**, resulting in improved performance metrics by **25%**.\n• Led the creation of user-friendly applications by leveraging technologies like **React (18)**, **Vue 3**, and **Next.js**, focusing on optimal user experiences through high-performance interfaces.\n• Implemented real-time analytics using **D3.js** and integrated dashboards with **Power BI Embedded**, allowing teams to gain insights on over **1M** transactions daily.\n• Developed and maintained ETL pipelines powered by **Python**, **Apache Airflow**, and **Azure Data Factory**, enabling efficient data ingestion and processing from both internal and external data sources, with a throughput of **2TB** per day.\n• Actively participated in AI/ML projects for fraud detection employing libraries like **scikit-learn** and **XGBoost**, improving anomaly detection rates by **30%** through predictive modeling techniques.\n• Fostered collaborative environment, utilizing effective documentation practices, enhancing overall software verification processes with upgraded testing frameworks."
    },
    {
      "role": "Software Engineer",
      "company": "Timspark",
      "from_date": "Sep 2015",
      "to_date": "Aug 2019",
      "location": "UK",
      "responsibilities": "Utilized **JavaScript** and **Python** to architect and refine backend services for a high-traffic e-commerce platform, enhancing system reliability and scalability for key features such as checkout and order fulfillment.\nFacilitated effective communication across teams, enabling seamless integration of **AI** functionalities including recommendation systems that improved product visibility and lead to a **30%** increase in conversion rates.\nDrafted and maintained clear documentation for software verification processes, ensuring compliance with project standards and aiding in knowledge transfer among team members.\nCollaborated on the development of real-time features using **WebSockets** and event-driven architectures, leveraging technologies like **Kafka** and **RabbitMQ** to enhance user experience by providing immediate order updates.\nEngineered frontend systems with libraries such as **React 18**, **Vue 3**, and **Angular**, integrated with **TypeScript** and **Redux Toolkit** for robust user interfaces on both web and mobile platforms, achieving a loading time reduction of **25%**.\nImplemented distributed data management with **MongoDB**, **PostgreSQL**, **Redis**, and **Cassandra**, ensuring high availability and performance under peak loads, successfully managing **1M+** transactions per month.\nEmployed **Kubernetes** and **LaunchDarkly** for efficient feature flag management and deployment strategies, such as blue-green deployments, ensuring minimal disruption during updates and rigorous software verification.\nConducted thorough reviews and testing of various programming languages including **Go**, **C++**, and **Ruby**, contributing to high-quality code and performance optimization.\nEnsured data protection and compliance through robust security measures including role-based access control (RBAC) and **OAuth 2.0** protocols, safeguarding sensitive user information and adhering to GDPR regulations."
    }
  ],
  "skills": "**Programming Languages:**\n\tJavaScript, Python, Go, C++, Ruby\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tN/A\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD\n\n**Cloud & Infrastructure:**\n\tTerraform, Ansible, Helm, Docker Compose\n\n**Other:**\n\tAI, Software Verification, Documentation, Communication, MLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot",
  "apply_company": "Hourly Rate"
}