{
  "name": "Tomasz Lee",
  "role_name": "Senior Data Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Results-driven Senior Data Engineer with 9+ years of experience in leveraging analytical skills and market strategy to deliver data-driven solutions. Adept at client management and consulting, translating complex data sets into actionable insights that inform AI initiatives and sales strategies. Proven ability to collaborate effectively across multifaceted teams and present findings in both German and English. Originally skilled in developing and implementing applications using **.NET**, **C#**, **ReactJS**, **NextJS**, and technologies like **Apache Kafka**, **RabbitMQ**, and **Redis**, ensuring robust and scalable solutions.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Senior Data Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "• Leveraged **Data** analytics to optimize customer management strategies, resulting in a user satisfaction increase of **25%**.\n• Designed and implemented **AI**-driven solutions for data processing and analysis, enhancing decision-making capabilities for clients.\n• Applied **Analytical Skills** to extract insights from diverse datasets, aiding the sales and market strategy teams.\n• Developed data-driven presentations to communicate findings effectively to stakeholders in both **German** and **English**.\n• Managed client relationships through effective **Client Management** practices, ensuring alignment with their needs and goals.\n• Collaborated on cross-functional teams to integrate sales data into operational strategies, boosting overall sales performance.\n• Provided consulting services that improved clients' data utilization, establishing best practices in their workflows.\n• Created and maintained reports on key performance metrics, utilizing various data visualization tools for clarity and impact."
    },
    {
      "role": "Software Engineer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "Utilized analytical skills to design and implement data models, optimizing data processing and improving efficiency by **20%** in data retrieval operations.\nDeveloped and maintained APIs for data access and integration, leveraging **PostgreSQL** for highly responsive data interactions, achieving a response time reduction of **15%**.\nApplied market strategy understanding to gather and analyze client requirements, driving data-driven solutions tailored to stakeholder needs.\nConducted data analysis using advanced tools, resulting in insights that informed consulting projects and contributed to **10%** growth in client satisfaction ratings.\nCollaborated with cross-functional teams to define project objectives and timelines, ensuring alignment on data objectives and deliverables.\nDesigned visualizations and presentations utilizing data gathered from various sources, facilitating better decision-making for clients.\nPresented data findings and insights fluently in **German** and **English**, enhancing communication with diverse stakeholders.\nMentored junior team members in data management best practices and analytical techniques, fostering a culture of continuous improvement and skill development.\nProactively researched and implemented AI solutions to enhance data processing, leading to a **30%** increase in operational efficiency.\nEngaged with clients to provide consulting on data projects, establishing long-term relationships and repeat business opportunities."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "• Analyzed data to develop market strategies that increased sales by **15%** through targeted campaigns.\n• Utilized **AI** techniques to optimize client management processes, enhancing customer engagement.\n• Presented analytical findings to stakeholders in both **German** and **English**, ensuring clarity and alignment with client objectives.\n• Collaborated with cross-functional teams to provide consulting support, driving significant improvements to project workflows.\n• Managed client relationships effectively, resulting in a **25%** increase in repeat business.\n• Delivered high-impact presentations that demonstrated the value of data-driven decision-making.\n• Leveraged analytical skills to derive insights from performance data, improving overall sales strategies.\n• Produced comprehensive documentation and reports to facilitate data sharing and knowledge transfer across teams."
    }
  ],
  "skills": "**Programming Languages**\n\tPython, JavaScript, TypeScript\n\n**Frontend Frameworks**\n\tHTML, CSS, ReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n**Backend Frameworks**\n\tNodeJS, ExpressJS, NestJS, C#, .NET, Entity Framework, Microservices\n\n**API Technologies**\n\tRESTful API, GraphQL\n\n**Databases**\n\tMSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB\n\n**Cloud & Infrastructure**\n\tAWS, Azure, CI/CD pipelines\n\n**DevOps**\n\tGit, GitHub\n\n**Other**\n\tUX/UI Design, Testing Tools: NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest, Blockchain: Solidity, Ether.js, Web3.js, Ethereum, Data, AI, Sales, Market Strategy, Consulting, Client Management, Analytical Skills, Presentation Skills, German, English",
  "apply_company": "Sopra Steria"
}