{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Back-End Software Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-623a26390/",
  "profile_summary": "Back-End Software Engineer with 13+ years of experience in delivering high-performance applications, specializing in **JavaScript**, **TypeScript**, **Node.js**, and cloud services like **AWS** (including **Lambda**, **SNS**, **SQS**). Proven expertise in implementing **event-driven architecture** and **continuous integration** practices while using agile methodologies, including **Scrum**. Skilled in **MongoDB** for database management and proficient in **React** and **Next.js** for full stack development as needed. Strong communicator with a focus on compliance in development, ensuring adherence to standards such as HIPAA and PCI DSS. Demonstrated success in building robust back-end systems and APIs, with hands-on experience in microservices and serverless architectures.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Back-End Software Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Developed and maintained scalable back-end systems using **Node.js**, **TypeScript**, and **JavaScript**, aligning with Agile methodologies and Scrum practices for efficient project delivery.\n• Designed event-driven architectures utilizing **AWS Lambda**, **SNS**, and **SQS** to enhance the responsiveness and reliability of applications.\n• Implemented continuous integration practices with tools such as **GitHub Actions** and **CircleCI**, ensuring robust automation for testing and deployment workflows.\n• Integrated and optimized databases including **MongoDB** to support application data needs while maintaining performance at scale.\n• Led full stack development initiatives incorporating **React**, **Next.js**, and **Node.js**, enabling the seamless rendering of dynamic applications with version **17-18** for React.\n• Executed unit testing strategies to elevate code quality and maintainability using tools like **Jest** and **PyTest**, ensuring that software meets critical performance standards.\n• Collaborated cross-functionally to enhance system performance and user experience by integrating communication protocols and following best coding practices.\n• Engaged in wealth management solutions through advanced back-end coding, ensuring compliance with industry regulations while simplifying user interactions.\n• Fostered strong communication skills within the team to effectively translate client requirements into functional software features, enhancing team collaboration and project outcomes."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "• Developed scalable back-end solutions utilizing **Node.js** and **JavaScript** for high-volume transaction systems, ensuring performance efficiency.\n• Integrated with cloud services like **AWS** including **Lambda**, **SNS**, and **SQS** to implement a **Serverless** architecture for improved system reliability and reduced costs.\n• Managed data storage using **MongoDB** to ensure efficient handling of wealth management applications and financial transactions.\n• Designed an **event-driven architecture** that leverages **Kafka** and **RabbitMQ** for asynchronous processing across workflows, contributing to reduced latency in critical functions.\n• Collaborated in an **Agile** environment employing **Scrum** methodologies, promoting team synergy and optimized project delivery.\n• Conducted thorough **unit testing** and embraced **continuous integration** practices to maintain high code quality and ensure application stability.\n• Built full-stack applications using **React**, **Next.js**, and **TypeScript**, successfully delivering front-end features that enhance user interaction with back-end services.\n• Demonstrated strong communication skills while collaborating with cross-functional teams to align project objectives and deliver innovative solutions.\n• Leveraged tools like **D3.js** for data visualization and **Power BI Embedded** to create dashboards for instant financial insights, resulting in more informed decision-making.\n• Implemented robust ETL pipelines with **Python** and **Apache Airflow**, incorporating both batch and real-time data ingestion strategies to drive analytical projects."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "- Developed high-performance backend services leveraging **Node.js** and **JavaScript**, ensuring seamless functionality and interactions across critical modules for a global e-commerce platform.\n- Designed and implemented serverless architectures using **AWS Lambda** and **SNS/SQS**, streamlining operational processes and improving resource utilization for scalable application deployment.\n- Engineered real-time features employing event-driven architecture, enhancing user experience with dynamic updates and reduced latency through **WebSockets** and messaging queues like **Kafka**.\n- Integrated a myriad of databases including **MongoDB** for dynamic data management and ensuring high availability in handling over **100,000** daily transactions efficiently on high-traffic platforms.\n- Championed **Continuous Integration** practices within an **Agile** and **Scrum** environment, ensuring robust deployment cycles that included unit testing for reliability and speed.\n- Enhanced frontend experiences with frameworks such as **Next.js** and **React**, focusing on delivering responsive interfaces optimized for both desktop and mobile, achieving a load time reduction of up to **40%**.\n- Fostered secure application environments by implementing OAuth 2.0 and role-based access control (RBAC), maintaining GDPR compliance and protecting sensitive user data throughout the platform.\n- Collaboratively worked on software development processes that included **full stack development**, ensuring end-to-end functionality and coherence in project features.\n- Maintained high-level communication across teams to align project goals and timelines, thus enhancing cross-functional collaboration within an **Agile** framework."
    }
  ],
  "skills": " **Programming Languages:**\n\tJavaScript, TypeScript, Python\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django, Node.js\n\n **Frontend Frameworks:**\n\tReact, Vue, Angular, Next.js\n\n **API Technologies:**\n\tServerless, AWS Lambda, SNS, SQS, Event-driven architecture\n\n **Serverless and Cloud Functions:**\n\tAWS, Azure\n\n **Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Continuous integration, Terraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:**\n\tAWS: ECS, RDS, S3, Azure: App Services, Blob Storage, SQL Database\n\n **Other:**\n\tMLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), OAuth2, JWT, Nginx, Let’s Encrypt, Certbot, Agile, Scrum, Unit testing, Full stack development, Wealth management, Strong communication skills"
}