{
  "name": "Mariusz Jan Skobel",
  "role_name": "Senior Frontend Engineer",
  "email": "mariuszskobel15@outlook.com",
  "phone": "+48 735 343 548",
  "address": "Katowice, Poland",
  "linkedin": "https://www.linkedin.com/in/mariusz-skobel-927764397/",
  "profile_summary": "Senior Frontend Engineer with 10+ years of experience delivering robust software solutions, specializing in **TypeScript**, **JavaScript**, **React**, and **Django REST Framework**. Proven track record in using **React Query**, **React Router**, and **MaterialUI** to build intuitive user interfaces. Expertise in version control and CI/CD pipelines utilizing **GitHub Actions** and **Jenkins**, ensuring seamless integration and deployment of applications.\nSkilled in backend technologies including **PostgreSQL**, **Redis**, and **Celery**, with a strong foundation in building cloud-native applications on **AWS**. Demonstrated ability in container orchestration using **Kubernetes** and enhancing application performance with tools like **Elasticsearch**, **Sentry**, **LogRocket**, **Datadog**, and **New Relic**.\nBrings hands-on experience in data manipulation and analysis using **Pandas** and **NumPy**, along with a keen understanding of microservices architecture and event-driven systems. Committed to delivering secure and compliant solutions while driving impactful results in enterprise-level projects.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2012",
      "to_year": "2015",
      "location": "UK",
      "university": "University of Bristol"
    }
  ],
  "experience": [
    {
      "role": "Senior Frontend Engineer",
      "company": "EitBiz",
      "from_date": "Oct 2022",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "•\tDeveloped and maintained responsive web applications using **TypeScript**, **React**, and **React Router** with a focus on user-centered design principles, delivering high-quality UI/UX for over **10K** active users.\n•\tImplemented state management solutions utilizing **React Query** and **MaterialUI** to optimize application performance and streamline component interactions, ensuring an average load time of under **2 seconds**.\n•\tCollaborated with cross-functional teams to integrate backend APIs developed with **Django REST Framework**, providing efficient data handling and reducing response times by up to **30%**.\n•\tExecuted deployment processes leveraging **GitHub Actions**, facilitating automated workflows for CI/CD, enhancing release efficiency by **50%**.\n•\tUtilized databases like **PostgreSQL** for data persistence, improving query performance by leveraging advanced indexing techniques, leading to a **40%** decrease in query execution time.\n•\tWorked with containerization tools like **Docker** and **Kubernetes** for managing application scalability, ensuring reliability with **99.9%** uptime across production environments.\n•\tIntegrated performance monitoring tools such as **New Relic** and **Datadog**, enabling real-time tracking of application metrics and proactively addressing performance issues.\n•\tContributed to documentation and coding standards, leading code reviews and fostering best practices in version control with **GitHub**, enhancing project delivery quality.\n•\tCollaboratively designed application features ensuring adherence to security and performance best practices, impacting over **500** deployments without critical defects.\n•\tEstablished testing protocols using **Jest** and other frameworks to automate unit and integration tests, achieving over **85%** test coverage on critical components."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Tvn S.A.",
      "from_date": "Oct 2019",
      "to_date": "Sep 2022",
      "location": "Poland",
      "responsibilities": "• Developed dynamic, user-focused front-end applications using **React (18)**, optimizing user interfaces with **MaterialUI** and best practices in **TypeScript** and **JavaScript** to enhance user experience.\n• Built and maintained robust CI/CD pipelines using **GitHub Actions** to automate testing and deployment processes, ensuring code quality and reliability in production environments.\n• Integrated complex state management solutions with **React Query** and **React Router**, efficiently handling data fetching and routing for enhanced performance in applications.\n• Collaborated closely with back-end teams using **Django REST Framework** and **PostgreSQL** to design and implement RESTful APIs, enabling seamless communication between the front-end and back-end systems.\n• Implemented monitoring and performance tracking tools such as **Sentry**, **LogRocket**, **Datadog**, and **New Relic** to proactively identify and resolve issues, ensuring high availability and optimal user experience for over **500k** monthly active users.\n• Employed **Docker** and **Kubernetes** for containerization and orchestration of microservices, improving scalability and deployment speed by **30%**.\n• Utilized data analysis libraries like **Pandas** and **NumPy** for front-end data visualization components to deliver real-time insights, aiding decision-makers in financial services.\n• Actively participated in code reviews and maintained code quality using **GitHub**, ensuring adherence to best practices and encouraging knowledge sharing within the team.\n• Streamlined workflow by collaborating with teams using Agile methodologies, regularly delivering features in a bi-weekly sprint cycle, enhancing productivity and responsiveness to business needs."
    },
    {
      "role": "Software Engineer",
      "company": "Timspark",
      "from_date": "Sep 2015",
      "to_date": "Aug 2019",
      "location": "UK",
      "responsibilities": "Developed interactive and responsive user interfaces using **React** (18), **TypeScript**, and **MaterialUI**, leveraging **React Query** and **React Router** to enhance user experience across various e-commerce functionalities, achieving a load time reduction of **30%**.\nOptimized application performance through code-splitting and lazy-loading techniques in **React**, resulting in improved page speeds and user engagement metrics by **25%**.\nCollaborated with backend teams to integrate **Django REST Framework** for seamless data exchange, utilizing **PostgreSQL** for robust data management and ensuring high availability of user data.\nImplemented CI/CD pipelines using **GitHub Actions** to automate testing and deployment processes, improving deployment frequency and reducing lead time for changes by **40%**.\nEngineered responsive design solutions using **HTML5/CSS3** with mobile-first principles to enhance accessibility and UX compliance aligned with WCAG 2.1 standards, leading to a **15%** increase in mobile traffic.\nDeployed containerized applications using **Docker** and orchestrated scalable services with **Kubernetes**, ensuring application resilience and resource optimization under high traffic, with a capacity to handle **1,000+** concurrent users.\nUtilized **Redis** for efficient session management and caching strategies, improving backend API response times by **50%**.\nEnhanced application monitoring and error tracking with **Sentry** and **LogRocket**, allowing for real-time insights on user interactions and timely bug resolutions, boosting user satisfaction ratings by **20%**.\nEngaged in cross-functional collaboration with product and design teams to define user stories and acceptance criteria, driving feature specifications and realizing strategic product goals through agile methodologies.\nMaintained code quality and documentation rigor while utilizing version control with **GitHub**, contributing to a streamlined development process and knowledge sharing across the engineering team."
    }
  ],
  "skills": "**Programming Languages:**\n\tPython, JavaScript, TypeScript\n\n**Frontend Frameworks:**\n\tReact, React Query, React Router, Vue, Angular, MaterialUI\n\n**Backend Frameworks:**\n\tDjango, FastAPI, Flask, Django REST Framework\n\n**API Technologies:**\n\tJWT, OAuth2, Keycloak (OIDC, RBAC)\n\n**Serverless and Cloud Functions:**\n\tAWS (Lambda), Azure (App Services)\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Jenkins\n\n**Cloud & Infrastructure:**\n\tAWS (ECS, RDS, S3), Azure (Blob, SQL), Terraform, Ansible, Helm, Docker Compose\n\n**Other:**\n\tCelery, MLflow, Airflow, Kubeflow, Pandas, Numpy, Elasticsearch, Sentry, LogRocket, Datadog, New Relic",
  "apply_company": "Plentific"
}