{
  "name": "Mariusz Jan Skobel",
  "role_name": "Senior Fullstack Engineer",
  "email": "mariuszskobel15@outlook.com",
  "phone": "+48 735 343 548",
  "address": "Katowice, Poland",
  "linkedin": "https://www.linkedin.com/in/mariusz-skobel-927764397/",
  "profile_summary": "Results-driven Senior Fullstack Engineer with 10+ years of experience in developing high-performance software solutions. Proficient in **Go**, **React**, and **TypeScript**, with a solid background in building APIs and working within Payments and Blockchain ecosystems. Demonstrated expertise in Web3 technologies, **Git** version control, and Agile methodologies tailored for startup environments.\n\nSkilled in modern frameworks and libraries such as **Node.js**, **FastAPI**, and **Django**, with hands-on experience in delivering comprehensive applications. Adept at cloud-native deployments on **Azure** and **AWS**, leveraging microservices architecture and CI/CD automation for efficient software delivery. Experienced in embedding AI/ML capabilities for real-time analytics, and ensuring compliance with industry standards like HIPAA and PCI DSS.\n\nBrings practical knowledge in MLOps, including developing ML pipelines and production workflow management with tools like MLflow and Kubeflow. Passionate about crafting secure, maintainable solutions that create tangible impact.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2012",
      "to_year": "2015",
      "location": "UK",
      "university": "University of Bristol"
    }
  ],
  "experience": [
    {
      "role": "Senior Fullstack Engineer",
      "company": "EitBiz",
      "from_date": "Oct 2022",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "•\tDeveloped and maintained scalable APIs using **TypeScript** and **Go**, optimizing for performance and reliability in fast-paced, startup environments.\n•\tEngineered user-centric web applications utilizing **React** to enhance customer engagement and deliver seamless payment experiences in blockchain and Web3 technologies.\n•\tCollaborated in Agile teams to align project objectives with client requirements, ensuring timely delivery of high-quality code in under **2 weeks** sprints.\n•\tManaged code versioning and collaboration through **Git**, improving team productivity and communication across multiple concurrent projects.\n•\tImplemented payment gateway integrations, enhancing transaction security and processing speeds for a user base of over **10,000** active users.\n•\tParticipated in enterprise-level DevOps practices leveraging CI/CD pipelines to automate tests and deployments, reducing average deployment time by **30%**.\n•\tDesigned and executed rigorous testing strategies using Jest and Postman, achieving over **90%** code coverage across critical frontend and backend components.\n•\tLed initiatives for performance optimization of existing codebases, contributing to a **40%** increase in application responsiveness.\n•\tFostered an innovative startup culture by mentoring junior engineers in best practices and advanced **React** techniques, ensuring knowledge transfer and team development."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Tvn S.A.",
      "from_date": "Oct 2019",
      "to_date": "Sep 2022",
      "location": "Poland",
      "responsibilities": "• Developed and maintained scalable and efficient APIs for financial transactions using **Go**, ensuring seamless integration and high performance for payment processing systems.\n• Built dynamic front-end applications utilizing **React (18)** and **TypeScript**, enhancing user engagement and satisfaction within payment platforms.\n• Collaborated in an Agile environment, driving the development process within a startup culture, managing sprints, and optimizing team workflows.\n• Implemented payment solutions integrating with various payment gateways while ensuring compliance with applicable regulations.\n• Designed and implemented a blockchain-based verification system to enhance transaction security and fraud detection in collaboration with cross-functional teams.\n• Utilized **Git** for version control, ensuring code quality and effective collaboration among team members throughout the development life cycle.\n• Participated in the introduction of **Web3** technologies to enable decentralized transactions and e-wallet capabilities, paving the way for innovative payment solutions.\n• Conducted thorough testing and debugging of applications, contributing to a **30%** reduction in production bugs through improved code quality and QA practices.\n• Spearheaded initiatives that enhanced system resilience and scalability, resulting in a **40%** improvement in application performance metrics during peak transaction volumes."
    },
    {
      "role": "Software Engineer",
      "company": "Timspark",
      "from_date": "Sep 2015",
      "to_date": "Aug 2019",
      "location": "UK",
      "responsibilities": "Designed and optimized scalable APIs for e-commerce applications using **Go**, ensuring high availability and performance across critical services.\nDeveloped frontend applications using **React (18)** and **TypeScript**, delivering fast, responsive user experiences on both web and mobile platforms.\nImplemented secure payment workflows integrated with various payment gateways, demonstrating expertise in handling transactions, ensuring compliance with **PCI** standards in high-volume environments.\nUtilized **Git** for version control and collaboration in an **Agile** development environment, enhancing team productivity and project visibility.\nEngineered feature enhancements and deployed updates in a startup context, utilizing strategies for rapid iteration and feedback integration.\nApplied blockchain concepts in relevant features, contributing to the exploration of **Web3** technologies to improve transparency and security in transactions.\nCreated a robust end-to-end testing strategy that improved code reliability, reducing production issues by **30%** within the first **6 months**.\nFostered a culture of collaboration, code reviews, and knowledge sharing, leading to an enhancement in team efficiency and code quality, achieving a **20%** reduction in bug reports post-deployment.\nIntegrated innovative solutions to streamline payment processes, decreasing transaction completion time by **15%**, significantly improving user satisfaction ratings."
    }
  ],
  "skills": " **Programming Languages:** \n\tGo, Python, JavaScript, TypeScript \n\n **Backend Frameworks:** \n\tFastAPI, Flask, Django \n\n **Frontend Frameworks:** \n\tReact, Vue, Angular  \n\n **API Technologies:** \n\tAPIs \n\n **Serverless and Cloud Functions:** \n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL) \n\n **Databases:** \n\tPostgreSQL, MySQL, MongoDB, Redis \n\n **DevOps:** \n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose \n\n **Cloud & Infrastructure:** \n\tAWS, Azure \n\n **Other:** \n\tMLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, Payments, Blockchain, Web3, Git, Agile, Startup",
  "apply_company": "The Open Platform"
}