{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Python Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "As a Senior Python Engineer with 8 years of experience, I excel in developing high-performance applications utilizing **Python**, **Django**, and **AWS**. My comprehensive expertise includes CI/CD automation, ensuring efficient development workflows and robust deployment strategies. I am skilled in building APIs and have a strong understanding of architecture principles that support scalable and maintainable systems. Additionally, I am well-versed in automation strategies and observability practices to enhance application performance.\nI have successfully led the development of enterprise-grade platforms in the healthcare and finance sectors, integrating AI/ML capabilities for predictive analytics and real-time data processing. Proficient in **JavaScript/TypeScript**, I work with modern frameworks such as **React**, **Next.js**, and **Vue**. My experience also includes a foundational knowledge of microservices architecture and managing event-driven systems to build secure applications in compliance with standards like HIPAA and PCI DSS.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Python Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Focused on architecting and developing robust, scalable applications utilizing **Python** and **Django** while implementing high standards for **Architecture** and **API** design.\nEmployed **AWS** services to build cloud-based solutions, ensuring scalability and reliability in deployments while adhering to best practices in **CI/CD**.\nImplemented automated workflows to enhance **Automation** efforts, significantly reducing build and deployment time by **30%**.\nKept meticulous documentation of architectural decisions and API specifications to improve team collaboration and observability across projects.\nIntegrated advanced monitoring solutions to improve system observability, leading to quicker identification and resolution of issues, resulting in **25%** reduction in downtime.\nCollaborated with cross-functional teams to define requirements and ensure alignment with business objectives while maintaining a focus on **API** integrations.\nOversaw the performance and optimization of applications, reporting actual performance levels against established benchmarks which improved response times by **40%**.\nTrained junior developers on **Python** best practices and effective usage of **Django**, fostering a strong team environment and enhancing team output.\nContributed to open-source projects and shared knowledge within the community, further establishing expertise in **Python** frameworks."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Developed robust and scalable financial platforms with a focus on **Python** and **Django**, enhancing maintainability and throughput for high-volume transaction systems by 30%.\nImplemented automation strategies and CI/CD practices to streamline deployment processes, resulting in a 40% reduction in time-to-market for new features.\nIntegrated RESTful **API** services to facilitate communication between front-end applications and backend systems, ensuring a seamless user experience across platforms.\nArchitected a microservices-based system to improve observability and performance, increasing the operational efficiency of the application architecture by 25%.\nCreated dynamic, user-focused front-end applications using React, improving user engagement by 50% in financial dashboards and admin portals.\nManaged the orchestration of ETL pipelines utilizing **AWS** services such as **AWS Lambda** and **AWS Glue**, enabling real-time data ingestion from internal and third-party sources.\nImplemented event-driven architecture with tools like RabbitMQ and **AWS EventBridge**, enhancing system responsiveness and reliability in processing transactions and alerts.\nLeveraged analytics tools for real-time monitoring and reporting, improving detection of anomalies by 70% through data visualization and actionable insights."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Focus on developing and optimizing backend services using **Python** and **Django**, driving performance improvements and ensuring scalability for high-traffic applications.\nImplemented CI/CD pipelines to streamline deployment processes and maintain efficient automation within the development workflow, enhancing team productivity by up to **30%**.\nArchitected robust API solutions that facilitated seamless integration with third-party services, ensuring consistent performance across all e-commerce modules.\nMonitored and improved system observability by integrating tools for performance tracking and error monitoring, thereby reducing downtime incidents by **15%**.\nEngaged in AWS cloud services for the deployment of applications, optimizing resource utilization and cost-effectiveness while ensuring high availability for vital user transactions.\nDesigned comprehensive automation solutions to enhance functionality and reduce repetitive tasks within the development lifecycle, improving deployment cycle efficiency by **20%**.\nCollaborated closely with cross-functional teams to create APIs that support complex architecture requirements, promoting robust communication between different software components.\nAdhered to best practices in software architecture, ensuring maintainability and ease of enhancements as new features are incorporated into the platform.\nContributed to the strategic development approach by leveraging Observability tools, which greatly enhanced troubleshooting capabilities and improved response times to system-related issues."
    }
  ],
  "skills": "**Programming Languages:**\n\tPython\n\n**Backend Frameworks:**\n\tDjango\n\n**Frontend Frameworks:**\n\tJavaScript/TypeScript (React, Vue, Angular)\n\n**API Technologies:**\n\tAPI\n\n**Serverless and Cloud Functions:**\n\tAWS\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, Directus, Automation, Architecture, Observability, Authentication & Security (Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot)",
  "apply_company": "Paychex"
}