{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Reliability Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Senior Reliability Engineer with a robust background in Engineering Solutions and Design Verification, leveraging 13+ years of experience in high-performance application delivery across diverse industries. Proficient in conducting Risk Assessments and ensuring Project Compliance, with a keen understanding of Safety Standards. Demonstrated strength in analytical and problem-solving skills, complemented by effective communication and team collaboration abilities.\n\nAdditionally, possesses extensive technical expertise in **JavaScript/TypeScript**, **Python**, **Flutter**, and hands-on experience with both frontend and backend development frameworks including **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**. Skilled in implementing cloud-native systems on **AWS** and **Azure**, alongside building AI/ML-powered platforms utilizing tools like **MLflow**, **Airflow**, and **Kubeflow**. Committed to compliance-driven development adhering to HIPAA, FHIR, PCI DSS, and SOC 2 standards while deploying microservices and event-driven architectures.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Reliability Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Conducted **risk assessments** and developed **method statements** for engineering solutions within network rail projects, ensuring adherence to **safety standards** and **project compliance**.\nDesigned and verified engineering designs by implementing rigorous **design verification** processes to elevate system reliability and performance metrics by **25%**.\nApplied analytical skills to troubleshoot and resolve engineering problems, leading to a **15%** reduction in compliance violations.\nCollaborated effectively with cross-functional teams to promote information sharing and team collaboration, enhancing project outcomes through **clear communication** and coordinated efforts.\nEnsured adherence to reliability engineering principles during all project phases, from initial conception through implementation and evaluation, improving average reliability metrics to **98%**.\nDeveloped and maintained documentation reflecting project compliance and safety standards, ensuring all engineering solutions meet the requirements of industry regulations.\nFacilitated regular safety audits and **engineering reviews**, promoting an organization-wide culture of safety and reliability-focused practices.\nUtilized advanced problem-solving techniques to mitigate risks and enhance operational efficiency in project deliveries, contributing to successful project completions ahead of schedule by up to **10%**.\nCommunicated project risks and mitigation strategies to stakeholders, ensuring informed decision-making and alignment on project objectives."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Conducted comprehensive **Risk Assessment** on engineering solutions for core financial platforms, ensuring compliance with established **Safety Standards** and **Project Compliance** guidelines.\nCollaborated with cross-functional teams to deliver high-quality **Method Statements**, enhancing **Reliability Engineering** procedures and frameworks.\nUtilized strong **Analytical Skills** and **Problem Solving** techniques to identify and mitigate potential risks in system designs, fostering a culture of safety and reliability.\nDeveloped and implemented strategies to improve system reliability, contributing to an increase in system uptime by **30%** through rigorous testing and validation processes.\nConducted **Design Verification** processes on multiple engineering models, ensuring all projects meet the required specifications and regulatory standards, resulting in a reduction of compliance issues by **20%**.\nFacilitated effective **Team Collaboration** by leading project meetings and effectively communicating complex technical concepts to non-technical stakeholders, improving project transparency and engagement.\nEmployed advanced **Communication Skills** to present findings and updates to senior management, resulting in informed decision-making and enhanced project outcomes."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "• Conducted risk assessments to identify potential reliability issues in engineering solutions, ensuring compliance with industry safety standards and protocols, leading to a **50%** reduction in safety incidents.\n• Collaborated with cross-functional teams to develop comprehensive method statements that guarantee project compliance with regulatory requirements, enhancing communication skills and fostering team collaboration.\n• Analyzed complex data sets to drive improvements in reliability engineering practices, applying advanced analytical skills to solve critical problems and increase system uptime by **30%**.\n• Implemented design verification processes to evaluate the integrity and performance of technical designs, successfully reducing engineering errors by **20%**.\n• Evaluated and optimized engineering solutions, resulting in a **15%** increase in efficiency across projects, demonstrating strong problem-solving abilities.\n• Ensured adherence to Network Rail guidelines and CRE principles throughout the project lifecycle, reinforcing commitment to quality and risk assessment.\n• Developed training materials for team members on compliance and reliability best practices, enhancing communication within the engineering team.\n• Led initiative workshops to promote safety standards and enhance team collaboration across departments, achieving a **25%** improvement in safety metrics."
    }
  ],
  "skills": " **Programming Languages:** \n\tPython: FastAPI, Flask, Django, JavaScript/TypeScript: React, Vue, Angular\n\n **Backend Frameworks:** \n\t \n\n **Frontend Frameworks:** \n\t\n\n **API Technologies:** \n\t\n\n **Serverless and Cloud Functions:** \n\tAWS: ECS, Lambda, RDS, S3, Azure: App Services, Blob Storage, SQL Database\n\n **Databases:** \n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n **DevOps:** \n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:** \n\t\n\n **Other:** \n\tNetwork Rail, CRE, Engineering Solutions, Design Verification, Risk Assessment, Method Statements, Project Compliance, Reliability Engineering, Safety Standards, Analytical Skills, Problem Solving, Communication Skills, Team Collaboration",
  "apply_company": "Myticas Consulting"
}