{
  "name": "Rei Taro",
  "role_name": "Senior iOS Engineer",
  "email": "rei515@outlook.com",
  "phone": "+48732529451",
  "address": "Warszawa, Poland",
  "linkedin": "https://www.linkedin.com/in/rei-taro-81a410391/",
  "profile_summary": "Results-driven Senior iOS Engineer with 10+ years of experience in mobile development, particularly in enhancing user experiences through dynamic applications using **Swift** and **React Native**. Highly skilled in integrating AI capabilities into mobile solutions to deliver intelligent user functionality. Proven expertise in designing and delivering scalable backend systems and APIs, leveraging technologies like **Python** (FastAPI, Django, Flask) and cloud services such as **AWS** and **Azure**. A strong history of impactful contributions with leading companies, including VISA, Sii Poland, and Reply Polska.",
  "education": [
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2010",
      "to_year": "2015",
      "location": "Japan",
      "university": "Keio University"
    }
  ],
  "experience": [
    {
      "role": "Senior iOS Engineer",
      "company": "Leobit",
      "from_date": "Aug 2022",
      "to_date": "Present",
      "location": "Poland",
      "responsibilities": "• Developed mobile applications utilizing **Swift** for seamless user experiences, focusing on high performance and responsiveness.\n• Built cross-platform solutions with **React Native**, enabling efficient code reuse and faster deployment, achieving a **30%** reduction in development time.\n• Leveraged **AI** technologies to enhance app functionality, leading to a **25%** increase in user engagement metrics.\n• Led initiatives in mobile development best practices, ensuring adherence to the latest industry standards and improving application scalability by **40%**.\n• Collaborated with UX/UI designers to implement features that align with user needs, resulting in a **15%** increase in user satisfaction scores.\n• Conducted thorough QA testing and implemented CI/CD practices, reducing deployment errors by **60%** and speeding up release cycles."
    },
    {
      "role": "Software Engineer",
      "company": "Innovature",
      "from_date": "Nov 2018",
      "to_date": "Jun 2022",
      "location": "Japan",
      "responsibilities": "Designed and developed robust mobile applications using **Swift** and **React Native** for an enhanced user experience, focusing on performance optimization and seamless integration.\nImplemented AI-driven features to enhance application functionality and user engagement, ensuring innovative solutions for client requirements.\nCollaborated with cross-functional teams to integrate backend services, leading to increased efficiency and streamlined workflow processes.\nConducted feasibility analysis and contributed to project planning, resulting in a **30%** reduction in development time for mobile applications.\nMaintained code quality through regular code reviews and unit testing, achieving **95%** test coverage with a focus on best practices.\nDeployed applications on the **App Store**, managing submission processes and ensuring compliance with guidelines.\nUtilized agile methodologies to ensure timely project delivery while adapting to changing requirements, leading to an improvement in team productivity by **20%**."
    },
    {
      "role": "Software Developer",
      "company": "Wizcorp",
      "from_date": "Apr 2015",
      "to_date": "Nov 2018",
      "location": "Japan",
      "responsibilities": "• Leveraged **Swift** for mobile application development, ensuring robust and high-performance iOS applications.\n• Utilized **React Native** to create cross-platform mobile experiences, allowing for efficient code reuse between iOS and Android.\n• Integrated AI algorithms to enhance user engagement and personalization within mobile apps, contributing to a **25%** increase in user retention.\n• Collaborated with cross-functional teams to translate intricate functionalities into user-friendly mobile interfaces.\n• Achieved a response time of under **200ms** for API interactions, ensuring seamless data flow between the mobile app and backend services.\n• Ensured compliance with industry standards for mobile security and data protection, aligning with best practices for app development.\n• Engaged in continuous improvement practices, yielding a **30%** reduction in app crash rates through iterative testing and feedback cycles.\n"
    }
  ],
  "skills": "Programming Languages: •\tPython (3.8+), SQL, Bash, JavaScript, Swift\n\nBackend Frameworks: •\tFastAPI, Flask, Django, Celery\n\nFrontend Frameworks: •\tReact Native\n\nAPI Technologies: •\tREST/gRPC APIs\n\nServerless and Cloud Functions: •\tAWS (EC2, S3, Lambda), Azure\n\nDatabases: •\tPostgreSQL, MySQL, MongoDB, Redis\n\nDevOps: •\tDocker, Kubernetes, GitHub Actions, Azure DevOps, CI/CD, PyTest, Git\n\nCloud & Infrastructure: \n\nOther: •\tAI, MLflow, TensorFlow, Airflow, Pandas, NumPy, Microservices, Kafka",
  "apply_company": "AI Jobs"
}