{
  "name": "Rei Taro",
  "role_name": "Senior COBOL Engineer",
  "email": "rei515@outlook.com",
  "phone": "+48732529451",
  "address": "Warszawa, Poland",
  "linkedin": "https://www.linkedin.com/in/rei-taro-81a410391/",
  "profile_summary": "Results-driven Senior COBOL Engineer with over 10 years of experience in enhancing quality control and driving process improvement in backend systems for financial applications. Proficient in **COBOL**, **JCL**, **DB2**, **CICS**, and **VSAM**, ensuring robust technical documentation and effective defect tracking. Committed to delivering high-quality training resources and possess excellent communication skills complemented by strong attention to detail. Previously contributed to successful projects at leading companies, including VISA, Sii Poland, and Reply Polska.",
  "education": [
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2010",
      "to_year": "2015",
      "location": "Japan",
      "university": "Keio University"
    }
  ],
  "experience": [
    {
      "role": "Senior COBOL Engineer",
      "company": "Leobit",
      "from_date": "Aug 2022",
      "to_date": "Present",
      "location": "Poland",
      "responsibilities": "Applied quality control measures and process improvement strategies to enhance backend services, ensuring robust functionalities.\nEngineered and maintained technical documentation for application processes and workflows, facilitating clarity in communication across teams.\nDeveloped defect tracking and reporting systems to manage issues effectively, resulting in a **30%** reduction in turnaround time for problem resolution.\nLed training sessions on programming standards and best practices to enhance team competencies in **COBOL**, **JCL**, and **DB2**.\nCollaborated with cross-functional teams to integrate **CICS** and **VSAM** into existing frameworks, optimizing data handling and improving system performance.\nImplemented attention to detail in every phase of project execution, leading to a **15%** increase in operational efficiency.\nLeveraged strong communication skills to provide clear instructions to team members and stakeholders on system updates and enhancements."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Innovature",
      "from_date": "Nov 2018",
      "to_date": "Jun 2022",
      "location": "Japan",
      "responsibilities": "Leveraged **quality control** techniques to ensure robust code quality within COBOL systems, focusing on performance optimization and defect tracking.\nImplemented **process improvement** strategies to enhance legacy systems utilizing **CICS** and **DB2**, achieving a **30%** reduction in transaction processing time.\nContributed to technical documentation standards, ensuring clarity and consistency in system documentation and training resources for junior engineers.\nCommunicated technical concepts effectively across teams, fostering collaboration and enhancing knowledge sharing and problem-solving capabilities.\nDemonstrated **attention to detail** in troubleshooting and debugging complex **VSAM** file systems, leading to a **25%** decrease in reported defects.\nConducted training sessions and workshops aimed at improving team proficiency with COBOL development practices and **JCL** scripting, resulting in **40%** faster onboarding of new team members.\n"
    },
    {
      "role": "Software Developer",
      "company": "Wizcorp",
      "from_date": "Apr 2015",
      "to_date": "Nov 2018",
      "location": "Japan",
      "responsibilities": "- Developed and maintained technical documentation for system processes, ensuring clarity and adherence to **quality control** standards.\n- Conducted training resources for team members on **defect tracking** and **process improvement**, fostering skill enhancement and collaborative communication.\n- Ensured project deliverables met quality standards, focusing on attention to detail by implementing **DB2** performance monitoring metrics, reducing issues by **30%**.\n- Collaborated with cross-functional teams to improve processes and workflows, utilizing **COBOL**, **JCL**, and **CICS**, achieving a **25%** increase in overall system efficiency.\n- Analyzed performance data from **VSAM** to identify bottlenecks, leading to an implementation of optimizations that accelerated processing times by **15%**.\n- Managed tasks with a focus on effective communication and thorough documentation, enhancing project transparency and team alignment."
    }
  ],
  "skills": "  **Programming Languages**\n\tPython (3.8+), SQL, Bash, JavaScript, COBOL\n\n  **Backend Frameworks**\n\tFastAPI, Flask, Django, Celery\n\n  **API Technologies**\n\tREST/gRPC APIs, Microservices\n\n  **Databases**\n\tPostgreSQL, MySQL, MongoDB, Redis, DB2\n\n  **Cloud & Infrastructure**\n\tAWS (EC2, S3, Lambda), Azure\n\n  **DevOps**\n\tDocker, Kubernetes, GitHub Actions, Azure DevOps, CI/CD, Git\n\n  **Other**\n\tAI/ML Tools: Pandas, NumPy, scikit-learn, TensorFlow, Airflow, MLflow, quality control, process improvement, technical documentation, training resources, defect tracking, communication, attention to detail",
  "apply_company": "N/A"
}