{
  "name": "Tomasz Lee",
  "role_name": "Product-Aware Software Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-477994390/",
  "profile_summary": "Product-Aware Software Engineer with 9+ years of experience in designing and delivering complex applications using **Java**, **Kotlin**, and **Groovy**. Proficient in **Spring Boot**, **Quarkus**, and microservices architecture, leveraging technologies such as **AWS**, **PostgreSQL**, and **Docker** to build and deploy scalable solutions. Deep expertise in developing RESTful Web Services and implementing CI/CD pipelines with **Jenkins** and **Liquibase**. Experienced in data modeling and agile methodologies, demonstrating strong collaboration and problem-solving skills. Additionally, skilled in frontend frameworks like **React** and **NodeJS**, enhancing user experience and ensuring performance optimization. Proven track record of leading projects to successful completion and driving innovation.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Product-Aware Software Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Apr 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Leveraged **Java** and **Kotlin** to design and develop scalable microservices architecture focused on enhancing product-aware features, improving performance by **30%**.\nUtilized **Spring Boot** for developing **RESTful Web Services**, achieving seamless integration of disparate services and enhancing communication efficiency by **25%**.\nImplemented **AWS** for deploying applications, ensuring high availability and scalability, which reduced downtime by **15%**.\nManaged database systems with **PostgreSQL** and **Liquibase**, resulting in a **20%** faster deployment of database changes and enhanced data integrity.\nEmployed **Docker** for containerization, leading to streamlined development environments and eliminating “works on my machine” issues, achieving a development cycle reduction of **35%**.\nExecuted CI/CD pipelines using **Jenkins**, which increased deployment frequency by **45%** and enhanced collaboration among development teams.\nApplied **Ansible** and **Terraform** for infrastructure as code, facilitating automated provisioning and configuration management, reducing manual errors by **50%**.\nEngaged in agile methodologies for project management, contributing to improved team collaboration and faster delivery cycles.\nDeveloped unit tests and integration tests using **JUnit 5** and **Spock**, guaranteeing code reliability and reducing bugs by **40%**.\nFacilitated collaboration across teams, orchestrating efforts between UX/UI designers and backend developers to create an intuitive product experience."
    },
    {
      "role": "Full Stack Developer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "Designed and developed a cloud-based project management tool employing **AWS**, improving team collaboration efficiency by **15%**.\nCreated a **Microservices** architecture utilizing **RabbitMQ** for task orchestration and **Apache Kafka** for event-driven data streams, leading to enhanced system scalability.\nIntegrated **Redis** as a caching layer, achieving a **25%** boost in system performance by reducing latency in frequent API calls.\nDeveloped **RESTful Web Services** using **.NET Core** and connected to a **PostgreSQL** database for seamless real-time data access.\nConstructed and maintained interactive components with **React** and **Tailwind CSS**, which resulted in a **25%** improvement in user engagement on the platform.\nImplemented CI/CD pipelines with **Jenkins**, reducing production deployment errors by **30%**.\nManaged database systems such as **MSSQL** and **MySQL**, optimizing queries to enhance data storage and retrieval performance.\nEngaged closely with stakeholders to define system requirements and establish development timelines, ensuring timely project delivery.\nDeveloped custom visualization tools using **D3.js** for interactive project status tracking, enhancing reporting capabilities.\nConducted code reviews and mentorship sessions for junior developers, fostering improved team productivity and collaboration."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "Utilized **Java** and **Kotlin** to enhance backend services, contributing to the development and efficiency of microservices architecture.\nLeveraged **Spring Boot** for rapid development of RESTful APIs, which improved response times by **30%**.\nImplemented **PostgreSQL** for data management and optimized query performance, leading to a **25%** decrease in data retrieval time.\nEmployed **Docker** to containerize applications, facilitating quick deployments and consistent environments in collaboration with the DevOps team.\nUsed **Liquibase** for version control of database schema changes, streamlining the development process and enabling easy rollback of changes.\nIntegrated solutions using **AWS**, enhancing system scalability and reducing operational costs by **15%**.\nDeveloped testing frameworks using **JUnit 5** and **Spock** to ensure high code quality and minimized bugs before production releases.\nParticipated in Agile methodologies for project management, contributing to efficient sprint planning and execution.\nCollaborated with cross-functional teams, promoting a culture of teamwork and knowledge sharing to achieve project goals.\nProvided comprehensive documentation and technical guides to facilitate easy understanding and maintenance of internal systems."
    }
  ],
  "skills": "**Programming Languages**\n\tJava, Kotlin, Groovy, Swift, SwiftUI, TypeScript, JavaScript, Python\n\n**Backend Frameworks**\n\tSpring Boot, Quarkus, NodeJS, ExpressJS, NestJS, .NET, C#, Microservices\n\n**Frontend Frameworks**\n\tReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n**API Technologies**\n\tRESTful API, RESTful Web Services, GraphQL\n\n**Serverless and Cloud Functions**\n\tAWS, Azure\n\n**Databases**\n\tPostgreSQL, MSSQL Server, MySQL, MongoDB, DynamoDB, CosmosDB\n\n**DevOps**\n\tDocker, Jenkins, CI/CD pipelines, Terraform, Ansible\n\n**Cloud & Infrastructure**\n\tAWS, Azure\n\n**Other**\n\tUX/UI Design, Git, GitHub, Testing Tools: NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest, Blockchain: Solidity, Ether.js, Web3.js, Ethereum, Agile methodologies, Data modeling, Collaboration, Problem-solving"
}