{
  "name": "Mariusz Jan Skobel",
  "role_name": "Senior QA Engineer",
  "email": "mariuszskobel15@outlook.com",
  "phone": "+48 735 343 548",
  "address": "Katowice, Poland",
  "linkedin": "https://www.linkedin.com/in/mariusz-skobel-927764397/",
  "profile_summary": "Senior QA Engineer with 10+ years of experience in developing and delivering high-performance software solutions, particularly in the healthcare and finance sectors. Proficient in **TypeScript**, with hands-on expertise in **Cucumber-JS**, **Playwright**, **Appium**, and **Maestro** for robust test automation. Skilled in RESTful APIs development, utilizing libraries such as **node-fetch**, **Axios**, **Supertest**, and **Postman** for efficient API testing and integration. Experienced in CI/CD processes using **GitHub Actions** and aligning testing protocols with modern frameworks like **Testmo** and **TestRail**. Knowledgeable in QA strategies that support **Web3** and blockchain technologies within the **iGaming** industry.\nBrings additional strengths in full stack development with technical expertise in **JavaScript/TypeScript**, **Python**, **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**. Proven capability in deploying cloud-native applications on **Azure** and **AWS** while ensuring compliance with industry standards such as HIPAA, FHIR, PCI DSS, and SOC 2. Passionate about leveraging QA practices that not only ensure product quality but also support innovative solutions that drive real-world impact.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2012",
      "to_year": "2015",
      "location": "UK",
      "university": "University of Bristol"
    }
  ],
  "experience": [
    {
      "role": "Senior QA Engineer",
      "company": "EitBiz",
      "from_date": "Oct 2022",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Conducted rigorous testing and validation of applications developed in **TypeScript**, ensuring high performance and adherence to quality standards within CI/CD pipelines using **GitHub Actions** and **BrowserStack**.\n• Developed automated test cases utilizing **Cucumber-JS**, **Playwright**, and **Appium** to streamline the testing process for both web and mobile platforms, enabling a reduction in testing time by **50%**.\n• Implemented comprehensive testing strategies for RESTful APIs with tools like **Supertest** and **Postman**, ensuring functionality and security compliance in all healthcare and finance applications.\n• Collaborated in cross-functional teams to integrate quality assurance practices into the development workflow, promoting a culture of quality and excellence in software delivery.\n• Oversaw end-to-end testing for applications designed with **Node.js** and **React**, achieving a **95%** pass rate across all critical test scenarios.\n• Monitored application performance and error logs to identify and resolve any issues, improving the user experience and system reliability by **30%**.\n• Spearheaded the introduction of advanced testing frameworks and tools like **TestRail** and **Testmo**, enhancing project documentation and test management, leading to improved team collaboration.\n• Drove the integration of **Web3** and **Blockchain** testing requirements into QA processes for innovative projects in the iGaming sector, ensuring seamless user experiences and transaction security.\n• Assisted in training and mentoring junior QA engineers on best practices for test automation and framework usage, fostering a knowledge-sharing environment within the team.\n• Participated in sprint planning and retrospectives to provide insights on testing efforts and quality improvement recommendations, consistently striving for higher standards in software development."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Tvn S.A.",
      "from_date": "Oct 2019",
      "to_date": "Sep 2022",
      "location": "Poland",
      "responsibilities": "Developed and executed automated testing strategies for **RESTful APIs** and front-end applications using **Cucumber-JS** and **Playwright**, ensuring a seamless user experience and high-quality deliverables.\nCollaborated with development teams to implement **CI/CD** pipelines with **GitHub Actions**, enabling rapid deployment and continuous integration with a focus on reliability and performance.\nDesigned and executed comprehensive test plans utilizing **TestRail** and **Testmo** for tracking test coverage and results, contributing to a reduction in production incidents by **30%** over **12 months**.\nConducted end-to-end testing on **Node.js** applications interfacing with various databases, utilizing **Supertest** and **Axios** for efficient API testing.\nPerformed mobile application testing using **Appium** and **BrowserStack**, improving application usability across diverse platforms and devices, resulting in a user satisfaction increase of **25%**.\nEngaged in performance testing for gaming-related applications within the **iGaming** sector, identifying bottlenecks and ensuring scalability to handle peak loads of **1000+** concurrent users.\nIntegrated testing frameworks with **Web3** technologies to validate smart contracts and blockchain interactions, enhancing security and reliability of transactions.\nProvided mentorship and training for junior QA engineers, fostering a collaborative team atmosphere and elevating overall testing processes, leading to a **50%** improvement in onboarding time for new hires."
    },
    {
      "role": "Software Engineer",
      "company": "Timspark",
      "from_date": "Sep 2015",
      "to_date": "Aug 2019",
      "location": "UK",
      "responsibilities": "- Developed and executed comprehensive test strategies for applications utilizing **TypeScript**, ensuring robust and reliable performance within the e-commerce platform.\n- Automated testing frameworks with **Cucumber-JS**, **Playwright**, and **Appium** to enhance testing efficiency and coverage by **30%**, supporting continuous integration and delivery practices.\n- Designed RESTful APIs testing scenarios using tools like **node-fetch**, **Axios**, and **Supertest** to validate backend functionality and performance, achieving over **95%** test coverage for critical endpoints.\n- Collaborated with development teams using **GitHub Actions** for seamless CI/CD pipelines, resulting in reduced deployment times by **20%** while maintaining high-quality standards.\n- Managed testing of payment workflows integrated with Stripe, PayPal, and Razorpay, ensuring full compliance with PCI standards and reducing transaction failure rates by **15%**.\n- Created automated tests for iGaming features utilizing **Testmo** and **TestRail** to track and manage test cases, significantly improving the testing lifecycle efficiency.\n- Engaged in mobile test automation across various devices using **BrowserStack**, ensuring consistent application performance and UI/UX quality in line with industry standards.\n- Conducted thorough testing of blockchain and Web3 functionalities, supporting secure and scalable integration within the platform, while leveraging best practices in security testing.\n- Ensured cross-platform compatibility and functionality by leading automation efforts that saved an estimated **100 hours** a month in manual testing.\n- Participated in scrum meetings and peer reviews to optimize test strategies and identify potential areas of risk within the application stack, fostering a culture of continuous improvement.\n"
    }
  ],
  "skills": "  **Programming Languages:**\n\tPython, JavaScript, TypeScript\n\n  **Frontend Frameworks:**\n\tReact, Vue, Angular\n\n  **Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n  **API Technologies:**\n\tRESTful APIs, Axios, Supertest, Postman, node-fetch\n\n  **Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n  **Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n  **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n  **Cloud & Infrastructure:**\n\tCI/CD, iGaming, GitHub Actions\n\n  **Other:**\n\tMLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, Cucumber-JS, Playwright, Appium, Maestro, Testmo, TestRail, BrowserStack, Blockchain, Web3",
  "apply_company": "Block Labs"
}