{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior FullStack Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Senior Full Stack Engineer with 13+ years of experience, specializing in delivering high-performance applications for the healthcare and financial sectors. Proficient in **TypeScript**, **React**, **Next.js**, **Python**, and **Django**, with comprehensive expertise in both frontend and backend development. Proven track record of designing and implementing Web APIs and observability solutions, ensuring efficient application performance and reliability. \nDemonstrated capability in Agile methodologies, fostering collaboration and iterative progress. Strong problem-solving skills with exceptional attention to detail. Experienced in creating AI/ML-driven platforms that enable predictive analytics and real-time processing. Adept at deploying cloud-native architectures on **AWS** and **Azure**, integrating microservices, event-driven systems, and CI/CD pipelines. Knowledgeable in compliance-oriented development, ensuring solutions meet HIPAA, FHIR, PCI DSS, and SOC 2 standards.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior FullStack Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Utilized **TypeScript** and **React (17–18)** to design and build full-stack solutions, ensuring strong adherence to Agile methodologies and achieving high user satisfaction rates.\nDeveloped robust **Web APIs** using **Python (Django)**, implementing secure data access and enhancing system interoperability in healthcare and fintech sectors.\nDemonstrated exceptional **problem-solving** skills, transforming legacy systems to modern architectures, focusing on observability and performance.\nMaintained acute **attention to detail** while delivering real-time mobile applications for iOS and Android using **Flutter** and **React Native**, enhancing user engagement by **30%**.\nImplemented CI/CD pipelines with **GitHub Actions** and **CircleCI**, ensuring seamless deployment workflows and achieving a **40%** reduction in deployment time.\nLed the mapping of **Next.js** benefits for server-side rendering and optimized performance for high-traffic applications.\nCollaborated with cross-functional teams, applying **Agile** practices to drive project success and foster innovation.\nConducted comprehensive testing strategies using **Jest** and **Cypress**, ensuring **98%** test coverage across frontend components and backend services.\nDeveloped advanced features, incorporating AI-driven analytics into UI, achieving real-time insights and enhancing decision-making capabilities.\nBuilt observability tools and dashboards, leveraging **observability** frameworks to enhance system monitoring and performance analysis across platforms."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "• Developed interactive front-end applications with **React (18)**, **Next.js**, and **TypeScript**, enhancing user experience and engagement through responsive designs and dynamic functionalities.\n• Implemented robust Web APIs using **Python (Django)**, streamlining communications between clients and servers while ensuring security and performance efficiency.\n• Delivered end-to-end solutions through Agile methodologies, focusing on problem-solving and attention to detail, driving project efficiency by reducing delivery times by **20%**.\n• Employed observability techniques to enhance system monitoring and performance analytics across applications, resulting in a **15%** reduction in downtime.\n• Enhanced application performance through rigorous testing and optimization strategies, achieving load improvements of up to **30%** in high-traffic scenarios.\n• Collaborated with cross-functional teams to integrate **Ruby on Rails** for backend services, maintaining a seamless development pipeline and reducing bottlenecks in the deployment process.\n• Actively participated in code reviews to support best practices, achieving a code quality improvement rate of **25%** through actionable feedback and mentorship."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "- Developed robust backend services using **Python** (Django) and **Ruby** (Rails), emphasizing **Agile** methodologies to ensure timely delivery and iterative improvements.\n- Created dynamic web applications with **TypeScript**, **React** (18), and **Next.js**, prioritizing user experience and attention to detail in design and functionalities.\n- Designed and implemented **Web APIs**, ensuring seamless integration between frontend and backend components, while focusing on observability and performance tuning.\n- Conducted optimization and refactoring of existing codebases, significantly improving load times by **25%** and reducing API response times to under **200ms**.\n- Collaborated closely with cross-functional teams, applying strong problem-solving skills to tackle challenges in application architecture and scalability.\n- Implemented comprehensive testing strategies and utilized code reviews to maintain high code quality and team knowledge sharing.\n- Managed feature rollouts and updates using modern deployment strategies, enhancing deployment frequency by **30%** and minimizing downtime during releases.\n- Ensured compliance with industry standards, including GDPR, by applying best practices in data protection and user privacy management.\n"
    }
  ],
  "skills": "**Programming Languages:**\n\tPython, TypeScript, Ruby\n\n**Backend Frameworks:**\n\tDjango, FastAPI, Flask, Rails\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular, Next.js\n\n**API Technologies:**\n\tWeb APIs\n\n**Serverless and Cloud Functions:**\n\tAWS: Lambda, ECS\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD\n\n**Cloud & Infrastructure:**\n\tAWS: RDS, S3\n\tAzure: App Services, Blob Storage, SQL Database\n\tTerraform, Ansible, Helm, Docker Compose\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, Observability, Agile, Problem-Solving, Attention to Detail, Keycloak (OIDC, RBAC), OAuth2, JWT, Nginx, Let’s Encrypt, Certbot",
  "apply_company": "Numan"
}