{
  "name": "Mariusz Jan Skobel",
  "role_name": "Senior Software Engineer",
  "email": "mariuszskobel15@outlook.com",
  "phone": "+48 735 343 548",
  "address": "Katowice, Poland",
  "linkedin": "https://www.linkedin.com/in/mariusz-skobel-789557397/",
  "profile_summary": "Results-driven Senior Software Engineer with 10+ years of experience in delivering high-performance software solutions, particularly in the healthcare and finance sectors. Expertise in **Python**, **AWS**, **CI/CD**, and **DevOps** practices, combined with hands-on experience in Agile methodologies including **Scrum**. Proven ability to develop secure and maintainable applications while adhering to accessibility standards. Proficient in modern technologies including **Typescript**, **Java**, and building microservices using **Kubernetes**, **Docker**, and various database solutions such as **PostgreSQL** and **DynamoDB**. Experienced in implementing event-driven architectures and leveraging tools like **Terraform** for infrastructure as code. Known for strong communication skills, capable of collaborating with cross-functional teams to deliver innovative solutions aligned with business goals. Additionally, I possess practical experience in MLOps, focusing on driving real-world impact through advanced analytics and automation.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2012",
      "to_year": "2015",
      "location": "UK",
      "university": "University of Bristol"
    }
  ],
  "experience": [
    {
      "role": "Senior Software Engineer",
      "company": "EitBiz",
      "from_date": "Oct 2022",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "•\tDeveloped secure and scalable **microservices** using **Python** and **TypeScript**, ensuring compliance with **Accessibility Standards** and **Secure Software Development** practices in a **CI/CD** environment.\n•\tImplemented automated **DevOps** pipelines with **Docker**, **Kubernetes**, and **AWS**, managing deployments and infrastructure as code with **Terraform**, resulting in reduced deployment times by **40%**.\n•\tLed agile development processes in **Scrum** methodologies, collaborating with cross-functional teams to enhance **communication skills** and improve overall project delivery efficiency by **30%**.\n•\tDesigned and optimized cloud-based data solutions leveraging **PostgreSQL** and **DynamoDB**, achieving performance improvements of up to **50%** for data retrieval and storage.\n•\tUtilized **Event Driven Architectures** to build robust systems that effectively handle real-time data processing for applications in healthcare and finance domains.\n•\tConducted code reviews and established testing strategies to ensure application functionality and reliability, covering unit, integration, and regression testing across services using tools such as Jest and Cypress.\n•\tSpearheaded the adoption of **Agile** methodologies, which improved team productivity and accelerated project timelines.\n•\tIntegrated third-party APIs and services into existing applications, enhancing functionality and user experience through implementation of modern frameworks and libraries.\n•\tMentored junior developers on industry best practices, fostering skill development and technical growth in modern software engineering principles."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Tvn S.A.",
      "from_date": "Oct 2019",
      "to_date": "Sep 2022",
      "location": "Poland",
      "responsibilities": "Utilized **Python** and **Go** to enhance the development process and support **microservices** architecture, resulting in a **30%** improvement in system scalability and maintainability.\nDeveloped CI/CD pipelines using **AWS**, **Terraform**, and **Docker**, facilitating faster deployment cycles and increased reliability in production environments.\nEmployed **Scrum** and **Agile** methodologies to lead project teams, ensuring timely delivery of features and adherence to **accessibility standards** and **secure software development** practices.\nImplemented robust **event-driven architectures** utilizing **Kafka** and **RabbitMQ** to streamline asynchronous communication across systems, achieving **95%** reduction in latency for critical processes.\nDesigned and built resilient database solutions using **PostgreSQL** and **DynamoDB**, enabling efficient data storage and retrieval for high-volume transaction environments.\nIntegrated **Kubernetes** for container orchestration, enhancing application scalability and reliability, with **99.9%** uptime during peak transaction periods.\nConducted thorough code reviews and mentored junior developers to strengthen team competencies in best practices for software development and team-oriented communication skills."
    },
    {
      "role": "Software Engineer",
      "company": "Timspark",
      "from_date": "Sep 2015",
      "to_date": "Aug 2019",
      "location": "UK",
      "responsibilities": "- Leveraged **Python** and **Java** in the design and optimization of backend services for a global e-commerce platform, ensuring scalability and high availability in key modules like checkout and order fulfillment.\n- Applied **Event Driven Architectures** using **Kafka** and **RabbitMQ** to engineer real-time features, enhancing responsive order updates and dynamic inventory tracking.\n- Developed and maintained high-performance frontend applications utilizing **TypeScript**, **React (18)**, **Vue 3**, and **Angular**, delivering fast, responsive user experiences on both web and mobile platforms.\n- Implemented CI/CD pipelines and **DevOps** practices using **Terraform** and **Kubernetes**, improving deployment efficiency and streamlining application updates.\n- Enhanced data management solutions by integrating **PostgreSQL** and **DynamoDB** for distributed data storage, ensuring fast and fault-tolerant data access for high-traffic workflows.\n- Developed and integrated AI/ML-based recommendation engines using **TensorFlow**, which improved conversion rates by up to **30%** based on user behavior data.\n- Established responsive, SEO-friendly e-commerce UIs using **Next.js**, optimizing them for mobile-first engagement and compliance with accessibility standards (WCAG 2.1).\n- Built and secured payment workflows integrated with **Stripe** and **PayPal**, ensuring compliance with PCI standards and enhancing transaction security through tokenization.\n- Applied role-based access control (RBAC) and **OAuth 2.0** to ensure secure customer and admin access, maintaining GDPR compliance and protecting user data throughout the platform.\n- Fostered effective collaboration and communication within a **Scrum** and **Agile** framework, enhancing project delivery timelines and team performance."
    }
  ],
  "skills": "**Programming Languages:**\n\tPython, Go, Java, TypeScript\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\t\n\n**Serverless and Cloud Functions:**\n\tAWS, AWS Lambda\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis, DynamoDB\n\n**DevOps:**\n\tDocker, Kubernetes, CI/CD, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm\n\n**Cloud & Infrastructure:**\n\tAWS (ECS, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Other:**\n\tScrum, Agile, Accessibility Standards, Secure Software Development, Communication Skills, Microservices, Event Driven Architectures, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, MLflow, Airflow, Kubeflow"
}