{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Test Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "Results-driven Senior Test Engineer with 8 years of experience in manual testing, test management, and defect tracking. Proficient in **Azure DevOps**, Agile methodologies, and Scrum practices, ensuring efficient test planning and execution. Adept at Computer System Validation and Computer Software Assurance, producing thorough test case designs that align with regulatory compliance. Proven ability to report and log bugs effectively, enhancing overall software quality in diverse sectors, particularly healthcare and finance.\n\nAlong with my strong testing foundation, I leverage my background as a Full Stack Developer, drawing from technologies such as **JavaScript/TypeScript**, **Python**, and **Flutter**. My expertise includes full-stack development with **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**. I have experience in cloud solutions across **Azure** and **AWS**. My work has involved building enterprise-grade platforms integrating AI/ML for predictive analytics, while ensuring robust application development in line with compliance standards like HIPAA and PCI DSS.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Test Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Executed manual testing strategies across healthcare and financial platforms, ensuring compliance with standards such as HIPAA and GDPR while following Agile methodologies including **Scrum**.\nUtilized test management tools like **Azure DevOps** to design and manage comprehensive test plans, focusing on rigorous test case design and defect tracking to improve software quality.\nReported bugs effectively and documented findings with precision to facilitate timely resolutions and enhancements, contributing to overall project success.\nParticipated in cross-functional Agile teams to foster collaboration and continuous improvement in software testing processes, enhancing release cycles by **30%**.\nLed test planning initiatives that reduced deployment times by **25%** through streamlined testing processes and effective resource allocation.\nIncorporated Computer System Validation methodologies to ensure that software systems meet required specifications and regulatory standards, maintaining a documentation standard across projects.\nEstablished a robust defect tracking system that improved visibility and resolution time of software issues by **40%**.\nCoordinated with development teams to facilitate the integration of testing cycles within the software development life cycle, leveraging communication to align testing objectives with business goals.\nCollaborated with stakeholders to define acceptance criteria and validate software features, ensuring alignment with user requirements within the healthcare and financial sectors.\nMentored junior testers on best practices in test execution and test management, fostering a culture of quality assurance within the team."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Conducted **manual testing** of financial applications to ensure comprehensive coverage and compliance with industry standards.\nDeveloped and maintained **test management tools** within **Azure DevOps**, facilitating streamlined collaboration and tracking of testing activities and defects.\nParticipated in **Agile** and **Scrum** methodologies to contribute to iterative product development, enhancing team communication and project timelines.\nDesigned intricate **test case designs** for various applications, improving the accuracy of test scenarios and maximizing defect detection efficiency by **35%**.\nUtilized **defect tracking** systems to record, manage, and verify defects effectively, resulting in a **20%** reduction in bug turnaround time.\nLed **test planning** initiatives, establishing clear objectives and criteria for testing phases while aligning with project timelines and deliverables.\nGenerated detailed reports on **testing outcomes**, enabling clear visibility into software quality for stakeholders and facilitating informed decision-making.\nCollaborated with cross-functional teams to align on **Computer System Validation** and **Computer Software Assurance**, ensuring that software met regulatory requirements and quality standards."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Employed **Azure DevOps** to enhance test management workflows, ensuring agility in development and testing processes by utilizing **Agile** and **Scrum** methodologies.\nDesigned and executed comprehensive test case designs in compliance with **Computer System Validation** and **Computer Software Assurance** standards, improving overall product quality and risk reduction by **30%**.\nImplemented effective defect tracking using industry-standard tools, contributing to a substantial **25%** decrease in bug turnaround time by maintaining clarity in reporting.\nDeveloped and maintained test plans aligned with project goals, enabling efficient resource allocation and adherence to timelines through diligent management of testing resources.\nFacilitated robust manual testing processes that resulted in the early detection of critical issues, contributing to a **15%** improvement in software reliability prior to release.\nReported bugs and critical findings seamlessly to development teams, ensuring timely resolution of issues and sustaining a high standard of product quality throughout the development lifecycle.\nCollaborated with cross-functional teams to align on testing strategies and project deliverables, enhancing team productivity and fostering a culture of continuous improvement."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, JavaScript, TypeScript\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n **Frontend Frameworks:**\n\tReact, Vue, Angular\n\n **API Technologies:**\n\n\n **Serverless and Cloud Functions:**\n\tAWS (Lambda), Azure (App Services)\n\n **Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:**\n\tAWS (ECS, RDS, S3), Azure (Blob, SQL)\n\n **Other:**\n\tMLflow, Airflow, Kubeflow, Keycloak, JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, manual testing, test management tools, Azure DevOps, Agile, Scrum, Computer System Validation, Computer Software Assurance, test case design, defect tracking, test planning, reporting bugs",
  "apply_company": "TRI - The RBQM Experts"
}