{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Java Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Senior Java Engineer with 13+ years of experience in full-stack development, specializing in **Java**, **Spring Boot**, and **ETL** processes. Proficient in handling data formats such as **CSV**, **XML**, and **JSON**, along with deep expertise in **SQL** and **NoSQL** databases. Skilled in designing robust applications that ensure data integrity and compliance.\nDemonstrated ability to build and maintain high-performance applications across various industries, particularly in healthcare and finance. Experienced in employing **Docker** for containerized applications and utilizing **Kafka** for real-time data processing.\nAdept in developing microservices and constructing efficient **Spring Batch** infrastructures, ensuring agile data workflows. Strong communicator with exceptional **Technical English** skills, capable of collaborating effectively with cross-functional teams.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Java Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Designed and implemented robust ETL processes using **Java** and **Spring Boot** to efficiently process and transform data from **CSV**, **XML**, and **JSON** formats, handling over **1 million records** per day.\nDeveloped backend services with **Spring Batch** for orchestrating and automating complex batch processing jobs, enhancing data ingestion speeds by **30%**.\nLeveraged **Docker** for containerizing applications, resulting in consistent deployments across multiple environments, achieving a **95% reduction** in integration issues.\nManaged real-time data streaming and processing using **Kafka**, ensuring low latency and high throughput for critical applications, with an uptime of **99.9%**.\nDesigned and maintained SQL and NoSQL databases, efficiently storing and querying large datasets, improving data retrieval times by **50%** through optimized queries.\nCollaborated with data engineering teams to establish best practices for data modeling, scalability, and compliance with regulatory standards.\nUtilized comprehensive technical English communication skills to document workflows and specifications, ensuring clarity in cross-team collaborations.\nImplemented rigorous testing strategies across all layers using tools such as JUnit and Mockito, achieving over **90% test coverage** for critical application modules.\nLed migration efforts from monolithic applications to microservices architectures, utilizing **Docker** and orchestration tools to improve system modularity and fault tolerance.\nFacilitated knowledge sharing sessions on **Spring Boot** and cloud-native development, mentoring junior engineers and enhancing team capabilities."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Leveraged **Java** and **Spring Boot** to develop and maintain microservices for financial platforms, ensuring high performance and scalability in transaction processing.\nImplemented ETL processes utilizing **Spring Batch** to efficiently ingest and transform financial data from **CSV**, **XML**, and **JSON** formats, enhancing data accuracy and reporting capabilities.\nUtilized **Docker** for containerization and deployment of applications, ensuring consistent environments across development, testing, and production phases.\nDesigned and optimized data storage solutions with **SQL** and **NoSQL** databases to support rapid data retrieval and updates for high-volume transactions.\nIntegrated **Kafka** for real-time data streaming and messaging, establishing robust asynchronous communication channels across various services within the financial ecosystem.\nWrote technical documentation in **Technical English** to facilitate understanding and maintenance of complex systems among team members and stakeholders, improving collaboration and efficiency.\nMaintained code quality through rigorous testing and adherence to best practices, resulting in a **30%** reduction in production bugs over a **6-month** period.\nMentored junior developers on **Java**, **Spring Boot**, and application architecture best practices, enhancing team productivity and knowledge sharing."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Utilized **Java** and **Spring Boot** to design and optimize backend services, ensuring high availability, low latency, and scalability across key modules for a global e-commerce platform.\nDeveloped ETL processes to efficiently handle CSV, XML, and JSON data formats, streamlining data ingestion and transformation workflows.\nImplemented **Docker** containers to facilitate smooth deployment, ensuring consistent environments across development and production.\nEngineered real-time features using **Kafka**, enabling responsive order updates and dynamic inventory tracking, significantly enhancing user experience.\nManaged data using SQL and NoSQL databases, effectively ensuring fast data retrieval and fault tolerance for high-traffic workflows.\nCollaborated with cross-functional teams to create seamless integration of payment gateways and API services, applying best practices in security and compliance.\nDeveloped comprehensive testing and deployment strategies using **Spring Batch** and conducted performance tuning for improved efficiency.\nEnsured robust data handling and processing capabilities within applications by leveraging **Kafka** for asynchronous data processing.\nUtilized strong Technical English skills to communicate complex technical concepts to team members and stakeholders, ensuring clarity and alignment on project objectives."
    }
  ],
  "skills": "**Programming Languages:**\n\tJava,\n\tPython,\n\tJavaScript/TypeScript\n\n**Backend Frameworks:**\n\tSpring Boot,\n\tFastAPI,\n\tFlask,\n\tDjango\n\n**Frontend Frameworks:**\n\tReact,\n\tVue,\n\tAngular\n\n**API Technologies:**\n\tREST API,\n\tJSON,\n\tXML\n\n**Serverless and Cloud Functions:**\n\tAWS: Lambda,\n\tAzure: App Services\n\n**Databases:**\n\tPostgreSQL,\n\tMySQL,\n\tMongoDB,\n\tRedis,\n\tNoSQL,\n\tSQL\n\n**DevOps:**\n\tDocker,\n\tKubernetes,\n\tGitHub Actions,\n\tGitLab CI/CD,\n\tCI/CD,\n\tTerraform,\n\tAnsible,\n\tHelm,\n\tDocker Compose\n\n**Cloud & Infrastructure:**\n\tAWS: ECS,\n\tAWS: RDS,\n\tS3,\n\tAzure: Blob Storage,\n\tSQL Database\n\n**Other:**\n\tMLflow,\n\tAirflow,\n\tKubeflow,\n\tETL,\n\tCSV,\n\tKafka,\n\tTechnical English,\n\tAuthentication & Security: Keycloak (OIDC, RBAC), OAuth2, JWT,\n\tNginx, Let’s Encrypt, Certbot",
  "apply_company": "Future Connections"
}