{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-187801395/",
  "profile_summary": "Results-driven Senior Engineer with over 13 years of experience in software development, specializing in **JavaScript**, **TypeScript**, **React**, and **Next.js** for high-performance application delivery across healthcare and financial sectors. Expertise in **CI/CD** practices and deploying solutions on **AWS**, ensuring robust product architecture and high code quality.\nDemonstrated ability to design and implement scalable software solutions while utilizing collaborative and effective communication skills. Proven track record in building AI/ML-powered platforms, applying predictive analytics, automation, and real-time data processing effectively. Strong foundation in compliance-driven development aligning systems with HIPAA, FHIR, PCI DSS, and SOC 2 standards.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Utilized **JavaScript**, **TypeScript**, and **React (17–18)** to develop and optimize full-stack healthcare and fintech platforms, ensuring robust **Product Architecture** and adherence to best **Software Development Practices**.\nImplemented CI/CD practices through **GitHub Actions** and **CircleCI**, facilitating seamless deployment workflows and ensuring high **Code Quality** across all stages of development.\nDesigned and executed responsive UI components with **Next.js** to enhance user engagement and streamline communication, significantly improving user experience.\nCollaborated with cross-functional teams to define project requirements and share insights, leveraging strong **Communication Skills** to foster an environment of teamwork and innovation.\nSpearheaded the creation of CI/CD pipelines using **Fastlane** and **App Center**, resulting in a **40% reduction** in deployment times and minimal downtime.\nTransformed legacy systems into microservices using **Docker** and **Kubernetes (EKS)**, achieving a **50% increase** in application scalability and maintainability.\nBuilt and maintained comprehensive data solutions with **PostgreSQL** and **MongoDB**, supporting rapid data ingestion and analytics, leading to a **30% improvement** in data processing speed.\nIntegrated real-time analytics features using **Chart.js** and **Power BI Embedded**, which enhanced reporting efficiency and provided actionable insights to stakeholders.\nEmployed advanced testing strategies utilizing **Jest** and **Cypress**, ensuring code stability and reliability while reducing bug rates by **25%** before production release.\nDeveloped and maintained security protocols conforming to industry standards including **AWS**, reinforcing data integrity and protecting sensitive information across platforms."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Utilized **Javascript** and **Typescript** to create interactive and responsive front-end applications with **React (18)**, **Vue 3**, and **Next.js**, promoting best practices in software development and code quality.\nImplemented CI/CD pipelines to streamline deployment processes, enhancing product architecture through efficient deployment strategies across cloud platforms such as **AWS**.\nCollaborated with cross-functional teams to ensure clear communication and alignment on project objectives, delivering solutions that meet business needs effectively.\nModernized core financial platforms by migrating to microservices architecture with **Node.js (NestJS/Express)** and **Python (FastAPI, Django)**, improving system performance by over **30%** for high-volume transactions.\nDesigned and deployed a robust event-driven architecture using **Kafka**, **RabbitMQ**, and **Azure Service Bus**, ensuring seamless communication and processing across critical workflows.\nBuilt and managed real-time analytics dashboards with **D3.js** and **Power BI Embedded**, providing real-time insights into operational metrics and improving decision-making speed by **25%**.\nDeveloped and optimized ETL pipelines for financial data ingestion from various sources using **Apache Airflow** and **Azure Data Factory**, facilitating both batch and real-time data processing for enhanced operational efficiency.\nCreated and deployed machine learning models for fraud detection with **scikit-learn**, **XGBoost**, and **Azure ML**, enhancing fraud detection capabilities to identify suspicious activities, reducing false positives by **15%**.\nDesigned ML pipelines for real-time credit scoring and churn prediction, integrating predictive modeling into backend services using **MLflow** and **Airflow**."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "- Developed and optimized high-quality software applications utilizing **JavaScript**, **React (18)**, and **TypeScript** to meet business requirements and improve user experience in a global e-commerce environment.\n- Implemented scalable, efficient frontend applications leveraging **Next.js** to enhance SEO and ensure mobile-first engagement, resulting in a **30%** increase in site traffic.\n- Engaged in continuous integration and continuous deployment (CI/CD) practices to streamline development workflows, achieving a **40%** reduction in deployment time across different environments.\n- Ensured adherence to software development best practices and code quality standards, leading to a **25%** decrease in post-deployment issues and improved maintainability.\n- Played a pivotal role in the architecture and design of product solutions, effectively collaborating with cross-functional teams to deliver high-impact features.\n- Leveraged **AWS** for cloud services, improving application scalability and reliability in various deployment scenarios.\n- Actively participated in code reviews and offered constructive feedback, fostering a culture of collaboration and continuous improvement within the engineering team.\n- Maintained effective communication with stakeholders to understand requirements and provide updates on project progress, ensuring alignment with business objectives.\n- Led discussions on product architecture, driving technical decision-making to address performance and scalability challenges, and advocated for best practices in code quality and documentation."
    }
  ],
  "skills": " **Programming Languages:** \n\tJavaScript, TypeScript, Python\n\n **Frontend Frameworks:** \n\tReact, Next.js, Vue, Angular \n\n **Backend Frameworks:** \n\tFastAPI, Flask, Django \n\n **API Technologies:** \n\tOAuth2, JWT\n\n **Serverless and Cloud Functions:** \n\tAWS: Lambda, Azure: App Services \n\n **Databases:** \n\tPostgreSQL, MySQL, MongoDB, Redis\n\n **DevOps:** \n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose \n\n **Cloud & Infrastructure:** \n\tAWS: ECS, RDS, S3, Azure: Blob Storage, SQL Database \n\n **Other:** \n\tSoftware Development Practices, Code Quality, Product Architecture, Collaboration, Communication Skills, MLflow, Airflow, Kubeflow, Keycloak, Nginx, Let’s Encrypt, Certbot"
}