{
  "name": "Tomasz Lee",
  "role_name": "Senior Golang Developer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-477994390/",
  "profile_summary": "Results-driven Senior Golang Developer with over 9 years of experience in developing robust REST APIs and leveraging **Golang** for high-performance applications. Proficient in **DevOps** practices, ensuring seamless integration and deployment while optimizing workflows. Strong English communication skills facilitate effective collaboration across cross-functional teams. Experienced in utilizing microservices architecture and distributed systems with hands-on knowledge of **Apache Kafka**, **RabbitMQ**, and **Redis**. Additionally skilled in frontend and backend technologies, including **ReactJS**, **NextJS**, **.NET**, and **C#**, with a proven track record of delivering high-quality solutions and enhancing development processes.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Senior Golang Developer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Apr 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Utilized **Golang** to develop and optimize high-performance applications, enhancing execution speed by **30%**.\nImplemented robust **RESTful APIs** ensuring seamless communication between services, leading to a reduction in error rates by **15%**.\nCollaborated with cross-functional teams to establish efficient **DevOps** practices, including CI/CD pipelines, improving deployment frequency by **50%**.\nConducted regular code reviews and provided mentorship to junior developers, fostering a culture of continuous improvement in software quality.\nEnhanced system architecture by employing microservices principles, contributing to an increased system uptime of **99.9%**.\nDesigned and maintained comprehensive documentation for software applications, improving team communication and project transparency.\nLeveraged advanced **cloud services** and third-party tools to streamline operations and strengthen security measures across applications.\nExecuted performance testing and monitoring, analyzing metrics to ensure high availability and reliability of applications.\nFacilitated regular meetings and demos in **English** to communicate project progress and receive feedback from stakeholders."
    },
    {
      "role": "Full Stack Developer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "Leveraged **Golang** expertise to design and develop high-performance applications for project management, achieving a **15%** increase in team collaboration efficiency.\nImplemented **DevOps** practices by establishing CI/CD pipelines using **GitHub Actions**, which reduced production deployment errors by **30%**.\nDeveloped and maintained **REST APIs** to facilitate seamless integration with front-end components, enhancing system interoperability.\nUtilized advanced coding and architecture techniques to optimize backend processes and improve system performance.\nCollaborated effectively with cross-functional teams, utilizing strong **English communication** skills to define system requirements and project timelines, ensuring timely delivery of features.\nDesigned a **microservices architecture** utilizing **RabbitMQ** and **Apache Kafka** that supported event-driven data streams, significantly enhancing scalability of applications.\nIntegrated caching solutions, employing **Redis** to minimize API call latency, resulting in a **25%** boost in overall system performance.\nOptimized database management by employing **MSSQL** and **MySQL** databases, fine-tuning queries for improved data retrieval times.\nFacilitated knowledge sharing through code reviews and mentorship sessions with junior developers, contributing to an increase in team productivity.\nDeveloped engaging user interfaces using **ReactJS** and **Tailwind CSS**, improving user engagement metrics by **25%**.\nCreated interactive project tracking tools with **D3.js**, enabling real-time project status visualization and reporting."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "Utilized **Golang** to develop efficient and scalable REST APIs, enhancing system performance significantly.\nCollaboration with the **DevOps** team to streamline deployment pipelines and manage releases using **Azure**, leading to a 30% reduction in downtime during updates.\nLeveraged strong English communication skills to convey technical concepts during team meetings and documentation, enhancing cross-functional collaboration.\nImplemented asynchronous handling of requests in **Golang**, improving response times by 25% during high-traffic periods.\nEngaged in the development of microservices architecture to improve modularization and scalability of applications.\nConducted code reviews and participated in sprint planning, ensuring high-quality deliverables and adherence to best practices.\nCreated comprehensive technical documentation, resulting in a 15% decrease in onboarding time for new developers.\nAnalyzed system performance metrics, identifying and resolving bottlenecks in backend services to boost productivity.\nIntegration of third-party services to enhance application capabilities, increasing overall functionality for end-users."
    }
  ],
  "skills": "**Programming Languages**\n\tGolang, Python, HTML, CSS, JavaScript, TypeScript\n\n**Backend Frameworks**\n\tNodeJS, ExpressJS, NestJS, C#, .NET, Entity Framework, Microservices\n\n**Frontend Frameworks**\n\tReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n**API Technologies**\n\tRESTful API, GraphQL\n\n**Serverless and Cloud Functions**\n\t\n\n**Databases**\n\tMSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB\n\n**DevOps**\n\tAWS, Azure, CI/CD pipelines\n\n**Cloud & Infrastructure**\n\t\n\n**Other**\n\tUX/UI Design, Git, GitHub, Solidity, Ether.js, Web3.js, Ethereum, Apache Kafka, RabbitMQ, Redis, NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest, English communication"
}