{
  "name": "Marcin Karol Kotlinski",
  "role_name": "QA Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-karol-kotlinski-bb2520397/",
  "profile_summary": "Detail-oriented QA Engineer with 8 years of experience in ensuring data quality and system reliability, specializing in **API Testing**, **REST APIs**, and **JSON Validation**. Proficient in using tools like **Postman**, **Newman**, **Cypress**, **Playwright**, and **Jest** to deliver robust test solutions. Adept at implementing systematic **Data Comparison** strategies and comprehensive **Documentation Skills** to improve overall project transparency and process adherence. Strong analytical and **Problem Solving** skills, complemented by a commitment to **Attention to Detail**.\n\nMy technical skills extend to **Python** and **JavaScript**, enabling collaboration with developers to enhance the testing framework. With extensive experience in CI/CD Tools, I ensure seamless integration and deployment of applications, ultimately contributing to high-quality software delivery across healthcare and financial sectors. Leveraging my background in full-stack development, I am poised to effectively bridge communication between development and QA teams, fostering an environment of continuous improvement.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "QA Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Conducted comprehensive **API Testing** on healthcare and financial platforms to ensure functionality and compliance with standards such as HIPAA and PCI DSS, utilizing tools like **Postman** and **Newman**.\nEnsured **Data Quality Assurance** by implementing rigorous **JSON Validation** and **Data Comparison** processes across multiple production environments.\nCollaborated with development teams using **Cypress** and **Jest** for end-to-end and unit testing, ensuring all application components meet quality and performance benchmarks.\nUtilized **CI/CD Tools** to establish streamlined testing pipelines, enhancing deployment efficiency and minimizing regression issues in production builds.\nImplemented robust documentation processes to accurately capture test procedures, results, and defect tracking reports, fostering effective communication within cross-functional teams.\nEmployed **Python** and **JavaScript** for test automation scripts, improving testing coverage and execution speed across various applications.\nApplied problem-solving skills to quickly identify issues within systems, analyze root causes, and suggest actionable solutions to enhance overall product quality.\nMaintained a keen attention to detail while performing tests, ensuring that all application features functioned as intended and conformed to user requirements.\nLeveraged frameworks like **Playwright** for cross-browser testing, ensuring optimal user experience and performance across platforms and devices.\nAnalyzed systemic data discrepancies and worked diligently to mitigate data-related issues that could affect project outcomes and user satisfaction.\nUtilized cloud services for enhanced testing environments, ensuring seamless integration of test cases and deployment across multiple platforms."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Performed extensive **API Testing** and **JSON Validation** on financial platforms, ensuring the accuracy and quality of data across all services, which increased data reliability by **15%**.\nUtilized tools such as **Postman**, **Newman**, and **Cypress** to automate and streamline the testing process, leading to a **30%** reduction in testing time for REST APIs.\nConducted **Data Quality Assurance** assessments to confirm the integrity of financial data processed through various ETL pipelines, improving error detection rates by **25%**.\nCollaborated with development teams to document test cases and results, enhancing **Documentation Skills** and ensuring all stakeholders are informed about testing progress and outcomes.\nEngaged in **problem-solving** activities to address issues identified during testing, providing effective solutions and recommendations to improve product quality and user experience.\nExecuted **Data Comparison** checks post-deployment to validate data consistency between environments, thus reducing discrepancies by **10%**.\nMaintained a meticulous approach to testing and quality assurance, showcasing strong **attention to detail** that directly contributed to minimizing post-release defects by **20%**.\nDeveloped automated testing frameworks using **Jest** and **Playwright**, improving test coverage for both frontend and backend components.\nContributed and provided insights into CI/CD processes, aiding in the swift deployment of high-quality software releases."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Conducted comprehensive **API Testing** and **JSON Validation** across various backend services, ensuring data integrity and compliance with specifications.\nUtilized tools like **Postman**, **Newman**, and **Cypress** to develop and execute automated test cases, achieving a test coverage of **95%** for critical **REST APIs** responsible for order processing and user authentication.\nApplied **problem-solving** skills to identify and address data discrepancies in the e-commerce platform through thorough **data comparison** and **data quality assurance** protocols, significantly reducing bugs by **30%**.\nMaintained detailed documentation of testing processes, results, and software specifications, enhancing team communication and ensuring **attention to detail** in quality assurance practices.\nImplemented CI/CD practices using Jenkins and GitLab, streamlining the deployment process, leading to a **40%** reduction in release times and enhancing overall efficiency.\nCollaborated with development teams to ensure seamless integration of **AI tools** for real-time data processing and enhancement of user experience, enabling rapid feedback loops and continuous improvement cycles.\nEngaged in manual and automated testing of new features and functionalities, leveraging **Jest** for unit testing JavaScript components to uphold code quality.\nParticipated in sprint planning and retrospectives, contributing insights on test results and application performance which improved project deliverables by **25%**.\nFostered a quality-first mindset across teams, advocating for best practices in testing and documentation, while adapting to evolving technical requirements with agility."
    }
  ],
  "skills": " **API Technologies:**\n\tAPI Testing, REST APIs, JSON Validation, Postman, Newman\n\n **Programming Languages:**\n\tPython, JavaScript, TypeScript\n\n **Artificial Intelligence & Machine Learning:**\n\tAI Tools, MLflow, Airflow, Kubeflow\n\n **Frontend Frameworks:**\n\tReact, Vue, Angular, Cypress, Playwright, Jest\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n **Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, CI/CD Tools\n\n **Cloud & Infrastructure:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL), Terraform, Ansible, Helm, Docker Compose\n\n **Other:**\n\tData Quality Assurance, Data Comparison, Problem Solving, Documentation Skills, Attention to Detail"
}