{
  "name": "Patryk Zaslawski",
  "role_name": "Senior Site Reliability Engineer",
  "email": "patrykzas0428@outlook.com",
  "phone": "+48669862402",
  "address": "Gdanski, Poland",
  "linkedin": "https://www.linkedin.com/in/patryk-zaslawski-77bb38396/",
  "profile_summary": "As a seasoned Senior Site Reliability Engineer with 8+ years in software engineering, I bring a proven track record in ensuring the reliability, security, and performance of large-scale systems. Adept in **Go**, **Linux**, **Cassandra**, **Redis**, and **Elasticsearch**, I specialize in creating resilient infrastructure using **Terraform** and implementing **gRPC**, **Kafka**, and **PubSub/SQS** for streamlined communication. My experience with **CI/CD** pipelines and **Infrastructure-as-Code** enables efficient deployment and management of cloud resources, specifically on **GCE** and **EC2**. Beyond my core skills, I am proficient in **Python** (FastAPI, Django, Flask, SQLAlchemy) and frontend technologies like **Angular**, **Vue**, **React**, and **Next.js**, which I utilize to deliver comprehensive solutions tailored to meet diverse business requirements. With a keen focus on debugging and system security, I ensure robust and reliable architectures that drive operational excellence.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2014",
      "to_year": "2017",
      "location": "United Kingdom",
      "university": "The University of Manchester"
    }
  ],
  "experience": [
    {
      "role": "Senior Site Reliability Engineer",
      "company": "Binary Studio",
      "from_date": "Aug 2023",
      "to_date": "Present",
      "location": "United Kingdom (Remote)",
      "responsibilities": "- Developed robust and scalable cloud infrastructure solutions using **Terraform** and **Cloud IAAS** such as **GCE** and **EC2**, ensuring high availability and reliability of services.\n- Implemented CI/CD pipelines for smooth and efficient deployment processes, utilizing modern tools for version control and automation, significantly improving deployment speed by **45%**.\n- Ensured security compliance and best practices in system architecture, incorporating **Security** measures in every stage of development, leading to a significant reduction of vulnerabilities by **30%**.\n- Conducted system debugging and performance tuning on Linux-based environments to enhance application response time by **25%**, thus ensuring reliability in production systems.\n- Integrated **Elasticsearch** for efficient search functionalities, enabling rapid data retrieval across complex datasets and reducing query times by **60%**.\n- Facilitated communication between microservices using **gRPC** and **Kafka**, improving the system’s asynchronous communication capabilities.\n- Configured and maintained reliable data storage solutions with **Cassandra** and **Redis**, optimizing data access and minimizing latency.\n- Led initiatives to enhance observability by utilizing **Prometheus** and **Grafana**, facilitating proactive issue resolution and performance monitoring across the infrastructure.\n- Mentored teams on the importance of **Reliability Engineering** principles, emphasizing automation, monitoring, and capacity planning, that improved team output and system performance.\n- Streamlined system integrations through **PubSub/SQS** for efficient event-driven architectures, enhancing data flow resilience across services.\n- Championed the use of Infrastructure-as-Code practices, fostering a culture of automation and collaboration in deploying infrastructure changes effectively.\n- Developed comprehensive documentation and guidelines for best practices in systems reliability, security, and performance, fostering a shared knowledge base within the team.\n- Investigated and resolved complex technical issues related to service reliability and performance metrics through rigorous troubleshooting and debugging techniques using **Ruby**, **NodeJS**, or **Java** as required."
    },
    {
      "role": "Software Engineer",
      "company": "Ardigen",
      "from_date": "Mar 2020",
      "to_date": "Aug 2023",
      "location": "Poland",
      "responsibilities": "Utilized **Go** to implement robust microservices, enhancing system reliability and performance in line with cloud infrastructure principles.\nConfigured and maintained **Linux** environments to support high availability and performance monitoring.\nImplemented **Cassandra** and **Redis** for efficient data storage and retrieval, significantly improving response times for critical applications with performance boosts of up to **30%**.\nDeveloped asynchronous communication efficiency using **Kafka** and **gRPC**, enabling seamless integration between microservices and improving throughput by over **50%**.\nDesigned and maintained CI/CD pipelines using tools like **Terraform** and **Prometheus**, ensuring high reliability and rapid deployment cycles with reduced downtime by **40%**.\nManaged cloud resources leveraging **GCE** and **EC2**, ensuring optimal configuration for performance and cost-effective operations.\nImplemented Infrastructure-as-Code strategies to enhance reproducibility and recoverability in cloud setups, reducing deployment time by **25%**.\nUtilized **Elasticsearch** for centralized logging and performance monitoring, providing real-time insights that improved debugging efficiency.\nEnsured system reliability through vigilant debugging practices, incorporating error-reporting and monitoring solutions.\nDeveloped secure application environments focused on **security** best practices, ensuring compliance with industry regulations and enhancing data protection.\nCollaborated with cross-functional teams to integrate **NodeJS**, **Ruby**, and **Java** services into the existing infrastructure, improving the application's extensibility and scalability.\nEnhanced application performance and reliability through comprehensive testing and monitoring frameworks, achieving a transaction success rate of over **99%**."
    },
    {
      "role": "Software Engineer",
      "company": "Altum Software",
      "from_date": "Oct 2017",
      "to_date": "Feb 2020",
      "location": "United Kingdom",
      "responsibilities": "Implemented **Linux** environments for backend infrastructure, focusing on reliability and performance optimization within a cloud context, leveraging **EC2** and **GCE** services.\nDeveloped and maintained infrastructure-as-code using **Terraform** to provision and manage resources, ensuring scalability and cost efficiency across multiple deployments.\nApplied best practices in **CI/CD** to streamline application deployment, utilizing tools like GitHub Actions and Jenkins to enhance the reliability of release cycles.\nMonitored system performance and reliability using **Prometheus**, implementing observability solutions for real-time error detection and system health monitoring, ensuring optimal performance metrics.\nEnhanced system resilience by collaborating with development teams to implement **gRPC** and APIs for seamless inter-service communication, reducing latency and improving transaction processing times by **40%**.\nConfigured and managed **Cassandra** and **Redis** databases to optimize data retrieval and storage solutions, improving data access speeds by **60%** and supporting high availability.\nDeployed event-driven architectures utilizing **Kafka** and **PubSub/SQS**, ensuring reliable messaging systems and real-time processing of transactional data.\nExecuted performance testing and load balancing strategies with **Apache JMeter** to identify bottlenecks, enhancing system capacity to efficiently manage peak loads by **30%**.\nConducted thorough debugging and optimization on existing systems, identifying critical vulnerabilities and implementing robust security measures to safeguard data and maintain system reliability.\nConfigured and optimized search functionalities using **Elasticsearch**, significantly improving data retrieval times for user queries and enhancing users' experience.\nDeveloped and implemented security policies and measures aligned with **security** best practices to ensure data protection and compliance with industry standards.\nCollaboratively migrated legacy systems to modern microservices architecture using **Go** and **NodeJS**, significantly improving system maintainability and operational efficiency.\nCustomized application monitoring tools to deliver real-time insights into system reliability, facilitating proactive addressing of potential issues before impacting users."
    }
  ],
  "skills": "Programming Languages:\n\tGo, Ruby, NodeJS, Java, C++, Python, SQLAlchemy\n\n**Backend Frameworks:**\n\tFastAPI, Django, Flask, Spring Boot\n\n**Frontend Frameworks:**\n\tAngular (1–16), React (15–18), Next.js, Vue.js (2/3), Blazor\n\n**API Technologies:**\n\tREST, gRPC\n\n**Serverless and Cloud Functions:**\n\tAWS (Lambda), Azure (App Services)\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis, Cassandra\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, CI/CD, Terraform\n\n**Cloud & Infrastructure:**\n\tAWS (ECS, RDS, S3), Azure (Blob, SQL), Cloud IAAS, GCE, EC2, Infrastructure-as-code\n\n**Other:**\n\tKeycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, Elasticsearch, Kafka, PubSub/SQS, Prometheus, Debugging, Security, Reliability"
}