{
  "name": "Patryk Zaslawski",
  "role_name": "Senior AI Engineer",
  "email": "patrykzas0428@outlook.com",
  "phone": "+48669862402",
  "address": "Gdanski, Poland",
  "linkedin": "https://www.linkedin.com/in/patryk-z-107978395/",
  "profile_summary": "As a seasoned Senior AI Engineer with 8+ years in software engineering, I excel in applying **Python** along with **TensorFlow** for advanced **machine learning** and **AI** applications. My strong background in **cloud computing** enables me to deploy scalable solutions efficiently, leveraging **Docker** for containerization. I bring a solid foundation in **data analysis** and **audio processing**, ensuring high-quality data handling for intelligent systems. Known for my critical thinking and creativity, I thrive in team collaboration settings while maintaining a keen focus on delivering innovative solutions that drive strategic business outcomes.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2014",
      "to_year": "2017",
      "location": "United Kingdom",
      "university": "The University of Manchester"
    }
  ],
  "experience": [
    {
      "role": "Senior AI Engineer",
      "company": "Binary Studio",
      "from_date": "Aug 2023",
      "to_date": "Present",
      "location": "United Kingdom (Remote)",
      "responsibilities": "• Developed scalable and efficient AI solutions leveraging **Python** and **TensorFlow** for advanced machine learning models to enhance data analysis and audio processing capabilities in the healthcare sector.\n• Implemented Docker containers to facilitate smooth deployment of AI applications, improving workflow efficiency by **30%**.\n• Collaborated with cross-functional teams, mentoring 10+ engineers in team collaboration practices while fostering a culture of creativity and critical thinking.\n• Designed and executed data pipelines for real-time data analysis, enhancing decision-making processes based on insights drawn from healthcare data, resulting in a **25%** increase in actionable outcomes.\n• Utilized **cloud computing** platforms like AWS and Azure to ensure scalable AI solutions, effectively handling datasets exceeding **1TB** in size.\n• Integrated machine learning models into existing systems, optimizing performance and audio processing tasks to meet industry standards.\n• Ensured robust testing and deployment strategies using Docker and CI/CD pipelines, which reduced the deployment time by **40%**, leading to more effective iterations.\n• Conducted thorough data analyses utilizing advanced techniques, improving the accuracy of AI algorithms employed in healthcare decision-making.\n• Guided the creative approach in the development of innovative machine learning applications that significantly enhanced user experiences in digital healthcare platforms."
    },
    {
      "role": "Software Engineer",
      "company": "Ardigen",
      "from_date": "Mar 2020",
      "to_date": "Aug 2023",
      "location": "Poland",
      "responsibilities": "Applied **machine learning** techniques in Python using **TensorFlow** to develop intelligent algorithms for audio processing and data analysis, enhancing performance and efficiency in AI-driven applications.\nCollaborated with cross-functional teams to implement solutions for complex problems in **cloud computing**, optimizing deployment strategies using **Docker** for containerization and orchestration.\nLeveraged critical thinking and creativity to design and engineer innovative audio processing systems, delivering scalable solutions for sound engineering projects.\nEngineered data analysis pipelines to process large datasets, extracting valuable insights for AI models and supporting data-driven decision-making.\nConducted experiments and implemented machine learning models that improved system accuracy by **20%**, contributing to the development of robust AI features.\nUtilized **Python** for developing back-end services and APIs for AI platforms, ensuring seamless integration with existing system architectures.\nOptimized model performance through regular evaluations and improvements, maintaining a minimum accuracy threshold of **95%** on validation datasets.\nMentored junior engineers in best practices in AI and Python development, promoting team collaboration and enhancing skill sets within the team.\nParticipated in the deployment of scalable AI models using **Docker**, resulting in reduced deployment time by **30%** and enabling continuous integration/continuous delivery (CI/CD) practices.\nReported and documented findings and development processes, ensuring clear communication and knowledge sharing among team members."
    },
    {
      "role": "Software Engineer",
      "company": "Altum Software",
      "from_date": "Oct 2017",
      "to_date": "Feb 2020",
      "location": "United Kingdom",
      "responsibilities": "• Developed and optimized AI-driven backend services in **Python** using frameworks such as **TensorFlow** and **Docker** to enhance performance in audio processing and sound engineering applications.\n• Conducted data analysis to extract meaningful insights, leveraging machine learning techniques to improve system efficiency and user experience.\n• Collaborated in team settings to design creative solutions integrating AI technologies into sound engineering processes, successfully optimizing workflows by **30%**.\n• Implemented AI models that support audio processing, increasing the accuracy of predictions and automating critical tasks, achieving a **25%** reduction in manual effort.\n• Applied critical thinking in troubleshooting issues related to AI applications, ensuring seamless integration and operation within cloud environments.\n• Conducted performance testing and optimization, utilizing GPU resources in cloud computing for machine learning training, yielding training speeds up to **5x** faster than before.\n• Collaborated on AI projects, coordinating with cross-functional teams to ensure alignment on product development and deployment strategies.\n• Built and maintained scalable data pipelines, enhancing data accessibility and availability for machine learning tasks, achieving real-time data processing capabilities.\n• Utilized **Docker** to containerize AI applications, simplifying deployments and enabling cloud-based scaling solutions across multiple environments.\n• Engaged in continuous learning and development of AI technologies, fostering innovation through creative approaches to problem-solving."
    }
  ],
  "skills": "**Programming Languages:**\n\tPython\n\n**Backend Frameworks:**\n\tFastAPI, Django, Flask, Spring Boot\n\n**Frontend Frameworks:**\n\tAngular (1–16), React (15–18), Next.js, Vue.js (2/3), Blazor\n\n**API Technologies:**\n\tREST & gRPC APIs\n\n**Serverless and Cloud Functions:**\n\tAWS (Lambda), Azure\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD\n\n**Cloud & Infrastructure:**\n\tAWS (ECS, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Other:**\n\tAI, sound engineering, machine learning, data analysis, audio processing, TensorFlow, critical thinking, creativity, team collaboration, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot",
  "apply_company": "Polance"
}