{
  "name": "Tomasz Lee",
  "role_name": "Software Engineering Intern",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Motivated Software Engineering Intern with proven skills in **JavaScript** and **Agile development**. Adept in **full-stack development**, bringing over 9 years of experience in designing, developing, and implementing complex applications. Proficient in **Python**, **Go**, and leveraging a user-centric design approach to create intuitive user experiences. Strong expertise in **AI proficiency** and collaborative problem solving, with a focus on **rapid prototyping** and **iterative development**. Experienced in technical mentorship and providing feedback-driven improvements to foster team growth. Committed to ensuring **data integrity and security** throughout the development lifecycle.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Software Engineering Intern",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Utilized **Python** and **JavaScript** frameworks to develop innovative solutions, ensuring a user-centric approach to design and functionality.\nParticipated in **Agile development** practices, contributing to rapid prototyping and iterative development cycles to enhance productivity and team collaboration.\nAssisted in the implementation of **AI proficiency** strategies within system processes, improving the overall efficiency of applications.\nContributed to the enhancement of platform security through **security engineering** best practices, ensuring data integrity and protection.\nEngaged in collaborative problem solving with team members to address challenges and implement feedback-driven improvements.\nSupported technical mentorship initiatives, providing guidance to peers and fostering a culture of continuous learning and knowledge sharing.\nFacilitated user-centric design improvements through interactions with UX/UI designers, ensuring a seamless experience for end-users.\nParticipated in the development of key features using **.NET 7**, **ReactJS**, and **Next.js**, driving user satisfaction upwards by **25%**.\nCollaborated on the design of a microservices architecture with **.NET Core**, enhancing system scalability and maintainability.\nIntegrated message brokers such as **Apache Kafka** and **RabbitMQ**, resulting in higher system resilience.\nImplemented **Redis** caching for frequently accessed data, reducing database load and enhancing system response times by **35%**.\nContributed to the development of RESTful APIs connected to **MongoDB** using **.NET**, facilitating efficient data access across services.\nAssisted in setting up CI/CD pipelines on **Azure DevOps**, leading to a **40%** decrease in deployment time.\nOptimized **MSSQL** database queries, which decreased average query execution time by **20%**.\nDeveloped an interactive reporting engine leveraging **D3.js** and **Three.js**, enhancing data visualization for user insights.\nImplemented authentication and authorization strategies using **JWT**, bolstering application security."
    },
    {
      "role": "Full Stack Developer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "Utilized **Python**, **JavaScript**, and **Go** for developing user-centric applications as part of a full-stack development team.\nEngaged in **Agile development** practices to ensure iterative progress and timely delivery of project milestones.\nImplemented feedback-driven improvements, contributing to a significant enhancement in user satisfaction scores by **20%**.\nConducted technical mentorship sessions for junior developers, fostering skill development and collaborative problem solving within the team.\nDesigned and iterated on rapid prototypes using **ReactJS** and **Tailwind CSS**, resulting in a **25%** increase in user engagement.\nDeveloped sophisticated data integrity and security measures within applications, ensuring compliance with best practices and standards.\nCreated RESTful APIs and integrated them with various databases, including **PostgreSQL** and **MSSQL**, optimizing data access speed by **30%**.\nCollaborated with cross-functional teams to gather requirements and ensure alignment with user-centric design principles.\nDeveloped cloud-based applications, enhancing scalability and responsiveness in a fast-paced development environment.\nContributed to ongoing efforts in security engineering to safeguard user data and maintain system reliability."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "Demonstrated **full-stack development** skills by contributing to the development of an internal CRM system using **.NET Framework** and **Angular**, leading to a **20%** increase in sales team productivity.\nEmployed **Agile development** methodologies in project execution, ensuring adaptability and alignment with project goals through daily standups and iterative development cycles.\nUtilized **JavaScript** to create a set of reusable Angular components, significantly accelerating development for future projects by **30%**.\nImplemented **RabbitMQ** to manage message queues for processing customer notifications asynchronously, which resulted in a **15%** reduction of system load during peak usage times.\nEnhanced data integrity and security by working with **SQL Server** databases to query and manage customer information, optimizing query efficiency by **25%**.\nAssisted in migrating legacy code from **ASP.NET WebForms** to **.NET Core**, which improved system performance and maintainability by **40%**.\nCollaborated with the DevOps team to set up automated builds and releases in **Azure**, reducing deployment time by **50%**.\nSupported the integration of the platform with third-party APIs, ensuring seamless data sharing across systems and improving overall system usability.\nImproved the frontend user experience on a client-side dashboard using **Vue.js**, enhancing user engagement through **rapid prototyping** and **user-centric design** principles.\nDelivered detailed technical documentation and user guides for internal systems, facilitating improved knowledge transfer among teams and contributing to **feedback-driven improvement**."
    }
  ],
  "skills": "**Programming Languages**\n\tPython, JavaScript, Go\n\n**Backend Frameworks**\n\tNodeJS, ExpressJS, NestJS, C#, .NET, Entity Framework, Microservices\n\n**Frontend Frameworks**\n\tHTML, CSS, TypeScript, ReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n**API Technologies**\n\tRESTful API, GraphQL\n\n**Serverless and Cloud Functions**\n\tAWS, Azure\n\n**Databases**\n\tMSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB\n\n**DevOps**\n\tCI/CD pipelines\n\n**Cloud & Infrastructure**\n\tSecurity engineering, Data integrity and security\n\n**Other**\n\tUX/UI Design, Git, GitHub, Blockchain: Solidity, Ether.js, Web3.js, Ethereum, Agile development, AI proficiency, Full-stack development, User-centric design, Rapid prototyping, Iterative development, Technical mentorship, Collaborative problem solving, Feedback-driven improvement, Testing Tools: NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest"
}