{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Fullstack Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-152840397/",
  "profile_summary": "As a Senior Fullstack Engineer with 8 years of experience, I excel in building high-performance solutions leveraging **C#**, **Angular**, and **T-SQL** within service-oriented architectures. My technical expertise is underscored by a solid background in **Microservices** and **Cloud Computing** principles, enabling me to develop robust applications that meet industry standards for **IT Security** and compliance.\nI bring an in-depth understanding of developing enterprise-grade platforms, integrating **AI** capabilities for predictive analytics and automation. My previous roles have involved effectively collaborating with cross-functional teams, utilizing strong **problem-solving** and **communication** skills to drive project success.\nIn addition to my technical proficiencies with **SQL Server**, I possess hands-on experience deploying solutions using **Azure** and **AWS**, affirming my capability in modern cloud environments. My dedication to continuous improvement and adherence to best practices ensure the delivery of secure, efficient, and scalable applications.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Fullstack Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Utilized **C#**, **Angular**, and **T-SQL** to architect and develop scalable, full-stack healthcare and financial platforms, ensuring compliance with IT Security standards like HIPAA and GDPR.\nImplemented microservices architecture to enhance system reliability and performance across applications, leveraging **Cloud Computing** principles and tools.\nFocused on collaboration and communication with cross-functional teams, ensuring alignment on project goals and methodologies.\nApplied advanced **AI** techniques to develop intelligent features in applications, enhancing user experience and operational efficiency.\nLed problem-solving sessions to address technical challenges, employing strategic analysis and innovative thinking to reach effective solutions.\nDesigned and maintained cloud-native data architectures using **SQL Server** and integrated with various front-end frameworks for a comprehensive user experience.\nDeveloped and deployed CI/CD pipelines using modern tools, enabling regular updates and reliable deployment of software across environments.\nDelivered data visualization tools that improved insights into key performance indicators and operational metrics.\nStreamlined RESTful API development for seamless integration between microservices and front-end applications, focusing on optimal performance.\nCollaborated with team members and stakeholders to conduct code reviews and ensure adherence to best practices in software development. \nConducted training sessions for team members on best practices for **Microservices** and **Service Fabric**, fostering continuous learning and development."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Utilized **C#** and **Angular** to enhance financial platforms by implementing a microservices architecture, resulting in a **20%** increase in system scalability and maintainability.\nLeveraged **T-SQL** to optimize database queries and improve performance for high-volume transaction processing, achieving a **15%** faster response time.\nDeveloped collaborative solutions in an agile environment, focusing on effective communication and teamwork to meet project milestones successfully, demonstrated by launching **3 major updates** within a quarter.\nApplied **Cloud Computing** technologies to deploy and scale applications on **Azure Service Fabric**, ensuring robust operational capacity for financial management systems.\nIntegrated **AI** methodologies into existing systems to enhance fraud detection and user profiling, increasing anomaly detection rates by **30%**.\nEmphasized strong **problem-solving** skills to troubleshoot complex issues in production environments, reducing downtime by **40%** through timely interventions.\nEngaged in cross-team collaborations to gather requirements and deliver effective solutions that aligned with business objectives, successfully improving customer onboarding times by **25%**.\n\nContinued to modernize our tech stack by integrating **Kafka**, **RabbitMQ**, and **Azure Data Factory** into existing workflows, improving event processing efficiency for transactional alerts and compliance notifications."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Utilized **C#** and **Angular** to develop and optimize microservices architecture, enhancing system scalability and maintainability across multiple modules for robust e-commerce functionality.\nEmployed **T-SQL** for database design and management in **SQL Server**, ensuring efficient data handling and query performance for high-traffic applications, processing over **10,000** queries per second.\nDesigned and implemented cloud-based solutions utilizing **Cloud Computing** strategies to ensure high availability and optimized resource utilization, significantly reducing operational costs by **30%**.\nApplied AI methodologies to develop innovative solutions for predictive analytics and user behavior modeling, increasing customer engagement and conversion rates by over **15%**.\nEngineered secure applications adhering to **IT Security** best practices, implementing role-based access control (RBAC) and **OAuth 2.0** to protect user data and maintain compliance with GDPR guidelines.\nLed collaborative development efforts, fostering communication among cross-functional teams to resolve complex problems and accelerate project timelines by **40%**.\nDrove the adoption of **Microservices** using **Service Fabric** to streamline application deployments and enhance modularity, resulting in reduced deployment times from **1 hour** to under **15 minutes** for microservices updates.\nParticipated in code reviews and provided mentorship to junior developers, promoting knowledge sharing and continuous improvement in coding practices and technologies."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, C#, JavaScript/TypeScript\n\n **Frontend Frameworks:**\n\tReact, Vue, Angular\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n **API Technologies:**\n\t\n\n **Serverless and Cloud Functions:**\n\tAWS (Lambda), Azure (App Services)\n\n **Databases:**\n\tPostgreSQL, MySQL, MongoDB, SQL Server, T-SQL, Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:**\n\tAWS (ECS, RDS, S3), Azure (Blob, SQL), Cloud Computing\n\n **Other:**\n\tMLflow, Airflow, Kubeflow, Microservices, Service Fabric, AI, IT Security, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, Problem Solving, Collaboration, Communication",
  "apply_company": "Inycom"
}