{
  "name": "Tomasz Lee",
  "role_name": "Senior Platform Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Results-driven Senior Platform Engineer with 9+ years of experience specializing in **AWS**, **Azure**, **GCP**, **CI/CD**, and **Git**. Proven expertise in designing and implementing **RESTful APIs** within distributed systems. Proficient in backend development using **Python** and **GoLang**, and adept at leveraging **Linux** environments. Strong understanding of **Agile** methodologies and committed to optimizing performance through innovative solutions. Original strengths include a solid foundation in **microservices architecture**, demonstrated capability in **Apache Kafka**, **RabbitMQ**, and **Redis**, and a background in full stack development with **ReactJS**, **NextJS**, **.NET**, and **C#**. Dedicated team collaborator with a track record of leading projects to successful outcomes.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Senior Platform Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Implemented CI/CD pipelines on **Azure** DevOps, enhancing deployment efficiency by **40%**.\nDeveloped and maintained robust RESTful APIs, ensuring seamless integration with various microservices and supporting application scalability.\nStreamlined cloud-based operations using **AWS** and **GCP**, optimizing resource management for improved system performance.\nSpearheaded coding standards and best practices in a **Linux** environment, contributing to enhanced software quality and team productivity.\nCollaborated on cross-functional Agile teams to drive software development using **Python** and **GoLang**, improving development cycle times by **25%**.\nLeveraged **Git** for version control, managing code repository integrity and facilitating collaborative workflows.\nUtilized advanced networking techniques for system integration and improved data flow across services.\nEnhanced system architecture and data management strategies, contributing to a modernized and high-performing platform.\nExplored and integrated AI-driven solutions to enhance application capabilities and user experience.\nExpanded the system's accessibility and functionality by designing a reporting engine using **D3.js** for data visualization."
    },
    {
      "role": "Software Engineer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "Designed and developed RESTful APIs ensuring high performance with **Python** and **GoLang**, facilitating seamless interactions within the system.  \nImplemented CI/CD pipelines using **Git** and **AWS**, achieving a **30%** reduction in deployment errors and ensuring consistent delivery.  \nLed a team through Agile methodologies, ensuring timely project delivery while maintaining clear communications with stakeholders.  \nEmployed **Linux** environments for deployment and server management, enhancing reliability and efficiency in service delivery.  \nUtilized **AWS**, **Azure**, and **GCP** for cloud solutions, contributing to a scalable infrastructure that supports evolving business needs.  \nIntegrated AI algorithms into platforms, optimizing data processing workflows and automating routine tasks to increase productivity by **20%**.  \nConducted networking configurations to improve data flow and security across services, enhancing overall system performance.  \nCollaborated on creating interactive visualizations with **D3.js**, improving project status tracking and reporting with real-time data access.  \nMentored junior developers through code reviews and collaborative sessions, boosting team skillsets and efficiency."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "Utilized **AWS**, **Azure**, and **GCP** services to enhance system architecture and cloud integration, improving overall system resilience and uptime by **15%**.\nDeveloped and maintained **RESTful APIs** using **Python** and **GoLang**, facilitating efficient data exchange between microservices and improving response time by **25%**.\nImplemented **CI/CD** pipelines using **Git**, automating deployment processes and reducing manual errors by **30%**.\nLeveraged **Linux** system administration skills to optimize server performance and uptime, reinforcing system security and stability.\nCollaborated in an **Agile** environment, participating in daily standups and sprint planning to ensure project alignment and timely delivery.\nConducted networking assessments to improve connectivity and data transfer rates, achieving a latency reduction of **20%**.\nUtilized AI principles to enhance system functionalities, focusing on intelligent data processing and decision-making capabilities.\nProvided technical mentorship and leadership to junior engineers, fostering a culture of learning and innovation within the team.\nProduced comprehensive technical documentation and user guides, improving internal knowledge sharing and process clarity for **5+** teams.\nContinuously assessed and integrated new technologies to ensure the platform remains state-of-the-art and competitive in the market."
    }
  ],
  "skills": "**Programming Languages**\n\tPython, GoLang\n\n**Backend Frameworks**\n\tNodeJS, ExpressJS, NestJS, C#, .NET, Entity Framework, Microservices\n\n**Frontend Frameworks**\n\tHTML, CSS, JavaScript, TypeScript, ReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n**API Technologies**\n\tRESTful API, GraphQL\n\n**Serverless and Cloud Functions**\n\tAWS, Azure, GCP\n\n**Databases**\n\tMSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB\n\n**DevOps**\n\tCI/CD, Git, GitHub\n\n**Cloud & Infrastructure**\n\tLinux, Networking\n\n**Other**\n\tUX/UI Design, Agile, AI, Blockchain: Solidity, Ether.js, Web3.js, Ethereum, Messaging & Caching: Apache Kafka, RabbitMQ, Redis, Testing Tools: NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest",
  "apply_company": "Qumulo"
}