{
  "name": "Patryk Zaslawski",
  "role_name": "Software Engineer (Ruby)",
  "email": "patrykzas0428@outlook.com",
  "phone": "+48669862402",
  "address": "Gdanski, Poland",
  "linkedin": "https://www.linkedin.com/in/patryk-zaslawski-6b04a8397/",
  "profile_summary": "Skilled Software Engineer with 8+ years of experience specializing in **Ruby** and **Ruby on Rails** for developing scalable and secure web applications. Proficient in Test-Driven Development (TDD) and Continuous Integration, I prioritize high code quality through practices like **Unit Testing**, **Integration Testing**, and **System Testing**. My expertise in creating robust **RESTful APIs** ensures efficient backend services, while my experience with **PostgreSQL** enhances database management for optimal performance. I also possess strong capabilities in **Git**, utilizing platforms such as **GitHub** and **GitLab** for version control and collaboration. Experienced in **AWS** for cloud services, I embrace Agile methodologies, fostering continuous improvement through **Code Reviews** and **Mentoring** team members. My background includes **Frontend Development** using frameworks like **React** and languages like **TypeScript**, ensuring a seamless user experience across applications while leveraging my strong communication skills to thrive in **Remote Collaboration** environments.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2014",
      "to_year": "2017",
      "location": "United Kingdom",
      "university": "The University of Manchester"
    }
  ],
  "experience": [
    {
      "role": "Software Engineer (Ruby)",
      "company": "Binary Studio",
      "from_date": "Aug 2023",
      "to_date": "Present",
      "location": "United Kingdom (Remote)",
      "responsibilities": "- Developed and maintained **Ruby on Rails** web applications, ensuring adherence to **Test-Driven Development (TDD)** principles to deliver high-quality code.\n- Built secure **RESTful APIs** using **Ruby** to facilitate seamless communication between backend services and frontend applications.\n- Utilized **PostgreSQL** for efficient data storage and retrieval, optimizing database queries to support application performance.\n- Integrated **Continuous Integration** tools to automate deployment pipelines, improving the efficiency and reliability of software releases.\n- Collaborated with cross-functional teams to ensure alignment on project goals and deliverables, fostering a culture of **Continuous Improvement**.\n- Mentored junior developers in **Ruby**, **TDD**, and **Agile** methodologies, facilitating knowledge sharing through **code reviews** and pair programming sessions.\n- Engaged in **Frontend Development**, utilizing **React** and **TypeScript** to enhance user interface experiences and improve application usability.\n- Implemented secure coding practices in all projects, ensuring compliance with industry standards for safety and security.\n- Led design discussions for backend services, focusing on scalable architecture using software design patterns appropriate for evolving business needs.\n- Demonstrated expertise in **DevOps** practices, leading the transition to cloud-based infrastructures like **AWS** for improved scalability and performance.\n- Facilitated asynchronous communication while managing projects in a remote collaboration environment, using tools like **GitHub** and **GitLab** for version control and team collaboration.\n- Conducted unit, integration, and system testing to ensure application stability and performance, reducing post-deployment issues by over **30%**.\n- Actively participated in sprint planning, retrospectives, and stand-up meetings, ensuring clear communication and collaboration within the team."
    },
    {
      "role": "Software Engineer",
      "company": "Ardigen",
      "from_date": "Mar 2020",
      "to_date": "Aug 2023",
      "location": "Poland",
      "responsibilities": "Utilized Ruby and **Ruby on Rails** to build scalable **backend services**, enhancing application performance and maintainability.\nImplemented **RESTful APIs** in Ruby, ensuring secure integration with various web applications, facilitating data exchange and enhancing user experiences.\nAdopted **Test-Driven Development (TDD)** practices, achieving a 30% reduction in bugs in production by writing robust unit and integration tests in Ruby.\nCollaborated within an **Agile** team, contributing to continuous integration and deploying applications seamlessly using **Git**, **GitHub**, and **GitLab** to manage code changes and automate builds.\nDesigned efficient asynchronous communication patterns leveraging **background job processing**, ensuring responsiveness in data handling and user interactions.\nEngaged in code reviews and provided mentoring to junior developers, fostering a culture of continuous improvement and learning within the team.\nDeveloped and maintained **web applications** with a focus on secure coding practices, ensuring compliance with industry standards and policies.\nEnhanced frontend development using **React** and **TypeScript**, creating dynamic, user-centric interfaces that interact with the Ruby backend effectively.\nManaged CI/CD pipelines within **DevOps** environments to automate deployment workflows, resulting in a 40% increase in delivery speed.\nContributed to software design patterns implementation, improving code reusability and maintainability across projects within the organization.\nEmployed integration testing methodologies to validate complex interactions between frontend and backend systems, ensuring a seamless user experience.\nLeveraged collaboration tools effectively to support remote teamwork, maintaining clear communication and project transparency.\nEncouraged best practices in unit testing with Ruby frameworks, ensuring code quality and system reliability throughout the development lifecycle."
    },
    {
      "role": "Software Engineer",
      "company": "Altum Software",
      "from_date": "Oct 2017",
      "to_date": "Feb 2020",
      "location": "United Kingdom",
      "responsibilities": "Developed backend services for web applications using **Ruby on Rails** and **PostgreSQL**, ensuring high performance and secure coding practices across multiple modules.\nImplemented RESTful APIs following Test-Driven Development (TDD) principles, achieving a **20%** reduction in bugs before deployment through rigorous unit testing.\nUtilized **Git** for version control coupled with **GitHub** and **GitLab** for Continuous Integration, enhancing team collaboration and improving deployment efficiency.\nDesigned and built responsive frontend components using **React** and **TypeScript**, integrating seamlessly with backend services to enhance user experience.\nLeveraged Agile methodologies to manage project workflows and adapt to changing requirements, ensuring timely delivery of features.\nConducted code reviews and mentored junior developers to promote best practices in software development within a collaborative team environment.\nImplemented continuous improvement strategies that led to a **30%** decrease in deployment time and improved system reliability.\nEngineered asynchronous communication solutions for background job processing to handle high-volume tasks efficiently.\nEnsured secure coding practices throughout the software development lifecycle, focusing on protecting sensitive user data and maintaining compliance.\nDeveloped and maintained robust testing strategies, including unit and integration tests to verify functionality and system performance, achieving full test coverage for critical components.\nParticipated in the implementation of CI/CD pipelines, utilizing tools like **Jenkins** to automate testing and deployments, significantly reducing manual intervention and errors.\nCollaborated remotely with cross-functional teams to deliver high-quality web applications, utilizing collaboration tools to maintain project visibility and team engagement."
    }
  ],
  "skills": " **Programming Languages:** \n\tPython, Ruby, TypeScript \n\n **Backend Frameworks:** \n\tFastAPI, Django, Flask, Ruby on Rails, Spring Boot \n\n **Frontend Frameworks:** \n\tAngular (1–16), React (15–18), Next.js, Vue.js (2/3), Blazor \n\n **API Technologies:** \n\tREST & gRPC APIs, RESTful APIs \n\n **Serverless and Cloud Functions:** \n\tAWS Lambda \n\n **Databases:** \n\tPostgreSQL, MySQL, MongoDB, Redis \n\n **DevOps:** \n\tDocker, Kubernetes, Git, GitHub Actions, GitLab CI/CD, Continuous Integration \n\n **Cloud & Infrastructure:** \n\tAWS (ECS, RDS, S3), Azure (App Services, Blob, SQL) \n\n **Other:** \n\tSQLAlchemy, Pydantic, Celery, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, TDD, Secure Coding, Web Applications, Backend Services, Test-Driven Development, Agile, Frontend Development, Software Design Patterns, Background Job Processing, Unit Testing, Integration Testing, System Testing, Collaboration Tools, Asynchronous Communication, Code Reviews, Mentoring, Continuous Improvement, Remote Collaboration, Communication"
}