{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Technical Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Senior Technical Engineer with 13+ years of experience in providing top-tier customer support and optimizing SaaS solutions. Proficient in SQL for data management and skilled in using tools like **Metabase**, **Zendesk**, **Linear**, and **JIRA** to streamline operations and enhance user experience. Demonstrated aptitude for troubleshooting technical issues and delivering effective solutions while ensuring robust communication and teamwork.\n\nAccomplished Full Stack Developer experienced in building high-performance applications for the healthcare and financial sectors. Strong technical expertise in **JavaScript/TypeScript**, **Python**, and **Flutter**, with hands-on knowledge in both frontend and backend development using **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**. Capable of leveraging **AWS** and **Azure** for cloud-native deployments and implementing microservices and event-driven architectures. Well-versed in compliance standards such as HIPAA, FHIR, PCI DSS, and SOC 2, alongside a strong background in MLOps utilizing **MLflow**, **Airflow**, and **Kubeflow**.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Technical Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Provided exceptional **Customer Support** by addressing technical inquiries and resolving issues, enhancing user satisfaction across **SaaS** platforms.\nUtilized **SQL** for extensive data retrieval and management, ensuring accurate reporting and consistent data integrity across numerous databases.\nDeveloped and maintained comprehensive documentation and **Technical Writing** material to facilitate clarity and understanding of product functionalities, achieving a 30% decrease in support tickets.\nLeveraged **Metabase** for effective data visualization, enabling stakeholders to access insights and improve decision-making processes related to customer engagement.\nImplemented troubleshooting protocols to quickly identify and resolve user issues, reducing resolution time by **40%**.\nCollaborated with cross-functional teams using **JIRA** and **Linear** for task management and progress tracking, ensuring smooth project flow and adherence to deadlines.\nEmployed **Zendesk** for managing customer feedback and support tickets, resulting in a **20%** faster response time and improved customer retention rates.\nArticulated complex technical concepts to both non-technical and technical stakeholders, ensuring alignment and comprehension throughout project lifecycles.\nFostered teamwork and adaptability in a fast-paced environment, leading to successful project outcomes and improved product iterations.\nUtilized **Sendgrid** for efficient email communication, streamlining internal and external communications for better customer interactions.\nApplied strong problem-solving skills to enhance product features, contributing to a **25%** increase in customer satisfaction metrics through feedback-driven improvements.\nManaged data efficiently across different platforms, ensuring robust **Data Management** practices were upheld at all levels of the organization."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Provided exceptional **Customer Support** for SaaS applications, leveraging tools such as **Zendesk** and **Metabase** to streamline issue resolution and enhance user satisfaction.\nUtilized **SQL** for database queries and data management, ensuring effective data operations and insightful reporting.\nImplemented **Troubleshooting** techniques to diagnose and resolve technical issues, achieving an **85%** first-contact resolution rate.\nCollaborated with cross-functional teams using **JIRA** and **Linear**, improving project transparency and communication efficiency by **30%**.\nAuthored and maintained **Technical Writing** documentation, including user manuals and API guides, contributing to onboarding processes and knowledge sharing.\nDemonstrated strong **Problem-Solving** skills by identifying root causes of system failures, which reduced downtime by **15%** through prompt action and continuous improvement.\nFostered a **Teamwork** environment, mentoring junior engineers and promoting a culture of adaptability and continuous learning in a fast-paced SaaS ecosystem.\nDeveloped technical solutions and strategies that align with business objectives, driving efficiency and scalability in project deliverables."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Leveraged **SQL** querying skills to manage and analyze customer data, ensuring accurate reporting and seamless data management within the SaaS framework.\nUtilized **Zendesk** and **Metabase** for customer support, enabling effective troubleshooting and real-time reporting to enhance customer experiences and resolve issues promptly.\nImplemented project management tools like **JIRA** and **Linear** to streamline workflows, ensuring timely communication and transparency with the team during the development process.\nDeveloped clear technical documentation and training materials, enhancing **technical writing** skills to facilitate knowledge transfer and promote best practices across teams.\nConducted troubleshooting sessions to diagnose and resolve complex technical issues, demonstrating problem-solving skills and a commitment to delivering high-quality support to both internal and external stakeholders.\nCollaborated cross-functionally with product and engineering teams, ensuring teamwork and adaptability in fast-paced environments to meet project milestones and client needs.\nMaintained an open line of communication with stakeholders, providing updates and gathering feedback to improve overall service delivery and customer satisfaction.\nDesigned and optimized backend services for a global e-commerce platform using **Python** (**FastAPI**, **Django**) and **Node.js** (**NestJS**, **Express**), ensuring high availability, low latency, and scalability across key modules like checkout, cart, and order fulfillment.\nEngineered real-time features using **WebSockets** and event-driven architecture powered by **Kafka** and **RabbitMQ**, enabling responsive order updates and dynamic inventory tracking.\nDeveloped frontend applications using **React** (**18**), **Vue 3**, and **Angular**, enhanced with **TypeScript**, **Redux Toolkit**, and **Tailwind CSS**, delivering fast, responsive user experiences on both web and mobile platforms.\nLeveraged **MongoDB**, **PostgreSQL**, **Redis**, and **Cassandra** for distributed data storage, ensuring fast, fault-tolerant data access for high-traffic e-commerce workflows.\nIntegrated AI/ML-based recommendation engines using **scikit-learn**, **LightGBM**, and **TensorFlow** to personalize product listings, optimizing search relevance and improving conversion rates based on real-time behavioral data.\nImplemented **Redis** caching for product metadata, enhancing application responsiveness while reducing read pressure on databases.\nExecuted feature flags and blue-green deployments using **LaunchDarkly** and **Kubernetes**, enabling controlled rollouts and risk mitigation during major platform updates.\nCreated responsive, SEO-friendly e-commerce UIs using **Next.js**, **Vue 3 + Nuxt**, and **HTML5/CSS3**, optimized for mobile engagement and accessibility compliance (WCAG **2.1**).\nBuilt secure payment workflows integrated with **Stripe**, **PayPal**, and **Razorpay**, applying PCI-compliant handling of sensitive data.\nApplied role-based access control (**RBAC**) and **OAuth 2.0** for secured access, ensuring GDPR compliance and user data protection throughout the platform."
    }
  ],
  "skills": "**Programming Languages:**\n\tPython: FastAPI, Flask, Django\n\tJavaScript/TypeScript: React, Vue, Angular\n\n**Backend Frameworks:**\n\t\n\n**Frontend Frameworks:**\n\t\n\n**API Technologies:**\n\t\n\n**Serverless and Cloud Functions:**\n\tAWS: ECS, Lambda, RDS, S3\n\tAzure: App Services, Blob Storage, SQL Database\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare)\n\tMongoDB (Gaming), Redis\n\tSQL\n\n**DevOps:**\n\tDocker, Kubernetes\n\tGitHub Actions, GitLab CI/CD\n\tTerraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\t\n\n**Other:**\n\tCustomer Support\n\tSaaS\n\tMetabase\n\tZendesk\n\tLinear\n\tJIRA\n\tSendGrid\n\tTroubleshooting\n\tTechnical Writing\n\tData Management\n\tCommunication\n\tProblem Solving\n\tTeamwork\n\tAdaptability",
  "apply_company": "Sona"
}