{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Software Engineer, Core Services",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-152840397/",
  "profile_summary": "As a Senior Software Engineer with 8 years of hands-on experience in API design and integration patterns, I bring a strong proficiency in **Golang**, **TypeScript**, and modern AI technologies. My expertise includes distributed systems design patterns and event-driven architectures, particularly leveraging **Kafka** for scalable solutions. I have a solid understanding of the CAP Theorem and Backend for Frontend (BFF) strategies, ensuring optimal developer experience.\n\nI have successfully built high-performance applications across healthcare and financial sectors, utilizing modern frameworks including **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**. My deep cloud experience spans **Azure** and **AWS**. I've developed enterprise-grade platforms incorporating AI/ML capabilities for advanced predictive analytics and intelligent automation.\n\nFurthermore, I employ a robust microservices architecture and CI/CD automation practices to develop secure applications in compliance with standards like HIPAA, FHIR, PCI DSS, and SOC 2. My proficiency in MLOps workflows, utilizing tools like **MLflow**, **Airflow**, and **Kubeflow**, complements my extensive background in real-time data processing. I am committed to ownership and accountability in my work, driving successful project outcomes.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Software Engineer, Core Services",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Designed and implemented robust API standards and design for scalable core services using **TypeScript**, ensuring high-level compliance with modern API integration patterns.\n• Developed event-driven architectures leveraging **Kafka** for asynchronous processing, adhering to **CAP Theorem** and distributed systems design patterns.\n• Architected and developed full-stack applications using **Golang** and various frontend frameworks, optimizing for developer experience consideration and strong ownership accountability.\n• Collaborated effectively to document and maintain APIs, enhancing communication skills within the development team and ensuring seamless integration of services.\n• Engaged in the architecture of Backend for Frontend (BFF) designs to optimize performance across applications, resulting in a **30%** improvement in response time.\n• Implemented machine learning algorithms using **modern AI technologies** to enhance service capabilities, leading to a **25%** improvement in predictive accuracy for user insights.\n• Established CI/CD pipelines with **GitHub Actions** for efficient deployment, achieving an **80%** reduction in time to production for core services.\n• Developed and maintained documentation, promoting clear communication around API functionalities and ensuring smooth onboarding for new developers.\n• Contributed to the strategic planning of future API enhancements and features, driving accountability and ownership within the development lifecycle.\n• Optimized application performance ensuring high availability through best practices in distributed systems. \n• Provided insights and guidance to junior developers, fostering developer experience and reinforcing a culture of ownership and accountability."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "• Designed and implemented **API standards** and **API integration patterns** for microservices architecture, enhancing system interoperability and developer experience.\n• Led the backend development using **Golang** and **TypeScript**, including **Node.js** with **NestJS/Express**, resulting in a **25%** increase in performance metrics for high-volume transaction systems.\n• Applied **CAP Theorem** principles in the development of robust **distributed systems design patterns**, ensuring high availability and fault tolerance.\n• Established a **Kafka**-powered event-driven architecture, supporting real-time processing for transaction alerts and compliance workflows, leading to a **30%** reduction in latency in event handling.\n• Collaborated on the development of **event-based patterns** for application services, improving communication between microservices by **40%**.\n• Focused on **Backend for Frontend (BFF)** strategies to optimize user experiences in financial applications by implementing tailored APIs that serve specific frontend requirements.\n• Leveraged modern **AI technologies** to construct **ML pipelines** for fraud detection, which utilized **scikit-learn** and **XGBoost**, achieving a **95%** accuracy rate in detecting fraudulent activities.\n• Facilitated ownership and accountability within the team by mentoring junior engineers and promoting best practices in API design and software development life cycle.\n• Engaged in effective **communication skills** to articulate technical concepts to non-technical stakeholders, enhancing cross-departmental collaboration and understanding of software solutions."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "• Developed and optimized APIs adhering to API standards and best practices using **Golang** and **TypeScript**, ensuring robust API design and integration patterns for seamless communication across applications.\n• Designed distributed systems leveraging **Kafka** for event-driven architecture, effectively managing data flow and enhancing responsiveness across services, particularly in real-time features and workflows with a focus on CAP Theorem.\n• Implemented backend for frontend (BFF) strategies to streamline user interactions and improve developer experience, ensuring high efficiency and maintainability of services.\n• Collaborated on modern AI technologies, utilizing frameworks like **TensorFlow** and **scikit-learn** to enhance product recommendations, targeting a **20%** increase in conversion rates based on behavior-driven insights.\n• Ensured reliable service availability and scalability across the platform, achieving **99.9%** uptime through effective monitoring and performance evaluations across all modules.\n• Held ownership and accountability for core services, driving improvements and maintaining high standards of performance and quality in software development.\n• Developed and managed communication protocols, ensuring alignment with **MCP protocol** for consistent data transactions.\n• Actively engaged in knowledge sharing and team discussions to foster a collaborative environment that emphasizes clear communication skills.\n• Participated in design and implementation discussions focused on distributed systems design patterns, improving team understanding and application of complex architectural challenges.\n• Oversaw API integrations with external services and platforms, promoting effective use of backend tools and libraries to enhance overall system performance and agility."
    }
  ],
  "skills": " **API Technologies:**\n\tAPI standards, API design, API integration patterns, Backend for Frontend (BFF), event based patterns, Kafka\n\n**Programming Languages:**\n\tPython, JavaScript, TypeScript, Golang\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps:**\n\tDocker, Kubernetes, CI/CD, GitHub Actions, GitLab CI/CD\n\n**Cloud & Infrastructure:**\n\tAWS, Azure, Terraform, Ansible, Helm, Docker Compose\n\n**Serverless and Cloud Functions:**\n\tAWS Lambda, Azure App Services\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, Keycloak, JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, developer experience consideration, communication skills, ownership, accountability, CAP Theorem, distributed systems design patterns, modern AI technologies, MCP protocol"
}