{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Network Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "As a Senior Network Engineer with 8 years of experience, I excel in troubleshooting and analytical problem-solving skills essential for effective network management. My comprehensive expertise includes configuring and managing complex network systems utilizing technologies such as **TCP/IP**, **BGP**, **OSPF**, **EIGRP**, **VLANs**, **VPNs**, and various **firewalls**, **proxies**, and **load balancers**. \nIn my previous roles, I have developed and maintained high-performance network solutions for sectors like healthcare and finance, ensuring compliance with industry standards. I possess a robust understanding of network architecture principles, network security protocols, and the intricacies of network traffic management.\nAdditionally, my adaptability extends to full-stack development, where I’ve employed **JavaScript/TypeScript**, **Python**, and **Flutter** to build efficient solutions, leveraging frameworks like **React**, **Next.js**, **Vue**, **Node.js**, as well as cloud services on **Azure** and **AWS**. This unique blend of networking and programming skills allows me to propose innovative solutions that enhance network functionality and security.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Network Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Performed advanced troubleshooting and analytical problem-solving tasks for complex **TCP/IP** networks, ensuring optimal performance and security.\n- Configured and managed **VLANs**, **VPNs**, and **firewalls** to maintain secure and efficient network environments across multiple sites.\n- Deployed and maintained **Aruba**, **Infoblox**, and **VeloCloud** solutions to enhance network performance, availability, and management.\n- Implemented **BGP**, **OSPF**, and **EIGRP** protocols for effective routing strategy, ensuring reliable data flow across dynamic networks.\n- Optimized network load balancing using various techniques, improving throughput by over **30%** during peak hours, leading to enhanced user experience.\n- Developed comprehensive network designs incorporating **Algosec** for security policy management, ensuring compliance with regulatory standards.\n- Led network integration projects with a focus on quality assurance, utilizing metrics to track performance improvements, achieving an uptime SLA of **99.9%**.\n- Created documentation and training materials for network configuration and troubleshooting best practices, enhancing team efficiency by **25%**.\n- Collaborated with cross-functional teams to integrate third-party hardware and software solutions, improving operational capabilities through system optimization.\n- Conducted risk assessments and audits identifying vulnerabilities and recommending actionable mitigations, leading to a reduction in security incidents by **40%**."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Utilized expert knowledge of **TCP/IP**, **BGP**, **OSPF**, and **EIGRP** to troubleshoot and optimize network performance, ensuring reliable connectivity for up to **1000+** users.\nImplemented advanced configurations for **firewalls**, **load balancers**, and **VPNs** to enhance network security and redundancy, achieving a **99.9%** uptime.\nConducted detailed network analysis and diagnostics to identify issues, resulting in a **30%** reduction in downtime through proactive problem-solving strategies.\nManaged and configured **VLANs** for efficient network segmentation and traffic management, improving data flow and interface performance by **25%**.\nCollaborated with cross-functional teams to establish and maintain **Infoblox** and **Aruba** solutions for robust DNS and DHCP services, contributing to seamless network operations across multiple sites.\nDesigned and deployed **VeloCloud** for SD-WAN solutions, enhancing application performance and driving operational efficiency through optimized routing policies.\nImplemented security measures using **Algosec** to streamline firewall rule management, resulting in a **40%** decrease in compliance-related incidents.\nEngaged in continuous learning and development in advanced networking concepts, contributing analytical insights into network strategies and enhancements."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "- Developed and implemented robust **TCP/IP**, **BGP**, **OSPF**, and **EIGRP** protocols in network infrastructures, ensuring optimal data routing and efficient communication in a high-traffic environment.\n- Configured and managed **VLANs**, **VPNs**, and **firewalls** to enhance network security and segmentation, reducing the risk of unauthorized access and increasing overall network resilience.\n- Assisted in troubleshooting complex network issues using analytical skills to perform root cause analysis, achieving a **95%** resolution rate for ticketed incidents.\n- Collaborated with cross-functional teams to design and deploy **load balancers** and **proxies**, improving system availability and performance metrics by **30%**.\n- Utilized **Infoblox** for DNS management and IP address allocation, managing over **5000** IP addresses efficiently to support the corporate network infrastructure.\n- Participated in the deployment and management of **VeloCloud** SD-WAN solutions, enhancing connectivity uptime and optimizing application performance across various branches, reducing latency by **20%**.\n- Leveraged **Algosec** to enhance security policy management and compliance, ensuring all network changes are documented and audited effectively.\n- Engaged in proactive monitoring and maintenance tasks using analytical methodologies, improving network uptime to **99.9%** through rigorous performance analysis and adjustments.\n- Provided comprehensive training and documentation for team members on troubleshooting techniques and best practices, fostering a culture of continuous improvement and knowledge sharing."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, JavaScript/TypeScript\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\t\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda), Azure (App Services)\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS (RDS, S3), Azure (Blob, SQL)\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, Aruba, Infoblox, VeloCloud, Algosec, TCP/IP, BGP, OSPF, EIGRP, VLANs, VPNs, firewalls, proxies, load balancers, troubleshooting, analytical, problem-solving",
  "apply_company": "emagine"
}