{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Frontend Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "As a highly skilled Senior Frontend Engineer with 8 years of experience, I bring expertise in **React** and **TypeScript**, and comprehensive knowledge in developing user-centric solutions that enhance user experience. I have a proven track record in implementing asynchronous communication strategies and collaborating cross-functionally to deliver robust digital wallet and payment services solutions.\nMy background in full-stack development includes leveraging technologies such as **Python** and **Flutter**, and my cloud experience spans across **GCP** and **AWS** environments. I excel in iterative development and autonomous work, employing strong problem-solving skills to address complex challenges.\nWith a focus on healthcare and financial sectors, I have led projects ensuring compliance with standards such as HIPAA and PCI DSS while driving innovation through technologies like **Node.js**, **FastAPI**, and **Django**. My experience also includes developing solutions that integrate machine learning capabilities for fraud detection, alongside a solid foundation in microservices architecture and CI/CD practices.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Frontend Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Developed high-performance user interfaces utilizing **React** while implementing **TypeScript** for robust type checking, ensuring a seamless user experience in line with modern standards.\n• Collaborated cross-functionally with design and backend teams to enhance **UX** across web applications, executing iterative development methodologies to align with project goals.\n• Implemented asynchronous communication patterns in frontend applications, enabling efficient data retrieval and user interaction.\n• Utilized GCP to deploy and manage microservices, optimizing the performance of applications to handle over **100,000** concurrent users seamlessly.\n• Integrated fraud detection capabilities into financial applications, leveraging intuitive UI designs to enhance usability for transaction monitoring.\n• Collaborated with multidisciplinary teams to support the adoption of digital wallet features, enhancing user transactions while maintaining compliance with payment services regulations.\n• Engaged in autonomous work to prototype and develop new features, showcasing strong problem-solving skills through innovative technical solutions.\n• Conducted thorough user experience testing and feedback loops to iterate on designs, resulting in a **30%** increase in user satisfaction ratings.\n• Mentored junior developers in implementing best practices in **React** and **TypeScript**, fostering a collaborative learning environment.\n• Published and maintained documentation for all frontend components and functionalities, ensuring clarity and accessibility for future development efforts."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "• Developed dynamic, user-focused front-end applications using **React (18)** and **TypeScript**, enhancing user experience for financial dashboards and admin portals.\n• Collaborated cross-functionally to ensure seamless integration of **payment services** and **digital wallet** functionalities, improving transaction processes.\n• Leveraged problem-solving skills to enhance application performance and responsiveness through iterative development methodologies.\n• Led the modernization of financial platforms, integrating asynchronous communication strategies for real-time data processing and maintaining high security in transaction systems.\n• Employed fraud detection techniques in applications, utilizing AI/ML insights to proactively flag suspicious activities, thus increasing security for users.\n• Scaled applications to support a user base growth of over **100,000** users while ensuring optimal performance and reduced latency by **30%**.\n• Engaged in autonomous work while delivering high-quality code, improving team efficiency by **20%** through the adoption of scalable frameworks.\n• Ensured adherence to best practices in user experience design, contributing to a **40%** increase in user satisfaction ratings post-deployment.\n• Integrated third-party payment gateways, ensuring compliance and enhancing functionality for **digital wallet** features, processing above **1 million** transactions monthly."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Developed robust frontend applications utilizing **React (18)** and **TypeScript**, ensuring a smooth user experience by implementing effective design principles and collaborative workflows with cross-functional teams.\nEngineered asynchronous communication features to enhance user interactivity and responsiveness across platforms, effectively addressing user feedback and optimizing functionality.\nCollaborated in an iterative development environment to implement scalable digital wallet solutions, ensuring seamless integration with payment services like **Stripe**, **PayPal**, and **Razorpay**, focusing on enhanced user experience and security.\nLeveraged **GCP** for deploying applications with a focus on high availability and performance metrics to support **9** million transactions per month, reducing latency to below **200 milliseconds**.\nApplied advanced fraud detection techniques within frontend systems, utilizing data insights to proactively address potential security threats and safeguard user transactions.\nFacilitated autonomous work processes in a fast-paced environment, demonstrating strong problem-solving skills to tackle challenges promptly and efficiently.\nDesigned and implemented UI components with a focus on digital wallet functionalities that improved user engagement by **30%** through enhancements in UX/UI across mobile and web applications.\nUtilized tools and frameworks to create responsive interfaces that comply with accessibility standards (WCAG 2.1) and optimized for mobile-first design, enhancing user reach and satisfaction.\nIntegrated iterative feedback loops to continuously improve user experience, thereby increasing conversion rates of digital wallet transactions by **15%** over **3** months."
    }
  ],
  "skills": "**Programming Languages:**\n\tPython, JavaScript, TypeScript, Scala\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\t\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL), GCP\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\t\n\n**Other:**\n\tFraud Detection, Digital Wallet, Payment Services, Asynchronous Communication, Cross-Functional Collaboration, Autonomous Work, Problem Solving, Iterative Development, User Experience",
  "apply_company": "Hopper"
}