{
  "name": "Mariusz Jan Skobel",
  "role_name": "Senior FullStack Engineer",
  "email": "mariuszskobel15@outlook.com",
  "phone": "+48 735 343 548",
  "address": "Katowice, Poland",
  "linkedin": "https://www.linkedin.com/in/mariusz-skobel-927764397/",
  "profile_summary": "Senior Full Stack Engineer with over 10 years of experience in delivering cutting-edge software solutions tailored for healthcare and finance industries. Proficient in **JavaScript**, **TypeScript**, **React**, **Next.js**, and adept at deploying **serverless** architectures using **Vercel**. Demonstrated expertise in building responsive and user-friendly designs leveraging **Tailwind CSS** and utilizing design platforms like **Figma**. Experienced in integrating LLM technologies from **OpenAI**, **Anthropic**, and **Google** for innovative applications in image and video generation, as well as audio generation. Skilled in developing robust data pipelines and managing async operations in line with modern API standards.\n\nHands-on experience with **PostgreSQL** and **Supabase** fuels strong backend capabilities. Committed to building scalable systems with effective **UI/UX** components while ensuring compliance with data standards. Proven ability to lead development on enterprise platforms embedding AI/ML functionalities aimed at enhancing real-time analytics and decision-making processes. Solid foundations in microservices architecture, CI/CD automation, and event-driven systems, ensuring the delivery of secure and maintainable solutions.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2012",
      "to_year": "2015",
      "location": "UK",
      "university": "University of Bristol"
    }
  ],
  "experience": [
    {
      "role": "Senior FullStack Engineer",
      "company": "EitBiz",
      "from_date": "Oct 2022",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Designed and implemented scalable, full-stack solutions utilizing **TypeScript**, **JavaScript**, and **React (17–18)** for healthcare and finance applications, ensuring compliance with industry regulations such as HIPAA and GDPR.\n• Developed responsive user interfaces employing **Next.js** and **Tailwind CSS**, while leveraging **Figma** for UI/UX design, enhancing the overall user experience.\n• Architected serverless solutions with **AWS Lambda** and **Azure Functions**, effectively optimizing application performance and reducing operational costs by **30%**.\n• Implemented data pipelines using **PostgreSQL** and **async operations** to handle large volumes of healthcare and financial data, achieving a **50%** improvement in data retrieval times.\n• Collaborated on building APIs that integrate AI capabilities, including **OpenAI** and **Anthropic**, for functionalities such as image and audio generation, enhancing application features.\n• Led the transition of monolithic applications to a microservices architecture using **Docker** and **Vercel**, improving deployment frequency by **40%**.\n• Developed engaging data visualization tools with **Chart.js** and **D3.js**, providing insights into transaction patterns and operational KPIs.\n• Established robust testing frameworks utilizing Jest and PyTest to ensure code quality and reliability across development cycles, achieving a **95%** test coverage.\n• Integrated advanced search functionalities using **Azure Cognitive Search** and **ElasticSearch** for efficient querying of unstructured health and financial data.\n• Built creative solutions for personalized health and financial recommendations through the integration of LLMs and context engineering techniques, making use of vector databases and embeddings."
    },
    {
      "role": "Software Engineer",
      "company": "Tvn S.A.",
      "from_date": "Oct 2019",
      "to_date": "Sep 2022",
      "location": "Poland",
      "responsibilities": "• Developed user-focused front-end applications using **React (18)**, **Next.js**, and **TypeScript**, ensuring responsive design and optimal performance for financial dashboards and admin portals.\n• Designed and implemented robust API integrations to enhance system capabilities and enable seamless data flow between components, leveraging tools such as **PostgreSQL** and **Supabase**.\n• Utilized **Git** for effective version control and collaboration on various projects, ensuring a streamlined development process.\n• Applied **Tailwind CSS** to maintain consistent and responsive UI/UX across all applications, enhancing user interactions and visual appeal.\n• Collaborated with design teams using tools like **Figma** to create wireframes and prototypes, aligning technical implementation with user-centered design principles.\n• Developed dynamic data pipelines, integrating with external APIs and focusing on asynchronous operations to manage high-volume data processes efficiently.\n• Engaged LLM technologies such as **OpenAI** and **Anthropic** for integrating AI functionalities, improving user engagement with innovative features in applications.\n• Led the development and deployment of serverless solutions, enhancing system scalability while minimizing operational costs.\n• Spearheaded projects involving image and video generation, contributing to advanced feature sets that leverage graphical content dynamically in applications.\n• Implemented advanced machine learning techniques for audio generation and context engineering, enhancing application capabilities with data-driven insights."
    },
    {
      "role": "Software Engineer",
      "company": "Timspark",
      "from_date": "Sep 2015",
      "to_date": "Aug 2019",
      "location": "UK",
      "responsibilities": "Designed and optimized responsive frontend applications using **React (18)** and **Next.js**, ensuring exceptional UI/UX through efficient **TypeScript** integration and **Tailwind CSS** for styling, while focusing on cross-platform compatibility.\nImplemented **APIs** and serverless architectures for swift asynchronous operations, enhancing interactiveness and user engagement across web applications.\nCreated dynamic data pipelines integrating **PostgreSQL** and **Supabase** for robust backend support, ensuring efficient data retrieval and storage, capable of handling up to **100k** user interactions concurrently.\nEngineered advanced features utilizing **async operations**, employing **vector databases** and **embeddings** to store and process complex datasets in support of AI-driven functionalities.\nCollaborated with design tools such as **Figma** to deliver pixel-perfect designs, optimizing responsive design aligned with accessibility compliance (WCAG 2.1).\nIntegrated AI solutions utilizing **OpenAI** and **Anthropic** for context engineering and to develop innovative features such as LLM-powered chat interfaces and image generation capabilities, improving user engagement by over **30%**.\nImplemented robust version control using **Git**, ensuring smooth team collaboration and maintaining stability across multiple feature branches in a rapid development environment.\nLed efforts in building secure, user-friendly applications while maintaining compliance with data protection regulations and swift load times, achieving a **50%** reduction in page load times through optimized code and usage of caching strategies.\nConducted A/B testing and feature flag integration to assess new features, analyzing user feedback for continual improvement and enhancement of platform responsiveness."
    }
  ],
  "skills": "Programming Languages:\n\tJavaScript, TypeScript, Python\n\n**Frontend Frameworks:**\n\tReact, Next.js, Vue, Angular, Tailwind CSS, Figma\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**API Technologies:**\n\tAPIs\n\n**Serverless and Cloud Functions:**\n\tAWS (Lambda), Azure, serverless\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis, Supabase\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS (ECS, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Other:**\n\tArtificial Intelligence & Machine Learning (MLflow, Airflow, Kubeflow), Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, async operations, responsive design, UI/UX, vector databases, embeddings, LLM, OpenAI, Anthropic, data pipelines, image generation, context engineering, agentic AI, video generation, audio generation, Git",
  "apply_company": "Crypto Banter"
}