{
  "name": "Patryk Zaslawski",
  "role_name": "Senior Customer Engineer",
  "email": "patrykzas0428@outlook.com",
  "phone": "+48669862402",
  "address": "Gdanski, Poland",
  "linkedin": "https://www.linkedin.com/in/patryk-z-107978395/",
  "profile_summary": "As a Senior Customer Engineer with 8+ years of experience, I excel in **Cloud** technologies and **APIs** leveraging my strong background in **Python** development. I am proficient in **SQL** databases such as PostgreSQL, MySQL, and MongoDB, enhancing data management and performance. I have a robust understanding of **Cloud** security principles, including DLP and Data Privacy, ensuring that customer solutions are not only efficient but also secure and compliant. My expertise in project management enables me to oversee projects effectively while maintaining strong technical communication and fostering customer relations. Additionally, I possess mentoring skills, guiding team members to achieve excellence in delivering high-performance solutions across various sectors, including e-commerce, financial, and healthcare industries.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2014",
      "to_year": "2017",
      "location": "United Kingdom",
      "university": "The University of Manchester"
    }
  ],
  "experience": [
    {
      "role": "Senior Customer Engineer",
      "company": "Binary Studio",
      "from_date": "Aug 2023",
      "to_date": "Present",
      "location": "United Kingdom (Remote)",
      "responsibilities": "Utilized **SQL** to optimize data storage and querying with databases like PostgreSQL and Azure SQL, implementing indexing and partitioning for large-scale datasets.\nLeveraged **Python** for developing scalable microservices, integrating security best practices to ensure Data Loss Prevention (DLP) and compliance with **Cloud** security standards.\nIntegrated and secured **APIs** for communication with healthcare providers and third-party platforms, ensuring robust **CloudSecurity** and **DataPrivacy** measures.\nCollaborated with cross-functional teams, applying **ProjectManagement** skills to guide the development of complex solutions in **Python**, improving operational efficiency by **35%**.\nConducted **TechnicalCommunication** workshops to enhance the team's understanding of **SIEM** tools for monitoring security across cloud workflows.\nMentored junior engineers in **Python** best practices and cloud-native design patterns, contributing to their professional growth and understanding of industry standards.\nFacilitated strong **CustomerRelations** by actively participating in client meetings to gather requirements and provide technical insights, leading to a **20%** increase in customer satisfaction scores.\nDeveloped and deployed secure Python microservices on cloud platforms (AWS & Azure), ensuring compliance with SOC 2, ISO 27001, HIPAA, and PCI DSS.\nImplemented observability solutions using **Cloud** technologies (Prometheus, Grafana, ELK stack), significantly reducing incident response times by **40%**.\nSpearheaded the migration of monolithic applications to a microservices architecture, improving resilience and scalability, leading to a **50%** increase in deployment frequency."
    },
    {
      "role": "Software Engineer",
      "company": "Ardigen",
      "from_date": "Mar 2020",
      "to_date": "Aug 2023",
      "location": "Poland",
      "responsibilities": "Utilized **Python** to develop and maintain robust **APIs** ensuring secure integration with SQL databases and cloud services, leading to a 25% increase in transaction processing efficiency.\nConducted **ProjectManagement** for the migration of legacy systems, converting 100% of **.NET/VB.NET** applications into scalable **Python** microservices, thereby enhancing system performance by 30%.\nDesigned and implemented advanced data protection measures including **Data Loss Prevention (DLP)** strategies, ensuring strict **DataPrivacy** and compliance with industry regulations, resulting in a 20% reduction in security incidents.\nExecuted effective **CloudSecurity** practices using Azure and AWS services, integrating **SIEM** solutions to monitor and respond to security threats in real-time.\nLed technical communication initiatives, fostering collaboration with stakeholders and achieving a 40% improvement in customer satisfaction through enhanced service delivery.\nMentored junior engineers in **technical communication** and best coding practices, contributing to a knowledge-sharing culture and professional growth.\nStreamlined operations by utilizing **SQL** for database optimization, achieving a significant reduction in query times and improving data retrieval by 50%.\nDeveloped comprehensive documentation and project reports utilizing **APIs**, facilitating better understanding and collaboration across teams.\nExecuted customer relations strategies to build trust and rapport with clients, leading to a 30% increase in renewal rates for customer contracts.\nFacilitated training sessions showcasing new **Python** solutions, contributing to a 15% increase in application usage among clients during the first quarter post-launch."
    },
    {
      "role": "Software Engineer",
      "company": "Altum Software",
      "from_date": "Oct 2017",
      "to_date": "Feb 2020",
      "location": "United Kingdom",
      "responsibilities": "Utilized **SQL** to manage and optimize relational databases, ensuring data integrity and performance efficiency across platforms.\nLeveraged **Python** for developing backend services and APIs that enhance customer interactions, optimizing process flow for a seamless user experience.\nImplemented robust **APIs** to facilitate data exchange between systems, improving real-time communications and transaction handling for better customer relations.\nEnsured strong **Cloud Security** measures are integrated into all Python applications, safeguarding customer data and adhering to **Data Privacy** best practices.\nEngaged in **Project Management** practices, coordinating the development and delivery of features that align with business objectives, fostering team collaboration.\nConducted **Technical Communication** sessions to ensure clear understanding of project objectives and technical requirements among team members and stakeholders.\nMentored junior developers in best practices for **Python** and **SQL** application development, fostering a collaborative learning environment.\nApplied **Cloud** strategies to deploy scalable applications, enhancing system performance and reliability while meeting customer demands.\nConducted regular assessments using **SIEM** tools, enabling proactive identification of security incidents and enhancing data loss prevention (DLP) strategies.\nMaintained open channels of **Customer Relations**, addressing ongoing user needs and feedback to refine applications for increased satisfaction.\nDesigned and implemented **automated CI/CD** pipelines to streamline the development process, ensuring timely updates and feature releases, targeting improvements in delivery times by up to **40%**.\nDrove process enhancements and monitored results, achieving a **30%** reduction in response times for user queries and transactions.\nFacilitated successful migrations of legacy systems, modernizing technology stacks by introducing **Python** microservices, leading to a **25%** improvement in overall application performance."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython\n\n **Backend Frameworks:**\n\tFastAPI,\n\tDjango,\n\tFlask,\n\tSpring Boot\n\n **Frontend Frameworks:**\n\tAngular (1–16),\n\tReact (15–18),\n\tNext.js,\n\tVue.js (2/3),\n\tBlazor\n\n **API Technologies:**\n\tREST & gRPC APIs,\n\tAPIs\n\n **Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3),\n\tAzure (App Services, Blob, SQL)\n\n **Databases:**\n\tPostgreSQL (Fintech),\n\tMySQL (Healthcare),\n\tMongoDB (Gaming),\n\tRedis,\n\tSQL\n\n **DevOps:**\n\tDocker,\n\tKubernetes,\n\tGitHub Actions,\n\tGitLab CI/CD\n\n **Cloud & Infrastructure:**\n\tCloud,\n\tCloudSecurity\n\n **Other:**\n\tDLP,\n\tDataPrivacy,\n\tSIEM,\n\tProjectManagement,\n\tTechnicalCommunication,\n\tCustomerRelations,\n\tMentoring",
  "apply_company": "Cyera"
}