{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Mobile Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "As a results-driven Senior Mobile Engineer with 8 years of experience, I excel in software design patterns and team collaboration, emphasizing agile methodologies including **Scrum** and **CI/CD** practices. I am proficient in **C#**, **.NET**, and **Xamarin**, enabling me to build high-performance mobile solutions. My background includes enhancing problem-solving capabilities across diverse teams while ensuring robust communication.\nIn addition to my strong foundation in mobile application development, I leverage modern technologies including **JavaScript**, **TypeScript**, **Python**, and **Flutter**. I have extensive experience with full-stack development using **React**, **Next.js**, **Vue**, **Node.js**, and **FastAPI**, as well as cloud platforms such as **Azure** and **AWS**. My expertise extends to developing enterprise-grade platforms that incorporate AI/ML capabilities for enhanced decision-making and process automation. I am skilled in implementing microservices architecture, event-driven systems, and maintaining compliance standards including HIPAA, PCI DSS, and SOC 2.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Mobile Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Developed and deployed cross-platform mobile applications using **Xamarin**, ensuring seamless healthcare and fintech user experiences across iOS and Android platforms, with native module integration and state management.\n- Implemented mobile-driven CI/CD pipelines through **Git** and other tools, enhancing delivery cycles and reducing deployment times for both web and mobile apps.\n- Leveraged **C#** and **.NET** frameworks for building scalable mobile solutions, adhering to Agile practices and actively participating in **Scrum** ceremonies.\n- Collaborated effectively with teams to solve complex challenges, employing **software design patterns** to foster code maintainability and efficiency.\n- Championed **team collaboration** efforts, facilitating communication among cross-functional teams to align objectives and delivery timelines.\n- Ensured code quality and performance by integrating best practices in problem-solving, validating solutions through rigorous testing and debugging techniques.\n- Established clear communication strategies within the team, promoting transparency on project progress and roadblocks to enable collective problem resolution.\n- Contributed to the design and development of user-centric solutions in compliance with industry standards, enhancing overall user experience on mobile platforms.\n- Actively participated in code reviews and mentoring, leading to improved coding standards and team knowledge sharing."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "- Collaborated in an **Agile**/Scrum environment, enhancing team collaboration and communication among cross-functional teams to drive project success.\n- Developed mobile applications using **Xamarin** for cross-platform compatibility, ensuring seamless user experiences across devices.\n- Leveraged **C#** and **.NET** frameworks to implement software design patterns, improving code maintainability and scalability in mobile applications.\n- Managed version control with **Git**, streamlining codebase management and collaboration across a team of developers.\n- Established **CI/CD** practices to automate the deployment process, reducing the time to market by **30%** through efficient release cycles.\n- Utilized **MvvmCross** to create flexible MVVM architecture, enhancing application responsiveness and facilitating easier testing and maintenance.\n- Demonstrated exceptional problem-solving skills, resolving **90%** of critical issues within the first **24 hours** of identification during the development phase.\n- Contributed to the design and architecture of scalable mobile solutions, focusing on robust software design patterns to enhance overall performance and user experience."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Utilized **C#**, **.NET**, and **Xamarin** to design and develop mobile applications, ensuring seamless integration with backend services and an enhanced user experience.\nCollaborated in an **Agile** environment, actively participating in **Scrum** ceremonies to improve team efficiency and foster effective communication, achieving a **30%** reduction in project turnaround time.\nImplemented **CI/CD** pipelines, utilizing **Git** for version control, which streamlined the deployment process and reduced errors by **15%** during releases.\nEmployed **MvvmCross** framework to adhere to software design patterns, enhancing code maintainability and scalability for multiple mobile platforms including iOS and Android.\nConducted code reviews and applied software design patterns to solve complex problems effectively, improving code quality and team collaboration across projects.\nFacilitated team collaboration through regular stand-ups and discussions, positioning the team to adapt to changing project requirements in real-time, thus increasing customer satisfaction ratings by **20%**.\nMentored junior developers on best practices in mobile development, fostering a culture of continuous learning and improvement within the team.\nInvolved in user interface design and implementation adhering to responsive design principles to optimize applications for various device sizes and operating systems.\nSuccessfully addressed technical challenges and implemented solutions that led to a **25%** improvement in application performance metrics, resolving critical issues efficiently."
    }
  ],
  "skills": " **Programming Languages:** \n\tC#, Python, JavaScript/TypeScript\n\n **Backend Frameworks:** \n\tFastAPI, Flask, Django, .NET, MvvmCross\n\n **Frontend Frameworks:** \n\tReact, Vue, Angular, Xamarin\n\n **API Technologies:** \n\tOAuth2, JWT, Keycloak (OIDC, RBAC)\n\n **Serverless and Cloud Functions:** \n\tAWS (ECS, Lambda), Azure (App Services)\n\n **Databases:** \n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n **DevOps:** \n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:** \n\tAWS (RDS, S3), Azure (Blob, SQL)\n\n **Other:** \n\tAgile, Scrum, software design patterns, problem-solving, team collaboration, communication",
  "apply_company": "AMCS Group"
}