{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Technical Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "As a Senior Technical Engineer with 8 years of experience, I excel in utilizing **JavaScript**, **Python**, **AWS**, **Azure**, and **GCP** to develop high-performance solutions in the healthcare and financial sectors. My proficiency in building APIs and managing cloud services enables me to ensure robust security, efficient performance tuning, and effective debugging across projects. I have a strong command of **SQL** and have implemented project management practices using tools like **JIRA**. Furthermore, I am well-versed in creating technical documentation to facilitate cross-functional collaboration and maintain customer focus. My experience includes leading teams through the development of enterprise-grade platforms, integrating AI/ML capabilities with a focus on compliance with standards like HIPAA and PCI DSS. I am self-motivated and adaptable, excelling in time management and delivering results in collaborative environments, fluent in both English and Portuguese.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Technical Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Utilized **JavaScript** and **Python** to architect and develop scalable, full-stack healthcare and financial platforms, implementing best practices to ensure high performance and security across all applications.\nDesigned and integrated robust **API** functionalities, adhering to regulatory compliance with HIPAA, FHIR, GDPR, and financial standards including PCI DSS and SOX for **cross-platform** applications.\nLed cross-functional collaboration in the development and deployment of mobile applications using **React Native** and **Flutter**, achieving seamless user experiences across **iOS** and **Android** with significant performance improvements and state management integration.\nEngineered CI/CD pipelines using **GitHub Actions**, **Azure DevOps**, and **CircleCI** for enterprise-level deployments, automating testing, linting, and security scans across multiple environments, improving deployment efficiency by **30%**.\nRe-engineered monolithic applications into microservices, utilizing **Docker**, **Kubernetes (AKS/EKS)**, and serverless technologies (**AWS Lambda**, **Azure Functions**) to ensure system reliability and fault tolerance, reducing downtime by **20%**.\nDeveloped and maintained a cloud-native data architecture employing **PostgreSQL**, **MongoDB**, and **GraphQL** facilitating the ingestion, storage, and querying of large-scale healthcare and financial datasets.\nDesigned machine learning models with **Python** frameworks including **scikit-learn**, **PyTorch**, and **TensorFlow** for applications such as patient risk prediction and financial fraud detection, integrating real-time inference services into backend infrastructures.\nImplemented MLOps pipelines with tools like **MLflow** and **Apache Airflow** to streamline continuous training and deployment processes across a **CI/CD** development cycle, enhancing model update efficiency.\nCreated advanced data visualization tools using **D3.js**, **Chart.js**, and **Power BI Embedded** for real-time insights into financial transactions and operational performance metrics.\nCollaborated closely with data scientists to integrate **NLP** models leveraging **spaCy** and **Hugging Face Transformers** for document parsing and anomaly detection, embedding these capabilities into core services via **RESTful APIs**.\nEstablished testing strategies using frameworks such as **Jest**, **Cypress**, and **PyTest** to ensure comprehensive coverage through unit, integration, end-to-end, and contract testing across applications.\nIncorporated **Azure Cognitive Search** and **ElasticSearch** to enable sophisticated search functionalities across vast datasets of healthcare records and financial documents, improving search performance and reliability."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Led the development and modernization of financial platforms, focusing on:\n- Leveraging **JavaScript**, **Python**, and **Java** in a microservices-based architecture using **Node.js** (NestJS/Express) and **Python** (FastAPI, Django) to enhance scalability and maintainability for high-volume transactions.\n- Constructing dynamic front-end applications with **React** (18), **Vue 3**, and **Next.js**, utilizing **TypeScript**, **Redux Toolkit**, and **Tailwind CSS** for responsive user experiences in financial dashboards.\n- Establishing real-time transaction monitoring dashboards with **React**, **D3.js**, and **Power BI Embedded**, allowing teams to track financial activity efficiently and uncover insights, enhancing decision-making through data.\n- Deploying **Kafka**, **RabbitMQ**, and **Azure Service Bus** for a robust event-driven architecture that enables asynchronous communication and supports real-time processing of transactions and compliance workflows.\n- Engineering and managing ETL pipelines using **Python**, **Apache Airflow**, and **Azure Data Factory** to facilitate the ingestion of financial data, ensuring high throughput for both batch and real-time processing.\n- Implementing AI/ML-based fraud detection systems utilizing **scikit-learn**, **XGBoost**, and **Azure Machine Learning** to analyze transaction patterns, resulting in a **30%** increase in detection rates of fraudulent activities.\n- Developing ML pipelines for credit scoring and transaction classification leveraging **MLflow** and **Airflow**, integrating model inference into backend services for **real-time** decision-making capabilities.\n- Ensuring adherence to **performance tuning** and **debugging** best practices, contributing to system reliability and user satisfaction while maintaining comprehensive **technical documentation** and engaging in **cross-functional collaboration**."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "- Developed and maintained **API** endpoints in **Python** and **JavaScript** (including **FastAPI**, **Django**, **NestJS**, and **Express**), ensuring efficient data handling and seamless integrations for e-commerce systems.\n- Collaborated with cross-functional teams to enhance **networking** and **security** protocols, implementing role-based access control (RBAC) and **OAuth 2.0** for robust **authentication** practices, achieving **GDPR** compliance.\n- Executed performance tuning and debugging strategies using **AWS**, **Azure**, and **GCP** to optimize server responses, reducing latency by **30%** and improving scalability for high-demand services.\n- Engaged in project management using **JIRA** and agile methodologies, ensuring timely delivery of features and effective communication across teams, resulting in a **25%** increase in project throughput.\n- Crafted technical documentation for internal and external stakeholders to facilitate knowledge transfer and enhance customer focus, leading to a **15%** reduction in support tickets.\n- Demonstrated adaptability and self-motivation by quickly learning and incorporating new technologies into the existing tech stack, including **Salesforce** integrations for CRM functionalities.\n- Participated in regular reviews and performance assessments to ensure project milestones aligned with business objectives, achieving **90%** on-time project delivery.\n- Implemented caching strategies using **Redis** to improve data retrieval times, contributing to overall application performance and enhancing user experience across platforms.\n- Utilized a combination of **SQL** databases like **PostgreSQL** and NoSQL systems such as **MongoDB**, achieving fault-tolerant data access and optimizing queries for analytical efficiency.\n- Advanced personal and team development by providing mentorship on **Java**, **C#**, and debugging techniques, fostering a culture of learning and growth within the technical team."
    }
  ],
  "skills": "**Programming Languages:**\n\tPython, JavaScript, Java, C#, SQL\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tAPI, JWT, OAuth2\n\n**Serverless and Cloud Functions:**\n\tAWS, Azure, GCP\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), Nginx, Certbot, Salesforce, JIRA, networking, security, performance tuning, debugging, technical documentation, project management, customer focus, cross-functional collaboration, self-motivation, time management, adaptability, English, Portuguese",
  "apply_company": "Sovos"
}