{
  "name": "Mariusz Jan Skobel",
  "role_name": "Senior Unity Engineer",
  "email": "mariuszskobel15@outlook.com",
  "phone": "+48 735 343 548",
  "address": "Katowice, Poland",
  "linkedin": "https://www.linkedin.com/in/mariusz-skobel-927764397/",
  "profile_summary": "Senior Unity Engineer with 10+ years of experience creating high-quality applications in the domains of AI, VR, and 3D modeling. Expertise in **Unity** and **C#** programming, with a strong understanding of **Web-BIM**, **IFC**, and **glTF** standards. Proven ability to implement **Netcode**, manage **Addressables**, and enhance user experience in virtual reality environments using **NavMesh**. Skilled in Python for AI integrations, leveraging tools like **ChatGPT** to develop intelligent features and improve system functionalities.\nExperience in building cloud-native applications and ensuring compliance with industry standards, enriched by a solid background in developing enterprise platforms. Passionate about driving innovation and delivering impactful software solutions that align with user needs and project goals.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2012",
      "to_year": "2015",
      "location": "UK",
      "university": "University of Bristol"
    }
  ],
  "experience": [
    {
      "role": "Senior Unity Engineer",
      "company": "EitBiz",
      "from_date": "Oct 2022",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Developed immersive 3D experiences using **Unity** and **C#**, focusing on Web-BIM applications to enhance collaborative design and build processes.\n• Implemented AI-driven features leveraging **ChatGPT** for intelligent user interactions, optimizing workflow efficiency in virtual environments.\n• Utilized **glTF** and **IFC** formats to integrate and manipulate complex models, ensuring compatibility and high fidelity of 3D assets across various platforms.\n• Designed and executed VR applications with **Unity**, enhancing user engagement through interactive exploration of virtual spaces, utilizing best practices in performance optimization and user comfort.\n• Integrated **NavMesh** for efficient navigation in 3D environments, allowing dynamic pathfinding for VR and AR experiences.\n• Managed assets and build processes using **Addressables**, improving resource management and loading efficiency across various scenes and levels within applications.\n• Collaborated with cross-functional teams to implement **Speckle** for real-time collaboration on BIM projects, improving data interoperability and project communication.\n• Conducted rigorous testing and debugging to ensure optimal performance and user experience, achieving a reduction in reported issues by **30%** in production environments.\n• Delivered completed projects on schedule, achieving a **95%** client satisfaction rate, by maintaining efficient project timelines and communication with stakeholders.\n• Engaged with emerging technologies such as **glTFast** to enhance asset streaming in real-time applications, enabling rapid load times and performance improvements in 3D rendering."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Tvn S.A.",
      "from_date": "Oct 2019",
      "to_date": "Sep 2022",
      "location": "Poland",
      "responsibilities": "Developed immersive 3D applications and environments using **Unity** and **C#**, leveraging cutting-edge technologies to create engaging virtual reality (VR) experiences.\nImplemented AI-driven features using **ChatGPT** for enhanced user interactions, promoting intelligent dialogue and responsiveness within applications.\nUtilized **Web-BIM** standards to integrate Building Information Modeling (BIM) data into **Unity**, enabling the creation of interactive visualization tools for architectural projects with precise **IFC** formats.\nExploited **glTF** and **glTFast** techniques to optimize 3D asset loading and rendering performance, achieving seamless integration of high-quality 3D models in applications with a performance boost of up to 40%.\nDeveloped real-time multiplayer functionality using **Netcode**, enabling smooth communication and gameplay for up to **16** concurrent users in competitive VR environments.\nDesigned and implemented navigation solutions utilizing **NavMesh** for AI agents, ensuring efficient pathfinding and interactions in complex virtual spaces.\nStreamlined asset management through the use of **Addressables**, enhancing the overall resource management process and reducing load times by an average of **30%**.\nCollaborated with cross-functional teams to enhance applications using **Python** for backend logic, paving the way for seamless integration of machine learning algorithms for predictive analytics in construction projects.\nSupported bi-directional data integrity by integrating **Speckle** to connect Unity with design tools like **Revit**, facilitating real-time updates and collaborative workflows in architectural visualizations."
    },
    {
      "role": "Software Engineer",
      "company": "Timspark",
      "from_date": "Sep 2015",
      "to_date": "Aug 2019",
      "location": "UK",
      "responsibilities": "Utilized **Unity** and **C#** to design and develop innovative 3D applications with a focus on **AI** integration for enhanced user experiences.\nEngineered **Web-BIM** solutions for real-time collaborative design utilizing **IFC** and **glTF** formats, improving architectural workflows through optimized data visualization and interaction capabilities.\nIncorporated **ChatGPT** for creating intuitive conversational interfaces within applications, significantly enhancing user engagement and interaction.\nDeveloped robust systems for **VR** environments using **NavMesh** for improved navigation and user experience, achieving **70%** faster pathfinding capabilities in complex 3D spaces.\nUtilized **Netcode** for building efficient multiplayer functionalities, ensuring smooth interactions among **100+** concurrent users.\nImplemented **Addressables** for dynamic content management and optimized resource loading, enhancing application performance and reducing initial load times by **30%**.\nCollaborated with cross-functional teams to leverage **Revit** and **Speckle** APIs for seamless integration of BIM data into Unity, fostering real-time visualization enhancements in architectural projects.\nLed efforts in optimizing 3D asset management strategies using **glTFast**, resulting in a **50%** reduction in asset loading times on various platforms.\nConducted thorough performance testing and optimization of the applications, achieving a **40%** increase in frame rates across all supported devices."
    }
  ],
  "skills": " **Programming Languages:**\n\tC#, Python\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tJavaScript/TypeScript (React, Vue, Angular)\n\n**API Technologies:**\n\tChatGPT\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD\n\n**Cloud & Infrastructure:**\n\tTerraform, Ansible, Helm, Docker Compose\n\n**Other:**\n\tUnity, Web-BIM, AI, 3D, IFC, glTF, Netcode, Addressables, VR, NavMesh, Revit, Speckle, glTFast",
  "apply_company": "WattWeiser"
}