{
  "name": "Mariusz Jan Skobel",
  "role_name": "Senior QA Engineer",
  "email": "mariuszskobel15@outlook.com",
  "phone": "+48 735 343 548",
  "address": "Katowice, Poland",
  "linkedin": "https://www.linkedin.com/in/mariusz-skobel-927764397/",
  "profile_summary": "Senior QA Engineer with 10+ years of experience in delivering high-performance software solutions, specializing in modern testing technologies such as **Playwright**, **Cypress**, and **API** testing. Proficient in **JavaScript** (JS) and **TypeScript** (TS) for automation scripts, and skilled in leveraging **Web** protocols and tools for comprehensive QA processes. Strong background in **Relational Databases** and data visualization using **Kibana** and **Grafana** to analyze test results and system behaviors. Demonstrated expertise in Object-Oriented Programming (OOP) principles, enhancing test frameworks and ensuring code quality through rigorous testing practices. Experienced in utilizing **Firebase** for backend testing and implementing A/B Testing strategies for product iterations.\nAdditionally, I bring hands-on experience with microservices architecture and cloud-native applications, complemented by a passion for mentorship and fostering collaborative team environments to drive innovation. My commitment to building secure and maintainable solutions aligns with industry compliance standards, while my technical acumen ensures that testing processes integrate seamlessly with development cycles.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2012",
      "to_year": "2015",
      "location": "UK",
      "university": "University of Bristol"
    }
  ],
  "experience": [
    {
      "role": "Senior QA Engineer",
      "company": "EitBiz",
      "from_date": "Oct 2022",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "•\tImplemented and tested high-quality web applications using **JavaScript** (JS) and **TypeScript** (TS), focusing on API functionality in compliance with industry standards.\n•\tUtilized **Cypress** for end-to-end and integration testing, ensuring robust test coverage across multiple environments and enhancing application reliability by **30%**.\n•\tConducted performance testing and monitoring with **Grafana** and **Kibana** to identify bottlenecks, achieving a **20%** reduction in load times and improving user experience.\n•\tDesigned and enforced test strategies using **Playwright** and other testing frameworks to support continuous integration and delivery, streamlining deployment processes by **25%**.\n•\tMentored junior team members on best practices for testing and debugging, fostering a collaborative environment and improving overall team productivity.\n•\tDeveloped automated test scripts for relational databases to validate data integrity and performance, contributing to a **15%** improvement in data retrieval times.\n•\tImplemented A/B testing strategies to evaluate new features and improve user engagement metrics by **10%**, driving data-informed decision-making.\n•\tCollaborated with cross-functional teams to enhance the quality of web applications, maintaining high standards of object-oriented programming (OOP) and adherence to coding principles.\n•\tExecuted comprehensive regression testing to ensure consistent application functionality post-deployment, leading to a **40%** decrease in production issues."
    },
    {
      "role": "Software Engineer",
      "company": "Tvn S.A.",
      "from_date": "Oct 2019",
      "to_date": "Sep 2022",
      "location": "Poland",
      "responsibilities": "Conducted thorough **API** testing and validation of financial applications utilizing **Playwright** and **Cypress**, ensuring high-quality releases and smooth deployment cycles.\nMentored junior QA engineers, sharing best practices in **OOP** and advanced testing strategies to foster team skill development and enhance overall productivity.\nImplemented comprehensive test plans focusing on **Web** applications, resulting in a **30%** decrease in post-release defects and heightened user satisfaction.\nAnalyzed system performance and provided insights using **Kibana** and **Grafana**, aligning test strategies with operational metrics to improve system reliability in high-volume environments.\nExecuted **A/B Testing** frameworks to evaluate user interface changes, measuring impacts on user engagement with a focus on data-driven decisions.\nCollaborated closely with development teams to identify and rectify issues in **Relational Databases**, enhancing data integrity within applications.\nDesigned and executed automated test suites that supported the CI/CD pipeline initiatives, contributing to a **40%** reduction in manual testing efforts while increasing test coverage to **95%**.\nLeveraged **Firebase** in testing mobile application integrations, ensuring seamless user experiences across various platforms and devices.\nUtilized **Network Proxies** for accurate traffic simulations and debugging, leading to enhanced performance evaluations and issue resolutions."
    },
    {
      "role": "Software Engineer",
      "company": "Timspark",
      "from_date": "Sep 2015",
      "to_date": "Aug 2019",
      "location": "UK",
      "responsibilities": "Advanced QA methodologies to ensure the quality of web applications developed using **JavaScript (JS)** and **TypeScript (TS)** across multiple e-commerce platforms.\nExecuted comprehensive test automation strategies utilizing **Cypress** and **Playwright** for streamlined API and web testing, achieving a test coverage increase of **75%**.\nDeveloped and maintained API testing frameworks to validate backend services built with **Python** and **Node.js**, facilitating early bug detection and reducing release cycle times by **30%**.\nImplemented continuous monitoring and reporting using **Kibana** and **Grafana**, offering real-time insights into application performance and automated feedback loops for ongoing iterations.\nMentored junior QA engineers in best practices for **OOP** and test strategy execution, fostering a culture of quality and continuous improvement within the team.\nFacilitated A/B testing strategies to analyze feature performance, partnering closely with product teams to optimize user experiences based on empirical data.\nCollaborated on database testing strategies for **MongoDB**, **PostgreSQL**, and caching mechanisms, ensuring data integrity and performance under high load conditions in the production environment.\nDesigned and executed performance and stress testing scenarios to evaluate scalability, achieving a baseline throughput of **1000** transactions per minute without degradation in response times.\nEngaged in risk assessment and mitigation planning using structured test cases for critical features, enhancing the overall application resilience and preparedness for production deployments.\nLeveraged knowledge of **Network Proxies** to enhance testing in segmented environments, ensuring accurate simulation of user interactions and environment variables."
    }
  ],
  "skills": "Programming Languages:\n\tJavaScript, TypeScript\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular, Playwright, Cypress\n\n**API Technologies:**\n\tAPI, Web\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda), Azure (App Services)\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis, Relational Databases\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS (RDS, S3), Azure (Blob, SQL), Kibana, Grafana\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, Network Proxies, OOP, Mentorship, A/B Testing, Firebase",
  "apply_company": "OBRIO"
}