{
  "name": "Andrzej Ito",
  "role_name": "Senior Value Engineer",
  "email": "andrzej.ito@outlook.com",
  "phone": "+48 732 126 371",
  "address": "Rzeszów, Poland",
  "linkedin": "https://www.linkedin.com/in/andrzej-ito-2872a4391/",
  "profile_summary": "As a Senior Value Engineer, I leverage my expertise in strategic consulting, pre-sales, and business transformation to drive impactful business outcomes. With over 9 years of comprehensive experience, I excel in financial modeling, ROI, NPV, and TCO analyses, enabling organizations to make informed decisions. My strength in business process analysis and workshop facilitation allows me to effectively collaborate with cross-functional teams. Additionally, I possess strong communication, storytelling, and presentation skills to articulate technical concepts clearly. My commitment to design thinking enhances my approach to solving complex business challenges, ensuring that I deliver tailored solutions that prioritize user experience and performance.",
  "education": [
    {
      "degree": "Bachelor of Science",
      "category": "Computer Science",
      "from_year": "2010",
      "to_year": "2014",
      "location": "Osaka, Japan",
      "university": "Osaka University"
    }
  ],
  "experience": [
    {
      "role": "Senior Value Engineer",
      "company": "Allegro.pl",
      "from_date": "08/2022",
      "to_date": "",
      "location": "Poznan, Poland",
      "responsibilities": "• Conduct strategic consulting sessions to enhance business processes and drive transformation initiatives for clients.\n• Facilitate workshops aimed at identifying key business outcomes, ensuring alignment with financial goals like ROI and TCO.\n• Engage in pre-sales activities by developing compelling presentations and storytelling techniques to articulate value propositions effectively.\n• Utilize industry expertise to guide clients through financial modeling, including NPV assessments and business outcome discussions.\n• Enable sales strategies through effective communication, emphasizing the benefits of transformation services on business metrics.\n• Collaborate with cross-functional teams to assess and refine business processes, ensuring streamlined operations and enhanced client satisfaction.\n• Leverage design thinking principles to innovate solutions that address client pain points and drive measurable improvements."
    },
    {
      "role": "Software Engineer",
      "company": "Paypay Corporation",
      "from_date": "05/2017",
      "to_date": "07/2022",
      "location": "Tokyo, Japan",
      "responsibilities": "• Conducted **business process analysis** to identify key areas for **business transformation** and ROI improvement, leading to a **20%** increase in project efficiencies.\n• Facilitated **workshops** with cross-functional teams to leverage **strategic consulting** and align sales strategy with client needs, resulting in **15 successful project pitches**.\n• Developed financial models including **NPV** and **TCO** calculations that informed client decision-making and contributed to **$1M** in revenue growth.\n• Applied **design thinking** principles to craft compelling **presentations** and storytelling techniques that effectively communicated value propositions to stakeholders.\n• Engaged in **business outcome discussions** with clients, utilizing strong **communication** and **presentation skills** to build rapport and trust, enhancing client relationships.\n• Participated in **pre-sales** activities, collaborating with sales and technical teams to demonstrate the impact of technology solutions, including **React 12**, **Spring MVC**, and **AngularJS**, on business processes.\n• Effectively utilized **ChartJS** for interactive dashboards, improving data visibility for stakeholders and aiding data-driven decision-making.\n• Designed web applications that integrated leading frameworks like **Spring Boot** for Microservices and **Hibernate** for efficient data management.\n• Enhanced UI components using **HTML5**, **CSS3**, **JavaScript**, and **jQuery**, ensuring compatibility across **5 major browsers** while implementing **custom directives** in **Angular 12** and **13**."
    },
    {
      "role": "Software Engineer",
      "company": "Fujitsu Ltd",
      "from_date": "06/2014",
      "to_date": "04/2017",
      "location": "Tokyo, Japan",
      "responsibilities": "• Engaged in **strategic consulting** to enhance business transformation efforts, leveraging analytical skills and financial modeling techniques including **ROI**, **NPV**, and **TCO**.\n• Conducted thorough **business process analysis** and facilitated workshops to align stakeholder expectations and drive sales strategy.\n• Developed compelling **storytelling** and presented solutions to clients, highlighting the impact on business outcomes through effective communication and presentation skills.\n• Collaborated in high-level discussions focusing on diverse financial metrics and achieved a **15% increase** in project ROI through strategic initiatives.\n• Created web applications using **Spring MVC**, **jQuery**, **HTML**, **JavaScript**, **CSS**, and **Material UI**, ensuring functional user interfaces and robust performance.\n• Utilized **Node.js** for implementing CORS and developing REST services, streamlining data operations with a focus on efficiency.\n• Designed **SSIS packages** to successfully export data from flat file sources to **MS SQL Server**, optimizing data management practices.\n• Gained proficiency with **Bower**, **NPM**, **Git**, and cloud services such as **AWS**, **Azure**, **GCP**, and **Heroku**, enhancing deployment strategies across projects."
    }
  ],
  "skills": "strategic consulting, pre-sales, business transformation, financial modeling, ROI, NPV, TCO, business process analysis, workshop facilitation, sales strategy, communication, storytelling, presentation skills, industry expertise, design thinking, business outcome discussions, \n\n**Programming Languages**\n\tJava, C++, C#, Python, SQL, PLSQL, Kotlin, \n\n**Backend Frameworks**\n\tSpring, Spring Boot, Hibernate, Struts, JPA, Node.js, \n\n**Frontend Frameworks**\n\tReact, Vue, Angular, \n\n**API Technologies**\n\tSOAP, REST APIs, \n\n**Serverless and Cloud Functions**\n\tMicroservices, \n\n**Databases**\n\tMS SQL Server, Oracle, MongoDB, Rabbit MQ, PostgreSQL, Redis, \n\n**DevOps**\n\tSOLID, DRY, LINQ, \n\n**Cloud & Infrastructure**\n\t, \n\n**Other**\n\t",
  "apply_company": "Camunda"
}