{
  "name": "Mariusz Jan Skobel",
  "role_name": "Senior React Engineer",
  "email": "mariuszskobel15@outlook.com",
  "phone": "+48 735 343 548",
  "address": "Katowice, Poland",
  "linkedin": "https://www.linkedin.com/in/mariusz-skobel-927764397/",
  "profile_summary": "Accomplished Senior React Engineer with 10+ years of experience in delivering high-performance software solutions, specifically within healthcare and finance sectors. Expert in **React.js**, **TypeScript**, **JavaScript**, and modern front-end technologies, including **Redux**, **Zustand**, **Context API**, and web performance optimization techniques. Proven track record in implementing **Server-Side Rendering (SSR)** and **Static Site Generation (SSG)** strategies to enhance application performance.\n\nSeamlessly integrates **CI/CD** practices and automated testing frameworks to ensure robust, scalable, and maintainable applications. Adept at designing and developing **REST APIs** and **GraphQL** interfaces, while leveraging **Agile** methodologies to promote swift project delivery and efficient team communication. Fosters collaboration and drives clarity within the development process.\n\nBrings substantial experience in building cloud-native applications and enterprise platforms embedding AI/ML capabilities for real-time analytics. Supportive of compliance standards such as HIPAA and PCI DSS, with a commitment to developing secure solutions. Passionate about creating systems that provide measurable real-world impact while pushing the boundaries of technology.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2012",
      "to_year": "2015",
      "location": "UK",
      "university": "University of Bristol"
    }
  ],
  "experience": [
    {
      "role": "Senior React Engineer",
      "company": "EitBiz",
      "from_date": "Oct 2022",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Designed and implemented user-centric, high-performance front-end solutions leveraging **React.js** and **TypeScript**, ensuring optimal web performance and adherence to **SSR** and **SSG** practices for enhanced user experience, resulting in a **30%** improvement in load times.\n• Developed and maintained state management for React applications using **Redux**, achieving a **25%** reduction in application bugs through streamlined data flow and state handling.\n• Collaborated closely with backend teams to design and implement **REST APIs** and **GraphQL** endpoints that support efficient data retrieval, improving communication and integration across the stack.\n• Spearheaded automation in the development lifecycle utilizing CI/CD pipelines, with tools such as **GitHub Actions** and **CircleCI**, which led to a **40%** decrease in deployment times and increased code reliability.\n• Established automated testing frameworks using Jest and other tools, increasing test coverage to **95%**, significantly enhancing code stability and reducing regression issues in production.\n• Actively participated in Agile methodologies, holding regular communication with cross-functional teams to align project goals and deliverables, promoting a culture of collaboration and continuous improvement.\n• Implemented performance monitoring and optimization strategies to boost web applications, fostering a culture of accountability and responsiveness towards user feedback and metrics.\n• Mentored junior developers on best practices in React development and state management techniques, contributing to a **50%** increase in onboarding efficiency for new team members."
    },
    {
      "role": "Software Engineer",
      "company": "Tvn S.A.",
      "from_date": "Oct 2019",
      "to_date": "Sep 2022",
      "location": "Poland",
      "responsibilities": "Utilized **React (18)** and **TypeScript** to develop and optimize dynamic, user-focused front-end applications, enhancing user experience through effective state management with **Redux Toolkit** and **Tailwind CSS**.\nApplied best practices in **Web Performance Optimization**, achieving **load time reductions of up to 30%** for financial dashboards and admin portals, ensuring seamless user interaction.\nCollaborated in an **Agile** environment to deliver features and improvements efficiently, implementing **CI/CD** strategies that decreased deployment times by **40%**.\nImplemented **automated testing** frameworks, improving code reliability and reducing bug reports by **25%**, while maintaining exceptional communication with cross-functional teams.\nDesigned and developed scalable **REST APIs** and enhanced data fetching strategies using **GraphQL,** ensuring optimal performance and responsiveness in high-volume transactional systems.\nParticipated in server-side rendering (**SSR**) and static site generation (**SSG**) techniques to improve SEO and initial load performance of financial applications.\nContributed to the design and development of component libraries and design systems in collaboration with UX designers to maintain visual consistency and developer efficiency."
    },
    {
      "role": "Software Engineer",
      "company": "Timspark",
      "from_date": "Sep 2015",
      "to_date": "Aug 2019",
      "location": "UK",
      "responsibilities": "Develop and maintain robust frontend applications leveraging **React.js**, **TypeScript**, and **JavaScript**, ensuring seamless user experiences compliant with **Web Performance Optimization** standards across **9** key e-commerce modules.\nUtilize **Redux** and **Zustand** for state management to deliver high-performance, scalable applications integrated with **REST APIs** and **GraphQL** for data interactions, achieving a **30%** improvement in load times compared to previous implementations.\nImplement **SSR** (Server-Side Rendering) and **SSG** (Static Site Generation) techniques to enhance page load speed and SEO capabilities, contributing to a **15%** increase in organic traffic.\nConduct automated testing processes to ensure code quality and maintainability, leading to a **25%** reduction in post-release defects by employing CI/CD pipelines for rapid and reliable deployments.\nWork within an **Agile** environment, collaborating closely with cross-functional teams to refine project requirements, promote continuous improvements, and enhance communication across development cycles.\nMonitor and optimize web application performance, ensuring optimal load times and responsiveness through effective caching strategies and front-end optimization techniques.\nFoster strong communication with stakeholders to gather feedback and deliver high-quality products that meet functional and business requirements."
    }
  ],
  "skills": " **Programming Languages:**\n\tJavaScript, TypeScript, Python\n\n **Frontend Frameworks:**\n\tReact.js, React, Vue, Angular, Redux, Zustand, Context API\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n **API Technologies:**\n\tREST APIs, GraphQL\n\n **Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n **Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:**\n\tAWS, Azure\n\n **Other:**\n\tMLflow, Airflow, Kubeflow, JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, Web Performance Optimization, SSR, SSG, CI/CD, automated testing, Agile, communication",
  "apply_company": "INNOCV Solutions"
}