{
  "name": "Rei Taro",
  "role_name": "Senior ML Engineer",
  "email": "rei515@outlook.com",
  "phone": "+48732529451",
  "address": "Warszawa, Poland",
  "linkedin": "https://www.linkedin.com/in/rei-taro-81a410391/",
  "profile_summary": "Results-driven Senior ML Engineer with 10+ years of expertise in **machine learning**, **statistics**, and **optimization** applied to create robust ML pipelines and data engineering solutions. Proven ability to implement and optimize **programmatic advertising** strategies through effective **data structures** and **algorithms** while ensuring best practices in **production code** development. Experienced in collaborative **prototyping**, rigorous **testing**, and iterative development, contributing to successful projects in high-stakes environments with industry leaders such as VISA, Sii Poland, and Reply Polska. Proficient in creating high-performance APIs and automation tools leveraging **Python (FastAPI, Django, Flask)** and cloud technologies including **AWS** and **Azure**.",
  "education": [
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2010",
      "to_year": "2015",
      "location": "Japan",
      "university": "Keio University"
    }
  ],
  "experience": [
    {
      "role": "Senior ML Engineer",
      "company": "Leobit",
      "from_date": "Aug 2022",
      "to_date": "Present",
      "location": "Poland",
      "responsibilities": "Utilized statistical and optimization techniques to refine **machine learning** algorithms, enhancing predictive accuracy by **25%**.\nEngineered robust data structures and contributed to **data engineering** workflows, ensuring optimal data processing for model training.\nCollaborated effectively with cross-functional teams to integrate **programmatic advertising** solutions, improving acquisition strategies and user engagement by **30%**.\nDeveloped high-quality **production code** for NLP and computer vision applications, testing prototypes for scalability and performance.\nConducted rigorous testing and iterative development cycles, reducing bugs in **machine learning** models by **40%** before deployment.\nImplemented advanced **data structures** and algorithms to optimize data retrieval and processing, reducing computation time by **15%**.\nFacilitated collaboration by using version control tools and agile methodologies to ensure timely delivery of projects and adherence to best practices."
    },
    {
      "role": "Software Engineer",
      "company": "Innovature",
      "from_date": "Nov 2018",
      "to_date": "Jun 2022",
      "location": "Japan",
      "responsibilities": "Utilized strong collaboration skills to work with cross-functional teams, ensuring smooth system integration and successful release management for machine learning projects.\nImplemented data engineering techniques, focusing on **data structures** and **algorithms** to optimize data pipelines for efficient data flow.\nEmployed advanced machine learning techniques and statistical methods to prototype and test models, improving overall performance by **20%**.\nManaged production code quality through rigorous testing and iterative development processes, resulting in a **15%** reduction in deployment errors.\nDeveloped robust solutions using **FastAPI**, **Celery**, and **Redis** for efficient management of workflows and asynchronous processes.\nDesigned and maintained infrastructure on **Azure** App Services and **Terraform**, increasing deployment efficiency by **30%** while ensuring scalability.\nEngineered secure data exchange pipelines utilizing **Apache Airflow** and **Azure Functions** to facilitate regulatory compliance on financial data handling.\nConducted security audits and implemented **OAuth2** and **Azure AD B2C** for robust authentication, securing access controls in line with industry standards."
    },
    {
      "role": "Software Developer",
      "company": "Wizcorp",
      "from_date": "Apr 2015",
      "to_date": "Nov 2018",
      "location": "Japan",
      "responsibilities": "Applied advanced machine learning techniques and statistical analysis to optimize trading algorithms and enhance execution strategies.\nUtilized data structures and algorithms to design efficient solutions for data processing and feature extraction, significantly improving performance by **30%**.\nEngaged in collaborative discussions with cross-functional teams to prototype and refine trading models, facilitating iterative development cycles for rapid deployment.\nConducted rigorous testing and validation of machine learning models, ensuring robustness and accuracy in production code with comprehensive unit tests and integration testing frameworks like **PyTest**.\nImplemented data engineering best practices to design and maintain scalable data pipelines, utilizing **PostgreSQL** for data storage and retrieval.\nLeveraged programmatic advertising insights to inform model features, improving user targeting effectiveness by **25%**.\nEmbraced optimization strategies in model training processes, reducing computational overhead by leveraging **Python** and **Flask** in microservices for backend services.\n"
    }
  ],
  "skills": " **Programming Languages**\n\tPython (3.8+), SQL, Bash, JavaScript\n\n **Backend Frameworks**\n\tFastAPI, Flask, Django, Celery\n\n **Frontend Frameworks**\n\t\n\n **API Technologies**\n\tREST/gRPC APIs, Microservices, Kafka\n\n **Serverless and Cloud Functions**\n\tAWS (EC2, S3, Lambda), Azure\n\n **Databases**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n **DevOps**\n\tDocker, Kubernetes, GitHub Actions, Azure DevOps, CI/CD\n\n **Cloud & Infrastructure**\n\t\n\n **Other**\n\tmachine learning, statistics, optimization, programmatic advertising, data structures, algorithms, data engineering, production code, collaboration, prototyping, testing, iterative development, Pandas, NumPy, scikit-learn, TensorFlow, Airflow, MLflow, PyTest, Git",
  "apply_company": "StackAdapt"
}