{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior AI Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Results-driven Senior AI Engineer with 13+ years of experience in full-stack development, specializing in **Azure**, **Python**, and **MLOps**. Proficient in building and deploying microservices architecture and REST APIs, leveraging **Docker**, **Kubernetes**, and **CI/CD** practices to ensure reliable and scalable solutions. Expertise in implementing cloud-native applications and infrastructures on **Azure**, utilizing tools such as **Azure Functions**, **Azure ML**, **Cognitive Services**, and **Terraform** for effective deployment and orchestration.\nDemonstrated ability to develop AI/ML-driven platforms that facilitate automated retraining and monitoring, implementing AI best practices using frameworks like **FastAPI**, **Django**, and **Flask**. Strong background in compliance-driven development aligned with industry standards. Committed to delivering high-performance applications across diverse sectors, with specific experience in healthcare and financial industries.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior AI Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Developed and deployed efficient **Azure**-based AI solutions, implementing **Python** for robust backend services in alignment with **AI best practices**.\n- Designed and built scalable systems with **Microservices architecture** utilizing **Docker** and **Kubernetes** for container orchestration, achieving **99.9% uptime**.\n- Led the implementation of **CI/CD** pipelines using **Azure DevOps** and **Terraform** for infrastructure as code, reducing deployment time by **30%**.\n- Integrated **REST APIs** to facilitate communication between microservices, ensuring smooth data flow and usability across **C#** and **.NET** applications.\n- Developed and maintained MLOps workflows leveraging **Azure ML**, focusing on automated retraining and continuous improvement of AI models with an emphasis on monitoring.\n- Designed and executed advanced data pipelines for analysis of health and financial data, using **Kubernetes** for orchestration and **Azure Functions** for serverless processing.\n- Conducted performance evaluations of deployed models, optimizing them to achieve a **90% accuracy** rate in real-time predictions and reducing inference time by **25%**.\n- Collaborated with cross-functional teams to apply **Cognitive Services** for enrichment of data with intelligent features, enhancing user experience through personalized insights.\n- Implemented agile methodologies in project management, leading to improved team efficiency and collaboration across multidisciplinary teams.\n- Enhanced monitoring and logging solutions for **AI models**, employing tools such as **Azure Monitor** and custom dashboards to visualize performance metrics effectively."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Designed and implemented machine learning solutions following **AI best practices**, leveraging **Azure ML** for building and deploying models.\nAdvanced the infrastructure with **Docker** and **Kubernetes** for streamlined deployment and scaling of machine learning services, leading to a 50% reduction in deployment time.\nEstablished a robust **CI/CD** pipeline for continuous integration and delivery of machine learning models using **MLOps** methodologies, achieving a deployment success rate of 100% across **3** different environments.\nDeveloped REST APIs for model inference, ensuring smooth integration with existing systems and enabling live predictions for **5** critical business applications.\nAutomated retraining processes for machine learning models with **Azure Functions**, resulting in an increase of model accuracy by over **15%** through timely updates and feedback loops.\nMigrated legacy systems to **Microservices architecture** using **Python** and **C#** with **.NET**, enhancing system resilience and reducing downtime by **40%**.\nUtilized **Terraform** and **ARM templates** for infrastructure as code, ensuring consistent and reproducible environments across **3** cloud regions.\nExecuted efficient monitoring solutions that improved incident response times by **30%**, utilizing tools such as **Azure Monitor** and custom dashboards.\nLeveraged **Azure Cognitive Services** and **Azure OpenAI** to enrich applications with intelligent features, integrating features like natural language processing and automated responses for improved user experience."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "• Engineered and optimized scalable **Microservices** on Azure using **Python** and **C#** to enhance performance and availability across critical e-commerce workflows, resulting in a 30% reduction in latency.\n• Developed and maintained **REST APIs** and implemented **CI/CD** pipelines, ensuring seamless integration and deployment of 10+ features monthly with minimal downtime.\n• Leveraged **Azure ML** to integrate AI/ML capabilities, enhancing user experience through personalized recommendations and automating retraining processes, resulting in a 25% increase in conversion rates.\n• Implemented **Kubernetes** for orchestration of **Docker** containers, improving deployment speeds and maintaining high availability across services, achieving a 99.9% uptime.\n• Applied **Azure Functions** for event-driven solutions, enhancing application responsiveness and reducing costs by 20% as a result of optimized resource utilization.\n• Utilized **Azure OpenAI** and **Cognitive Services** to create intelligent features that respond to user behavior, significantly improving engagement metrics.\n• Monitored application performance with real-time metrics dashboards, employing automated alerts to preemptively address potential issues and maintain service reliability.\n• Utilized **Terraform** and **ARM templates** to automate infrastructure provisioning, version control, and compliance, facilitating rapid scalability as demand fluctuates.\n• Designed and developed secure, high-performance applications adhering to **AI best practices**, ensuring robust security controls such as RBAC and OAuth 2.0, achieving full compliance with GDPR regulations.\n• Collaborated closely with cross-functional teams to deliver solutions using **MLOps** methodologies, streamlining the development lifecycle and boosting team efficiency by 40%."
    }
  ],
  "skills": "**Programming Languages:**\n\tPython, C#, .NET\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django, Azure Functions\n\n**Frontend Frameworks:**\n\tJavaScript/TypeScript: React, Vue, Angular\n\n**API Technologies:**\n\tREST APIs\n\n**Serverless and Cloud Functions:**\n\tAzure Functions, AWS: Lambda\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, CI/CD\n\n**Cloud & Infrastructure:**\n\tAWS: ECS, RDS, S3, Azure: App Services, Blob Storage, SQL Database, ARM templates\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, MLOps, Monitoring, Automated retraining, AI best practices, Azure ML, Azure OpenAI, Cognitive Services, Keycloak (OIDC, RBAC), OAuth2, JWT, Nginx, Let’s Encrypt, Certbot, Microservices, Microservices architecture",
  "apply_company": "Quest Software"
}