{
  "name": "Tomasz Lee",
  "role_name": "Senior Operations Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Results-driven Senior Operations Engineer with 9+ years of comprehensive experience in DevOps practices and delivering scalable solutions across various environments. Proficient in **AWS**, **Terraform**, **Ansible**, **Kubernetes**, and CI/CD pipelines using **GitLab CI**. Strong background in monitoring and observability tools such as **Prometheus**, **Grafana**, and **CloudWatch**, ensuring high performance and security in cloud environments. Skilled in utilizing **Infrastructure as Code** strategies, optimizing cost, and managing incident response effectively. Proven track record of streamlining development processes and enhancing team collaboration for successful project delivery. Years of experience developing applications in **.NET**, **C#**, and frontend frameworks like **ReactJS** and **NextJS**, showcasing versatility in both application development and operational excellence.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Senior Operations Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Implemented Infrastructure as Code (IaC) strategies using **Terraform** to automate deployment processes across cloud environments.\nDesigned and maintained CI/CD pipelines in **GitLab CI** and **Azure DevOps**, achieving a **40%** reduction in deployment time.\nManaged container orchestration with **Kubernetes**, ensuring high availability and scaling of applications.\nAutomated operational tasks and configuration management using **Ansible**, improving efficiency in system provisioning and maintenance.\nMonitored system performance and health using **Prometheus** and **Grafana**, facilitating proactive incident response and minimizing downtime.\nConducted cloud security assessments implementing **AWS CloudWatch** for monitoring and an effective incident response plan, ensuring system integrity.\nUtilized **Helm** to manage Kubernetes applications, simplifying deployment and versioning for improved operational flow.\nAchieved cost optimization strategies through resource management and analysis, reducing overall cloud expenditures by **15%**.\nCollaborated with cross-functional teams to enhance platform reliability, resulting in improved service uptime by **30%**.\nEngaged in continuous improvement practices within the DevOps lifecycle, adhering to best practices and enhancing team productivity."
    },
    {
      "role": "Software Engineer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "Implemented **AWS** cloud solutions to enhance operational efficiency, achieving a **20%** reduction in infrastructure costs.\nUtilized **Terraform** for Infrastructure as Code (IaC) to automate provisioning and management of cloud resources, improving deployment speed by **40%**.\nDeveloped CI/CD pipelines using **GitLab CI** and **Argo CD**, resulting in a **30%** decrease in deployment times and production errors.\nManaged container orchestration with **Kubernetes**, ensuring scalable and reliable application deployments across multiple environments.\nAutomated configuration management with **Ansible**, streamlining key operational processes and reducing manual interventions by **50%**.\nMonitored system performance and resource utilization with **Prometheus** and **Grafana**, enabling timely alerts and improving system uptime to **99.9%**.\nImplemented cost optimization strategies on **AWS CloudWatch**, resulting in a **15%** reduction in unnecessary resource spending.\nConducted incident response drills and developed cloud security protocols, enhancing overall system security posture.\nCollaborated with cross-functional teams to define operational strategies, ensuring alignment with business goals and timely project executions.\nProvided mentorship to junior engineers on **DevOps** practices, fostering a culture of continuous improvement and professional growth."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "Implemented Infrastructure as Code (IaC) practices using **Terraform** to automate the provisioning of cloud resources, achieving a **30%** reduction in deployment time.\nManaged cloud infrastructure on **AWS** for scalable and secure operations, optimizing resource costs by **15%** through effective cost management strategies.\nDeveloped and maintained CI/CD pipelines using **GitLab CI** and **Argo CD**, resulting in a **40%** increase in deployment frequency and consistency.\nOrchestrated containerized applications with **Kubernetes**, enhancing system reliability and availability in production environments.\nConfigured monitoring and alerting solutions using **Prometheus** and **Grafana**, enabling real-time insights and reducing incident response times by **25%**.\nImplemented configuration management with **Ansible** to automate system updates and reduce manual errors across the infrastructure.\nCollaborated with development teams to ensure cloud security best practices, conducting regular audits to maintain compliance with organizational standards.\nParticipated in on-call rotations for incident response, leading proactive measures that improved uptime and system resilience.\nConducted training sessions on cloud security measures and operational processes, boosting team awareness and capability.\nDocumented operational procedures and infrastructure architecture, ensuring clarity and knowledge transfer across the team."
    }
  ],
  "skills": "  **Programming Languages**\n\tPython, JavaScript, TypeScript, C#, Solidity  \n\n  **Backend Frameworks**\n\tNodeJS, ExpressJS, NestJS, .NET, Entity Framework, Microservices  \n\n  **Frontend Frameworks**\n\tHTML, CSS, ReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS  \n\n  **API Technologies**\n\tRESTful API, GraphQL  \n\n  **Serverless and Cloud Functions**\n\tAWS  \n\n  **Databases**\n\tMSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB  \n\n  **DevOps**\n\tCI/CD, GitLab CI, Terraform, Ansible, Kubernetes, Helm, Argo CD, Prometheus, Grafana, CloudWatch, DevOps, Infrastructure as Code, Cloud Security, Incident Response, Cost Optimization  \n\n  **Cloud & Infrastructure**\n\tAWS, Azure  \n\n  **Other**\n\tUX/UI Design, Git, GitHub, Redux, Testing Tools: NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest, Apache Kafka, RabbitMQ, Redis, Blockchain: Ether.js, Web3.js, Ethereum",
  "apply_company": "Pagestreet"
}