{
  "name": "Tomasz Lee",
  "role_name": "Back-End Programmer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-477994390/",
  "profile_summary": "Results-driven Back-End Programmer with 9+ years of experience in backend development, proficient in **PHP**, **SQL**, and **APIs**. Strong foundation in object-oriented programming (OOP) principles, ensuring robust and scalable code using **SOLID** design patterns and clean architecture. Expertise in version control and development best practices, including TDD and DDD, to enhance code quality. Committed to using effective organizational and analytical skills to streamline workflows and contribute to cross-functional team efforts. Adept at fostering a collaborative environment while bringing a proactive attitude and good humor to the workplace, with a continuous desire to learn and share knowledge.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Back-End Programmer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Apr 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Utilized **PHP** and **SQL** to develop and maintain back-end functionalities, optimizing existing code for better performance.\nDesigned and implemented robust **APIs** ensuring seamless communication between front-end and back-end services, incorporating **REST** principles.\nAdhered to **OOP** principles and **SOLID** design patterns to improve code quality and maintainability across multiple projects.\nCollaborated with team members to apply **Version Control** using Git, ensuring efficient management of code changes and facilitating collaboration.\nCreated user-friendly interfaces with **HTML**, **CSS**, and **JavaScript**, enhancing the overall user experience.\nDeveloped and maintained a **WordPress** framework for client websites, implementing custom plugins and themes to meet specific business needs.\nEmployed **TDD** and **DDD** methodologies to ensure high-quality software delivery and design accuracy.\nApplied **Clean Architecture** principles to structure applications for better separation of concerns and testability.\nConducted thorough testing and debugging processes, demonstrating strong **Analytical Skills** to troubleshoot and resolve issues efficiently.\nUtilized strong **Organizational Skills** to manage multiple projects, ensuring timely deliverance and client satisfaction.\nExhibited a **Proactive Attitude** in learning new technologies and teaching concepts to team members, fostering a culture of continuous improvement.\nMaintained a positive team environment through **Teamwork** and **Good Humor**, promoting collaboration and effective communication among team members.\n"
    },
    {
      "role": "Full Stack Developer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "Developed and maintained robust **APIs** using **PHP** and **SQL**, ensuring efficient data access and integration with front-end applications.\nImplemented **OOP** principles and **Design Patterns** to enhance code reusability and maintainability, contributing to a cleaner codebase.\nUtilized **Version Control** tools to manage code changes, ensuring collaboration and version management across the development team.\nDesigned interactive web solutions leveraging **HTML**, **CSS**, and **JavaScript**, resulting in a 20% increase in user engagement.\nAdopted **TDD** and **DDD** methodologies to drive high-quality software development and improve test coverage to 85%.\nEmployed **Clean Architecture** patterns to structure projects for scalability and maintainability, reducing technical debt by 15%.\nConducted code reviews and mentorship, fostering a culture of collaboration and knowledge sharing among team members.\nDemonstrated strong **Analytical Skills** and **Organizational Skills** in project management, ensuring timely execution of tasks and milestones.\nMaintained a **Proactive Attitude** towards problem-solving and continuous learning, staying updated with the latest technologies and practices.\nFostered **Teamwork** by encouraging open communication and support, leading to a cooperative and enjoyable work environment."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "Implemented robust backend solutions using **PHP** and **SQL**, ensuring efficient data management and retrieval processes.\nDeveloped and integrated RESTful **APIs** to facilitate seamless communication between different systems and services.\nAdhered to **OOP**, **SOLID principles**, and **Design Patterns** while developing applications to enhance code maintainability and scalability.\nUtilized version control systems to manage project iterations, ensuring effective collaboration among team members and tracking changes throughout **version 2.1**.\nParticipated in a **Test-Driven Development (TDD)** approach to ensure high-quality code and reduce bugs in production.\nImproved existing codebase by applying **Domain-Driven Design (DDD)** principles, resulting in a more structured and manageable architecture.\nDesigned user interfaces with **HTML**, **CSS**, and **JavaScript**, ensuring an optimal user experience and compliance with modern web standards.\nContributed to the development of a new feature in a **WordPress** environment, enhancing the overall functionality and user engagement.\nCollaborated with cross-functional teams in daily standups, ensuring alignment on project objectives and fostering a proactive team environment.\nDocumented technical specifications and user guides to aid in knowledge transfer, improving team efficiency by **15%**."
    }
  ],
  "skills": " **Programming Languages**\n\tPHP, JavaScript, TypeScript, Python, C#, Solidity\n\n**Backend Frameworks**\n\tNodeJS, ExpressJS, NestJS, .NET\n\n**Frontend Frameworks**\n\tHTML, CSS, ReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n**API Technologies**\n\tRESTful API, GraphQL, APIs\n\n**Serverless and Cloud Functions**\n\t\n\n**Databases**\n\tMSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB, SQL\n\n**DevOps**\n\tAWS, Azure, CI/CD pipelines\n\n**Cloud & Infrastructure**\n\t\n\n**Other**\n\tGit, GitHub, Testing, TDD, DDD, Clean Architecture, Design Patterns, OOP, SOLID, Redux, NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest, Analytical Skills, Organizational Skills, Proactive Attitude, Teamwork, Good Humor, Desire to Learn, Desire to Teach"
}