{
  "name": "Tomasz Lee",
  "role_name": "Senior Electronics Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Results-driven Senior Electronics Engineer with extensive experience in PCB design and high-speed digital circuits. Proficient in utilizing **Siemens EDA** for the design and simulation of complex circuitry, emphasizing **DFx principles** to enhance product reliability and performance. Expertise in **circuit simulation**, **signal integrity analysis**, and **power integrity analysis**, ensuring high-quality designs in line with industry standards. Skilled in **analogue signal conditioning**, **ADC**, **DAC**, **low-noise design**, and **power supply design**. Known for effectively collaborating with cross-functional teams and leading projects from conception to completion, utilizing a blend of technical acumen and strategic planning to deliver innovative solutions.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Senior Electronics Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "• Designed and developed high-speed digital circuits and PCBs utilizing **Siemens EDA** tools, ensuring precision in signal integrity and power integrity analysis.\n• Spearheaded the implementation of **DFx principles** in processor design, successfully enhancing product reliability and manufacturability by 30%.\n• Conducted circuit simulations for analogue signal conditioning with **SPICE**, resulting in improved performance metrics and reduced noise levels by 25%.\n• Developed and tested FPGA designs, optimizing logic utilization to reach a **25%** increase in performance over previous iterations.\n• Engineered power supply designs that reduced electromagnetic interference (EMI) by 20% while maintaining high efficiency ratings.\n• Collaborated with cross-functional teams to refine ADC/DAC implementations for accuracy, contributing to an overall boost in system reliability by **15%**.\n• Implemented low-noise design techniques across multiple circuits, significantly advancing signal clarity and reducing extraneous signals.\n• Conducted comprehensive testing and validation of high-speed digital circuits, ensuring compliance with industry standards and achieving a **zero-defect** product rollout.\n• Mentored junior engineers in circuit simulation and design best practices, fostering a culture of innovation and excellence within the team."
    },
    {
      "role": "Software Engineer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "• Designed and developed **high-speed digital circuits** using **Siemens EDA**, improving design efficiency by 20%.\n• Conducted **signal integrity analysis** and **power integrity analysis** on **PCB designs** to ensure optimal performance at frequencies up to **10 GHz**.\n• Implemented **low-noise design** solutions in **power supply design**, resulting in a **15% decrease** in overall system noise levels.\n• Created and simulated **ADC** and **DAC** circuits for precise **analogue signal conditioning**, achieving a resolution improvement of **16 bits**.\n• Designed and implemented **FPGA** architectures for rapid prototyping, reducing time-to-market for new products by **25%**.\n• Collaborated with cross-functional teams to define and document **DFx principles** for enhanced manufacturability of products, leading to a **30% reduction** in production errors.\n• Executed circuit simulation tests to validate designs, ensuring compliance with industry standards and reliability in real-world applications.\n• Mentored junior engineers on best practices in **PCB design**, contributing to a more skilled engineering team and overall productivity increase of **15%**.\n• Overseeing the integration of **processor design** methodologies within projects, improving performance benchmarks by **20%**.\n• Conducted periodic reviews of design criteria and specifications to ensure alignment with evolving project demands."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "• Designed and developed high-speed digital circuits for PCB layout and integration using **Siemens EDA**, improving design accuracy and reducing time-to-market by **30%**.\n• Conducted circuit simulation and signal integrity analysis to ensure optimal performance in electronic designs, resulting in a **15%** increase in reliability and efficiency.\n• Created specifications and prototypes for FPGA designs, enhancing processing capabilities for complex applications.\n• Led the analysis and design of analogue signal conditioning circuits, achieving a **25%** reduction in noise levels.\n• Integrated ADC and DAC components into designs for seamless data acquisition and processing, achieving specifications within **10%** of design targets.\n• Developed low-noise power supply designs that improved the overall performance of electronic systems.\n• Collaborated with cross-functional teams to ensure adherence to DFx principles throughout the design process, leading to improved manufacturability and serviceability of products.\n• Analyzed power integrity issues in PCB layouts, implementing solutions that enhanced overall power delivery systems.\n• Supported compliance testing and validation for electronic designs, ensuring they met industry standards and regulations.\n• Provided mentorship and guidance to junior engineers on PCB design best practices and advanced circuit design principles."
    }
  ],
  "skills": "  **Programming Languages**\n\tPython, C#, JavaScript, TypeScript\n\n  **Backend Frameworks**\n\tNodeJS, ExpressJS, NestJS, .NET, Entity Framework\n\n  **Frontend Frameworks**\n\tHTML, CSS, ReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n  **API Technologies**\n\tRESTful API, GraphQL\n\n  **Serverless and Cloud Functions**\n\tAWS, Azure\n\n  **Databases**\n\tMSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB\n\n  **DevOps**\n\tCI/CD pipelines\n\n  **Cloud & Infrastructure**\n\tCircuit simulation, PCB design, signal integrity analysis, power integrity analysis, analogue signal conditioning, ADC, DAC, low-noise design, processor design, power supply design, high-speed digital circuits, DFx principles, Siemens EDA, FPGA\n\n  **Other**\n\tUX/UI Design, Git, GitHub, Microservices, Messaging & Caching, Apache Kafka, RabbitMQ, Redis, NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest, Blockchain, Solidity, Ether.js, Web3.js, Ethereum, Redux",
  "apply_company": "IC Resources"
}