{
  "name": "Rei Taro",
  "role_name": "Senior Unity Engineer",
  "email": "rei515@outlook.com",
  "phone": "+48732529451",
  "address": "Warszawa, Poland",
  "linkedin": "https://www.linkedin.com/in/rei-taro-81a410391/",
  "profile_summary": "Results-driven Senior Unity Engineer with over 10 years of experience in game development, specializing in **Unity**, **C#**, and **MonoBehaviours** to create immersive gaming experiences. Proficient in utilizing **ScriptableObjects**, **Prefabs**, and **Addressables** to optimize game assets and workflow efficiency. Skilled in **GoLang**, **Redis**, and **SQL** for backend support in gaming applications, alongside expertise in **Docker**, **CI/CD**, and performance optimization strategies. Acclaimed for strong problem-solving abilities and effective collaboration and communication skills, contributing to successful projects within leading organizations.",
  "education": [
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2010",
      "to_year": "2015",
      "location": "Japan",
      "university": "Keio University"
    }
  ],
  "experience": [
    {
      "role": "Senior Unity Engineer",
      "company": "Leobit",
      "from_date": "Aug 2022",
      "to_date": "Present",
      "location": "Poland",
      "responsibilities": "Demonstrated expertise in **Unity** and **C#** to create innovative game solutions and mechanics, enhancing user experience and engagement.\nUtilized **ScriptableObjects** and **Prefabs** to design modular and maintainable game assets, ensuring faster development cycles.\nImplemented **CI/CD** practices for game deployments, resulting in a **30%** reduction in release time.\nLeveraged **Redis** for in-memory data storage, improving game performance by **50%** and enabling real-time game state management.\nDesigned and executed performance optimization strategies, decreasing load times by **25%** and enhancing overall player retention.\nCollaborated effectively with cross-functional teams to troubleshoot issues and refine game features, showcasing strong **communication** and **problem-solving** skills.\nEngaged in continuous learning and applied knowledge of **GoLang** and **Docker** to enhance backend services relevant to gaming architectures."
    },
    {
      "role": "Software Engineer",
      "company": "Innovature",
      "from_date": "Nov 2018",
      "to_date": "Jun 2022",
      "location": "Japan",
      "responsibilities": "Utilized **C#** and **Unity** to develop and optimize game features and mechanics, enhancing user experience and engagement by **30%**.\nImplemented **MonoBehaviours** and **ScriptableObjects** to create reusable game components, improving code maintainability and reducing development time by **25%**.\nDesigned and deployed game assets using **Prefabs** and **Addressables**, ensuring efficient loading and memory management across various game levels.\nCollaborated with cross-functional teams to refine game design and mechanics, ensuring high-quality delivery and alignment with project goals.\nLeveraged **CI/CD** pipelines to automate testing and deployment processes, reducing release cycle times by **40%**.\nApplied **Redis** caching strategies to enhance game performance, resulting in smoother gameplay experiences and reduced latency.\nConducted regular performance optimizations and problem-solving sessions, addressing issues in real time to maintain seamless player interactions.\nIntegrated **Docker** for consistent development and production environments, streamlining onboarding processes for new team members."
    },
    {
      "role": "Software Developer",
      "company": "Wizcorp",
      "from_date": "Apr 2015",
      "to_date": "Nov 2018",
      "location": "Japan",
      "responsibilities": "Utilized **C#** and **Unity** to develop game components, optimizing performance for enhanced user experiences through efficient **MonoBehaviours** and **ScriptableObjects**.\nEngineered robust backend services using **GoLang**, **Redis**, and **SQL** for data management, resulting in a performance increase of **25%** in game loading times.\nImplemented **Docker** for consistent application deployment, contributing to a **30%** reduction in environment-related issues.\nCollaborated with cross-functional teams to integrate user feedback into game features, improving overall user satisfaction scores by **15%**.\nEnhanced game performance through rigorous profiling and profiling tools, ensuring smooth gameplay at frame rates exceeding **60 FPS**.\nPioneered CI/CD pipelines to automate testing and deployment processes, achieving a **40%** decrease in time spent on manual deployments.\nLeveraged **Redis** for real-time data storage and retrieval solutions, significantly improving the scalability of multiplayer environments."
    }
  ],
  "skills": " **Programming Languages**\n\t Python (3.8+), SQL, Bash, JavaScript, C#, GoLang\n\n **Backend Frameworks**\n\t FastAPI, Flask, Django, Celery\n\n **Frontend Frameworks**\n\t Unity\n\n **API Technologies**\n\t REST/gRPC APIs, Microservices\n\n **Serverless and Cloud Functions**\n\t AWS (EC2, S3, Lambda), Azure\n\n **Databases**\n\t PostgreSQL, MySQL, MongoDB, Redis\n\n **DevOps**\n\t Docker, Kubernetes, GitHub Actions, Azure DevOps, CI/CD\n\n **Cloud & Infrastructure**\n\t AWS, Azure\n\n **Other**\n\t Game Development, MonoBehaviours, ScriptableObjects, Prefabs, Addressables, Performance Optimization, Problem Solving, Collaboration, Communication, Pandas, NumPy, scikit-learn, TensorFlow, Airflow, MLflow, Kafka, PyTest, Git",
  "apply_company": "Limit Break"
}