{
  "name": "Rei Taro",
  "role_name": "Senior Intune Engineer / Intune & Autopilot Lead",
  "email": "rei515@outlook.com",
  "phone": "+48732529451",
  "address": "Warszawa, Poland",
  "linkedin": "https://www.linkedin.com/in/rei-taro-81a410391/",
  "profile_summary": "Results-driven Senior Intune Engineer with over 10 years of experience in managing mobile device ecosystems, specializing in **Microsoft Intune**, **Autopilot**, and **Mobile Device Management (MDM)** solutions. Expertise in **iOS device management** and **JAMF**, ensuring seamless device lifecycle management and compliance. Proven ability to lead change management initiatives and service ownership to optimize IT operations. Strong documentation skills complemented by effective English communication, facilitating collaboration across diverse teams. Additionally, adept at backend system design and API development, with a robust background in **Python (FastAPI, Django, Flask)** and cloud technologies including **AWS** and **Azure**, gained from impactful roles at industry leaders like VISA and Reply Polska.",
  "education": [
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2010",
      "to_year": "2015",
      "location": "Japan",
      "university": "Keio University"
    }
  ],
  "experience": [
    {
      "role": "Senior Intune Engineer / Intune & Autopilot Lead",
      "company": "Leobit",
      "from_date": "Aug 2022",
      "to_date": "Present",
      "location": "Poland",
      "responsibilities": "Managed Microsoft Intune and Autopilot for efficient device lifecycle management, ensuring seamless deployment and updates for **10,000+** devices.\nImplemented iOS device management strategies utilizing **JAMF** and **MDM**, enhancing mobile device security and compliance.\nDeveloped comprehensive documentation for device management processes and change management activities, increasing team efficiency by **25%**.\nOversaw the entire Windows device lifecycle, including provisioning, configuration, and ongoing support, ensuring alignment with organizational standards.\nLed change management initiatives aligned with business objectives, contributing to a **30%** reduction in deployment issues.\nAchieved high service ownership standards through proactive monitoring and support of Intune-managed devices, ensuring optimal system performance.\nCommunicated effectively in English with cross-functional teams to facilitate collaboration and address challenges in device management and deployment."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Innovature",
      "from_date": "Nov 2018",
      "to_date": "Jun 2022",
      "location": "Japan",
      "responsibilities": "Managed and implemented **Microsoft Intune** and **Autopilot**, ensuring seamless **Windows device lifecycle** management across 1500+ devices.\nDrove **iOS device management** strategies, enhancing security and compliance for mobile devices, successfully managing 300+ devices utilizing **JAMF** and **Mobile Device Management (MDM)** solutions.\nLed **change management** initiatives to improve system efficiency by **25%**, focusing on detailed **documentation skills** to create comprehensive process guides for team members.\nProvided **service ownership** by acting as the main point of contact for incidents and requests, maintaining a **90%** customer satisfaction rate.\nFacilitated clear **English communication** channels across cross-functional teams to streamline deployment processes, contributing to a **40%** reduction in deployment time for new devices.\nReviewed and optimized existing workflows to ensure compliance with corporate policies, resulting in successful audits with zero non-compliance issues."
    },
    {
      "role": "Software Developer",
      "company": "Wizcorp",
      "from_date": "Apr 2015",
      "to_date": "Nov 2018",
      "location": "Japan",
      "responsibilities": "Managed and implemented device lifecycle strategies for **Windows devices** using **Microsoft Intune** and **Autopilot**, ensuring a seamless user experience.\nAdministered **iOS device management** solutions via **JAMF**, enhancing the efficiency of mobile device management (**MDM**) practices across organizational environments.\nLed change management initiatives to optimize the adoption of **Microsoft Intune**, resulting in a **25%** increase in operational efficiency.\nCreated and maintained comprehensive documentation on device management processes and configurations that improved team communication and training by **40%**.\nConducted regular assessments and updates of **MDM** policies to ensure compliance with best practices and regulatory standards, achieving a compliance rate of **100%**.\nOversaw service ownership duties for mobile and desktop devices, facilitating problem resolution and ensuring high service availability for end-users.\nCollaborated cross-functionally to deliver effective communication strategies in English, improving stakeholder engagement during project implementation."
    }
  ],
  "skills": " \n\n**Programming Languages**\n\tPython (3.8+), SQL, Bash, JavaScript\n\n**Backend Frameworks**\n\tFastAPI, Flask, Django, Celery\n\n**Frontend Frameworks**\n\t\n\n**API Technologies**\n\tREST/gRPC APIs, Microservices\n\n**Serverless and Cloud Functions**\n\tAWS (EC2, S3, Lambda), Azure\n\n**Databases**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps**\n\tDocker, Kubernetes, GitHub Actions, Azure DevOps, CI/CD, PyTest, Git\n\n**Cloud & Infrastructure**\n\t\n\n**Other**\n\tMicrosoft Intune, Autopilot, iOS device management, JAMF, Mobile Device Management (MDM), Windows device lifecycle, Documentation skills, Change management, Service ownership, English communication, AI/ML Tools: Pandas, NumPy, scikit-learn, TensorFlow, Airflow, MLflow, Kafka"
}