{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior DFM Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Senior DFM Engineer with 13+ years of experience in CNC, 3D Printing, and SolidWorks, specializing in Design for Manufacturing (DFM) and product development processes. Adept at applying GD&T principles to optimize mechanical designs for manufacturability and efficiency, with a strong focus on material selection and sheet metal fabrication.\nSkilled in troubleshooting and problem-solving, effectively collaborating with cross-functional teams to enhance production processes and ensure customer satisfaction. Experienced in advanced manufacturing techniques including EDM, grinding, honing, lapping, welding, press brake, laser cutting, waterjet cutting, and stamping. \nProven track record in managing design projects and implementing best practices in manufacturing, demonstrating strong communication skills, adaptability, and a customer-focused approach.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior DFM Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Applied technical expertise in **SolidWorks** for designing and modeling complex components and assemblies, ensuring precision and manufacturability in accordance with **DFM** (Design for Manufacturing) principles.\nUtilized CNC machinery for producing high-fidelity parts, implementing best practices in **sheet metal** fabrication and **laser cutting** techniques to enhance production efficiency by **30%**.\nEmployed **GD&T** (Geometric Dimensioning and Tolerancing) for accurate specifications, facilitating cross-functional collaboration and minimizing errors in **welding**, **grinding**, and **EDM** processes.\nConducted thorough material selection processes to optimize performance and cost, leveraging knowledge in **honing**, **lapping**, and **waterjet cutting** technologies to align with project requirements.\nParticipated in the continuous improvement of manufacturing processes by identifying and solving production challenges, achieving a **25%** reduction in cycle times through effective **troubleshooting** and problem-solving strategies.\nCollaborated closely with multidisciplinary teams to communicate project specifications and provide technical support, fostering a **customer-focused** approach and ensuring successful project delivery within budget and time constraints.\nDeveloped and maintained process documentation for various manufacturing stages, enabling adaptability and quick onboarding of new team members with a clear focus on quality and compliance.\nLed workshops on best practices for manufacturing techniques, enhancing team skills in **stamping** and effective **press brake** operations, contributing to overall team performance and morale.\nImplemented feedback mechanisms to continuously gather insights from production teams, promoting a culture of **collaboration** and driving innovation in manufacturing techniques."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Ensured effective collaboration and communication among cross-functional teams to drive design for manufacturability (DFM) initiatives, enhancing overall product quality by **25%**.\nUtilized **SolidWorks** for 3D modeling and simulation, resulting in a **15%** reduction in design iteration time and improving project turnaround.\nApplied **GD&T** principles to enhance manufacturing accuracy and compliance, leading to a **20%** decrease in production errors.\nConducted thorough material selection and evaluation, leveraging knowledge in sheet metal processes and techniques to optimize cost and performance.\nLed troubleshooting sessions to address manufacturing challenges, employing problem-solving strategies to reduce downtime by **30%**.\nImplemented advanced fabrication techniques, including **laser cutting**, **waterjet cutting**, and **EDM**, which enhanced production efficiency by **40%**.\nPioneered welding and stamping processes to improve product durability, resulting in an increase in customer satisfaction metrics by **35%**.\nFostered a customer-focused approach in product development, ensuring alignment with client specifications and expectations through effective adaptability and collaboration."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Utilized **SolidWorks** for 3D modeling and design validation, ensuring optimal design for manufacturability (DFM) across **9** product lines.\nApplied **GD&T** principles to ensure precise component specifications, enhancing product quality and reducing manufacturing defects by **15%**.\nExecuted CNC machining and **3D printing** techniques to streamline prototyping processes, reducing lead time by **25%** and elevating production efficiency.\nOversaw welding and **sheet metal** fabrication processes, collaborating closely with cross-functional teams on production schedules and compliance with engineering standards.\nImplemented **EDM**, grinding, honing, and lapping techniques to achieve superior surface finishes, resulting in performance improvements of components by up to **30%**.\nManaged material selection processes tailored to specific project requirements, ensuring optimal performance and cost-effectiveness across diverse manufacturing scenarios.\nConducted troubleshooting and problem-solving sessions with engineering and production teams to address production challenges, leading to a **20%** reduction in downtime.\nFacilitated effective communication and collaboration within multi-disciplinary teams to enhance workflow efficiency and project completion timelines, maintaining a customer-focused approach throughout.\nDemonstrated adaptability in high-pressure environments, successfully navigating changes in project scope and urgency while delivering high-quality engineering solutions."
    }
  ],
  "skills": "**Programming Languages:**\n\tPython: FastAPI, Flask, Django\n\tJavaScript/TypeScript: React, Vue, Angular\n\n**Backend Frameworks:**\n\n**Frontend Frameworks:**\n\n**API Technologies:**\n\n**Serverless and Cloud Functions:**\n\tAWS: ECS, Lambda, RDS, S3\n\tAzure: App Services, Blob Storage, SQL Database\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare)\n\tMongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes\n\tGitHub Actions, GitLab CI/CD\n\tTerraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\n**Other:**\n\tCNC\n\t3D Printing\n\tSolidWorks\n\tDFM\n\tGD&T\n\tsheet metal\n\tEDM\n\tgrinding\n\thoning\n\tlapping\n\tmaterial selection\n\twelding\n\tpress brake\n\tlaser cutting\n\twaterjet cutting\n\tstamping\n\ttroubleshooting\n\tcommunication\n\tcollaboration\n\tproblem-solving\n\tadaptability\n\tcustomer-focused",
  "apply_company": "Xometry"
}