{
  "name": "Andrzej Ito",
  "role_name": "Monitoring Engineer",
  "email": "andrzej.ito@outlook.com",
  "phone": "+48 732 126 371",
  "address": "Rzeszów, Poland",
  "linkedin": "https://www.linkedin.com/in/andrzej-ito-2872a4391/",
  "profile_summary": "As a Monitoring Engineer with over 9 years of experience, I specialize in Web Technologies and have a strong background in building and supporting web applications. I am skilled in **Linux** administration, **troubleshooting**, and logs parsing, ensuring high performance and availability. Proficient in **API** development and integration, I excel in **HTTP** protocols and **TCP/IP** communications. My ability to quickly learn and multitask allows me to adapt to various technical challenges while providing exceptional support. Additionally, I have strong communication skills, fluent in both English and Ukrainian, and a proven track record of mentoring teams and driving technical excellence in all my projects.",
  "education": [
    {
      "degree": "Bachelor of Science",
      "category": "Computer Science",
      "from_year": "2010",
      "to_year": "2014",
      "location": "Osaka, Japan",
      "university": "Osaka University"
    }
  ],
  "experience": [
    {
      "role": "Monitoring Engineer",
      "company": "Allegro.pl",
      "from_date": "08/2023",
      "to_date": "",
      "location": "Poznan, Poland",
      "responsibilities": "• Monitor and troubleshoot web applications with a focus on **HTTP** and **TCP/IP** protocols, ensuring high availability and performance.\n• Utilize **Linux** environments for web technology support and maintenance, including logs parsing and system administration.\n• Collaborate and communicate effectively with cross-functional teams, employing strong communication skills in both English and Ukrainian.\n• Create and maintain scripts for automating monitoring tasks, enhancing efficiency and support capabilities.\n• Analyze application performance metrics, providing insights and recommendations for optimization.\n• Quickly learn and adapt to new **Web Technologies** and tools, staying updated on industry trends.\n• Handle multi-tasking scenarios effectively to support multiple applications and resolve issues in a timely manner.\n• Develop and deploy monitoring solutions to enhance the functionality of web applications and ensure compliance with service level agreements (SLAs)."
    },
    {
      "role": "Full Stack Developer",
      "company": "Paypay Corporation",
      "from_date": "05/2017",
      "to_date": "07/2023",
      "location": "Tokyo, Japan",
      "responsibilities": "- Developed and supported **web applications** using modern frameworks to ensure seamless operation and user experience.\n- Utilized **HTTP** protocols and created **APIs** for effective communication between services, enhancing data interchange capabilities.\n- Monitored and troubleshooted application issues in a **Linux** environment, enhancing system reliability and performance by resolving **TCP/IP** issues.\n- Analyzed and parsed logs to identify anomalies and improve application functionality, ensuring better support and administration.\n- Implemented effective **scripting** solutions to automate monitoring tasks, aiming for **quick resolution** of support requests.\n- Integrated multilingual support for functional applications, showcasing **English** and **Ukrainian proficiency** in documentation and communication.\n- Leveraged excellent **communication skills** to provide assistance and support to team members and stakeholders, while multitasking effectively.\n- Engaged in continuous learning and application of troubleshooting techniques to enhance personal and team proficiency in monitoring operations."
    },
    {
      "role": "Full Stack Developer",
      "company": "Fujitsu Ltd",
      "from_date": "06/2014",
      "to_date": "04/2017",
      "location": "Tokyo, Japan",
      "responsibilities": "• Monitored and troubleshot web applications built with **Spring MVC**, **jQuery**, and **AJAX** controls to ensure optimal performance and reliability.\n• Developed and maintained **API** integrations that facilitated seamless communication across systems, leveraging **Node.js** and **Express**.\n• Utilized **Linux** environments for server management and configuration, ensuring robust system administration and maintenance.\n• Employed scripting techniques to automate logs parsing and enhance operational efficiency, reducing manual efforts by **30%**.\n• Implemented and supported **CMS** solutions to manage content effectively, collaborating with cross-functional teams to gather requirements and deliver features.\n• Communicated technical concepts clearly in both English and Ukrainian, enhancing collaboration and support across diverse teams.\n• Managed HTTP requests and optimized TCP/IP configurations to improve network performance metrics by **20%**.\n• Demonstrated quick learning and multitasking abilities in a fast-paced environment, delivering projects on time and within budget while adhering to best practices in **web technologies**.\n• Engaged with stakeholders to troubleshoot and resolve issues, ensuring a high standard of operational support."
    }
  ],
  "skills": "Web Technologies, web applications, CMS, Java, C++, C#, Python, SQL, PLSQL, Spring, Spring Boot, Hibernate, Struts, JPA, Kotlin, Node.js, React, Vue, Angular, SOLID, DRY, LINQ, Linux, troubleshooting, HTTP, API, TCP/IP, MS SQL Server, Oracle, MongoDB, Rabbit MQ, PostgreSQL, Redis, SOAP, REST APIs, Microservices, communication skills, English proficiency, Ukrainian proficiency, support, administration, logs parsing, scripting, quick learning, multitasking"
}