{
  "name": "DANIEL HE",
  "role_name": "Senior Frontend Engineer",
  "email": "daniel.he8@outlook.com ",
  "phone": "+48 730 743 032",
  "address": "Rzeszów, Poland",
  "linkedin": "https://www.linkedin.com/in/daniel-he-9189a3390/",
  "profile_summary": "Results-driven Senior Frontend Engineer with expertise in **Vue.js**, **React**, and **GraphQL** for crafting dynamic and responsive user interfaces. Demonstrated proficiency in **JavaScript**, **HTML**, and **CSS**, alongside strong capabilities in **Automated Testing**, **CI/CD**, and **Performance Optimization**. Experienced in implementing accessibility standards and responsive designs, ensuring user-centric applications that perform efficiently. Skilled in microservice architectures and utilizing cloud services effectively. Proven track record in driving project success through leadership, collaboration, and project management, while maintaining a commitment to clean and efficient code across diverse sectors including healthcare, eCommerce, and finance.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2012",
      "to_year": "2016",
      "location": "Beijing, China ",
      "university": "Tsinghua University "
    }
  ],
  "experience": [
    {
      "role": "Senior Frontend Engineer",
      "company": "Britenet",
      "from_date": "Feb 2023 ",
      "to_date": "Present",
      "location": "Warsaw, Poland",
      "responsibilities": "Leveraged expertise in **React** and **JavaScript** to enhance UI/UX for the pathway builder, achieving a **30%** reduction in completion time.\nImplemented **GraphQL** for efficient data retrieval, optimizing performance and speeding up frontend interactions by **40%**.\nApplied **CI/CD** techniques integrating **Git** and **GitHub Actions**, which led to a **80%** reduction in deployment times.\nExecuted automated testing frameworks to ensure software reliability and adherence to accessibility standards, improving overall product quality.\nUtilized **Microservice Architectures** to design scalable frontend solutions, enhancing modularity and maintainability across the codebase.\nCollaborated effectively with cross-functional teams to deliver features on time, fostering a culture of leadership and collaboration.\nChampioned best practices in responsive design, ensuring applications are fully accessible on various devices while maintaining performance.\nContributed to the development of a performance optimization strategy utilizing tools and methods that increased application efficiency by over **30%**."
    },
    {
      "role": "Software Engineer",
      "company": "Alibaba Group",
      "from_date": "Oct 2020 ",
      "to_date": "Dec 2022",
      "location": "Hangzhou, China",
      "responsibilities": "• Developed scalable and optimized frontend applications using **Vue.js**, enhancing user experience and responsiveness with a performance increase of 20%.\n• Collaborated with backend engineers to create a robust API using **GraphQL** that improved data retrieval efficiency by 30%.\n• Implemented automated testing strategies utilizing **Jest** and **Cypress**, achieving a 95% test coverage rate.\n• Led CI/CD pipeline development with **Git**, ensuring seamless integration and delivery across platforms, reducing deployment times by 40%.\n• Ensured compliance with **Accessibility Standards** and best practices in **Responsive Design**, resulting in a 15% increase in user engagement.\n• Managed project timelines and deliverables effectively through agile methodologies, achieving 100% on-time delivery for 12 major releases.\n• Spearheaded an initiative to adopt **Microservice Architectures**, contributing to a 35% decrease in system downtime.\n• Fostered collaboration among team members using tools like **Slack** and **Trello**, enhancing productivity in a remote work setting."
    },
    {
      "role": "Software Engineer ",
      "company": "Huawei Technologies Co., Ltd",
      "from_date": "May 2016 ",
      "to_date": "Sep 2020",
      "location": "Shenzhen, China ",
      "responsibilities": "Developed responsive and accessible web applications utilizing **Vue.js** and **React**, ensuring compliance with accessibility standards.\nImplemented **GraphQL** for efficient data fetching, leading to an improvement in performance optimization by **30%**.\nUtilized **JavaScript**, **HTML**, and **CSS** to enhance UI/UX, contributing to a **40%** increase in overall application load times.\nApplied automated testing practices with **Git**, improving collaboration and reducing cycle time in project management by **25%**.\nExecuted CI/CD pipelines for seamless integration and deployment, maximizing team productivity in a remote work environment.\nLed a team of developers, fostering collaboration and effective communication, which boosted team performance.\nAdhered to microservice architectures ensuring scalable solutions for multiple projects."
    }
  ],
  "skills": " **Programming Languages**\n\tJava, JavaScript, Python, Go, SQL, Swift, Kotlin, Ruby on Rails\n\n**Frontend Frameworks**\n\tReact, Vue.js, Angular, Pixi.js, Next.js, Redux, D3.js, Material-UI, Ant Design\n\n**Backend Frameworks**\n\tSpring Boot, Spring Security, Hibernate, Node.js, Express.js, JPA, Kafka, RabbitMQ\n\n**API Technologies**\n\tRESTful API design, GraphQL, API Gateway\n\n**Serverless and Cloud Functions**\n\tAWS Lambda\n\n**Databases**\n\tMySQL, PostgreSQL, Redis, MongoDB\n\n**DevOps**\n\tDocker, Kubernetes, Jenkins, GitHub Actions, Terraform, AWS CodePipeline\n\n**Cloud & Infrastructure**\n\tAWS (EKS, RDS, CloudFront, S3), CloudWatch, ELK Stack\n\n**Other**\n\tMicroservices, Automated Testing, CI/CD, Infrastructure as Code (IaC), Accessibility Standards, Performance Optimization, Responsive Design, Agile/Scrum methodologies, Data structures and algorithms, Leadership, Collaboration, Project Management, Remote Work"
}