{
  "name": "Rei Taro",
  "role_name": "Senior EUC Engineer",
  "email": "rei515@outlook.com",
  "phone": "+48732529451",
  "address": "Warszawa, Poland",
  "linkedin": "https://www.linkedin.com/in/rei-taro-81a410391/",
  "profile_summary": "Results-driven Senior EUC Engineer with over 10 years of experience in **Identity Access Management**, **Endpoint Protection**, and **Enterprise Security**. Highly skilled in **Microsoft Azure**, **Amazon AWS**, and **Google GCP**, ensuring robust cloud solutions and server management. Proven expertise in deploying **Mobile Device Management** and **Desktop Virtualization** solutions while maintaining a focus on **Zero Trust** security architecture. Strong relationship-building skills, excellent presentation capabilities, and adept time management enable effective communication across teams. Experienced in developing and executing automation tools and API services using **Python** (FastAPI, Django, Flask) while ensuring seamless integration with **SaaS** platforms. Demonstrated success collaborating with industry leaders such as VISA, Sii Poland, and Reply Polska.",
  "education": [
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2010",
      "to_year": "2015",
      "location": "Japan",
      "university": "Keio University"
    }
  ],
  "experience": [
    {
      "role": "Senior EUC Engineer",
      "company": "Leobit",
      "from_date": "Aug 2022",
      "to_date": "Present",
      "location": "Poland",
      "responsibilities": "Implemented **Identity Access Management** and **Zero Trust** strategies to enhance desktop and mobile user security, ensuring an environment of **Enterprise Security** across systems.\nEngineered backend solutions utilizing **Microsoft Azure** and **Amazon AWS** for desktop virtualization, directly improving user experience and operational efficiency by **30%**.\nEmployed **Microsoft Intune** and **Ivanti** for effective mobile device management, achieving a **99%** compliance rate in device security protocols.\nConducted security assessments and integrated **Endpoint Protection** measures across **5 major platforms**, ensuring robust system integrity and user trust.\nCollaborated with cross-functional teams using strong **Communication** and **Relationship Building** skills to effectively address system integration challenges and release strategies.\nDelivered presentations on automation workflows and security frameworks, demonstrating strong **Presentation Skills** to stakeholders and decision-makers.\nManaged project timelines efficiently through exemplary **Time Management** skills, resulting in the timely delivery of all initiatives by an average of **15 days ahead of schedule**."
    },
    {
      "role": "Software Engineer",
      "company": "Innovature",
      "from_date": "Nov 2018",
      "to_date": "Jun 2022",
      "location": "Japan",
      "responsibilities": "• Implemented **Azure** and **AWS** solutions to enhance **Enterprise Security** and optimize **Identity Access Management**, ensuring robust security across environments.\n• Developed and integrated **Zero Trust** security protocols, significantly reducing vulnerabilities and improving overall **Endpoint Protection**.\n• Spearheaded the adoption of **Microsoft Intune** and **OmniSaaS Workspace ONE** for efficient **Desktop Management** and **Mobile Device Management**, achieving a **40%** reduction in device provisioning time.\n• Managed the deployment of virtual desktop infrastructure (VDI) solutions, improving the accessibility of corporate applications and enhancing user experience with a **99.9%** uptime.\n• Conducted presentations on security strategy and compliance, building effective relationships with stakeholders to align security practices across departments.\n• Implemented time management strategies for project delivery, ensuring on-time completion of security audits and system upgrades.\n• Collaborated with engineering teams to identify potential security risks, implementing solutions that increased system resilience by **25%**."
    },
    {
      "role": "Software Developer",
      "company": "Wizcorp",
      "from_date": "Apr 2015",
      "to_date": "Nov 2018",
      "location": "Japan",
      "responsibilities": "• Ensured enterprise security and compliance by implementing **Zero Trust** strategies in desktop virtualization and identity access management.\n• Managed and configured **Microsoft Azure**, **Amazon AWS**, and **Google GCP** for cloud services, enhancing resource optimization and scalability.\n• Developed and streamlined desktop management solutions using **Microsoft Intune**, **Ivanti**, and **SOTI**, leading to a **25%** improvement in deployment speed.\n• Implemented endpoint protection strategies that aligned with enterprise security standards, improving threat detection rates by **30%**.\n• Fostered strong relationships within teams, enhancing collaboration and communication efficiency, leading to a **15%** increase in project completion rates.\n• Employed effective time management techniques to juggle multiple projects, ensuring deadlines were consistently met while maintaining high-quality standards.\n• Presented technical solutions to stakeholders, demonstrating in-depth knowledge of SaaS technologies and mobile device management tools like **Omni SaaS Workspace One**.\n• Acted as a self-starter, driving initiatives to improve overall solution implementation and maintenance processes for diverse user environments."
    }
  ],
  "skills": "**Programming Languages**\n\tPython (3.8+), SQL, Bash, JavaScript\n\n**Backend Frameworks**\n\tFastAPI, Flask, Django, Celery\n\n**Frontend Frameworks**\n\t\n\n**API Technologies**\n\tREST/gRPC APIs, Microservices\n\n**Serverless and Cloud Functions**\n\tAWS (EC2, S3, Lambda), Azure, Google GCP\n\n**Databases**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps**\n\tDocker, Kubernetes, GitHub Actions, Azure DevOps, CI/CD\n\n**Cloud & Infrastructure**\n\tMicrosoft Azure, Amazon AWS, SaaS\n\n**Other**\n\tAI/ML Tools: Pandas, NumPy, scikit-learn, TensorFlow, Airflow, MLflow, Desktop Virtualization, Mobile Device Management, Desktop Management, Identity Access Management, Zero Trust, Endpoint Protection, Enterprise Security, Omnissa Workspace One, Microsoft Intune, Ivanti, SOTI, Communications, Relationship Building, Presentation Skills, Time Management, Self-Starter",
  "apply_company": "Omnissa"
}