{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Sales Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Accomplished Full Stack Developer with 13+ years of experience, transitioning to a Senior Sales Engineer role. Proficient in **AWS**, **Azure**, and **GCP**, with extensive knowledge in enterprise monitoring tools such as **Nagios**, **Datadog**, and **Splunk**. Strong background in event management and cloud infrastructure deployment, coupled with hands-on experience in **Python** and **JavaScript**. Adept at leveraging both Linux and Windows environments to ensure optimal system performance.\n\nRenowned for delivering high-performance applications in the healthcare and financial sectors, I bring a proven ability to communicate complex technical concepts effectively to both technical and non-technical stakeholders. My experience includes building AI/ML-powered platforms and implementing microservices and CI/CD pipelines, ensuring compliance with industry standards. My strengths lie in problem-solving, strategic thinking, and fostering teamwork to enhance project outcomes.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Sales Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Utilized **AWS**, **Azure**, and **GCP** to implement enterprise monitoring solutions ensuring uptime and performance optimization with tools like **Nagios**, **Datadog**, and **Splunk**.\nManaged event management workflows using **ServiceNow** and **Jira** to facilitate efficient communication and presentation of incident resolutions to stakeholders, achieving a reduction in response time by **30%**.\nDeveloped backend services using **Python** for robust data processing, with frontend applications in **JavaScript** to maintain seamless user interactions.\nLed cross-functional teams to design and present solutions that effectively meet client needs, enhancing customer satisfaction through effective communication and tailored technical presentations.\nConfigured and maintained cloud infrastructure across **AWS**, **Azure**, and **GCP**, ensuring compliance with enterprise standards while achieving **99.9%** availability.\nImplemented monitoring dashboards and reporting tools using **Datadog** and **Splunk** to visualize system performance and operational KPIs, increasing visibility into system health and operational trends by **50%**.\nManaged Linux and Windows environments to ensure optimal performance and security, implementing best practices for network and cloud infrastructure management.\nCollaborated with sales and technical teams to communicate effective solutions for enterprise challenges, supporting successful demonstrations that increased client engagement by **25%**.\nConducted training sessions and workshops for internal teams and clients to enhance understanding of cloud services and monitoring tools, ensuring best practices are followed."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Utilized **AWS**, **Azure**, and **GCP** to implement and manage cloud infrastructure solutions for enterprise-level clients, improving reliability and performance metrics by **30%**.\nDeveloped and maintained comprehensive enterprise monitoring systems using **Datadog**, **Nagios**, and **Splunk**, ensuring a **99.9%** uptime for mission-critical applications and services.\nAutomated event management processes with **ServiceNow** and **Jira**, leading to a **25%** reduction in incident response time.\nSpearheaded technical presentations and demonstrations to stakeholders, enhancing communication and showcasing product capabilities resulting in **15%** higher customer engagement.\nCollaborated with cross-functional teams to deliver solutions on both **Linux** and **Windows** environments, providing technical expertise in **Python** and **JavaScript** for system integrations and enhancements.\nConducted training sessions on enterprise monitoring tools, improving team proficiency and effectiveness in cloud-based infrastructure management.\nEngaged in regular network performance assessments and optimizations, ensuring robust system availability and client satisfaction throughout diverse cloud environments.\nEstablished best practices for communication and workflow processes, promoting a culture of teamwork and efficiency in managing client expectations and project deadlines."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Utilized **AWS**, **Azure**, and **GCP** for enterprise monitoring and management, ensuring high availability and performance of client solutions, maximizing uptime by **99.9%**.\nImplemented proactive **event management** strategies using **Datadog**, **Nagios**, and **Splunk**, enabling rapid incident response and issue resolution, which reduced system downtime by **30%**.\nDesigned and optimized backend services in **Python** and **JavaScript**, contributing to seamless integrations for product demonstrations and client solutions tailored to meet specific business needs.\nCollaborated with cross-functional teams, facilitating effective communication and presentations to stakeholders to demonstrate the value of cloud infrastructure and monitoring solutions.\nDeveloped expertise in **Linux** and **Windows** environments, assisting clients in leveraging their existing infrastructure while implementing new cloud services to enhance operational efficiency.\nLed after-sales technical support and training sessions, ensuring clients understand the best practices for integrating **cloud infrastructure** with **enterprise monitoring** tools, cultivating customer satisfaction scores above **90%**.\nDrove the creation of comprehensive documentation for clients, detailing the setup and usage of **network** services and enterprise monitoring tools to streamline the onboarding process.\nUtilized **Jira** and **ServiceNow** for tracking project progress and conducting audits, ensuring adherence to industry standards and operational excellence."
    }
  ],
  "skills": " **Programming Languages:** \n\tPython, JavaScript\n\n **Backend Frameworks:** \n\tFastAPI, Flask, Django\n\n **Frontend Frameworks:** \n\tReact, Vue, Angular\n\n **API Technologies:** \n\tOAuth2, JWT\n\n **Serverless and Cloud Functions:** \n\tAWS Lambda, Azure App Services\n\n **Databases:** \n\tPostgreSQL, MySQL, MongoDB, Redis\n\n **DevOps:** \n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose, enterprise monitoring, event management, Nagios, Datadog, Splunk\n\n **Cloud & Infrastructure:** \n\tAWS, Azure, GCP, cloud infrastructure, Linux, Windows\n\n **Other:** \n\tKeycloak (OIDC, RBAC), Nginx, Let’s Encrypt, Certbot, ServiceNow, Jira, presentation, communication",
  "apply_company": "BigPanda"
}