{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Frontend Developer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-187801395/",
  "profile_summary": "Frontend Developer with 13+ years of experience specializing in **TypeScript**, **Vue.js**, and **React Native**. Proficient in building high-performance applications with a focus on mobile-first design, platform optimization, and web standards. Demonstrated expertise in browser optimization and usability, ensuring exceptional user experiences.\nSkilled in full stack development, leveraging **JavaScript**, **React**, and **Next.js** to create responsive web applications. Experienced in collaborating within diverse teams, showcasing strong communication skills and a curiosity-driven approach to problem-solving. Committed to continuous learning and keeping up with the latest trends in frontend technologies.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Frontend Developer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Collaborated closely with cross-functional teams to design and implement responsive and performant front-end applications using **Vue.js**, **Nuxt.js**, and **React Native** for both iOS and Android platforms, adhering to modern web standards and usability principles.\nEnhanced mobile user experience through **Mobile-First Design** strategies, focusing on performance optimization and browser compatibility to ensure seamless interactions.\nDeveloped and maintained cutting-edge features aimed at improving usability and engagement, integrating intelligent components that leverage backend data for personalized user experiences.\nEngaged in thorough platform optimization efforts, regularly monitoring and refining the performance of applications to exceed **90%** loading speed metrics across all major browsers.\nConsistently applied robust testing strategies using tools like Jest and Cypress, ensuring high-quality deliverables through unit and integration testing covering **100%** of critical components.\nFostered teamwork and open communication throughout the development process, promoting knowledge sharing and collaborative problem-solving to meet project deadlines effectively.\nImplemented effective tracking and analytics to measure user interactions, leading to a **20%** increase in application retention rates through iterative improvements driven by user feedback.\nChampioned curiosity and exploration of new technologies, contributing to the adoption of modern libraries and frameworks to stay ahead of industry trends."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "• Developed interactive front-end applications using **React (18)**, **Vue.js**, **Next.js**, and **TypeScript**, ensuring a **Mobile-First design** for optimal user experiences.\n• Implemented performance optimization strategies to enhance scalability and responsiveness of web applications, adhering to **web standards**.\n• Collaborated effectively in cross-functional teams, showcasing strong **teamwork** and **communication skills** to deliver high-quality financial tools and admin panels.\n• Conducted thorough browser optimization to ensure seamless functionality across different platforms and devices, improving usability across the board.\n• Demonstrated curiosity and innovation by exploring and integrating the latest trends and technologies in front-end development to enhance project outcomes."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Utilized **TypeScript** for developing dynamic frontend applications with **React** (18), **Vue 3**, and **Nuxt.js**, ensuring seamless integration and optimized performance for a global e-commerce platform.\nDesigned mobile-first, SEO-friendly user interfaces in compliance with web standards, enhancing usability and accessibility for an engaging customer experience.\nImplemented browser optimization techniques to improve load times by **30%**, significantly boosting user engagement on both web and mobile platforms.\nCollaborated with cross-functional teams to streamline platform optimization, implementing performance measures that decreased latency by **20%** across various features.\nMaintained effective communication with stakeholders to gather requirements and provide updates, fostering a strong team-oriented development environment.\nOptimized frontend architecture for enhanced performance, achieving a reduction in resource loading time by **25%** through strategic caching practices.\nEngaged in continuous learning and curiosity-driven exploration of new technologies, ensuring the incorporation of modern best practices in frontend development.\nEmphasized usability by conducting user testing phases, which directly influenced design iterations and improved user satisfaction metrics by **15%**.\nPromoted teamwork across development teams to share knowledge and innovative ideas, leading to efficient problem-solving and increased project velocity."
    }
  ],
  "skills": "**Programming Languages:**\n\tPython\n\tJavaScript\n\tTypeScript\n\n**Frontend Frameworks:**\n\tReact\n\tVue\n\tnuxt.js\n\tReact Native\n\n**Backend Frameworks:**\n\tFastAPI\n\tFlask\n\tDjango\n\n**API Technologies:**\n\tKeycloak (OIDC, RBAC)\n\tOAuth2\n\tJWT\n\n**Serverless and Cloud Functions:**\n\tAWS: Lambda\n\tAzure: App Services\n\n**Databases:**\n\tPostgreSQL\n\tMySQL\n\tMongoDB\n\n**DevOps:**\n\tDocker\n\tKubernetes\n\tGitHub Actions\n\tGitLab CI/CD\n\n**Cloud & Infrastructure:**\n\tAWS: ECS\n\tAWS: RDS\n\tAzure: Blob Storage\n\tSQL Database\n\tTerraform\n\tAnsible\n\tHelm\n\tDocker Compose\n\n**Other:**\n\tMLflow\n\tAirflow\n\tKubeflow\n\tMobile-First design\n\tBrowser optimization\n\tPlatform optimization\n\tPerformance optimization\n\tWeb standards\n\tUsability\n\tTeamwork\n\tCommunication skills\n\tCuriosity"
}