{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Product Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "As a Senior Product Engineer, I excel in delivering robust backend solutions with a focus on AI and API development, leveraging my 8 years of experience in full-stack application building. My technological expertise includes **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, **Django**, and proficiency in cloud services like **Azure** and **AWS**. I am adept at creating data pipelines, implementing caching strategies, and optimizing solutions to meet customer-centric demands.\n\nI have successfully led projects integrating AI techniques, particularly in developing LLM and RAG implementations for enhanced real-time data handling. My background in microservices architecture and event-driven systems underpins my approach, as does my commitment to observability and continuous improvement through agile methodologies. With strong problem-solving skills, I thrive in dynamic environments, ensuring that the applications I build not only meet compliance standards like HIPAA, FHIR, PCI DSS, and SOC 2 but also deliver value to users and stakeholders.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Product Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Focused on **customer-centric** solutions by architecting and developing scalable healthcare and financial platforms using **TypeScript**, **Python (FastAPI)**, and **Node.js**.\n- Developed powerful **API** integrations ensuring compliance with HIPAA, FHIR, GDPR, and financial regulatory standards including PCI DSS and SOX.\n- Spearheaded optimization initiatives that led to a **30%** increase in performance by employing advanced caching strategies with **Redis** and **GraphQL**.\n- Streamlined data pipelines and improved observability across applications, utilizing **PostgreSQL** and **MongoDB** for efficient data storage solutions that manage up to **5 million** records.\n- Created and deployed cross-platform mobile applications with **Flutter** and **React Native**, achieving **95%** end-user satisfaction through seamless experiences in healthcare and fintech on both iOS and Android.\n- Implemented CI/CD pipelines utilizing **Fastlane** and **App Center**, enhancing release management processes that decreased deployment times by **40%**.\n- Led the transformation of monolithic applications to microservices using **Docker** and **Kubernetes (AKS/EKS)** for increased scalability and fault tolerance.\n- Designed and integrated machine learning capabilities within applications for patient risk prediction and financial fraud detection utilizing **scikit-learn**, **PyTorch**, and **TensorFlow**, resulting in **15%** reduction in false positives.\n- Built robust data observability frameworks incorporating **MLflow**, **DVC**, and **Apache Airflow** to streamline machine learning workflows.\n- Pioneered the implementation of AI-driven features that offer personalized health recommendations pulling data from real-time analytics processed through **Azure ML** and **AWS Sagemaker**.\n- Established comprehensive DevOps practices through **GitHub Actions**, **Azure DevOps**, and **CircleCI**, which refined multi-environment deployments and security scans.\n- Delivered insightful financial visualizations using **D3.js**, **Chart.js**, and **Power BI Embedded**, facilitating real-time extraction of KPIs and analysis of transaction trends.\n- Collaborated with data scientists to integrate **NLP** models using **spaCy** and **Hugging Face Transformers** into core services for enhanced document parsing and anomaly detection.\n- Developed testing strategies using **Jest**, **Cypress**, **PyTest**, and **Postman**, achieving complete test coverage across both front-end and backend services for improved reliability and bug detection.\n- Integrated **Azure Cognitive Search** and **ElasticSearch** to enhance search capabilities within extensive databases of health records and financial documents."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "• Leveraged **AI/ML** technologies to implement fraud detection systems, utilizing **scikit-learn**, **XGBoost**, and **Azure Machine Learning**, resulting in a **25%** reduction in fraudulent transactions.\n• Designed and developed backend services using **Node.js** (NestJS/Express) and **Python** (FastAPI, Django) for robust API functionalities, enhancing scalability and performance for high-volume financial transactions by **40%**.\n• Established efficient data pipelines using **Apache Airflow** and **Azure Data Factory**, optimizing batch and real-time data ingestion processes, achieving a **50%** increase in data processing speed.\n• Engineered a microservices-based architecture to enhance observability and maintainability, leading to a **30%** improvement in system uptime.\n• Implemented caching strategies and optimization techniques to improve API response times by **15%**, significantly enhancing customer-centric application performance.\n• Built and integrated ETL pipelines to facilitate smooth data flow from various internal and third-party sources, ensuring data accuracy and consistency for analytics.\n• Developed dynamic front-end applications using **React** (18), **Vue 3**, and **Next.js**, implementing customer-centric design practices and responsive interfaces for financial dashboards.\n• Adopted agile methodologies in product development, promoting iterative enhancement and effective problem-solving within cross-functional teams.\n• Created real-time analytics dashboards utilizing **D3.js** and **Power BI Embedded**, empowering stakeholders to track transaction metrics and derive insights effectively."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "• Applied **AI** and machine learning strategies to enhance customer-centric features, leveraging real-time behavioral data to optimize product listings and improve conversion rates.\n• Designed optimized **backend** services for a global e-commerce platform using **Python** (**FastAPI**, **Django**) and **Node.js** (**NestJS**, **Express**), achieving **high availability** and **low latency** across crucial modules with a scalability focus.\n• Developed and maintained **API** services to support diverse functionalities, ensuring seamless integration and data exchange between frontend and backend systems.\n• Engineered **data pipelines** using **Kafka** and **RabbitMQ** for real-time features, directly contributing to effective dynamic inventory tracking and responsive order updates.\n• Implemented effective **caching** strategies using **Redis** for product metadata and shopping cart sessions, resulting in significant performance gains and enhanced application responsiveness.\n• Applied **optimization** techniques to enhance system performance, achieving a **50%** reduction in latency for database queries through strategic caching and efficient querying practices.\n• Adopted **agile** methodologies to facilitate iterative development and enhance team collaboration, resulting in faster feature delivery and a **15%** increase in overall team productivity.\n• Executed observability practices across the platform to monitor performance metrics, identify bottlenecks, and effectively address potential issues in real-time.\n• Introduced **RAG** (Retrieval-Augmented Generation) techniques to improve data retrieval efficiency, yielding a **30%** increase in response accuracy for customer queries.\n• Cultivated a problem-solving culture by addressing customer feedback and aligning product features with user needs, leading to a **20%** increase in user satisfaction.\n• Built secure payment workflows integrated with **Stripe**, **PayPal**, and **Razorpay**, ensuring PCI-compliant handling of sensitive data and enhancing user trust in the platform.\n• Developed responsive, SEO-friendly e-commerce UIs using **Next.js**, **Vue 3 + Nuxt**, and HTML5/CSS3, prioritizing mobile-first engagement and accessibility compliance (WCAG 2.1).\n• Integrated role-based access control (RBAC) and **OAuth 2.0** for enhanced security and GDPR compliance, safeguarding user data throughout the platform."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, JavaScript, TypeScript\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n **Frontend Frameworks:**\n\tReact, Vue, Angular\n\n **API Technologies:**\n\tREST APIs, GraphQL APIs\n\n **Serverless and Cloud Functions:**\n\tAWS Lambda, Azure Functions\n\n **Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD\n\n **Cloud & Infrastructure:**\n\tAWS (ECS, RDS, S3), Azure (App Services, Blob, SQL), Terraform, Ansible, Helm, Docker Compose\n\n **Other:**\n\tMachine Learning, AI, Data Pipeline, LLM, Optimization, Caching, RAG, Observability, Agile, Customer-Centric, Problem-Solving, Authentication & Security (Keycloak, JWT, OAuth2, Let’s Encrypt, Nginx, Certbot)",
  "apply_company": "Plain"
}