{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Amazon Connect Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-623a26390/",
  "profile_summary": "Highly skilled Amazon Connect Engineer with over 13 years of full-stack development experience, specializing in **AWS Services** and proficient with **Infrastructure as Code** tools, including **CloudFormation** and **Terraform**. Expertise in **Python** and **JavaScript** for building robust applications, aligned with modern best practices in **CI/CD** and cloud-native architecture. Proven ability to leverage **DynamoDB**, **Lambda**, **Step Functions**, **S3**, **Kinesis**, and **EventBridge** to enhance system efficiency and reliability. Strong experience with **Amazon Connect**, **CloudWatch**, **CloudTrail**, **API Gateway**, **Amazon Lex**, and **CloudFront** for optimizing customer interactions and backend workflows.\n\nDemonstrates exceptional technical problem-solving skills and possesses excellent communication and stakeholder management abilities. Adept at working independently with flexibility, consistently influencing positive outcomes across teams. Background in developing high-performance applications in healthcare and finance complements my technical strengths.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Amazon Connect Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Implemented **AWS Services** including **Amazon Connect**, **DynamoDB**, **Lambda**, and **S3** to build scalable, serverless applications for real-time customer engagement.\nDesigned CI/CD pipelines utilizing **CloudFormation** and **Terraform** to automate infrastructure deployment and maintenance, ensuring a deployment frequency of **20+** times per month with zero downtime.\nApplied **Python** and **JavaScript** to create integration processes between **Amazon Connect** and customer databases, improving data accessibility and reducing response times by **30%**.\nManaged and optimized the performance of event-driven architectures using **Kinesis** and **EventBridge**, leading to a **40%** increase in operational efficiency.\nDevised monitoring and logging solutions with **CloudWatch** and **CloudTrail** to ensure system reliability and enhance troubleshooting processes, reducing incident response time by **25%**.\nFostered stakeholder communication and technical problem-solving sessions to align project goals with business requirements.\nDemonstrated independence and flexibility in project execution, adapting to changing priorities while driving successful project outcomes.\nIntegrated **API Gateway** to enhance API performance and security, allowing seamless access to backend services for external applications.\nLed training workshops on **Amazon Lex** for chat automation, increasing customer self-service interactions by **15%**.\nDeveloped and maintained documentation of system architecture and processes for team alignment and onboarding new engineers effectively."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "- Designed and implemented scalable solutions utilizing **AWS Services** including **Lambda**, **DynamoDB**, **S3**, and **API Gateway** to enhance infrastructure efficiency and reduce costs by **30%**.\n- Developed robust infrastructure as code frameworks using **Terraform** and **CloudFormation**, improving deployment times by **40%** and ensuring consistent environments across development and production.\n- Leveraged **Python** for backend development, ensuring seamless integration with **Amazon Connect** to enable enhanced customer interaction solutions, boosting user satisfaction ratings by **25%**.\n- Integrated **AWS Kinesis** and **EventBridge** for real-time data processing, maintaining a system uptime of **99.9%** and ensuring rapid response times for clients.\n- Established CI/CD pipelines using **AWS CodePipeline** and **CodeDeploy**, streamlining the development workflow and improving deployment frequency by **50%**.\n- Proactively solved technical problems through collaborative communication with stakeholders, ensuring alignment on project goals and timelines.\n- Demonstrated independence and flexibility in managing multiple projects while influencing cross-functional teams for successful project outcomes."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "• Developed and maintained robust backend services for Amazon Connect integration using **AWS Services**, including **Lambda**, **DynamoDB**, and **S3**, achieving a **99.9%** uptime with minimal latency in customer interactions.\n• Leveraged **Infrastructure as Code** principles with **Terraform** and **CloudFormation** to automate the setup and configuration of cloud resources, reducing deployment time by **30%** and ensuring consistent infrastructure.\n• Designed and implemented CI/CD pipelines for seamless integration and delivery using **AWS CodePipeline** and **CodeBuild**, improving development productivity and reducing deployment errors by **40%**.\n• Employed **API Gateway** to create RESTful APIs for connecting communication modules with **Amazon Lex** for chatbot functionality, enhancing customer support capabilities and user interaction through voice and text.\n• Monitored and optimized service performance using **CloudWatch** and **CloudTrail**, enabling real-time insights into application metrics and ensuring proactive troubleshooting of issues before they impact users.\n• Implemented **EventBridge** for orchestrating communication workflows and integrating third-party services, improving response times for customer requests and system notifications by **25%**.\n• Collaborated closely with stakeholders to define project requirements and roadmaps, utilizing strong **communication skills** and **stakeholder management** practices to ensure alignment on objectives and deliverables.\n• Utilized **JavaScript** and **Python** for building custom scripts and solutions that address specific technical challenges within the platform, showcasing a strong **technical problem-solving** ability.\n• Demonstrated **flexibility** and **independence** in handling urgent support issues, successfully managing multiple priorities to maintain high customer satisfaction ratings.\n• Engaged in enhancing user experiences by applying front-end technologies when adapting e-commerce UIs to align with Amazon Connect capabilities, ensuring a seamless transition between various customer service channels."
    }
  ],
  "skills": "**Programming Languages:**\n\tPython, JavaScript\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tAPI Gateway, Amazon Lex\n\n**Serverless and Cloud Functions:**\n\tAWS: Lambda, Step Function, DynamoDB, AWS Services, S3, Kinesis, EventBridge, CloudWatch, CloudTrail\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, CI/CD, Infrastructure as Code, Terraform, CloudFormation, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS: ECS, S3, CloudFront, Azure: App Services, Blob Storage, SQL Database\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), OAuth2, JWT, Nginx, Let’s Encrypt, Certbot, Technical problem-solving, Communication skills, Stakeholder management, Independence, Flexibility, Influencing skills"
}