{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Software Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "As a Senior Software Engineer with 8 years of hands-on experience, I specialize in leveraging **Kubernetes**, **OpenShift**, **Docker**, and **Ansible** for building and orchestrating scalable applications in hybrid cloud environments. My technical expertise includes proficient coding in **Python**, **Golang**, **Java**, and **C/C++**—ensuring robust automation and streamlined deployment processes. I excel in **Linux** systems and have a solid grasp of **NFV** and edge computing principles.\n\nIn addition to my infrastructure skills, I have a strong background in developing high-performance solutions within healthcare and financial sectors using advanced technologies like **JavaScript/TypeScript**, **Flutter**, **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**. I've effectively led projects incorporating AI capabilities and predictive analytics while ensuring compliance with critical standards such as HIPAA. I have also constructed microservices architecture and implemented CI/CD automation, enhancing system reliability and efficiency.\n\nEnabling real-time data processing and intelligent automation, I bring expertise in developing machine learning pipelines and serving ML models in production, utilizing tools like **MLflow**, **Airflow**, and **Kubeflow**. My strong communication skills allow me to collaborate effectively with cross-functional teams, always striving for high-quality deliverables.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Software Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Designed and implemented microservices architectures utilizing **Kubernetes**, **Docker**, and **OpenShift** for enhanced scalability and maintainability in complex applications.\n• Developed robust applications in **Python** and **Golang**, ensuring top-tier performance, security, and compliance in line with industry standards.\n• Employed automation strategies to streamline workflows, utilizing tools such as **Ansible** to manage configuration and deployment processes efficiently.\n• Ensured high availability and fault tolerance through cloud-native solutions leveraging **Linux** in hybrid and edge cloud environments.\n• Integrated AI technologies into software solutions, facilitating intelligent features and predictive analytics that improved user engagement and satisfaction.\n• Led initiatives for infrastructure automation, utilizing **Kubernetes** and **Docker** to manage deployments across multiple environments, achieving consistent delivery processes.\n• Conducted code reviews and established communication protocols to enhance team collaboration and maintain coding standards.\n• Created CI/CD pipelines with automated testing and deployment strategies using industry-standard tools, increasing deployment frequencies by over **50%**.\n• Collaborated on developing and refining technical documentation, ensuring clear communication across teams and projects to meet deadlines effectively.\n• Enhanced system performance by implementing NFV solutions, streamlining processes that reduced operational costs by **20%** while improving service delivery.\n• Established effective testing frameworks for continuous integration processes, resulting in a **30%** reduction in bugs across applications.\n• Acted as a mentor to junior developers, fostering their skills in **Python**, **Golang**, and cloud technologies, contributing to a growing, skilled engineering team."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Utilized **Kubernetes** and **OpenShift** to deploy and manage scalable microservices architecture for financial platforms, enhancing system reliability and ease of maintenance with a focus on automation and hybrid cloud solutions.\nEmployed **Python** and **Golang** for backend development, developing efficient high-volume transaction systems that support asynchronous communication and real-time processing of financial data.\nLed the implementation of containerization strategies using **Docker** and **cri-o**, allowing for seamless application deployment and improved operational efficiency in a **Linux** environment.\nImplemented event-driven architecture using **Kafka** and **RabbitMQ**, ensuring robust communication protocols for processing transactions, alerts, and compliance workflows.\nDeveloped AI and machine learning solutions to enhance financial analytics, deploying systems with **Azure Machine Learning** for real-time anomaly detection and fraud prevention, leveraging libraries such as **scikit-learn** and **XGBoost**.\nCreated and managed CI/CD pipelines using **Ansible**, enhancing automation across development and deployment workflows, resulting in a **30%** reduction in deployment time.\nOrchestrated ETL processes with **Apache Airflow** and **Azure Data Factory**, enabling efficient data ingestion from **9** internal and external sources for comprehensive financial reporting and analytics.\nDesigned interactive financial dashboards utilizing **D3.js**, **Power BI Embedded**, and **React (18)**, improving user experience for operations teams by providing real-time monitoring and analysis capabilities."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Utilized technical skills in **Kubernetes**, **Docker**, and **OpenShift** to optimize deployment processes and streamline the development lifecycle, enhancing application scalability and performance efficiency by **30%**.\nImplemented automation processes using **Ansible** and **Python**, ensuring consistent environment provisioning and configuration management, leading to a **25%** reduction in manual deployment errors.\nDeveloped and maintained backend services in **Python** and **Golang**, focusing on high availability and performance, significantly boosting server response times by **40%** across critical services.\nLeveraged **Linux** operating systems for server management and application deployment, ensuring robust and secure systems that handle extensive workloads in a **Hybrid Cloud** environment.\nDesigned and executed containerization strategies using **Docker** to ensure consistent application environments across development, testing, and production, leading to efficient resource utilization.\nCollaborated on AI-driven initiatives to integrate machine learning solutions with **Python** libraries, aiming to enhance product recommendations and improve user engagement metrics by **20%**.\nPracticed effective communication with cross-functional teams during the development of innovative software solutions, fostering a collaborative culture and ensuring alignment with project goals.\nImplemented compliance and security measures for sensitive data handling, ensuring adherence to **GDPR** standards and robust user protection protocols.\nEnhanced management of complex infrastructures utilizing **Kubernetes** for orchestration and scaling of cloud-native applications, improving operational efficiency in service delivery.\nContributed to edge computing initiatives, leveraging NFV strategies to optimize network performance and provide seamless user experiences in critical applications."
    }
  ],
  "skills": "Programming Languages:\n\tPython, Java, C/C++, Golang\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tJavaScript/TypeScript (React, Vue, Angular)\n\n**API Technologies:**\n\t\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes, OpenShift, GitHub Actions, GitLab CI/CD, Ansible, Terraform, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tHybrid Cloud, Edge, NFV, Linux, Automation\n\n**Other:**\n\tAI, MLflow, Airflow, Kubeflow, Authentication & Security (Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot), Communication",
  "apply_company": "Red Hat"
}