{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Network Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-karol-kotlinski-bb2520397/",
  "profile_summary": "As a dedicated Senior Network Engineer, I bring 8 years of expertise in **Data Center Networking**, **Network Architecture**, and **Network Operations**, with a strong focus on **Operational Excellence** and **Continuous Improvement**. My background includes troubleshooting complex networking issues and implementing effective network solutions that enhance operational efficiency. I am skilled in utilizing **Network Tools** for monitoring and managing network performance, ensuring seamless incident management and remote collaboration.\nPreviously, as a Full Stack Developer, I harnessed a versatile tech stack including **JavaScript**, **TypeScript**, **Python**, **Flutter**, **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**. My development experience spans the healthcare and financial sectors, where I successfully built high-performance applications integrated with AI/ML capabilities. With significant cloud experience on platforms like **Azure** and **AWS**, I have led projects that align with compliance standards such as HIPAA, FHIR, PCI DSS, and SOC 2, ensuring the security and robustness of the applications deployed.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Network Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Managed and optimized **network architecture** to ensure operational excellence in **data center networking**, implementing strategies for enhanced performance and reliability.\nExecuted troubleshooting procedures to identify and resolve network issues, maintaining **high availability** through effective **incident management** across complex environments with a focus on **continuous improvement** and efficiency.\nCollaborated remotely with cross-functional teams to implement best practices in **network operations**, ensuring smooth integration of new technologies and tools to enhance **network performance**.\nSpearheaded the development and deployment of **network tools** for monitoring and diagnostics, reducing incident response times by **30%** through proactive alerts and reporting systems.\nLed initiatives for the adoption of **BGP** protocols to improve routing efficiency and redundancy, achieving a **99.9% uptime** in network services across multi-tenant data center environments.\nStreamlined processes to enhance network stability and reduce downtime, with a measurable impact on business operations demonstrated by a **25%** improvement in operational efficiency metrics.\nConducted training workshops for team members on **network operations** and **troubleshooting techniques**, fostering a culture of operational excellence and enhancing team competency.\nDeveloped comprehensive documentation on network architecture and operations, facilitating better understanding and efficiency for both new and existing team members.\n"
    },
    {
      "role": "Senior Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Operated with **Network Architecture** and **Data Center Networking** principles to design and enhance robust and efficient networking solutions for service reliability and operational excellence.\nLed **Operational Excellence** initiatives by establishing standardized procedures to improve **Network Operations**, resulting in a **20% reduction** in incident resolution time.\nExecuted **Troubleshooting** methodologies to quickly identify and rectify network-related issues, enhancing uptime to **99.9%**.\nUtilized **Network Tools** to deploy performance monitoring systems, enabling proactive management of network resources and a **30% increase** in performance metrics.\nCollaborated with cross-functional teams for **Remote Collaboration** on network upgrades and migration projects, ensuring smooth transitions with minimal business disruption.\nChampioned **Continuous Improvement** efforts through the analysis of operation metrics, leading to the implementation of best practices that improved overall network reliability.\nManaged **Incident Management** processes to swiftly address and escalate major incidents, improving response and communication protocols within IT teams.\nParticipated in strategic planning for long-term **Network Architecture** needs, aligning network capabilities with evolving business objectives."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Leveraged **network architecture** to design and optimize Data Center Networking solutions, ensuring high availability and low latency across the infrastructure.\nImplemented proactive **network operations** utilizing industry-standard **network tools** for monitoring, troubleshooting, and optimizing performance in complex environments, resulting in a **30%** improvement in operational efficiency.\nExecuted continuous improvement strategies, resulting in a **25%** reduction in incident response times by employing advanced incident management techniques and tools.\nCollaborated remotely with cross-functional teams to enhance network security and reliability, achieving a **99.9%** uptime in service delivery through rigorous operational excellence protocols.\nDeveloped and maintained comprehensive documentation for network configurations and architectures, facilitating seamless transitions and knowledge sharing across teams.\nConducted thorough troubleshooting of network issues across multiple layers, utilizing deep knowledge of **BGP** to mitigate and resolve critical service disruptions within **1 hour** of detection.\nImplemented a standardized approach to network infrastructure upgrades, ensuring minimal downtime and alignment with best practices in operational excellence.\nLed training sessions on **network operations** best practices and tools to enhance team capabilities, contributing to a **20%** increase in team efficiency.\nRegularly assessed and enhanced data center networking strategies to align with evolving technologies and business needs, contributing to the overall agility of the organization."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython(FastAPI, Flask, Django), JavaScript/TypeScript (React, Vue, Angular)\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n **Frontend Frameworks:**\n\tReact, Vue, Angular\n\n **API Technologies:**\n\tN/A\n\n **Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n **Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:**\n\tAWS, Azure\n\n **Other:**\n\tMLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, BGP, Data Center Networking, Network Tools, Network Architecture, Network Operations, Operational Excellence, Troubleshooting, Continuous Improvement, Remote Collaboration, Incident Management"
}