{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior JavaScript Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Senior JavaScript Engineer with 13+ years of experience specializing in building and optimizing high-performance applications in the healthcare and financial domains. Expertise in **JavaScript**, **TypeScript**, **React**, **Vue.js**, **Node.js**, and front-end technologies such as **HTML5** and **CSS3**. Proficient in modern web development practices including **microservice architecture**, **Gulp**, **Webpack**, and **Behavior-Driven Development**. \nDemonstrated success in developing scalable solutions that enhance user experience and meet stringent industry standards. Skilled in deploying solutions using cloud services including **AWS** and **Azure**, alongside implementing CI/CD pipelines to streamline deployment processes. Adept at building AI/ML-driven platforms with frameworks like **FastAPI** and **Django**, while ensuring compliance with HIPAA, FHIR, PCI DSS, and SOC 2 requirements. Strong foundational experience in MLOps, focusing on model training, serving, and orchestration using **MLflow**, **Airflow**, and **Kubeflow**.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior JavaScript Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Developed full-stack web applications with a strong focus on **JavaScript** technologies including **React** (17-18), **Node.js**, and **TypeScript** to create responsive and interactive user interfaces.\nImplemented innovative front-end features using modern frameworks such as **Vue.js**, ensuring high performance and seamless integration with back-end services.\nUtilized best practices in **microservice architecture** to break down monolithic applications into scalable services that enhance maintainability and deployment scalability.\nAdopted **Behavior-Driven Development** principles to create more effective collaboration within cross-functional teams, leading to a 30% reduction in development cycles.\nEmployed build tools like **Gulp** and **Webpack** to optimize asset delivery and improve application performance with efficient loading times by up to **40%**.\nDemonstrated version control proficiency by managing code using **Git**, streamlining team collaboration and reducing merge conflicts with a 15% increase in code quality through regular code reviews.\nIntegrated **HTML5** and **CSS3** into the front-end codebase to ensure compliance with web standards and best practices for accessibility.\nExecuted testing strategies leveraging **Playwright** for end-to-end tests and **Jest** for unit testing, ensuring robust and bug-free releases.\nParticipated in agile development methodology, contributing to sprint planning and retrospective sessions, promoting a culture of continuous improvement and accountability.\nCollaborated effectively with cross-functional teams to deliver project milestones, leading to a successful deployment of **3 major releases** within target timelines."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "• Developed modern web applications using **JavaScript**, **React (18)**, and **Vue 3**, ensuring adherence to **microsservice architecture** for scalability and performance.\n• Implemented responsive user interfaces with **HTML5**, **CSS3**, and **TypeScript**, utilizing tools like **Gulp** and **Webpack** for efficient asset management.\n• Employed advanced programming concepts from **ECMAScript 5** and **ECMAScript 6** to enhance code quality and maintainability across projects.\n• Utilized **Git** for version control, collaborating seamlessly with team members on multiple features and fixes across **9** major releases.\n• Engaged in Behavior-Driven Development to align development processes with business objectives, boosting productivity by **30%**.\n• Designed and executed automated end-to-end testing procedures with **Playwright**, improving code reliability and reducing bugs by **25%** in production.\n• Applied best practices in microservice design to create interoperable and maintainable code, effectively reducing deployment times by **40%**."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "• Developed robust frontend applications using **JavaScript**, **React (18)**, **Vue.JS**, and **HTML5/CSS3**, ensuring compliance with modern coding standards and enhancing user experience on e-commerce platforms.\n• Implemented effective state management using **TypeScript** and **Redux Toolkit**, streamlining application performance and maintainability across **7+** different modules.\n• Utilized **Behavior-Driven Development** (BDD) practices to create automated tests for UI components ensuring high-quality, bug-free releases in **8+** deployment cycles.\n• Coordinated microservice architecture utilizing **Node.js** (NestJS, Express) to maximize application scalability and performance across various services involved in user interactions.\n• Enhanced build processes and asset management using tools like **Gulp** and **Webpack**, reducing load times by up to **25%** throughout the system.\n• Actively participated in version control with **Git**, promoting collaboration within teams and tracking progress across **5+** major project milestones.\n• Customized and optimized CSS pre-processing frameworks to improve code efficiency and maintain a consistent design across **10+** product pages.\n• Improved team velocity and productivity through the adoption of modern ECMAScript standards (**ECMAScript 5 & 6**), reducing development timeframes by approximately **30%**.\n• Collaborated in cross-functional teams to ensure seamless delivery and integration of features through rigorous QA practices, contributing to a **15%** increase in User Engagement Scores."
    }
  ],
  "skills": "{",
  "apply_company": "Aylo"
}