{
  "name": "Mariusz Jan Skobel",
  "role_name": "Software Engineer",
  "email": "mariuszskobel15@outlook.com",
  "phone": "+48 735 343 548",
  "address": "Katowice, Poland",
  "linkedin": "https://www.linkedin.com/in/mariusz-skobel-789557397/",
  "profile_summary": "Results-driven Software Engineer with over 10 years of experience specializing in delivering high-performance software solutions. Proficient in **.NET Core**, **.NET Framework**, **C#**, **MS SQL Server**, **T-SQL**, **Angular**, and **TypeScript**. Expert in developing secure and scalable web services and **REST APIs** with a strong foundation in **Microservices** architecture. Experienced in deploying cloud-native applications on **Azure**, utilizing **App Services**, **Azure SQL**, and **Azure Functions** to create robust solutions. Well-versed in CI/CD practices and **DevOps** methodologies to enhance development efficiency. \n\nBrings hands-on experience in modern **JavaScript** frameworks including **React**, **Next.js**, and **Vue**, alongside backend expertise in **Node.js**, **FastAPI**, and **Django**. Proven track record in leading projects that incorporate AI/ML capabilities, enhancing real-time analytics and automation. Demonstrated strong problem-solving skills, attention to detail, and effective communication, with a commitment to building compliant and maintainable applications.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2012",
      "to_year": "2015",
      "location": "UK",
      "university": "University of Bristol"
    }
  ],
  "experience": [
    {
      "role": "Software Engineer",
      "company": "EitBiz",
      "from_date": "Oct 2022",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "•\tDeveloped scalable web services and REST APIs using **.NET Core** and **C#**, ensuring seamless integration with microservices architecture and adherence to industry best practices.\n•\tDesigned and implemented robust database solutions with **MS SQL Server** and **T-SQL**, optimizing for performance and reliable data retrieval in enterprise applications.\n•\tCollaborated in the migration of legacy systems to modern architectures utilizing **Azure App Services** and **Azure Functions**, ensuring high availability and maintainability of applications.\n•\tLed the development of dynamic front-end applications using **Angular** and **TypeScript**, enhancing user engagement through responsive design and user-friendly interfaces.\n•\tExecuted CI/CD pipelines using **Azure DevOps** and **Visual Studio**, enhancing deployment frequency by **30%** through automation of build, testing, and delivery processes.\n•\tConducted thorough testing strategies using unit, integration, and E2E tests with tools like **Jest** and **Cypress**, resulting in a **15%** reduction in production bugs.\n•\tUtilized strong problem-solving skills to troubleshoot and resolve complex software issues, enhancing system performance and reliability.\n•\tDemonstrated exceptional communication skills while working in cross-functional teams, ensuring stakeholder alignment and project success.\n•\tEmphasized detail-oriented programming practices, maintaining high code quality through peer reviews and adherence to coding standards.\n•\tEngaged in self-motivated continuous learning of new technologies, regularly updating skills relevant to modern frameworks and cloud services."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Tvn S.A.",
      "from_date": "Oct 2019",
      "to_date": "Sep 2022",
      "location": "Poland",
      "responsibilities": "Developed and maintained scalable applications using **.NET Core** and **.NET Framework**, ensuring effective performance and high availability within cloud environments, leading to a 30% reduction in downtime.\nEngineered RESTful APIs and web services with **C#**, enhancing integration capabilities and providing seamless access to various functionalities in the financial platform, improving API response times by **20%**.\nImplemented Microservices architecture to break down monolithic applications into manageable services, facilitating continuous deployment practices through **CI/CD** pipelines, resulting in a deployment frequency increase of **50%**.\nCollaborated in an Agile environment, applying strong communication and problem-solving skills to address software development challenges, enhancing team efficiency by fostering open dialogue and teamwork.\nUtilized **MS SQL Server** and **T-SQL** for database management, optimizing queries and storage procedures, contributing to a **15%** increase in data retrieval speeds.\nDesigned and developed user-friendly interfaces using **Angular** and **TypeScript**, ensuring a responsive end-user experience which improved customer satisfaction scores by **25%**.\nEngaged in DevOps practices to streamline the software development process, utilizing **Azure App Services** and **Azure Functions** for serverless computing, improving resource management and cost efficiency.\nMaintained documentation and version control in **Visual Studio**, ensuring detailed project tracking and accountability, demonstrating attention to detail and commitment to quality."
    },
    {
      "role": "Software Engineer",
      "company": "Timspark",
      "from_date": "Sep 2015",
      "to_date": "Aug 2019",
      "location": "UK",
      "responsibilities": "Designed and optimized backend services for a global e-commerce platform using **.NET Core** and **C#**, ensuring robustness, scalability, and performance across key modules like checkout, cart, and order fulfillment.\nEngineered microservices architecture and implemented **REST APIs** to promote modularity and reusability, driving a 30% increase in system response times.\nDeveloped frontend applications using **Angular** (version 12), enhanced with **TypeScript**, delivering fast, user-friendly experiences on both web and mobile platforms.\nLeveraged **MS SQL Server** and **Azure SQL** for data storage, ensuring reliable and efficient data access, and utilizing **T-SQL** for complex queries and reporting.\nImplemented **Azure Functions** for serverless computing, improving application scalability and operational costs by 25% during peak traffic.\nAdopted **CI/CD** practices, streamlining development cycles and reducing deployment times by 40% through automated workflows.\nIntegrated **Azure App Services** for deploying applications, ensuring high availability and reliability in production environments.\nUtilized **Visual Studio** for efficient development and debugging, enhancing productivity and code quality.\nApplied **DevOps** strategies to foster collaboration among team members, leading to a 35% improvement in project delivery timelines.\nEmployed effective communication and problem-solving skills to bridge gaps between stakeholders and technical teams, ensuring clarity and alignment on project goals.\nMaintained a detail-oriented approach throughout all phases of the software development life cycle, resulting in the successful completion of 10+ major projects within deadlines.\n"
    }
  ],
  "skills": "**Programming Languages:**\n\tC#, Python, JavaScript, TypeScript\n\n**Backend Frameworks:**\n\t.NET Core, .NET Framework, FastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tAngular, React, Vue\n\n**API Technologies:**\n\tREST APIs, Web Services, Microservices\n\n**Serverless and Cloud Functions:**\n\tAWS Lambda, Azure Functions\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, MS SQL Server, Azure SQL, Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS (ECS, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, communication, problem-solving, detail-oriented, self-motivated"
}