{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Backend Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-karol-kotlinski-bb2520397/",
  "profile_summary": "As a Senior Backend Engineer with 8 years of experience, I focus on building high-performance back-end solutions using **Node.js**, **PostgreSQL**, and **AWS**. My strong expertise in **GraphQL** and **Test-Driven Development (TDD)** ensures the delivery of scalable and maintainable applications. I possess advanced analytical skills and problem-solving abilities that enable me to tackle complex backend challenges effectively.\nI have successfully led the development of enterprise-grade platforms, implementing robust microservices architectures while ensuring compliance with industry standards. My experience extends to mentoring junior developers and fostering collaboration within teams, which enhances overall productivity and innovation. I also have a solid foundation in building secure applications and integrating machine learning pipelines into backend systems, utilizing tools like **MLflow** and **Airflow** for a seamless development process.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Backend Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Developed and maintained scalable backend systems utilizing **Node.js** and **GraphQL**, ensuring seamless communication with front-end services, achieving performance improvements of **30%**.\n- Implemented robust database solutions using **PostgreSQL** for data storage and retrieval, optimizing query performance resulting in enhanced response times.\n- Employed Test-Driven Development (TDD) practices to ensure high-quality code and system reliability, achieving **95%** unit test coverage across multiple projects.\n- Collaborated effectively with cross-functional teams to identify and resolve complex backend issues, enhancing overall platform stability and performance.\n- Provided mentorship to junior developers, fostering an environment of learning and growth within the team, which led to a **40%** increase in code quality metrics.\n- Enhanced cloud deployment strategies using **AWS**, streamlining the infrastructure setup for backend services, reducing deployment times down to **10 minutes**.\n- Analyzed system performance metrics to detect bottlenecks and implement optimized solutions, successfully increasing transaction throughput by **20%**.\n- Conducted regular code reviews to maintain code quality and facilitate knowledge sharing among team members, ensuring adherence to best practices and industry standards.\n- Engaged in continuous integration and delivery processes with a focus on automation and efficiency, reducing integration issues by **50%**."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Utilized **Node.js** to develop high-quality backend services, enhancing system performance and reliability, while employing **GraphQL** for efficient data querying and retrieval, improving app responsiveness for over 100,000 users.\nImplemented test-driven development (TDD) practices to ensure optimal code quality and reduce bugs by **30%**, fostering a culture of reliability and robustness in project outcomes.\nCollaborated effectively within cross-functional teams to drive project success, demonstrating exceptional problem-solving and analytical skills to tackle complex technical challenges and deliver innovative solutions under tight deadlines.\nMentored junior developers, sharing expertise in **PostgreSQL** database design and query optimization, resulting in enhanced team productivity and elevated coding standards.\nDeployed applications on **AWS** services, ensuring high availability and scalability, while implementing cost-effective solutions that reduced cloud expenses by **20%**.\nDrove the modernization of legacy systems by advocating for the adoption of best practices and new technologies, ultimately increasing overall system performance by **25%**.\nConducted code reviews and provided constructive feedback to team members, fostering a collaborative environment that encouraged growth and learning."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "• Developed and maintained scalable backend services using **Node.js** (NestJS, Express) and **PostgreSQL**, ensuring high availability and low latency across critical business functions, resulting in a **30% increase** in system performance.\n• Implemented **GraphQL** APIs to enhance data fetching efficiency, reducing client load times by **40%** compared to traditional REST endpoints.\n• Employed **Test-Driven Development (TDD)** methodologies to ensure robust, bug-free code across complex features, reducing regulatory downtime by **25%** through better error management.\n• Leveraged **AWS** for deployment and infrastructure management, utilizing services such as EC2, RDS, and S3 for highly available and resilient backend architecture.\n• Collaborated with cross-functional teams to define requirements and deliver high-quality project outcomes, improving team efficiency and project completion rates by **20%**.\n• Provided mentorship to junior developers, fostering growth in analytical skills and problem-solving capabilities within the team, resulting in improved project delivery timelines.\n• Optimized code performance through analytical skills, identifying bottlenecks and implementing efficient solutions for faster data processing and retrieval.\n• Engaged in collaborative problem-solving sessions, facilitating innovative solutions that addressed both customer needs and technical challenges effectively."
    }
  ],
  "skills": "  **Programming Languages:**\n\tPython(FastAPI, Flask, Django), JavaScript/TypeScript (React, Vue, Angular), Node.js\n\n  **Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n  **Frontend Frameworks:**\n\tReact, Vue, Angular\n\n  **API Technologies:**\n\tGraphQL\n\n  **Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n  **Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n  **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n  **Cloud & Infrastructure:**\n\tAWS, Azure\n\n  **Other:**\n\tMLflow, Airflow, Kubeflow, Test-Driven Development, Analytical Skills, Problem-Solving, Collaboration, Mentorship, Authentication & Security: Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot"
}