{
  "name": "Damian Franciszek Pospiech",
  "role_name": "System Level Go Developer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-623a26390/",
  "profile_summary": "Results-driven System Level Go Developer with 13+ years of experience in system development and a strong focus on **Go** programming. Proficient in **Kubernetes** for orchestration and managing **system containers**, with a hands-on approach to **network configuration**, **resource allocation models**, and **storage devices** management. Skilled in leveraging **Ubuntu** environments for efficient deployment and operations.\n\nExperienced in employing **DevOps** practices to enhance system performance and streamline workflows, with a comprehensive understanding of **version control systems** and **VMware** for virtual resource management. Strong analytical skills with a system thinking mindset, dedicated to optimizing container resource interaction to support high-performance applications.\n\nAdditionally, well-versed in developing applications using **JavaScript/TypeScript**, **Python**, and **Flutter**, enhancing backend and frontend capabilities through frameworks like **React**, **Next.js**, and **Vue**. Proven track record in AI/ML integration and cloud-native deployments on **AWS** and **Azure**, ensuring compliance with industry standards such as HIPAA and PCI DSS.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "System Level Go Developer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Utilized **Go** for efficient system development, ensuring optimal performance and resource allocation models within various environments.\nImplemented and managed **Kubernetes** for system containers, effectively orchestrating deployment, scaling, and operations of application containers across clusters.\nConfigured and optimized **Ubuntu** systems, ensuring robust interaction between container resources and storage devices to enhance performance and reliability.\nDeveloped and maintained version control strategies utilizing **Git** and other systems to streamline collaboration and ensure code integrity.\nDesigned and tested high-performance network configurations, enhancing system networking capabilities with a focus on efficient data flow.\nApplied **DevOps** practices to facilitate continuous integration and continuous delivery (CI/CD) pipelines, improving deployment speed and quality.\nDemonstrated system thinking to identify and resolve complex issues, ensuring smooth operation across the entire system architecture.\nShowcased a passion for working with hardware, integrating it with software solutions to optimize system performance and workflow.\nExecuted functionality assessments across multiple environments, driving iterative enhancements and aligning solutions to user needs.\nCollaborated in a cross-functional team environment, ensuring knowledge sharing and expertise growth to innovate within system-level development."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Utilized **Go** programming language to develop efficient system-level applications, enhancing performance and reliability in high-demand environments.\nImplemented **Kubernetes** for orchestrating containerized applications, ensuring seamless scaling and management of resources across development and production environments with **VMware** integration.\nDesigned and maintained robust **Ubuntu** systems, focusing on network configuration and storage devices management to optimize system performance and security.\nCollaborated on version control systems for efficient code management and collaboration, employing practices to ensure code integrity and team alignment in system development.\nConducted thorough system development processes, employing resource allocation models to optimize the use of container resources, thus enhancing system efficiency by **30%**.\nLeveraged a strong understanding of system thinking to troubleshoot complex issues, contributing to a **40%** reduction in downtime through proactive maintenance and swift issue resolution.\nDemonstrated a passion for working with hardware, integrating software solutions with physical devices to create cohesive and efficient systems tailored to specific business needs."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Utilized **Go** for system development, ensuring robust and efficient backend functionality tailored for high-performance applications and services.\nImplemented **Kubernetes** for container orchestration, enhancing resource allocation models and container resource interaction dynamically across deployed environments.\nEngaged in **DevOps** practices to automate system builds, testing, and deployment processes, streamlining productivity and minimizing downtime to less than **5%** annually.\nConfigured and managed **Ubuntu** systems, ensuring optimal performance through precise network configuration and efficient resource allocation for various services.\nManaged version control systems effectively to maintain code integrity and track changes seamlessly, including **Git** for collaborative development activities.\nDeveloped and optimized network configurations for robust data transport and connectivity, reducing latency by an average of **20%** in critical services.\nEnforced storage device management practices, ensuring fault tolerance and redundancy in system storage solutions, achieving uptime metrics of **99.9%**.\nApplied system thinking to identify potential performance bottlenecks and address issues proactively, enhancing overall system usability and reliability.\nDemonstrated a passion for working with hardware, contributing to specialized projects that integrated software solutions with physical devices and storage systems.\nUtilized **VMware** for virtual machine management, enhancing system development and testing environments while simulating various operational scenarios efficiently."
    }
  ],
  "skills": "**Programming Languages**:\n\tPython, Go, C\n\n**Backend Frameworks**:\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks**:\n\tJavaScript/TypeScript: React, Vue, Angular\n\n**API Technologies**:\n\tKeycloak (OIDC, RBAC), OAuth2, JWT\n\n**Serverless and Cloud Functions**:\n\tAWS: ECS, Lambda, RDS, S3\n\tAzure: App Services, Blob Storage, SQL Database\n\n**Databases**:\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**DevOps**:\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD\n\tTerraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure**:\n\tUbuntu, VMware\n\n**Other**:\n\tArtificial Intelligence & Machine Learning: MLflow, Airflow, Kubeflow\n\tsystem development, system containers, network configuration, storage devices, version control systems, resource allocation models, container resource interaction, system thinking, passion for working with hardware"
}