{
  "name": "Rei Taro",
  "role_name": "Senior Frontend Engineer",
  "email": "rei515@outlook.com",
  "phone": "+48732529451",
  "address": "Warszawa, Poland",
  "linkedin": "https://www.linkedin.com/in/rei-taro-81a410391/",
  "profile_summary": "Results-driven Senior Frontend Engineer with a robust skill set in **React**, **JavaScript**, **HTML**, **CSS**, and **SCSS**. Experienced in translating complex design concepts into responsive and user-friendly web applications, leveraging tools like **Figma** for design collaboration. Strong background in **OOP** principles and Agile methodologies, with a proven ability to deliver high-quality projects on time and within budget. While specializing in frontend development, I bring over 10 years of technical expertise, including backend development for financial platforms, and an understanding of **Python** frameworks (FastAPI, Django, Flask), and cloud-native architectures on **AWS** and **Azure**.",
  "education": [
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2010",
      "to_year": "2015",
      "location": "Japan",
      "university": "Keio University"
    }
  ],
  "experience": [
    {
      "role": "Senior Frontend Engineer",
      "company": "Leobit",
      "from_date": "Aug 2022",
      "to_date": "Present",
      "location": "Poland",
      "responsibilities": "Developed user interfaces utilizing **React** and **JavaScript** to deliver seamless user experiences, improving engagement by **30%**.\nImplemented responsive designs with **HTML**, **CSS**, and **SCSS**, achieving a **95%** mobile compatibility score.\nCollaborated with UX designers using **Figma** to ensure alignment with business goals and optimize frontend workflows.\nAdopted **Agile** methodologies to enhance team productivity and reduce development cycles, resulting in a **20%** faster release schedule.\nApplied principles of **OOP** to create maintainable and scalable frontend architectures, ensuring code reusability.\nEngaged in cross-functional team collaboration to assess system performance and integrate new features effectively, enhancing user satisfaction by **25%**."
    },
    {
      "role": "Software Engineer",
      "company": "Innovature",
      "from_date": "Nov 2018",
      "to_date": "Jun 2022",
      "location": "Japan",
      "responsibilities": "Utilized **React** and **JavaScript** to develop high-performance user interfaces, enhancing overall user experience and engagement.\nApplied **HTML** and **CSS/SCSS** for responsive and visually appealing layouts, achieving a 90% customer satisfaction rate in user interface feedback surveys.\nEmployed Agile methodologies for iterative development and rapid delivery of features, improving team efficiency by **25%** in project timelines.\nConducted code reviews to ensure adherence to **OOP** principles, significantly decreasing bugs reported in production by **15%**.\nCollaborated with UX/UI designers using **Figma** to translate wireframes into functional components, ensuring design fidelity and user-centric functionality.\nFacilitated cross-functional team meetings to ensure effective communication and alignment on project goals, resulting in a successful product launch ahead of schedule by **2 weeks**."
    },
    {
      "role": "Software Developer",
      "company": "Wizcorp",
      "from_date": "Apr 2015",
      "to_date": "Nov 2018",
      "location": "Japan",
      "responsibilities": "Utilized **React** and **JavaScript** to develop responsive and dynamic user interfaces, enhancing user engagement by up to **30%**.\nCollaborated with UX/UI designers using **Figma** to implement visually appealing layouts and components, ensuring a seamless user experience across platforms.\nImplemented OOP principles to create modular code, improving maintainability and reducing bugs by approximately **25%**.\nApplied **Agile** methodologies to drive efficient project management and development cycles, successfully delivering features in **2-week sprints**.\nEnsured cross-browser compatibility through rigorous testing involving **HTML**, **CSS**, and **SCSS**, achieving a **95%** pass rate on performance metrics.\nConducted code reviews and provided mentorship to junior developers, fostering a collaborative team environment and knowledge sharing.\nParticipated in regular scrum meetings to discuss progress and future sprint goals, enhancing team cohesion and project alignment."
    }
  ],
  "skills": "**Programming Languages**\n\tJavaScript, Python (3.8+), SQL, Bash\n\n**Frontend Frameworks**\n\tReact, HTML, CSS, SCSS, Figma\n\n**Backend Frameworks**\n\tFastAPI, Flask, Django, Celery\n\n**API Technologies**\n\tREST/gRPC APIs, Microservices\n\n**Serverless and Cloud Functions**\n\tAWS (EC2, S3, Lambda), Azure\n\n**Databases**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps**\n\tDocker, Kubernetes, GitHub Actions, Azure DevOps, CI/CD\n\n**Cloud & Infrastructure**\n\tAWS, Azure\n\n**Other**\n\tPandas, NumPy, scikit-learn, TensorFlow, Airflow, MLflow, OOP, Agile, PyTest, Git, Kafka",
  "apply_company": "SOFTSWISS"
}