{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Rust Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Senior Rust Engineer with over 13 years of experience specializing in building secure, high-performance applications, prioritizing security, authentication, and authorization in compliance with industry standards. Proficient in **Rust** and **Golang**, with strong skills in **TypeScript** for seamless integration across backend systems. Adept in developing AI-driven solutions that enhance security protocols and deliver predictive analytics. Demonstrated ability in leveraging modern technologies, including **WASM** for improved performance and security measures. Experienced in implementing IAM strategies and protocols such as **OAuth** and **OIDC** to ensure robust user access management while maintaining compliance with critical regulations. Proven track record in full-stack development across healthcare and financial sectors, skilled in both frontend and backend technologies including **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**. Committed to continuous improvement and best practices in software engineering.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Rust Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Developed secured and scalable back-end systems using **Rust** and **Golang**, ensuring robust **Authentication** and **Authorization** mechanisms with **OAuth** and **OIDC** for comprehensive user protection.\nEngineered applications focused on **AI** integrations for enhanced data processing and decision making across multiple domains, applying machine learning techniques for automated insights and predictions.\nDesigned and implemented security protocols adhering to industry standards, strengthening the **Security** posture of all applications through meticulous code reviews and compliance checks.\nBuilt full-stack platforms employing **TypeScript** for dynamic front-end development, in conjunction with server-side **Rust** applications, achieving a seamless user experience across app versions **1.0 - 2.5**.\nDelivered mobile solutions for both iOS and Android, utilizing **Rust** for performance-critical modules alongside cross-platform frameworks, targeting a **35%** improvement in load times.\nManaged CI/CD processes with emphasis on security best practices, integrating tools like **GitHub Actions** and **Azure DevOps** to automate testing, deployments, and vulnerability scanning across **5** environments.\nCollaborated cross-functionally to develop intelligent **AI** features such as anomaly detection and user behavior predictions, improving operational efficiency by **25%**.\nConducted thorough testing and validation of APIs and microservices, utilizing frameworks for unit, integration, and end-to-end performance, achieving a **99%** reliability rate.\nEnhanced data ingestion pipelines and built integrations using structured storage solutions, effectively managing **10TB+** of data logs for real-time processing and analytics.\nImplemented search capabilities leveraging **Elasticsearch** to support fast queries on health and financial datasets, driving user satisfaction through improved data accessibility.\n"
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Utilized **Rust** to enhance back-end systems, ensuring high-performance and safe concurrency for financial applications.\nImplemented robust **authentication** and **authorization** mechanisms using **OAuth** and **OIDC**, ensuring secure access to sensitive financial data.\nCollaborated with cross-functional teams to integrate AI-driven solutions, leveraging cutting-edge technologies to improve user experience and operational efficiency.\nDesigned and maintained **authentication** protocols and **IAM** frameworks to ensure compliance and security in all financial transactions across diverse platforms.\nExtended existing microservices with **Golang** for optimized asynchronous processing, significantly increasing throughput for high-volume transactions by up to **40%**.\nDeveloped features in **TypeScript**, ensuring type safety and maintainability while enhancing the overall application architecture.\nOptimized WebAssembly (**WASM**) integrations for client-side performance, achieving rendering speeds improved by **50%** in complex financial data visualizations.\nContributed to security best practices across all development phases, proactively identifying vulnerabilities and testing solutions to ensure safety against threats.\n"
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Developed secure backend services using **Rust** for a global e-commerce platform, focusing on advanced **authentication** and **authorization** through **OAuth** and **OIDC** to ensure robust security and data protection.\nEngineered features leveraging **AI** for personalized user experiences, enhancing system capabilities with machine learning methodologies.\nDesigned and optimized high-performance modules for real-time data processing, applying effective coding practices and leveraging **WASM** for efficiency.\nUtilized **TypeScript** to build scalable and maintainable code structures, ensuring clean and consistent codebase across the project.\nImplemented role-based access control (RBAC) within the services, aligning with security protocols and industry standards to prevent unauthorized access.\nCreated unit and integration tests with coverage percentages exceeding **90%**, maintaining high code quality and reliability across the software lifecycle.\nCollaborated with cross-functional teams in leveraging **Golang** for microservices architecture, facilitating communication between different parts of the application stack and improving overall performance by **30%**.\nMaintained documentation for APIs and features developed, ensuring clarity and understanding for both technical teams and stakeholders, contributing to smoother transitions during hand-offs.\n"
    }
  ],
  "skills": " **Programming Languages:**\n\tRust, Golang, Python, JavaScript, TypeScript\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n **Frontend Frameworks:**\n\tReact, Vue, Angular\n\n **API Technologies:**\n\tOAuth, OIDC\n\n **Serverless and Cloud Functions:**\n\tAWS: ECS, Lambda; Azure: App Services\n\n **Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD\n\n **Cloud & Infrastructure:**\n\tAWS: RDS, S3; Azure: Blob Storage, SQL Database; Terraform, Ansible, Helm, Docker Compose\n\n **Other:**\n\tAI, Machine Learning, Security, Authentication, Authorization, IAM, Keycloak, Nginx, Let’s Encrypt, Certbot, MLflow, Airflow, Kubeflow",
  "apply_company": "1Password"
}