{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Drupal Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-152840397/",
  "profile_summary": "As a Senior Drupal Engineer with 8 years of experience, I excel in delivering high-quality, secure, and performant applications in compliance with industry standards including **FedRAMP**, **FISMA**, and **Section 508**. My technical proficiency encompasses **Drupal**, **Cypress**, and **Apache JMeter**, facilitating seamless Test Automation, Performance Testing, API Testing, and Database Testing. I have a strong understanding of Agile methodologies and defect tracking systems, ensuring efficient project management and continuous improvement.\nMy background includes extensive work in the healthcare and financial sectors, employing **JavaScript/TypeScript**, **Python**, and **Flutter** for full-stack development. I possess significant cloud experience in both **AWS** and **Azure**, and have led initiatives integrating AI/ML capabilities for enhanced data processing solutions. With a solid foundation in microservices architecture, event-driven systems, and CI/CD automation, I focus on building robust, secure applications that adhere to compliance standards like **HIPAA**, **FHIR**, **PCI DSS**, and **SOC 2**. Additionally, I have hands-on experience in developing machine learning pipelines and implementing MLOps workflows using tools like **MLflow**, **Airflow**, and **Kubeflow**.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Drupal Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Implemented test automation frameworks and strategies using **Cypress** and **Apache JMeter** to ensure high-quality deliverables within Agile environments.\nConducted performance testing and security validation to meet **FedRAMP**, **FISMA**, and **Section 508** compliance, enhancing application reliability and security.\nPerformed rigorous API and database testing to ensure robust integration and functionality across platforms, reducing defect rates by **30%**.\nUtilized defect tracking tools to maintain a clear log of issues, ensuring timely resolutions and adherence to project timelines.\nCollaborated within cross-functional Agile teams to enhance development processes and deliver **Drupal** solutions, maximizing performance and user engagement.\nContributed to developing high-quality, secure web applications on **AWS** and **Azure** cloud platforms, ensuring scalability and performance efficiency.\nLeveraged **ISTQB** and **CSTE** methodologies to establish best practices for software testing and quality assurance across the development lifecycle.\nEngaged in continuous improvements through integration of automated testing techniques, resulting in a **25%** decrease in manual testing efforts.\nEnsured accessibility compliance and standards through testing, employing **508 Trusted Tester** protocols to create inclusive user experiences."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Implemented and maintained **Drupal** CMS for high-security projects, ensuring compliance with **FedRAMP** and **FISMA** standards, and executing **Section 508** accessibility validations for over **20** web applications.\nConducted extensive **test automation** using tools such as **Cypress** and **Apache JMeter** to improve testing efficiency by **30%**, while ensuring rigorous **performance testing** and **security validation** for Drupal websites.\nCollaborated with cross-functional teams in an **Agile** environment to track and resolve defects using **defect tracking** software, enhancing team productivity and project delivery timelines by **25%**.\nDesigned and executed **API testing** and **database testing** strategies to verify functionality and data integrity, contributing to a **99.9%** uptime of deployed applications.\nLeveraged cloud services such as **AWS** and **Azure** to deploy, manage, and maintain Drupal environments, resulting in cost reductions and improved scalability of services.\nContributed to the establishment of a **CI/CD** pipeline for seamless deployment workflows, utilizing industry best practices and tools for efficient software development life cycle management."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Utilized **Drupal** to develop and maintain high-performance backend services for an enterprise-level content management system, ensuring optimal scalability and security validation.\nImplemented **Test Automation** strategies with tools like **Cypress** and **Apache JMeter** to enhance performance testing and API testing, achieving a test coverage of **95%** and reducing release cycle times by **30%**.\nConducted **Database Testing** to ensure data integrity and conflict-free transactions within the content management system, leveraging robust database management practices.\nExecuted performance testing using **Apache JMeter**, achieving a system response time improvement of **50%** during peak load scenarios.\nApplied Agile methodologies for iterative development and strong collaboration with cross-functional teams, increasing product delivery speed by **40%**.\nEnsured compliance with Federal standards such as **FedRAMP** and **FISMA**, integrating security validation processes throughout the software development lifecycle.\nConfigured and managed applications in **AWS** and **Azure** cloud environments, optimizing deployments for reliability and cost-effectiveness.\nMaintained defect tracking systems as part of the quality assurance process, achieving a defect resolution rate of **85%** during initial testing phases.\nAdvocated for accessibility adherence by implementing **Section 508** standards, enhancing usability for all users and achieving regulatory compliance.\nActively participated in continuous improvement initiatives, obtaining certifications like **ISTQB** and **CSTE**, contributing to professional development and team knowledge sharing."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, JavaScript/TypeScript\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django, Drupal\n\n **Frontend Frameworks:**\n\tReact, Vue, Angular, Cypress\n\n **API Technologies:**\n\tAPI Testing\n\n **Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n **Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:**\n\tFedRAMP, FISMA\n\n **Other:**\n\tMLflow, Airflow, Kubeflow, Test Automation, Performance Testing, Security Validation, Apache JMeter, Database Testing, Agile, ISTQB, CSTE, 508 Trusted Tester, Authentication & Security (Keycloak, JWT, OAuth2, Let’s Encrypt, Nginx, Certbot), Defect Tracking",
  "apply_company": "Addison Group"
}