{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Sales Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "Dynamic Senior Sales Engineer with 8 years of robust experience in **Technical Solution Design**, **Project Management**, and **Specification Development** within the healthcare and financial sectors. With a strong emphasis on **Customer Relationship Management**, I excel in fostering collaboration and driving customer-oriented solutions.\nProficient in **JavaScript/TypeScript**, **Python**, **Flutter**, and experienced with **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**, I leverage my full-stack development knowledge to deliver tailored technical presentations that translate complex technical concepts into customer-friendly solutions. My background in deploying solutions on **Azure** and **AWS** underpins my ability to provide high-performance applications while ensuring compliance with industry standards.\nExcellent problem-solving skills combined with proficient communication in both **Fluent German** and **English** add value to my role as I engage with clients effectively. I take initiative and thrive in team environments, driven by a passion for continuous improvement and innovation.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Sales Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Leveraged **Technical Solution Design** skills to architect and develop tailored electrotechnical solutions for clients, ensuring alignment with their specific needs within healthcare and financial sectors.\nUtilized **Project Management** expertise to oversee the end-to-end deployment of integrated lighting systems, coordinating timelines and budgets to achieve project milestones effectively.\nDeveloped robust **Customer Relationship Management** strategies, enhancing engagement and satisfaction through active listening and addressing customer concerns promptly.\nDemonstrated strong **Team Collaboration** by working alongside cross-functional teams, sharing insights and strategies to optimize technical proposals and presentations.\nConducted **Technical Presentations** in fluent German and English, articulating complex technical concepts to diverse stakeholders, including clients and internal teams.\nCultivated a **Customer Orientation** approach, ensuring that all solutions met the operational requirements and expectations of clients.\nInitiated and led problem-solving sessions to address client challenges in electrotechnics and lighting systems, resulting in streamlined processes and enhanced product offerings.\nEmployed **Specification Development** techniques to create detailed project specifications that guided the implementation of complex technical systems.\nHarnessed initiative and proactive communication to keep clients informed throughout project lifecycles, promoting transparency and trust in service delivery."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Developed tailored technical solutions for clients leveraging in-depth knowledge of **Electrotechnics** and **Lighting Systems**, ensuring effective project management and specification development.\nManaged and executed projects efficiently by utilizing strong **Project Management** skills, achieving an on-time delivery rate of **95%** across multiple projects.\nFostered strong customer relationships through active listening and customer orientation, resulting in a **30%** increase in client satisfaction scores year-over-year.\nDesigned and presented technical solutions effectively to diverse audiences, enhancing customer understanding and engagement, supported by proficient **Technical Presentation** skills.\nCollaborated with cross-functional teams to drive innovative lighting projects, ensuring alignment and active participation, exemplifying strong **Team Collaboration** abilities.\nInitiated and implemented problem-solving strategies effectively, leading to operational improvements that reduced project bottlenecks by **20%**.\nUtilized excellent communication skills in **Fluent German** and **English Proficiency** to cater to a diverse customer base, expanding market reach significantly.\nAssessed customer needs and provided proactive solutions that enhanced functionality and increased user productivity by implementing tailored solutions based on gathered specifications."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Led technical solution design and specification development for electrotechnics and lighting systems projects, enhancing customer satisfaction through tailored solutions and robust project management practices.\nManaged project timelines and deliverables, showcasing superior project management skills that resulted in a **30% reduction** in project completion times across **5** major installations.\nCultivated strong customer relationships by actively listening to client feedback and providing innovative solutions based on their needs, achieving a **20% increase** in client retention rates through focused customer relationship management strategies.\nDrove team collaboration efforts by facilitating cross-functional meetings and technical presentations, ensuring alignment between sales, engineering, and support teams to expedite project rollouts.\nApplied problem-solving skills to troubleshoot complex system issues, reducing the average resolution time by **40%** through effective, initiative-driven approaches.\nDeveloped and delivered technical presentations in fluent German and English, enhancing client understanding of complex system specifications and driving informed decision-making.\nDemonstrated strong customer orientation by conducting in-depth needs assessments and tailoring proposals, resulting in a **25% increase** in sales conversion rates.\nUtilized strong initiative to identify and implement process improvements within the team, enhancing overall operational efficiency and driving a culture of continuous improvement."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, JavaScript, TypeScript\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n **Frontend Frameworks:**\n\tReact, Vue, Angular\n\n **API Technologies:**\n\tJWT, OAuth2\n\n **Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda), Azure (App Services)\n\n **Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:**\n\tAWS (RDS, S3), Azure (Blob, SQL)\n\n **Other:**\n\tElectrotechnics, Lighting Systems, Project Management, Customer Relationship Management, Technical Solution Design, Specification Development, Team Collaboration, Active Listening, Customer Orientation, Initiative, Problem Solving, Fluent German, English Proficiency, Technical Presentation",
  "apply_company": "Eaton"
}