{
  "name": "Rei Taro",
  "role_name": "Senior Frontend Engineer",
  "email": "rei515@outlook.com",
  "phone": "+48732529451",
  "address": "Warszawa, Poland",
  "linkedin": "https://www.linkedin.com/in/rei-taro-81a410391/",
  "profile_summary": "Results-driven Senior Frontend Engineer with over 10 years of experience in developing high-performance applications and delivering innovative solutions. Proficient in **React**, **Redux**, and **Typescript**, leveraging these frameworks to create responsive, user-friendly interfaces. Experience includes working with AI technologies, geospatial databases like **PostGIS**, and cloud-based data warehousing solutions such as **Amazon Redshift**, **Snowflake**, and **Databricks**. Strong expertise in collaboration tools such as **Slack** and **Shortcut**, ensuring streamlined communication and agile project management. Proven ability to document, test, and profile code meticulously, enhancing software quality and reliability. A track record of success at renowned firms including VISA, Sii Poland, and Reply Polska.",
  "education": [
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2010",
      "to_year": "2015",
      "location": "Japan",
      "university": "Keio University"
    }
  ],
  "experience": [
    {
      "role": "Senior Frontend Engineer",
      "company": "Leobit",
      "from_date": "Aug 2022",
      "to_date": "Present",
      "location": "Poland",
      "responsibilities": "Utilized **React** and **Typescript** to develop user-friendly and responsive web applications, enhancing user experiences with a focus on client-side performance and accessibility.\nEmployed **Redux** for effective state management to ensure predictable states in complex applications, improving application scalability.\nCollaborated with backend teams to design and implement RESTful APIs, enhancing integration with services built in **Python** and **FastAPI**.\nUsed **Git** and **GitHub** for version control, enabling seamless collaboration and efficient code reviews across the development team.\nIntegrated documentation practices into the development process, enhancing knowledge transfer and onboarding efficiency, achieving a **30%** increase in team onboarding speed.\nConducted rigorous testing and profiling of applications resulting in a **25%** reduction of load times in production environments. \nActively participated in code review sessions and suggested improvements that contributed to a **15%** decrease in bug rates post-release.\nCollaborated with cross-functional teams via **Slack** and **Shortcut** to adhere to project timelines and ensure compliance with evolving business requirements."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Innovature",
      "from_date": "Nov 2018",
      "to_date": "Jun 2022",
      "location": "Japan",
      "responsibilities": "- Developed user interfaces leveraging **React**, **Redux**, and **TypeScript** to enhance user engagement and optimize user experience across web applications.\n- Collaborated in the design of workflows for testing and profiling code, implementing best practices in documentation to ensure ease of maintenance and scalability.\n- Integrated AI functionalities into frontend applications, utilizing modern algorithms and models to improve data visualization and decision-making processes.\n- Ensured robust geospatial data handling by incorporating **PostGIS** and leveraged **BigQuery** for efficient data analytics on large datasets with over **10TB** of geospatial data.\n- Utilized version control systems like **Git** and **GitHub** to manage multiple projects and coordinate with team members for effective code collaboration and review processes.\n- Spearheaded the integration of APIs with backend services built on technologies such as **NodeJS**, delivering seamless data interactions for end-users.\n- Executed comprehensive testing strategies with focus on unit and integration testing, contributing to a **30%** reduction in bugs during the deployment phase.\n- Managed agile project boards and communication channels via **Slack** and **Shortcut**, ensuring prompt updates and collaborative discussions, contributing to on-time project delivery."
    },
    {
      "role": "Software Developer",
      "company": "Wizcorp",
      "from_date": "Apr 2015",
      "to_date": "Nov 2018",
      "location": "Japan",
      "responsibilities": "Developed comprehensive documentation to ensure seamless integration of **React** and **Redux** with the backend services, emphasizing clear communication among teams.\nEngineered testing strategies utilizing **Git** and **GitHub** for version control, enabling smooth collaboration and code reviews with a focus on quality and efficiency.\nImplemented profiling techniques, improving application performance and user experience, specifically targeting load times reduced by up to **40%**.\nOptimized data retrieval and manipulation through integration with **PostGIS** and **BigQuery**, enhancing the accuracy of geospatial features within the platform.\nCollaborated with the data engineering team to leverage **Amazon Redshift** and **Snowflake** for robust data analytics while ensuring compliance with **GDPR** and **MiFID II** regulations.\nParticipated in Agile methodologies using tools like **Slack** and **Shortcut** to enhance team productivity and streamline project tracking, resulting in a **25%** improvement in sprint delivery efficiency.\nFacilitated knowledge-sharing sessions focused on **Typescript** best practices, fostering a culture of continuous improvement among peers."
    }
  ],
  "skills": " **Programming Languages** \n\t Python (3.8+), SQL, Bash, JavaScript, Typescript \n\n **Backend Frameworks** \n\t FastAPI, Flask, Django, Celery, NodeJS \n\n **Frontend Frameworks** \n\t React, Redux \n\n **API Technologies** \n\t REST/gRPC APIs, Microservices \n\n **Serverless and Cloud Functions** \n\t AWS (EC2, S3, Lambda), Azure, Docker, Kubernetes, GitHub Actions, Azure DevOps \n\n **Databases** \n\t PostgreSQL, MySQL, MongoDB, Redis, PostGIS, BigQuery, Amazon Redshift, Snowflake, Databricks, Oracle \n\n **DevOps** \n\t CI/CD, PyTest, Git, GitHub, Documentation, Testing, Profiling \n\n **Cloud & Infrastructure** \n\t AWS, Azure, Docker, Kubernetes \n\n **Other** \n\t AI, geospatial, Kafka, Slack, Shortcut ",
  "apply_company": "CARTO"
}