{
  "name": "Patryk Zaslawski",
  "role_name": "Senior Fullstack Engineer",
  "email": "patrykzas0428@outlook.com",
  "phone": "+48669862402",
  "address": "Gdanski, Poland",
  "linkedin": "https://www.linkedin.com/in/patryk-z-9b9455391/",
  "profile_summary": "As a highly experienced Senior Full Stack Engineer, I bring 8+ years of software engineering expertise with a strong focus on **JavaScript**, **TypeScript**, **Node.js**, and **React**. I excel in Agile methodologies, utilizing modern development practices to deliver scalable and efficient solutions. My background in **Machine Learning**, **AI**, and **IoT** positions me to integrate cutting-edge technologies into application designs effectively. Additionally, my proficiency in Python (specifically **FastAPI**, **Django**, **Flask**, and **SQLAlchemy**) allows me to create secure and high-performance backend systems. I also leverage my skills in frontend frameworks like **Angular**, **Vue**, and **Next.js**, along with cloud platforms such as **AWS** and **Azure**, and database optimization with **PostgreSQL**, **MySQL**, and **MongoDB**. With a commitment to microservices architecture and REST/gRPC API development, I am dedicated to delivering enterprise-grade solutions that meet evolving business needs.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2014",
      "to_year": "2017",
      "location": "United Kingdom",
      "university": "The University of Manchester"
    }
  ],
  "experience": [
    {
      "role": "Senior Fullstack Engineer",
      "company": "Binary Studio",
      "from_date": "Aug 2023",
      "to_date": "Present",
      "location": "United Kingdom (Remote)",
      "responsibilities": "Developed and maintained efficient web applications using **JavaScript**, **TypeScript**, and **React**, enhancing user experience through modern UI/UX practices.\nImplemented machine learning algorithms in fullstack applications, leveraging data analysis for predictive modeling and customer insights.\nCollaborated with cross-functional teams in an **Agile** environment, ensuring timely delivery and high-quality code standards across multiple projects.\nDesigned and developed server-side applications using **Node.js**, ensuring robust backend support for interactive features and real-time functionalities.\nLed integration of IoT devices into web platforms, creating seamless interfaces for user interaction and data collection.\nEnhanced application performance with front-end optimization techniques, resulting in a **30%** increase in loading speed and improved user retention.\nConducted code reviews and established best practices in **JavaScript** and application architecture, fostering collaboration and mentorship within the development team.\nUtilized responsive design principles to build applications compatible across various platforms and devices, ensuring a broad user reach and engagement.\nEmployed various state management libraries to maintain application state and enhance performance across components in **React** applications.\nExecuted unit and integration tests to ensure reliability and stability of applications, achieving a minimum of **95%** code coverage in the test suite.\nEngaged in continuous learning of emerging technologies and frameworks to maintain a competitive edge in development practices and deliver innovative solutions."
    },
    {
      "role": "Software Engineer",
      "company": "Ardigen",
      "from_date": "Mar 2020",
      "to_date": "Aug 2023",
      "location": "Poland",
      "responsibilities": "Leveraged **JavaScript**, **TypeScript**, and **Node.js** to develop and maintain dynamic, user-centric frontends using **React**, ensuring responsive and efficient user interfaces for banking applications.\nDesigned and implemented scalable, secure, and high-performance backend services using **Python** frameworks such as **Django** and **FastAPI**, achieving a **30%** reduction in response time for API calls.\nIntegrated machine learning components to enhance user experiences and implemented AI-driven functionalities within web applications, contributing to a **20%** increase in user engagement.\nCollaborated in an **Agile** environment, leading team sprints and ensuring timely delivery of features and improvements.\nParticipated in end-to-end development, from designing interfaces in **React** to managing server logic in **Node.js**, ensuring seamless communication between frontends and backends.\nBuilt and deployed cloud-native applications using AWS and Azure, successfully migrating from legacy systems to modern architectures in less than **3 months**.\nUtilized IoT edge solutions to collect real-time data, processing inputs via **Node.js** applications for immediate insights and actions, enhancing operational efficiency.\nImplemented RESTful and gRPC APIs, securing communications with **OAuth 2.0** and ensuring compliance with industry regulations.\nImproved system performance by optimizing database queries against SQL Server and PostgreSQL, resulting in a **25%** efficiency boost.\nEmployed CI/CD practices with **GitHub Actions** for streamlined deployment processes, reducing release cycles by **40%**."
    },
    {
      "role": "Software Engineer",
      "company": "Altum Software",
      "from_date": "Oct 2017",
      "to_date": "Feb 2020",
      "location": "United Kingdom",
      "responsibilities": "• Developed dynamic and responsive frontends using **React**, integrated seamlessly with backend services to enhance user experience and application performance.  \n• Leveraged **JavaScript** and **TypeScript** to build interactive web applications, improving maintainability and scalability across projects leveraging frameworks like **Node.js**.  \n• Collaborated in an **Agile** environment to deliver user-centric features, meeting project deadlines and improving overall team productivity by **20%**.  \n• Enhanced backend services with **Node.js** for efficient handling of high-volume user interactions, ensuring robust application performance and reliability.  \n• Implemented machine learning algorithms for predictive analytics, improving decision-making processes within the application by over **30%**.  \n• Contributed to the integration of Internet of Things (**IoT**) technologies that enabled real-time data capture and processing, enriching user interactions.  \n• Engaged in continuous improvement of web application workflow, employing Agile practices to enhance project adaptability, leading to a **15%** reduction in time-to-market.  \n• Conducted code reviews and mentoring sessions to upskill team members and maintain high coding standards across projects.  \n• Analyzed user feedback and metrics, utilizing insights to drive feature enhancements and optimize user experience for at least **10%** increase in user satisfaction.  \n• Utilized advanced **JavaScript** features and libraries in conjunction with **Node.js** to create performant, scalable server-side applications.  \n• Orchestrated the design and implementation of a microservices architecture augmenting system flexibility and service isolation, improving deployment frequency by **30%**.  \n• Developed and maintained CI/CD workflows, facilitating automated testing and monitoring across development cycles for consistent build quality."
    }
  ],
  "skills": "**Programming Languages:**\n\tPython, JavaScript, TypeScript\n\n**Backend Frameworks:**\n\tFastAPI, Django, Flask, Spring Boot, Node.js\n\n**Frontend Frameworks:**\n\tAngular (1–16), React (15–18), Next.js, Vue.js (2/3), Blazor\n\n**API Technologies:**\n\tREST & gRPC APIs\n\n**Serverless and Cloud Functions:**\n\tAWS (Lambda), Azure (App Services)\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis, SQLAlchemy\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD\n\n**Cloud & Infrastructure:**\n\tAWS (ECS, RDS, S3), Azure (Blob, SQL), Nginx, Certbot\n\n**Other:**\n\tPydantic, Celery, Keycloak (OIDC, RBAC), JWT, OAuth2, Machine Learning, AI, IoT, Agile",
  "apply_company": "London Borough of Richmond upon Thames"
}