{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Backend Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Senior Backend Engineer with 13+ years of experience proficient in **Node.js**, **TypeScript**, and implementation of REST and GraphQL APIs. Strong expertise in data handling with **SQL** and **NoSQL** databases. Skilled in deploying cloud solutions using **AWS** and orchestrating containerized applications with **Docker** and **Kubernetes**. \nPossesses a solid background in both frontend and backend technology stacks, including **React**, **Next.js**, **Vue**, **Python**, and **Flutter**. Demonstrated success in developing high-performance applications for healthcare and financial industries, ensuring compliance with HIPAA, FHIR, PCI DSS, and SOC 2 standards. Proficient in building AI/ML-powered platforms with hands-on experience in MLOps using **MLflow**, **Airflow**, and **Kubeflow**.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Backend Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Developed robust backend solutions leveraging **Node.js** and **TypeScript** to create RESTful and GraphQL APIs for seamless data exchange.\n• Designed and implemented database architectures using **SQL** (PostgreSQL) and **NoSQL** (MongoDB, Redis) technologies, ensuring efficient data storage and retrieval.\n• Orchestrated containerized applications with **Docker** and **Kubernetes** for efficient deployment and scaling in cloud environments like **AWS**.\n• Built CI/CD pipelines with **GitHub Actions** and **CircleCI** to automate testing and deployment processes, achieving a decrease in deployment times by **40%**.\n• Led the migration of legacy systems to microservices, enhancing system resilience and scalability, which improved uptime by **25%**.\n• Engaged in rigorous application of testing frameworks such as Jest and Postman, achieving over **90%** test coverage across backend services.\n• Integrated with cloud services and third-party tools to enhance application features and performance, including data processing workflows on **AWS**.\n• Collaborated with frontend teams to ensure a seamless experience by consuming backend APIs efficiently designed for performance and security.\n• Implemented security best practices in all backend services to meet compliance requirements and safeguard sensitive data."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Leveraged **Node.js** to build scalable backend services integrating with **REST** and **GraphQL** APIs, enhancing overall performance for high-traffic applications.\nUtilized **TypeScript** to develop type-safe applications, improving maintainability and reducing runtime errors in critical systems.\nDesigned and implemented database solutions using **SQL** and **NoSQL** to optimize data storage and retrieval for financial transactions, supporting up to **100,000** transactions per minute.\nDeployed cloud infrastructure with **AWS**, using services such as EC2, S3, and Lambda to ensure optimal application performance and scalability.\nContainerized applications using **Docker** and orchestrated them with **Kubernetes** for efficient microservices management, achieving **99.9%** uptime.\nCollaborated closely with frontend teams to ensure seamless integration of backend services with user interfaces built on **React** and **Vue.js**, improving load times by **30%**.\nConducted rigorous API testing and documentation, ensuring robust service delivery aligned with industry standards and regulatory compliance.\nActively participated in code reviews and agile ceremonies, assisting in the mentorship of junior engineers and fostering a culture of continuous improvement."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Developed scalable backend services utilizing **Node.js** and **TypeScript**, ensuring RESTful architectures and optimal performance for a high-traffic e-commerce platform.\nEngineered resilient data solutions leveraging both **SQL** and **NoSQL** (MongoDB, PostgreSQL) databases, enabling seamless data access for more than **300,000** daily users.\nImplemented **Docker** and **Kubernetes** for efficient deployment and management of microservices, achieving a **50%** reduction in deployment time and simplified orchestration.\nCreated and maintained comprehensive APIs adhering to **REST** and **GraphQL** standards, which improved data fetching efficiency by **35%**.\nEnhanced cloud infrastructure reliability through **AWS** best practices, ensuring a global uptime of **99.99%** across services.\nStreamlined the application architecture for high availability and low latency, delivering quick load times and smooth user experiences on both web and mobile platforms.\nCollaborated with cross-functional teams to integrate user access management using OAuth 2.0, ensuring robust security and compliance with GDPR.\nOptimized performance through advanced caching techniques, including Redis and in-memory data structures, leading to enhanced application responsiveness.\nConducted thorough performance testing and monitoring, utilizing metrics to drive enhancements and proactively address bottlenecks.\nMentored junior engineers on best practices in backend development, contributing to a **40%** increase in team productivity."
    }
  ],
  "skills": "**Programming Languages:**\n\tPython, JavaScript, TypeScript\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django, Node.js\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tREST, GraphQL\n\n**Serverless and Cloud Functions:**\n\tAWS Lambda\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis, SQL, NoSQL\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD\n\n**Cloud & Infrastructure:**\n\tAWS (ECS, RDS, S3), Azure (App Services, Blob Storage, SQL Database)\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), OAuth2, JWT, Nginx, Let’s Encrypt, Certbot, Terraform, Ansible, Helm, Docker Compose",
  "apply_company": "TechTree"
}