{
  "name": "Mariusz Jan Skobel",
  "role_name": "Senior Backend Engineer",
  "email": "mariuszskobel15@outlook.com",
  "phone": "+48 735 343 548",
  "address": "Katowice, Poland",
  "linkedin": "https://www.linkedin.com/in/mariusz-skobel-927764397/",
  "profile_summary": "Senior Backend Engineer with 10+ years of experience in building scalable, high-performance applications in the cloud. Expert in **Java**, **Spring Boot**, and RESTful APIs, with a strong foundation in cloud services such as **GCP**, **AWS**, and **Azure**. Proficient in designing and developing effective microservices architecture and event-driven systems. Skilled in database management with **MySQL** and **NoSQL** solutions. Proven ability to maintain code quality and streamline CI/CD processes using **Git** and **GitLab**, while adhering to Agile methodologies.\nAdvanced knowledge of AI tools and the integration of AI capabilities into backend solutions. Adept at working with **Pub/Sub** and **Kafka** for real-time data processing. Passionate about delivering solutions that not only meet business requirements but also adhere to compliance standards and drive operational excellence. Excels in creating maintainable and secure backend systems that contribute to impactful software solutions.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2012",
      "to_year": "2015",
      "location": "UK",
      "university": "University of Bristol"
    }
  ],
  "experience": [
    {
      "role": "Senior Backend Engineer",
      "company": "EitBiz",
      "from_date": "Oct 2022",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "•\tDeveloped robust and scalable RESTful APIs using **Java** and **Spring Boot** to support healthcare and finance applications, ensuring compliance with industry standards such as HIPAA and PCI DSS.\n•\tLeveraged cloud services such as **AWS**, **GCP**, and **Azure** for deploying applications and maintaining high availability, facilitating seamless integration of microservices with **Docker** and **Kubernetes** orchestration capabilities.\n•\tImplemented data storage solutions using **MySQL** and various **NoSQL** databases to optimize data retrieval and management, enhancing application performance by up to **50%** in load testing scenarios.\n•\tStreamlined application architecture from monolithic to microservices using **Pub/Sub** and **Kafka** technologies, improving fault tolerance and reducing deployment times by **30%**.\n•\tDesigned and integrated AI tools into backend systems for predictive analysis and intelligence-driven decision-making, resulting in a more efficient data processing pipeline with a lead time reduction of **40%**.\n•\tEnsured code quality and version control through the use of **Git** and **GitLab**, establishing best practices in Agile methodology to enhance team collaboration and productivity.\n•\tActively participated in Agile ceremonies, delivering work in iterative sprints, and continuously improving back-end system functionalities based on user feedback and performance metrics.\n•\tExecuted complex queries and optimized data flow using **GraphQL**, facilitating efficient data interactions and enhancing the UX/UI experience for users across platforms.\n•\tCollaborated with cross-functional teams to integrate advanced analytics and machine learning features, fostering a data-driven culture within the organization.\n•\tEstablished CI/CD pipelines using modern DevOps tools, reducing deployment times and increasing the frequency of updates to production environments."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Tvn S.A.",
      "from_date": "Oct 2019",
      "to_date": "Sep 2022",
      "location": "Poland",
      "responsibilities": "Utilized **Java** and **Spring Boot** to develop and maintain scalable backend services, ensuring robust RESTful APIs and enhancing system performance by **30%**.\nDesigned and implemented data storage solutions using **MySQL** and **NoSQL** databases for effective data handling, improving retrieval times by **25%**.\nLeveraged cloud platforms such as **GCP** and **AWS** to deploy applications and services, enhancing system reliability and availability.\nDeveloped event-driven architectures using **Kafka** and **Pub/Sub** for asynchronous processing, which streamlined transactional workflows and increased throughput by **20%**.\nImplemented Agile methodologies in project management and development processes, facilitating continuous integration and delivery for quicker deployments.\nCollaborated with cross-functional teams to define and optimize backend processes, resulting in a **15%** reduction in operational costs.\nEmployed **AI Tools** for predictive analytics and machine learning model integration, enhancing decision-making capabilities across backend services.\nMaintained version control using **Git** and **GitLab**, ensuring seamless code collaboration and deployment processes across the development team."
    },
    {
      "role": "Software Engineer",
      "company": "Timspark",
      "from_date": "Sep 2015",
      "to_date": "Aug 2019",
      "location": "UK",
      "responsibilities": "Developed and optimized backend services for scalable applications using **Java** and **Spring Boot**, ensuring responsiveness and reliability under loads of **over 100,000** concurrent users.\nEngineered RESTful APIs and utilized **GraphQL** for efficient data fetching, enhancing application performance and reducing payload sizes by **30%**.\nLeveraged cloud platforms such as **GCP**, **AWS**, and **Azure** to deploy and manage applications, utilizing container orchestration with Kubernetes for streamlined deployment and scaling.\nImplemented Pub/Sub messaging patterns with **Kafka** for real-time data streaming and processing, achieving near-zero latency data updates in transactional workflows.\nIntegrated AI tools for advanced analytics and personalization, driving improved user engagement and boosting conversion rates by **25%**.\nExecuted version control practices through **Git** and **GitLab**, managing codebase changes and ensuring solid collaboration among team members, resulting in quicker release cycles within an **Agile** environment.\nDesigned data storage solutions utilizing both **MySQL** and **NoSQL** databases to ensure data consistency and integrity for high-volume transaction systems.\nImplemented robust security practices, incorporating RBAC and OAuth 2.0 for secure user authentication and compliance with data protection regulations like GDPR.\nContributed to system architecture discussions and design while mentoring junior developers, fostering a collaborative and growth-oriented team culture."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, Java, JavaScript, TypeScript\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django, Spring Boot\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tRESTful APIs, GraphQL\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL), GCP\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, NoSQL, Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS, Azure, GCP\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, AI Tools, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, Agile, Pub/Sub, Kafka",
  "apply_company": "Pathway Solutions GmbH"
}