{
  "name": "Mariusz Jan Skobel",
  "role_name": "Customer Engineer",
  "email": "mariuszskobel15@outlook.com",
  "phone": "+48 735 343 548",
  "address": "Katowice, Poland",
  "linkedin": "https://www.linkedin.com/in/mariusz-skobel-789557397/",
  "profile_summary": "Customer Engineer with 10+ years of experience in software development and a robust foundation in data management and governance. Skilled in ensuring data quality, privacy, and integration across enterprise architectures, leveraging **data catalog** and **data lakes** to enhance data delivery and accessibility. Proficient with **PaaS providers** and **integration platforms**, my expertise in modern technologies such as **JavaScript**, **TypeScript**, **Python**, and **Flutter** complements my ability to manage projects effectively and deliver customer-focused solutions. I have a proven track record in project management and process management, with strong skills in value-based selling, cost-benefit analysis, and ROI analysis that drive business value. \n\nMy technical proficiencies span the full stack, including **React**, **Node.js**, **FastAPI**, **Django**, and I am experienced in building and deploying applications on **Azure** and **AWS**. I bring a unique perspective on developing secure, compliant solutions adhering to standards like HIPAA, FHIR, PCI DSS, and SOC 2, while championing continuous learning and collaboration. I am dedicated to leveraging my technical knowledge and effective communication skills to drive impactful results.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2012",
      "to_year": "2015",
      "location": "UK",
      "university": "University of Bristol"
    }
  ],
  "experience": [
    {
      "role": "Customer Engineer",
      "company": "EitBiz",
      "from_date": "Oct 2022",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "•\tImplemented robust **data governance** practices within scalable, full-stack solutions for healthcare and finance, ensuring adherence to **data privacy** regulations like HIPAA and GDPR.\n•\tEnabled high **data quality** through the design and maintenance of cloud-native data architecture using **PostgreSQL**, **MongoDB**, and **Redis**, optimizing for large-scale data ingestions.\n•\tConducted **cost-benefit analysis** and **ROI analysis** for new features in mobile applications built with **Flutter** and **React Native**, leading to an improved user experience across both iOS and Android platforms.\n•\tUtilized effective **process management** to integrate advanced AI-based features into client-facing applications, enhancing customer satisfaction with smart financial dashboards and personalized health recommendations.\n•\tFostered team **collaboration** during the re-architecture of monolithic applications into microservices-based ecosystems using **Docker** and **Kubernetes (AKS/EKS)** for high availability and fault tolerance.\n•\tEmployed **project management** skills to build and deploy MLOps pipelines with **MLflow**, **DVC**, and **Apache Airflow**, achieving continuous validation and deployment of models across various environments.\n•\tLeveraged **enterprise architecture** principles to deliver financial data visualization tools using **D3.js**, **Chart.js**, and **Power BI Embedded**, facilitating real-time insights and KPI tracking.\n•\tIntegrated **PaaS providers** like **AWS Lambda** and **Azure Functions** for serverless architectures, optimizing deployment strategies to support scalability.\n•\tChampioned the establishment of test strategies using **Jest**, **Cypress**, **PyTest**, and **Postman**, executing over **200 tests** across front-end and backend services to ensure software reliability.\n•\tEnhanced **integration platforms** by collaborating with data scientists to implement **NLP models** using **spaCy** and **Hugging Face Transformers**, enabling advanced parsing and anomaly detection capabilities.\n•\tCultivated a culture of **continuous learning** and **flexibility** in the development team by providing training sessions on the latest technologies and best practices.\n"
    },
    {
      "role": "Senior Software Engineer",
      "company": "Tvn S.A.",
      "from_date": "Oct 2019",
      "to_date": "Sep 2022",
      "location": "Poland",
      "responsibilities": "Utilized **data governance** and **data quality** principles to ensure compliance and maintain high standards of information integrity within financial platforms.\nDeveloped and managed **data catalog** systems for efficient data discovery, enhancing overall **data management** and usability for various stakeholders.\nApplied **cost-benefit analysis** and **ROI analysis** methodologies to evaluate the financial impact of technology solutions, driving value-based selling efforts within the team.\nLed **process management** initiatives to streamline workflows, enhance productivity, and promote effective collaboration across cross-functional teams.\nExecuted **project management** strategies to ensure timely delivery of software solutions while staying within budget, demonstrating flexibility and effective communication skills.\nImplemented seamless integration of financial systems using **integration platforms** that enhanced interoperability and elevated the customer experience.\nAdvanced **enterprise architecture** design to align technology initiatives with business objectives, improving overall strategic framework for the financial organization.\nFacilitated continuous learning opportunities for team members, motivating them to upgrade their **technical knowledge** and remain competitive in the evolving tech landscape.\n\nDeveloped and modernized financial platforms by adopting a microservices-based architecture using **Node.js** (NestJS/Express) and **Python** (FastAPI, Django), boosting scalability and maintainability for high-volume transaction systems.\nBuilt dynamic user-focused front-end applications using **React** (18), **Vue 3**, **Next.js**, and **TypeScript**, applying **Redux Toolkit** and **Tailwind CSS** to create responsive user interfaces for financial dashboards and admin portals.\nCreated real-time transaction monitoring dashboards using **D3.js** and **Power BI Embedded**, enabling teams to track financial activity and generate actionable insights quickly.\nEstablished an event-driven architecture integrating **Kafka**, **RabbitMQ**, and **Azure Service Bus** to support real-time transaction processing and compliance workflows.\nBuilt and orchestrated **ETL** pipelines using **Python**, **Apache Airflow**, and **Azure Data Factory** for financial data ingestion from various sources.\nImplemented AI/ML-powered fraud detection systems using **scikit-learn**, **XGBoost**, and **Azure Machine Learning**, proactively flagging suspicious activities in banking systems.\nCreated machine learning pipelines for credit scoring, churn prediction, and transaction classification directly integrated into backend services for real-time decision making."
    },
    {
      "role": "Software Engineer",
      "company": "Timspark",
      "from_date": "Sep 2015",
      "to_date": "Aug 2019",
      "location": "UK",
      "responsibilities": "Maintained high standards of **data quality** and **data governance** for backend services, ensuring compliance with **data privacy** regulations and enhancing user trust in the e-commerce platform.\nEmployed effective **integration** strategies for seamless connection with external **PaaS providers** to improve overall system efficiency and service delivery.\nManaged and prioritized tasks through **project management** methodology, leading to a **30%** increase in the efficiency of process improvements and product feature rollouts.\nImplemented **data management** practices, utilizing **Data Lakes** and various **Databases** to ensure high availability of data and optimized data access throughout the platform.\nCollaborated closely with cross-functional teams to deliver customer-focused solutions, fostering effective communication and **collaboration** to meet the evolving needs of the business.\nDemonstrated flexibility and adaptability in approach, responding effectively to changing project requirements while maintaining high levels of team motivation and continuous learning.\nConducted **cost-benefit analysis** and **ROI analysis** for new features and integrations, ensuring the alignment of technology investments with business goals.\nLeveraged business insights drawn from customer interactions and product performance to contribute towards **value-based selling** initiatives that strengthened buyer relationships.\nEmphasized enterprise architecture best practices in design and development, guiding the execution of secure and scalable backend services.\nOptimized application performance through implementing caching techniques using Redis, achieving a **25%** increase in load times and handling peaks of up to **10,000** concurrent users effectively."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython(FastAPI, Flask, Django), JavaScript/TypeScript (React, Vue, Angular)\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tJWT, OAuth2\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS, Azure\n\n**Other:**\n\tdata governance, data catalog, data quality, data privacy, value-based selling, cost-benefit analysis, ROI analysis, process management, project management, data management, integration, enterprise architecture, PaaS providers, Data Lakes, Integration platforms, effective communication, collaboration, customer-focused, flexibility, motivation, continuous learning, technical knowledge"
}