{
  "name": "Tomasz Lee",
  "role_name": "Data Warehouse Developer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Results-driven Data Warehouse Developer with 9+ years of extensive experience in SQL, PL/SQL, and Oracle Database management. Proficient in ETL and Data Integration processes, leveraging tools such as **Oracle ERP**, **Power BI**, **Oracle Analytics**, and **Tableau** to deliver insightful data solutions. Solid expertise in designing and implementing Data Warehouse architectures, ensuring the optimization of data retrieval and reporting performance. Known for fostering collaboration across teams, exhibiting versatility, autonomy, and proactive problem-solving skills to drive project success.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Data Warehouse Developer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Utilized **SQL** and **PL/SQL** to design and execute efficient queries on **Oracle Database**, enhancing data retrieval processes and accuracy in reporting.\nImplemented **ETL** processes to facilitate data integration from various sources into the **Data Warehouse**, ensuring high-quality and accessible data.\nDeveloped interactive dashboards and reporting solutions utilizing **Power BI** and **Tableau**, improving data visibility for stakeholders by 30%.\nCollaborated with cross-functional teams to align data strategy with business objectives, demonstrating strong **proactivity** and **autonomy** in project execution.\nConverted raw data into meaningful insights through effective **Oracle Analytics**, enhancing decision-making processes.\nEngaged in data quality assessment and improvement initiatives using **Data Warehouse** best practices, leading to a 20% improvement in data accuracy.\nProvided support for **Oracle ERP** integration with existing systems, fostering seamless data flow and operational efficiency.\nCommunicated effectively with team members in **French**, delivering technical presentations and documentation to diverse audiences.\nExhibited **versatility** by managing multiple tasks simultaneously within tight deadlines, ensuring timely project delivery.\nDrove project success by leveraging strong analytical skills and attention to detail in all stages of development and deployment."
    },
    {
      "role": "Full Stack Developer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "Utilized **SQL** and **PL/SQL** for data querying and manipulation, ensuring optimal data retrieval from **Oracle Database**, enhancing data processing efficiency by **20%**.\nDesigned and developed data integration workflows using **ETL** processes, leading to a streamlined data flow in the **Data Warehouse** environment.\nLeveraged **Oracle ERP** systems for data analysis and reporting, contributing to a **15%** reduction in reporting time.\nCreated insightful data visualizations using **Power BI** and **Tableau**, increasing data accessibility for stakeholders by **30%**.\nCollaborated with cross-functional teams to gather requirements and craft seamless data solutions, maintaining a **flexible** approach to accommodate varying project needs.\nImplemented strategies for enhanced data accuracy and consistency, resulting in a **10%** improvement in data integrity.\nConducted training sessions on **Oracle Analytics** tools for team members, fostering a culture of **autonomy** and **proactivity** within the team.\nDemonstrated **versatility** by managing various database systems, ensuring effective data integration across platforms.\nCommunicated fluently in **French**, aiding in collaboration with French-speaking stakeholders and expanding project outreach.\nActive participation in code reviews, fostering mentorship, and enhancing skill development within the team."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "Utilized **SQL** and **PL/SQL** to optimize data retrieval processes from **Oracle Database**, resulting in a **30%** increase in query performance.\nDesigned and implemented **ETL** processes for effective **Data Integration** from diverse sources, contributing to the establishment of a robust **Data Warehouse**.\nCreated dynamic reports and dashboards in **Power BI** and **Tableau** for data visualization, improving decision-making efficiency by **25%**.\nCollaborated with cross-functional teams to ensure seamless integration of **Oracle ERP** with the data warehouse framework, enhancing data consistency and accuracy.\nLed data migration projects, ensuring minimal downtime and maintaining data integrity across **Oracle Analytics** platforms.\nEmployed advanced analytical skills to derive insights from complex datasets, impacting product improvements and strategy formulation.\nProvided support for data-related issues and ongoing improvements, leveraging my **knowledge of French Language** when communicating with diverse teams.\nDemonstrated **autonomy**, **versatility**, and **proactivity** in tackling challenges and enhancing workflows within the data development team.\nFacilitated training sessions on data management tools and methodologies, promoting knowledge sharing and professional growth among colleagues."
    }
  ],
  "skills": "**Programming Languages**\n\tJavaScript, TypeScript, C#, .NET, Python, Solidity, PL/SQL\n\n**Backend Frameworks**\n\tNodeJS, ExpressJS, NestJS, Microservices\n\n**Frontend Frameworks**\n\tHTML, CSS, ReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n**API Technologies**\n\tRESTful API, GraphQL\n\n**Serverless and Cloud Functions**\n\tAWS, Azure, CI/CD pipelines\n\n**Databases**\n\tMSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB, Oracle Database\n\n**DevOps**\n\tGit, GitHub\n\n**Cloud & Infrastructure**\n\tData Warehouse, ETL, Data Integration\n\n**Other**\n\tUX/UI Design, Testing Tools (NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest), Apache Kafka, RabbitMQ, Redis, Power BI, Oracle ERP, Oracle Analytics, Tableau, French Language, Autonomy, Versatility, Proactivity, Blockchain"
}