{
  "name": "Tomasz Lee",
  "role_name": "Senior PHP Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Results-driven Senior PHP Engineer with 9+ years of experience in developing and deploying high-performance web applications using **PHP**, **Magento 2**, **Laravel**, and **API** integration. Proficient in utilizing modern frontend technologies like **React** and **Alpine.js**, paired with backend frameworks. Strong expertise in utilizing tools such as **PHPUnit** for testing, **Git** for version control, and **JIRA** for project management. Demonstrated capability of leading projects to successful outcomes, optimizing performance, and collaborating effectively across teams. Adept at harnessing cloud services like **AWS** to enhance development and deployment processes.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Senior PHP Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Utilized **PHP** and **Magento 2** to design and develop robust e-commerce solutions, increasing website traffic by **30%**.\nImplemented **Laravel** framework for streamlined application development, achieving a code reusability rate of **50%**.\nDesigned and developed dynamic front-end components using **Alpine.js** and **React**, enhancing user engagement and reducing page load times by **20%**.\nConstructed and maintained RESTful APIs, ensuring smooth integration with third-party services and enhancing data accessibility across the platform.\nEmployed **Livewire** for building interactive user interfaces that improved user interactivity and satisfaction.\nConducted unit testing utilizing **PHPUnit** to ensure high code quality and reliability, achieving a test coverage of **85%**.\nManaged version control and collaboration through **Git** and **JIRA**, increasing team productivity by facilitating clear workflows.\nIntegrated AWS cloud services to enhance application deployment and scalability, reducing server costs by **15%**.\nPerformed code reviews and guided junior developers, sharing best practices and improving overall team performance.\nLed the migration of legacy systems to modern technologies, improving system efficiency by up to **40%**."
    },
    {
      "role": "Software Engineer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "• Developed and maintained web applications using **PHP** and **Laravel**, ensuring adherence to best practices and optimal performance.\n• Created custom e-commerce solutions on **Magento 2** that improved customer conversion rates by 20%.\n• Implemented responsive front-end components with **Alpine.js** and **React**, enhancing application usability and speed.\n• Integrated RESTful APIs for seamless data exchange between different services, leveraging **PHPUnit** for rigorous unit testing that ensured 99% code reliability.\n• Collaborated with cross-functional teams utilizing **JIRA** for agile project management, effectively managing over 50 tasks per sprint.\n• Employed **Git** for version control, leading to a **40% reduction** in merge conflicts through consistent branching strategies.\n• Developed and deployed applications on **AWS**, optimizing costs by systematically utilizing services like EC2 and S3.\n• Created and optimized features for **Shopify** platforms, directly contributing to a 15% increase in client sales.\n• Conducted code reviews and provided mentorship to junior developers, increasing overall team productivity by 30%.\n• Managed project timelines and deliverables, successfully delivering projects within an average of 2 weeks per cycle."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "Utilized **PHP** and **Laravel** to develop scalable applications, enhancing system functionality and user experience.\nIntegrated **Magento 2** for e-commerce solutions, leading to a 30% increase in online sales.\nImplemented efficient API integrations for third-party services, promoting seamless data synchronization. \nDeveloped dynamic user interfaces with **React** and **Alpine.js**, improving load times by 25%.\nMaintained version control and collaboration using **Git** and **JIRA**, ensuring streamlined project management and tracking.\nConducted unit testing with **PHPUnit**, achieving a test coverage of over 85%, which minimized bugs in production.\nDeployed applications on **AWS**, ensuring high availability and scalability while reducing costs by 15%.\nParticipated in code reviews and sprint planning discussions, contributing to a more agile and efficient development process.\nDelivered comprehensive documentation and training materials for team members, facilitating knowledge sharing and onboarding."
    }
  ],
  "skills": "Frontend Technologies: HTML, CSS, JavaScript, TypeScript, ReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS, Alpine.js\n\n\tBackend Frameworks: NodeJS, ExpressJS, NestJS, C#, .NET, Entity Framework, Microservices, Laravel, Livewire\n\n\tAPI Technologies: RESTful API, GraphQL, API\n\n\tServerless and Cloud Functions: AWS, Azure\n\n\tDatabases: MSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB\n\n\tDevOps: CI/CD pipelines, Git, GitHub\n\n\tCloud & Infrastructure: AWS\n\n\tOther: PHPUnit, JIRA, Shopify, UX/UI Design, Python, Redux, Blockchain: Solidity, Ether.js, Web3.js, Ethereum, Testing Tools: NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest",
  "apply_company": "Cloud Bridge"
}