{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior DevOps Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "Results-driven Senior DevOps Engineer with 8 years of experience executing CI/CD pipelines, container orchestration, and cloud services optimization. Proficient in **AWS**, **Docker**, **Kubernetes**, and **Terraform**, I ensure seamless deployment and infrastructure management for high-availability applications. My expertise extends to monitoring and observability tools such as **DataDog**, **Grafana**, and **Prometheus**, allowing for real-time performance insights and infrastructure health checks.\n\nSkilled in scripting with **Python** and **Bash**, I automate workflows and enhance operational efficiency. With hands-on experience in configuration management using **Ansible** and keen database management skills in **PostgreSQL**, I support scalable and secure application environments. I excel in leveraging **Kafka** for real-time data processing, integrating systems, and enhancing application performance. My background in full-stack development complements my DevOps capabilities, enabling me to bridge the gap between development and operations seamlessly.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior DevOps Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Implemented enterprise-level **CI/CD** pipelines using **GitHub Actions**, **Azure DevOps**, and **CircleCI**, harnessing **Terraform** for infrastructure as code to enable seamless deployments and version control across multiple environments.\nUtilized **Docker** and **Kubernetes** for container orchestration, ensuring high availability and scalability of applications, while employing automated monitoring solutions like **DataDog**, **Grafana**, and **Prometheus** for performance insights.\nDeveloped and maintained cloud-native data solutions using **PostgreSQL** and **Kafka** for efficient data ingestion and real-time processing, optimizing workflows for both healthcare and financial data.\nAutomated configuration management and deployment tasks using **Ansible** and **Bash**, facilitating streamlined operations and reducing deployment times by up to **30%**.\nArchitected robust infrastructure on **AWS** leveraging services such as EC2, S3, and Lambda for serverless computing, achieving enhanced flexibility and cost-efficiency.\nCollaborated closely with cross-functional teams to define and implement best practices in DevOps, leading initiatives that improved deployment frequency by **40%** and reduced change failure rates considerably.\nEstablished comprehensive monitoring and alerting strategies to ensure system reliability and reduced downtime, utilizing tools such as **Prometheus** and **DataDog**.\nSupervised the migration of legacy systems to microservices by leveraging **Docker** and **Kubernetes**, enhancing system resilience and scalability while aligning with modern architectural principles.\nCoordinated and facilitated training sessions for team members on best practices in **DevOps** and cloud methodologies, enhancing overall team proficiency and productivity.\nConducted regular audits and assessments of environments to maintain compliance and security of deployed services, safeguarding data integrity in adherence to relevant regulations."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Implemented CI/CD pipelines leveraging **Terraform** and **Docker** to ensure efficient and reliable deployments, achieving a **40%** reduction in deployment time across environments.\nManaged orchestration and scaling of containerized applications using **Kubernetes**, improving system reliability and uptime to **99.99%**.\nMonitored and optimized system performance utilizing tools such as **DataDog**, **Grafana**, and **Prometheus** to maintain service health and achieve operational excellence.\nDeveloped and maintained infrastructure as code (IaC) practices using **Git** and **Ansible**, facilitating seamless collaboration and version control for application environments.\nLeveraged **PostgreSQL** for database management, optimizing queries for performance improvements in data retrieval and storage, reducing access times by **30%**.\nArchitected solutions with **Python** and **Bash** to automate operational workflows and enhance efficiency within deployment processes.\nIntegrated **Kafka** for high-throughput data streaming, ensuring real-time data processing and resilient message queuing across distributed systems.\nCollaborated cross-functionally with development teams to enhance deployment strategies and system architecture, contributing to a **25%** increase in overall team productivity."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Utilized **AWS** for cloud infrastructure management, ensuring reliable deployment of applications and services necessary for high availability and performance.\nImplemented and managed **Kubernetes** clusters for container orchestration, enhancing scalability and resource utilization for microservices architecture.\nConfigured and optimized **Docker** containers to streamline development and deployment processes, ensuring consistency across multiple environments.\nAutomated infrastructure provisioning and management using **Terraform**, enabling efficient resource management and infrastructure as code practices.\nDeveloped and integrated CI/CD pipelines to facilitate rapid and reliable software delivery using modern DevOps practices, improving deployment frequency by **30%**.\nMonitored application performance and health metrics with **DataDog**, **Grafana**, and **Prometheus**, proactively identifying and mitigating issues to maintain application reliability.\nUtilized version control systems such as **Git** to manage codebase effectively, ensuring collaboration and code integrity.\nScripting and automating tasks with **Python** and **Bash**, improving operational efficiency and reducing manual intervention by **40%**.\nHandled data storage and retrieval using **PostgreSQL** for robust, relational database management, ensuring data integrity and performance for application needs.\nIntegrated messaging and event streaming solutions using **Kafka**, enabling real-time data processing and event-driven architecture across applications."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, Bash\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n **Frontend Frameworks:**\n\tJavaScript, TypeScript, React, Vue, Angular\n\n **API Technologies:**\n\tNginx, JWT, OAuth2, Keycloak (OIDC, RBAC)\n\n **Serverless and Cloud Functions:**\n\tAWS (Lambda), Azure (App Services)\n\n **Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n **DevOps:**\n\tDocker, Kubernetes, Git, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:**\n\tAWS (ECS, RDS, S3), Azure (Blob, SQL)\n\n **Other:**\n\tMLflow, Airflow, Kubeflow, DataDog, Grafana, Prometheus, CI/CD",
  "apply_company": "Product Pulse"
}