{
  "name": "Rei Taro",
  "role_name": "Senior Solutions Engineer",
  "email": "rei515@outlook.com",
  "phone": "+48732529451",
  "address": "Warszawa, Poland",
  "linkedin": "https://www.linkedin.com/in/rei-taro-81a410391/",
  "profile_summary": "Results-oriented Senior Solutions Engineer with 10+ years of experience in building innovative solutions utilizing **AI** technologies and robust **API** development. Proficient in **JavaScript** and **TypeScript**, with a proven ability to implement automation workflows using tools such as **N8N**. Exceptional problem-solving skills paired with creativity, autonomy, and proactivity, ensuring seamless project execution and delivery. Adept at crafting high-performing systems with a strong background in financial platforms and cloud-native architectures. Successfully contributed to high-stakes projects at leading organizations including VISA, Sii Poland, and Reply Polska, with emphasis on collaboration and empathy.",
  "education": [
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2010",
      "to_year": "2015",
      "location": "Japan",
      "university": "Keio University"
    }
  ],
  "experience": [
    {
      "role": "Senior Solutions Engineer",
      "company": "Leobit",
      "from_date": "Aug 2022",
      "to_date": "Present",
      "location": "Poland",
      "responsibilities": "Utilized **JavaScript** and **TypeScript** to develop scalable solutions that enhance user experience and streamline workflows in application development.\nDesigned and implemented AI-driven features leveraging **ChatGPT** and **Claude** for intelligent user interactions and automation, improving engagement by **25%**.\nAutomated workflows using **N8N** and integrated various APIs to foster seamless communication between services, leading to a **30%** increase in operational efficiency.\nEngaged in rigorous problem-solving to address integration challenges, ensuring systems remained compliant with industry standards.\nExercised creativity and autonomy in architecting innovative solutions, improving uptime and reliability of backend systems by over **15%**.\nPromoted proactive development practices by implementing Git for version control to enhance collaboration and streamline the coding workflow.\nFostered empathy in team dynamics, ensuring all voices were heard and contributing to a positive work environment and effective project outcomes."
    },
    {
      "role": "Software Engineer",
      "company": "Innovature",
      "from_date": "Nov 2018",
      "to_date": "Jun 2022",
      "location": "Japan",
      "responsibilities": "Utilized **API** development skills to design and implement scalable backend systems using **Python** and **FastAPI**, automating document workflows, which improved user onboarding efficiency by **30%**.\nEmployed **JavaScript** and **TypeScript** to create event-driven microservices with **Celery** and **Redis**, enhancing the asynchronous processing of financial data and reducing transaction processing time by **25%**.\nOversaw the deployment of microservices on **Azure App Services**, utilizing **Terraform** for infrastructure as code (IaC), ensuring consistent deployment environments across **5** projects.\nEngineered secure data pipelines for regulatory compliance, integrating **Apache Airflow** and **Azure Functions** to streamline data flow, resulting in a **40%** reduction in data processing errors.\nConducted thorough security audits and ensured compliance by implementing **OAuth2** and **Azure AD B2C** for secure authentication and access management across various platforms, mitigating security vulnerabilities by **50%**.\nFostered collaboration with cross-functional teams to ensure seamless system integration and successful release management, driving project completion timelines forward by **15%** through enhanced communication and creative problem-solving strategies."
    },
    {
      "role": "Software Developer",
      "company": "Wizcorp",
      "from_date": "Apr 2015",
      "to_date": "Nov 2018",
      "location": "Japan",
      "responsibilities": "Utilized **Git** for version control and collaborative development, ensuring seamless integration and efficient source management across development teams.\nEmployed **API** design principles to develop and maintain high-performance backend services for trading systems, including trade execution and account tracking, leveraging frameworks like **Flask** and databases such as **PostgreSQL**.\nEngineered innovative solutions for real-time data processing through **WebSockets** and **Redis**, enhancing data delivery speed by **30%** for high-frequency trading applications.\nImplemented automated workflows using **N8N** to enhance operational efficiency and reduce manual errors in daily processes, achieving a **50%** reduction in task completion time.\nIntroduced and maintained comprehensive testing frameworks with **PyTest**, significantly increasing code reliability while reducing production bugs by **25%**.\nDesigned and executed job scheduling mechanisms using **Celery** and **RabbitMQ** to manage backend tasks effectively, improving process management and prioritization.\nCollaborated with cross-functional teams, employing **JavaScript** and **TypeScript** for frontend integration, ensuring seamless communication and functionality between backend services and user interfaces.\nDisplayed exceptional problem-solving abilities and creativity to troubleshoot complex technical challenges, leading initiatives with a proactive approach and demonstrating strong autonomy in project management.\n"
    }
  ],
  "skills": " **Programming Languages**\n\tPython (3.8+), SQL, Bash, JavaScript, TypeScript\n\n**Backend Frameworks**\n\tFastAPI, Flask, Django, Celery\n\n**Frontend Frameworks**\n\t\n\n**API Technologies**\n\tREST/gRPC APIs, API\n\n**Serverless and Cloud Functions**\n\tAWS (EC2, S3, Lambda), Azure\n\n**Databases**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps**\n\tDocker, Kubernetes, GitHub Actions, Azure DevOps, CI/CD, Git\n\n**Cloud & Infrastructure**\n\t\n\n**Other**\n\tAI, Problem Solving, Creativity, Autonomy, Proactivity, Empathy, Pandas, NumPy, scikit-learn, TensorFlow, Airflow, MLflow, N8N, Kafka, PyTest",
  "apply_company": "Keplero AI"
}