{
  "name": "Tomasz Lee",
  "role_name": "Expert Software Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Highly skilled Expert Software Engineer with 9+ years of comprehensive experience in developing high-performance applications using **C++**, **CUDA**, **OpenCL**, and **Python**. Proficient in template meta-programming, RAII, and leveraging advanced technologies such as **LLVM**, **MLIR**, and **XLA** for optimizing code performance. Experienced in implementing CI/CD pipelines, utilizing **sanitizers**, and ensuring high-quality software development through documentation and collaboration. Solid understanding of multi-threading, MPI, and PGAS for efficient data processing, along with numerical linear algebra techniques and libraries like **PyTorch**, **JAX**, **MKL**, **MAGMA**, and **PETSc**. Adept at leading projects, fostering teamwork, and communicating complex ideas effectively, driving successful project completions.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Expert Software Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Utilized **C++**, **CUDA**, and **OpenCL** to develop high-performance computing solutions, enhancing computational efficiency by **30%**.\nImplemented **template meta-programming** techniques to streamline codebase and improve maintainability across projects.\nDesigned and optimized algorithms leveraging **Python** and **PyTorch** for machine learning applications, achieving model accuracy improvements of **15%**.\nCollaborated effectively with cross-functional teams to ensure clear communication and documentation of software processes, resulting in a **20%** reduction in project delivery time.\nApplied **CI/CD** practices for automated testing and deployment, leading to a **40%** increase in deployment frequency.\nConducted performance optimization using **sanitizers** and **multi-threading** techniques, decreasing software bottlenecks and improving overall system responsiveness.\nExplored parallel computing methodologies with **OpenMP** and **MPI** to enhance computational tasks and reduce processing time by **25%**.\nEngaged in continuous learning of advanced tools, including **LLVM**, **MLIR**, and **XLA**, to innovate and integrate cutting-edge technology into existing frameworks.\nDeveloped robust software components in **cmake** for efficient build processes, leading to a **35%** decrease in build times.\nImplemented FFT and numerical linear algebra methods using **MKL** and **MAGMA**, significantly enhancing performance for data-heavy applications."
    },
    {
      "role": "Full Stack Developer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "Utilized **C++** and **Python** to design and implement high-performance computing modules, achieving a reduction in processing time by **20%**.\nDeveloped parallel algorithms using **OpenMP** and **CUDA**, resulting in an increase of computational throughput by **35%**.\nEmployed **CI/CD** practices to streamline the deployment process, reducing integration issues by **40%**.\nImplemented efficient memory management techniques utilizing **RAII** and **sanitizers** to ensure system stability and reliability.\nConducted thorough performance analysis and optimization using **MLIR** and **LLVM**, improving execution speeds for critical applications by **15%**.\nCollaborated with multidisciplinary teams to gather requirements and establish timelines, ensuring precise project milestones and deliverables.\nCreated comprehensive documentation for system architecture and processes, facilitating better team knowledge sharing and onboarding for new members.\nLed mentoring sessions for junior engineers on best practices in **template meta-programming** and **multi-threading**, enhancing team skill levels and productivity.\nExecuted testing strategies using **MPI** and **FFT** to validate software performance across distributed systems.\nEngaged in active code reviews, fostering a culture of continuous improvement and collaborative problem-solving within the development team."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "Utilized **C++** and **Python** to engineer high-performance applications focused on numerical computations, enhancing processing speed by **30%**.\nDeveloped and maintained parallel computing frameworks using **OpenMP** and **MPI**, improving task execution efficiency across multiple processors.\nImplemented **CUDA** and **OpenCL** to leverage GPU capabilities for various machine learning tasks, achieving speedups of up to **50%** in data processing.\nDesigned template meta-programming strategies to increase code reusability and maintainability, streamlining the development cycle by **25%**.\nConducted integration of numerical libraries such as **MKL** and **MAGMA** to facilitate advanced linear algebra operations, reducing response times significantly.\nEstablished CI/CD pipelines and integrated testing frameworks to automate builds, enhancing code deployment cycles by reducing manual errors.\nProvided thorough documentation and technical guidelines related to **LLVM**, **MLIR**, and **Numba**, ensuring clarity and efficient knowledge transfer among team members.\nParticipated in collaborative discussions to refine architectural decisions, fostering a culture of continuous improvement and communication within the team.\nUtilized **PyTorch** and **JAX** for deep learning projects, achieving model training optimizations while handling extensive datasets.\nExecuted multi-threading methodologies to improve software responsiveness, effectively managing concurrent processes and resource allocation."
    }
  ],
  "skills": "**Programming Languages**\n\tC++, Python, TypeScript\n\n**Backend Frameworks**\n\tNodeJS, ExpressJS, NestJS, C#, .NET, Entity Framework, Microservices\n\n**Frontend Frameworks**\n\tReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n**API Technologies**\n\tRESTful API, GraphQL\n\n**Serverless and Cloud Functions**\n\t\n\n**Databases**\n\tMSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB\n\n**DevOps**\n\tAWS, Azure, CI/CD pipelines\n\n**Cloud & Infrastructure**\n\t\n\n**Other**\n\tUX/UI Design, Git, GitHub, Apache Kafka, RabbitMQ, Redis, Testing Tools: NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest, Blockchain: Solidity, Ether.js, Web3.js, Ethereum, CUDA, OpenCL, template meta-programming, RAII, XLA, LLVM, MLIR, Numba, NVRTC, cmake, sanitizers, CCCL, OpenMP, OpenACC, multi-threading, MPI, PGAS, FFT, numerical linear algebra, PyTorch, JAX, MKL, MAGMA, PETSc, Kokkos, collaboration, communication, documentation"
}