{
  "name": "Tomasz Lee",
  "role_name": "Senior Query Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Skilled Senior Query Engineer with 9+ years of experience specializing in **C++**, **database** technologies, and **distributed systems**. Proficient in executing complex **software design** and **architecture** strategies, alongside expertise in optimizing **query engines** and ensuring code quality. Strong command of **data structures** and **algorithms** to enhance performance and efficiency in production code. Proven track record in mentoring and coaching teams, while providing a clear technical vision that drives projects to successful completion. Additional strengths include hands-on experience in **microservices architecture**, **Apache Kafka**, **RabbitMQ**, **Redis**, **ReactJS**, **NextJS**, and **cloud services**.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Senior Query Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Applied strong expertise in **C++**, ensuring high-quality production code and adherence to coding standards.\nDesigned and developed efficient **database** solutions, focusing on optimizing query performance in line with best practices.\nArchitected complex **distributed systems** to ensure scalability and reliability in data processing.\nUtilized advanced **data structures** and algorithms to enhance system efficiency and processing speed by **15%**.\nSpearheaded software design initiatives promoting high code quality, mentoring junior engineers on best practices and architectural considerations.\nDeveloped and maintained scalable **query engines** to improve data retrieval methods, achieving an **average query execution time reduction of 20%**.\nConducted technical coaching sessions, fostering a culture of knowledge sharing and improving team productivity.\nEstablished a technical vision that aligns with organizational goals, leveraging innovative methodologies to solve complex engineering challenges.\nEngaged in optimizing existing system designs and architecture to enhance functionality and performance for end-users.\n"
    },
    {
      "role": "Software Engineer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "• Spearheaded the design and development of **distributed systems** architecture, ensuring robust **software design** practices, leading to a **15%** increase in operational efficiency.\n• Employed advanced **data structures** and **algorithms** in the development of a project management tool, driving improvements in system performance and scalability.\n• Optimized **database** management and query engines, reducing latency in data retrieval and processing, achieving a **25%** boost in system speed.\n• Mentored junior developers in **production code** practices and **code quality**, fostering a culture of continuous learning and professional growth.\n• Conducted thorough **code quality** audits and engineering reviews, supporting technical vision and enhancing overall team output by **30%**.\n• Collaborated with cross-functional teams to refine system architecture and project timelines, ensuring all stakeholder requirements were met effectively.\n• Assessed and implemented best practices in **software design**, delivering high-quality, maintainable code that aligns with enterprise standards.\n• Led initiatives for developing scalable solutions using **C++** and creating efficient data processing pipelines to improve data access and integration.\n• Engaged in active **mentoring** and **coaching** of team members, significantly improving productivity and collaborative efforts during project lifecycles."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "Utilized expertise in **C++** to develop optimized algorithms and data structures for high-performance query engines.\nContributed to designing robust software architecture that enhances code quality and maintainability in production environments.\nMentored junior engineers to Foster skills in database management and distributed systems, promoting a collaborative technical vision across teams.\nImplemented advanced querying techniques on **SQL Server**, achieving up to **30%** improvement in retrieval times through efficient query handling.\nEnhanced the performance of the internal CRM system by integrating **RabbitMQ** for distributed messaging, resulting in a **25%** reduction in server load.\nCreated high-quality, reusable production code in **C#** and **Angular**, streamlining development processes across multiple projects.\nParticipated in code reviews and daily standups to ensure alignment with best software design practices and architectural standards.\nAssisted in the migration of legacy applications to modern frameworks, maximizing system robustness and reducing technical debt by **15%**.\nDelivered comprehensive technical documentation and continued mentoring to improve the team’s understanding of complex software design principles."
    }
  ],
  "skills": "**Programming Languages**\n\tC++, HTML, CSS, JavaScript, TypeScript, Python\n\n**Backend Frameworks**\n\tNodeJS, ExpressJS, NestJS, C#, .NET, Entity Framework, Microservices\n\n**Frontend Frameworks**\n\tReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n**API Technologies**\n\tRESTful API, GraphQL\n\n**Serverless and Cloud Functions**\n\tAWS, Azure\n\n**Databases**\n\tMSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB\n\n**DevOps**\n\tCI/CD pipelines\n\n**Cloud & Infrastructure**\n\t\n\n**Other**\n\tUX/UI Design, Git, GitHub, Blockchain, Solidity, Ether.js, Web3.js, Ethereum, Messaging & Caching, Apache Kafka, RabbitMQ, Redis, Testing Tools, NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest, data structures, algorithms, software design, architecture, production code, code quality, mentoring, coaching, technical vision",
  "apply_company": "MongoDB"
}