{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior React Native Software Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-karol-kotlinski-bb2520397/",
  "profile_summary": "As a Senior React Native Software Engineer with 8 years of experience, I possess a strong command of **JavaScript**, **TypeScript**, **React Native**, and **RESTful APIs**. My proficiency extends to CI/CD practices and ensuring adherence to UI/UX best practices, enabling me to deliver high-quality, user-centric applications. In my career, I have successfully integrated **Bluetooth Low Energy (BLE)** capabilities into mobile applications, enhancing connectivity and functionality in IoT environments.\nI have a comprehensive background in full-stack development, leveraging modern frameworks such as **React**, **Next.js**, **Vue**, and backend technologies like **Node.js**, **FastAPI**, and **Django**. My extensive experience with cloud platforms like **Azure** and **AWS** has equipped me with the skills needed to create scalable solutions that meet enterprise standards. Furthermore, my expertise in **Git** ensures effective version control and collaboration in team environments.\nWith a strong foundation in microservices architecture and event-driven systems, I prioritize building robust and secure applications aligned with compliance standards. I have also led the implementation of machine learning pipelines and MLOps workflows, utilizing tools like **MLflow**, **Airflow**, and **Kubeflow**, to drive intelligent automation and predictive analytics.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior React Native Software Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Utilized **React Native** and **JavaScript** to architect and develop high-performance, cross-platform mobile applications, ensuring optimal **UI/UX best practices** for seamless user experiences across iOS and Android platforms.\nIntegrated **RESTful APIs** to facilitate dynamic data interactions and improve application responsiveness, demonstrating effective collaboration with backend services.\nDeveloped and deployed CI/CD pipelines using **Git** and modern tools, enhancing deployment efficiency with automated testing and version control.\nImplemented robust testing strategies utilizing **Jest** for unit testing, ensuring code quality and consistency, and employing CI best practices for rapid iteration.\nFocused on **Bluetooth Low Energy (BLE)** integration for innovative IoT features, enhancing mobile app capabilities within health and financial sectors.\nParticipated in architecture discussions to evolve mobile applications, leveraging **TypeScript** to improve code quality and maintainability, adhering to industry standards and best practices.\nLed the development process with an emphasis on performance optimization, achieving up to **30%** faster load times through efficient code practices and asset management strategies.\nCollaborated with design teams to align technical solutions with user-centric design, contributing to a significant increase in user satisfaction rates through improved app interfaces.\nEngaged in agile project management methodologies, ensuring timely delivery of projects and adherence to deadlines across multiple iterations, increasing team output by **25%**.\nExplored innovative features to enhance mobile applications, focusing on maintaining compatibility with future updates in **React Native**, ensuring a forward-compatible codebase."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Developed and maintained high-quality mobile applications using **React Native** and **JavaScript**, adhering to UI/UX best practices for optimal user engagement and satisfaction.\nUtilized **TypeScript** to enhance code quality and maintainability, ensuring type safety in complex application structures.\nCollaborated with cross-functional teams to implement **RESTful APIs** for seamless communication between mobile applications and backend services, fostering a rapid development cycle.\nEmployed **Git** for version control management, maintaining consistent documentation and facilitating effective team collaboration on large-scale projects.\nIntegrated **CI/CD** pipelines to automate testing and deployment processes, reducing release cycle time by **30%** and enhancing overall application reliability.\nImplemented Bluetooth Low Energy (BLE) functionalities to enhance connectivity features in mobile applications, driving user interaction in IoT environments.\nDesigned and executed unit tests using **Jest**, improving code reliability and reducing the occurrence of bugs in production by **25%**.\nMaintained leading-edge knowledge in **Swift** and **Kotlin** for potential cross-platform solutions, keeping the team primed for emerging technologies and frameworks."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Developed innovative mobile applications using **React Native**, ensuring seamless integration with **JavaScript** and **TypeScript** to create high-performance user interfaces and robust back-end interactions.\nImplemented **RESTful APIs** for efficient data exchange between front-end and back-end systems, enhancing user experiences and improving application functionalities.\nUtilized **Git** for version control, collaborating with cross-functional teams to streamline code management and maintain project integrity in a CI/CD pipeline.\nApplied **UI/UX best practices** to design intuitive interfaces that prioritize user satisfaction and engagement across various device formats, ensuring mobile-first responsiveness.\nIntegrated **Bluetooth Low Energy (BLE)** technology into mobile applications, enabling innovative IoT features that enhance user interactions with connected devices.\nEngineered automated testing frameworks using **Jest** to ensure consistent application quality and performance, facilitating faster deployment cycles and reduced bug rates.\nManaged application versions effectively through CI/CD processes, resulting in a **25%** improvement in deployment efficiency and a significant reduction in time-to-market for new features.\nConducted performance optimizations to achieve a **40%** increase in application load times, leveraging techniques such as resource caching and minimizing render blocking on mobile devices.\nLed workshops on **Swift** and **Kotlin** practices, enhancing team capabilities in cross-platform mobile development and fostering a culture of continuous learning and improvement."
    }
  ],
  "skills": "**Frontend Frameworks:**\n\tReact, React Native, JavaScript, TypeScript, Vue, Angular\n\n**Backend Frameworks:**\n\tPython (FastAPI, Flask, Django)\n\n**API Technologies:**\n\tRESTful APIs\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Authentication & Security:**\n\tKeycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot\n\n**Other:**\n\tArtificial Intelligence & Machine Learning (MLflow, Airflow, Kubeflow), UI/UX best practices, Bluetooth Low Energy (BLE), IoT, Swift, Kotlin, Jest, Git"
}