{
  "name": "Tomasz Lee",
  "role_name": "Senior Python Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Results-driven Senior Python Engineer with 9+ years of experience in developing robust applications and delivering innovative solutions. Proficient in **Python**, **AWS**, and **CI/CD** practices, leveraging **DevOps** methodologies to enhance productivity. Demonstrated expertise in **Microservices**, **Event Driven Architecture**, and secure software development. Strong background in containerization technologies such as **Docker** and orchestration with **Kubernetes**, along with infrastructure as code using **Terraform**. Experienced in various databases including **PostgreSQL** and **DynamoDB**. Committed to Agile and Scrum methodologies to foster seamless communication and collaboration across teams. Proven track record in optimizing performance and enhancing user accessibility within applications.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Senior Python Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Leveraged **Python** to develop efficient algorithms and services that enhanced application performance, improving service response times by **30%**.\nDesigned and implemented **Microservices** architecture to ensure scalability and flexibility, accommodating up to **1000** concurrent users without degradation of service.\nUtilized **AWS** services, including Lambda and DynamoDB, to create a cost-effective, serverless infrastructure that reduced operational costs by **20%**.\nImplemented robust **CI/CD** pipelines in an automated environment, cutting deployment time in half and increasing deployment frequency by **50%**.\nAdapted Agile and Scrum methodologies to streamline project management processes, increasing team productivity by **25%**.\nEnsured **Secure Software Development** practices throughout the development lifecycle, achieving a **zero-breach** status in security audits.\nIncorporated **Terraform** for infrastructure as code, improving resource provisioning speed by **40%**.\nCollaborated effectively with cross-functional teams to maintain open channels of **Communication**, driving project success and alignment across diverse groups.\nOptimized PostgreSQL database for high transaction volumes, reducing query execution time by **15%**.\nFostered a culture of **Accessibility** within the development team, ensuring solutions adhered to best practices and compliance standards."
    },
    {
      "role": "Software Engineer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "Utilized **Python** for developing scalable microservices architecture, enhancing system performance by 25% through optimized API calls.\nImplemented CI/CD pipelines using **AWS** and **Terraform**, leading to a 30% reduction in deployment errors and improved DevOps practices.\nLed software development with a focus on **Agile** practices and **Scrum**, ensuring timely project delivery and strong communication with stakeholders.\nConstructed and maintained efficient **PostgreSQL** databases for data storage, resulting in a **15%** increase in data retrieval speed.\nEmployed **Docker** and **Kubernetes** for container orchestration, enhancing application deployment flexibility.\nEnhanced application accessibility standards, ensuring compliance and an improved user experience.\nConducted thorough code reviews and provided mentorship to junior developers, resulting in a 20% increase in team productivity.\nCollaborated in the design and implementation of **Event Driven Architecture** using **RabbitMQ** and **Kafka**, improving system scalability.\nDesigned secure software solutions in accordance with **Secure Software Development** best practices.\nDeveloped custom reports and data visualizations using **D3.js** for enhanced project tracking and stakeholder engagement."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "Utilized **Python** for backend development, ensuring adherence to secure software development practices to enhance application security by **30%**.\nImplemented **AWS** services for application deployment and scalability, reducing infrastructure costs by **15%** while maintaining performance.\nDeveloped CI/CD pipelines using **Terraform** and **Docker** to streamline the deployment process, reducing release times by **50%**.\nEmployed Agile methodologies and Scrum frameworks to manage project deliverables efficiently, improving team communication and collaboration.\nArchitected and built microservices to enhance system modularity and maintainability, using **Go** and **Java** for specific service implementations.\nDesigned an event-driven architecture for processing data in real-time, utilizing appropriate messaging tools for improved responsiveness.\nManaged database operations with **PostgreSQL** and **DynamoDB** to ensure data accuracy and retrieval efficiency.\nFacilitated daily standup meetings and participated in code reviews to align project goals with quality standards.\nCollaborated with cross-functional teams to integrate accessibility features, improving user experience for all users.\nProduced comprehensive technical documentation and user guides that enhanced knowledge transfer across teams and ensured smooth onboarding."
    }
  ],
  "skills": " **Programming Languages**\n\t Python, TypeScript, Java, Go\n\n**Backend Frameworks**\n\t NodeJS, ExpressJS, NestJS, C#, .NET, Entity Framework, Microservices\n\n**Frontend Frameworks**\n\t HTML, CSS, JavaScript, ReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n**API Technologies**\n\t RESTful API, GraphQL\n\n**Serverless and Cloud Functions**\n\t AWS, Azure\n\n**Databases**\n\t PostgreSQL, MongoDB, DynamoDB, CosmosDB, MSSQL Server, MySQL\n\n**DevOps**\n\t CI/CD pipelines, Terraform, Kubernetes, Docker\n\n**Cloud & Infrastructure**\n\t AWS, Azure\n\n**Other**\n\t UX/UI Design, Git, GitHub, Scrum, Agile, Accessibility, Secure Software Development, Communication, Event Driven Architecture, Testing Tools: NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest, Blockchain: Solidity, Ether.js, Web3.js, Ethereum",
  "apply_company": "Admiral Money"
}