{
  "name": "Marcin Karol Kotlinski",
  "role_name": "QA Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-karol-kotlinski-bb2520397/",
  "profile_summary": "As a detail-oriented QA Engineer with 8 years of experience, I bring a strong proficiency in API testing and data validation, ensuring high-quality standards in large datasets comparison. My expertise includes working with **Postman** and **Newman** for thorough REST API assessments, while also utilizing **Cypress**, **Playwright**, and **Jest** as automation frameworks for efficient testing processes. \nI have a solid background in software development with modern **JavaScript**, **Python**, **React**, **Next.js**, **Node.js**, and cloud services including **AWS** and **Azure**, which enhances my ability to collaborate closely with development teams. Additionally, I have hands-on experience in implementing CI/CD pipelines and working with various AI tools to optimize quality assurance workflows.\nWith a commitment to maintaining data quality and adherence to compliance standards such as HIPAA and PCI DSS, I continually strive to elevate testing practices within the healthcare and financial sectors.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "QA Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Conducted comprehensive **API testing** to ensure the functionality and performance of **REST APIs**, utilizing tools such as **Postman**, **Newman**, and **Cypress**.\nPerformed rigorous **data validation** across **large datasets**, ensuring **data quality** and compliance with regulatory requirements, achieving a **99% accuracy rate** in data comparisons and verifications.\nDeveloped automated tests and test suites for microservices using **Jest**, **Cypress**, and **Playwright** to cover unit, integration, and end-to-end scenarios, resulting in a **30% reduction** in bug rates pre-release.\nCollaborated with cross-functional teams to identify and rectify discrepancies in data handling processes, implementing automated checks that improved process efficiency by **25%**.\nDesigned and managed CI/CD pipelines with **GitHub Actions** and **Azure DevOps**, facilitating continuous integration and deployment cycles that increased release frequency by **50%**.\nActively engaged in the testing of AI-based features within client applications, ensuring that **automation frameworks** integrated effectively with various AI tools, achieving seamless user experience.\nProvided quality assurance for complex financial data visualizations built using **D3.js** and **Chart.js**, ensuring reliability of insights presented to stakeholders. \nMonitored and reported on testing progress and project metrics to enhance data quality, ultimately improving stakeholder satisfaction by **40%**."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Conducted comprehensive **API testing** for REST APIs to ensure data quality and validate large datasets, utilizing **Postman** and **Newman** to streamline the testing processes and improve efficiency.\nUtilized **Cypress**, **Playwright**, and **Jest** frameworks to automate UI testing of web applications, enhancing test coverage and ensuring high-quality user interfaces.\nLed the implementation of CI/CD tools in the testing pipeline, which improved deployments by **30%** through automation and reduced manual errors in the process.\nCollaborated with development teams to define data validation processes, ensuring compliance with stringent data quality standards across all financial platforms.\nDeveloped and executed test plans for AI tools integrated within financial systems, ensuring robustness and accuracy in features such as fraud detection and transaction monitoring.\nEngaged in the comparison of large datasets, ensuring integrity and accuracy in data migration and system upgrades during modernization projects.\nShared insights on best practices and continuous improvement methodologies in software testing, fostering a culture of quality within teams."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Conduct API testing using tools like **Postman** and **Newman** to ensure robustness and reliability of **REST APIs**, performing data validation and ensuring high data quality across large datasets.\nDevelop and execute automated test scripts with **Cypress**, **Playwright**, and **Jest** to validate backend services built with **Python** and **JavaScript**, driving improved test coverage and defect detection.\nCollaborate with development teams to analyze requirements and design comprehensive testing strategies for new features, incorporating test cases for both functional and non-functional requirements.\nImplement CI/CD pipelines employing automation frameworks, ensuring seamless integration and delivery of high-quality code while maintaining rigorous testing standards.\nUtilize data analysis tools to compare large datasets and confirm the integrity and accuracy of data outputs, enabling precise feature verification and quality assurance.\nDocument testing processes, results, and defect reports to aid in continuous improvement and facilitate better communication within cross-functional teams.\nLeverage AI-based tools to enhance testing efficiency, identifying potential defects and optimizing testing approaches by analyzing historical data.\nParticipate in code reviews to provide feedback on testability and identify areas for enhancement in the development process, advocating for best practices in quality assurance."
    }
  ],
  "skills": "**API Technologies**\n\tREST APIs, API testing, Postman, Newman\n\n**Programming Languages**\n\tPython, JavaScript, TypeScript\n\n**Backend Frameworks**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks**\n\tReact, Vue, Angular, Cypress, Playwright, Jest\n\n**DevOps**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, CI/CD tools\n\n**Cloud & Infrastructure**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL), Terraform, Ansible, Helm, Docker Compose\n\n**Databases**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**Other**\n\tMLflow, Airflow, Kubeflow, data validation, data quality, large datasets comparison, automation frameworks, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot"
}