{
  "name": "Rei Taro",
  "role_name": "Senior Support Engineer",
  "email": "rei515@outlook.com",
  "phone": "+48732529451",
  "address": "Warszawa, Poland",
  "linkedin": "https://www.linkedin.com/in/rei-taro-81a410391/",
  "profile_summary": "Skilled Senior Support Engineer with a strong foundation in troubleshooting, diagnosing, and repairing complex measurement systems, optics, and image processing. Highly proficient in analytic problem-solving with a knack for delivering effective communication and teamwork in high-pressure environments. Bringing over 10 years of backend development experience, specializing in financial platforms and AI/ML pipelines, utilizing **Python** (FastAPI, Django, Flask) and cloud technologies like **AWS** and **Azure**. Dedicated to enhancing customer relations through meticulous support and technical expertise cultivated at leading organizations such as VISA, Sii Poland, and Reply Polska.",
  "education": [
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2010",
      "to_year": "2015",
      "location": "Japan",
      "university": "Keio University"
    }
  ],
  "experience": [
    {
      "role": "Senior Support Engineer",
      "company": "Leobit",
      "from_date": "Aug 2022",
      "to_date": "Present",
      "location": "Poland",
      "responsibilities": "- Diagnosed and troubleshot issues in semiconductor measurement systems, ensuring optimal performance and reliability.\n- Delivered precise repair and maintenance services for electro-mechanical and electro-optical systems, achieving a **95%** first-pass success rate.\n- Collaborated with customers to understand their optics and image processing needs, providing analytical solutions and fostering strong customer relations.\n- Utilized strong problem-solving skills to address and resolve complex technical issues, leading to a reduction in service downtime by **30%**.\n- Engaged in team-based troubleshooting activities to systematically address integration challenges and enhance product performance.\n- Assisted in optimizing operational procedures, effectively increasing the efficiency of support processes by **20%**."
    },
    {
      "role": "Software Engineer",
      "company": "Innovature",
      "from_date": "Nov 2018",
      "to_date": "Jun 2022",
      "location": "Japan",
      "responsibilities": "Demonstrated strong analytical and problem-solving skills by troubleshooting and diagnosing issues within **measurement systems** and **optics** for enhanced system performance.\nUtilized electro-mechanical and electro-optical techniques to repair complex hardware components, improving failure response times by **30%**.\nCollaborated with cross-functional teams, ensuring effective communication and teamwork to meet customer requirements and maintain high customer satisfaction ratings of over **90%**.\nApplied advanced image processing techniques to enhance the accuracy of measurement systems, contributing to a **25%** increase in data readability.\nMaintained thorough documentation of repair processes and system configurations to streamline future diagnostics and troubleshooting efforts.\nEngaged in continuous learning to improve troubleshooting methodologies and stay updated with the latest semiconductor technologies."
    },
    {
      "role": "Software Developer",
      "company": "Wizcorp",
      "from_date": "Apr 2015",
      "to_date": "Nov 2018",
      "location": "Japan",
      "responsibilities": "Utilized troubleshooting and diagnostic skills to identify and resolve issues in complex semiconductor systems, contributing to enhanced performance for clients.\nEngaged in detailed repair processes for electro-mechanical and electro-optical systems, ensuring reliability and efficiency in measurement systems used in optics and image processing.\nApplied analytical and problem-solving abilities to streamline communication and improve customer relations, effectively addressing client concerns and inquiries.\nCollaborated with cross-functional teams to foster teamwork and integrate solutions, enhancing overall product support and client satisfaction.\nExecuted thorough testing and quality assurance protocols, ensuring systems met operational standards and specifications, leading to a **20%** reduction in support tickets over **6 months**.\nConducted detailed measurements and analyses, implementing improvements that resulted in a **15%** increase in system accuracy and reliability.\nTrained team members on troubleshooting techniques and best practices, enhancing team efficiency and job satisfaction."
    }
  ],
  "skills": " **Programming Languages** \n\t Python (3.8+), SQL, Bash, JavaScript \n\n **Backend Frameworks** \n\t FastAPI, Flask, Django, Celery \n\n **Frontend Frameworks** \n\t  \n\n **API Technologies** \n\t REST/gRPC APIs, Microservices \n\n **Serverless and Cloud Functions** \n\t AWS (EC2, S3, Lambda), Azure \n\n **Databases** \n\t PostgreSQL, MySQL, MongoDB, Redis \n\n **DevOps** \n\t Docker, Kubernetes, GitHub Actions, Azure DevOps, CI/CD \n\n **Cloud & Infrastructure** \n\t  \n\n **Other** \n\t AI/ML Tools: Pandas, NumPy, scikit-learn, TensorFlow, Airflow, MLflow, troubleshooting, diagnosing, repairing, semiconductor, measurement systems, optics, image processing, electro-mechanical, electro-optical, communication, analytical, problem-solving, customer relation, teamwork",
  "apply_company": "KLA"
}