{
  "name": "Mariusz Jan Skobel",
  "role_name": "AI Product Engineer",
  "email": "mariuszskobel15@outlook.com",
  "phone": "+48 735 343 548",
  "address": "Katowice, Poland",
  "linkedin": "https://www.linkedin.com/in/mariusz-skobel-789557397/",
  "profile_summary": "Experienced AI Product Engineer with over 10 years in full stack development, specializing in AI integration and scalable coding solutions. Adept at data management, data acquisition, and data labeling to enhance AI model performance and drive impactful product outcomes. Proven problem-solving capabilities using first principles reasoning, with a strong proficiency in team collaboration and effective communication in English. Technical expertise in **JavaScript/TypeScript**, **Python**, and **Flutter**, alongside full stack knowledge of **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**. Skilled in deploying cloud-native applications leveraging **Azure** and **AWS**, while ensuring compliance with standards such as HIPAA and PCI DSS. Experienced in microservices architecture and CI/CD automation, facilitating the development of secure and maintainable solutions. Passionate about developing AI/ML capabilities that enable real-time analytics and intelligent decision-making.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2012",
      "to_year": "2015",
      "location": "UK",
      "university": "University of Bristol"
    }
  ],
  "experience": [
    {
      "role": "AI Product Engineer",
      "company": "EitBiz",
      "from_date": "Oct 2022",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Developed and integrated AI-driven features such as smart dashboards and predictive alerts, leveraging model techniques for actionable insights in healthcare and finance environments.\n• Engineered and managed robust data acquisition and data management strategies utilizing PostgreSQL, MongoDB, and Redis to ensure effective data sourcing and storage.\n• Implemented scalable coding practices in full-stack development using **TypeScript**, **Python (FastAPI)**, and **Node.js** while ensuring adherence to industry compliance standards like HIPAA and GDPR.\n• Led cross-functional team collaborations to optimize data labeling processes and improve the efficiency of machine learning models deployed on platforms like **Azure ML** and **AWS Sagemaker**.\n• Architected microservices ecosystems by utilizing containerization tools such as **Docker** and **Kubernetes (AKS/EKS)** to enhance system scalability and fault tolerance by up to **99.9%** uptime.\n• Delivered seamless mobile experiences through **Flutter** and **React Native**, achieving download numbers exceeding **100K** on platforms such as iOS and Android.\n• Constructed and monitored MLOps pipelines incorporating **MLflow**, **DVC**, and **Apache Airflow** for streamlined model training, validation, and deployment, enhancing model delivery speed by **35%**.\n• Spearheaded the establishment of test strategies with tools like **Jest** and **Cypress**, ensuring 95% test coverage for both front-end and back-end services to maintain high software quality.\n• Collaboratively embedded advanced NLP models using **spaCy** and **Hugging Face Transformers** into core applications, achieving significant improvements in document classification accuracy.\n• Integrated advanced search capabilities utilizing **Azure Cognitive Search** and **ElasticSearch**, facilitating rapid access to data across **millions** of unstructured documents in the healthcare and finance sectors."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Tvn S.A.",
      "from_date": "Oct 2019",
      "to_date": "Sep 2022",
      "location": "Poland",
      "responsibilities": "Implemented AI and machine learning algorithms to develop fraud detection systems using **scikit-learn**, **XGBoost**, and **Azure Machine Learning**, enhancing the capability to analyze transaction patterns and proactively flag suspicious activities across banking systems.\nOptimized data management and acquisition techniques by building and orchestrating ETL pipelines with **Python**, **Apache Airflow**, and **Azure Data Factory**, supporting a streamlined process for batch and real-time ingestion of financial data from **internal** and **third-party** sources.\nIntegrated first principles reasoning to identify scalable coding practices in the development of financial platforms, achieving a **30%** increase in system throughput for high-volume transaction systems through **microservices-based architecture** employing **Node.js (NestJS/Express)** and **Python (FastAPI/Django)**.\nEnhanced team collaboration by leading the creation of dynamic, user-focused front-end applications using **React (18)**, **Vue 3**, **Next.js**, and **TypeScript**, utilizing **Redux Toolkit** and **Tailwind CSS** for building responsive interfaces for financial dashboards and admin portals, resulting in improved user engagement metrics by **25%**.\nDesigned real-time analytics dashboards using **React**, **D3.js**, and **Power BI Embedded** to empower operations teams in tracking financial activities, detecting anomalies, and generating actionable insights, increasing operational efficiency by **20%**.\nEstablished a robust event-driven architecture by integrating **Kafka**, **RabbitMQ**, and **Azure Service Bus** to support asynchronous communication and real-time event processing for transactions, alerts, and compliance workflows, enhancing system reliability and responsiveness.\nDeveloped machine learning pipelines for tasks such as credit scoring, churn prediction, and transaction classification using **MLflow** and **Airflow**, streamlining model inference integration into backend services for real-time decision-making, which improved predictive accuracy by **15%**."
    },
    {
      "role": "Software Engineer",
      "company": "Timspark",
      "from_date": "Sep 2015",
      "to_date": "Aug 2019",
      "location": "UK",
      "responsibilities": "Applied **AI** techniques for customer insights and product recommendations, enhancing user experience and driving conversion rates through personalized content.\nUtilized **data management** strategies to ensure efficient handling, storage, and retrieval of large datasets across various technologies such as **MongoDB**, **PostgreSQL**, and **Redis**.\nEngineered scalable backend services with **Python** (FastAPI, Django) and **Node.js** (NestJS, Express) for a high-traffic e-commerce platform, achieving **99.9%** uptime and low latency in critical modules including checkout and order fulfillment.\nCollaborated with cross-functional teams to develop features using **frontend** frameworks such as **React** (18), **Vue 3**, and **Angular**, resulting in enhanced responsiveness and user engagement across **50%** of our mobile users.\nDeveloped **data acquisition** processes for real-time analytics, ensuring real-time customer feedback and seamless inventory tracking powered by **Kafka** and **RabbitMQ**.\nImplemented **data labeling** techniques to train **AI/ML** models with tools including **scikit-learn**, **LightGBM**, and **TensorFlow**, resulting in a **30%** increase in search relevance.\nLeveraged first principles reasoning to optimize backend performance, employing caching strategies using **Redis** to reduce database load by **40%**.\nContributed to **team collaboration** efforts through agile methodologies, fostering a productive environment and driving projects to completion within the established **6-week** delivery timeline.\nMaintained high standards of **problem-solving** by employing rigorous testing and QA methodologies, leading to a **25%** reduction in bug reports post-deployment.\nEnhanced user data protection and compliance with **GDPR** guidelines through effective use of **OAuth 2.0** and role-based access control (RBAC) ensuring secure access for **100%** of users."
    }
  ],
  "skills": "**Programming Languages:**\n\tPython, JavaScript, TypeScript\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tJWT, OAuth2, Keycloak (OIDC, RBAC)\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS, Azure\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, Nginx, Certbot, problem solving, team collaboration, English proficiency, first principles reasoning, scalable coding, data management, data acquisition, data labeling, models and techniques, Artificial Intelligence & Machine Learning"
}