{
  "name": "Mariusz Jan Skobel",
  "role_name": "Senior Manual QA Engineer",
  "email": "mariuszskobel15@outlook.com",
  "phone": "+48 735 343 548",
  "address": "Katowice, Poland",
  "linkedin": "https://www.linkedin.com/in/mariusz-skobel-789557397/",
  "profile_summary": "Senior Manual QA Engineer with a robust background in manual and automated testing, bringing over 10 years of experience in delivering high-quality software solutions, particularly in fintech and iGaming sectors. Expertise in testing methodologies including manual testing, API testing, and website testing, utilizing tools such as **BrowserStack**, **Sentry**, **Grafana**, and **Kibana** for effective quality assurance and monitoring. Proficient in client-server architecture, ensuring adherence to performance and security standards through thorough testing strategies. Skilled in network technologies like **TCP/IP**, **VPN**, and **DNS** to assure reliable application performance.\n\nExperienced with Agile development frameworks, leveraging tools such as **Jira** and **Confluence** for project management, and CI/CD practices with **GitLab** to maintain a smooth development lifecycle. Adept at implementing test design techniques to create comprehensive test cases and executing them efficiently. Strong analytical and problem-solving skills complemented by a passion for driving impactful results through high-quality products.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2012",
      "to_year": "2015",
      "location": "UK",
      "university": "University of Bristol"
    }
  ],
  "experience": [
    {
      "role": "Senior Manual QA Engineer",
      "company": "EitBiz",
      "from_date": "Oct 2022",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Conducted comprehensive **manual testing** and **API testing** of web applications utilizing **HTML**, **CSS**, and **client-server architecture** to ensure compliance with industry standards in the **fintech** sector.\n• Implemented effective **test design techniques** to develop test cases and scenarios, optimizing testing processes contributing to a **30%** reduction in bug turnaround time.\n• Collaborated closely with cross-functional teams in an **Agile development methodology** environment using **Jira** and **Confluence**, enhancing team communication and project tracking efficiency by **25%**.\n• Developed and executed **website testing** strategies using **DevTools**, **BrowserStack**, and **GitLab**, ensuring successful functionality across various browsers and devices, achieving a **99%** browser compatibility rate.\n• Managed and tracked system performance through tools like **Grafana**, **Sentry**, and **Logz**, identifying key metrics and improving system reliability by **40%**.\n• Executed **network technologies** evaluations including **VPN**, **DNS**, and **TCP/IP** to ensure robust connectivity and security for all applications tested, enhancing overall risk management.\n• Spearheaded the establishment of comprehensive test reporting and documentation processes in alignment with **qase.io**, facilitating clearer communication on project status and testing outcomes.\n• Engaged in **websockets** functionality testing to validate real-time data transmission capabilities, leading to **15%** faster client response times in applications.\n• Ensured rigorous adherence to quality standards across **iGaming** platforms by integrating feedback mechanisms and updating testing strategies in accordance with the latest industry developments.\n"
    },
    {
      "role": "Senior Software Engineer",
      "company": "Tvn S.A.",
      "from_date": "Oct 2019",
      "to_date": "Sep 2022",
      "location": "Poland",
      "responsibilities": "Conducted **API testing** and **website testing** to ensure the functionality and performance of financial web applications, leading to a **30% reduction** in defect rates across multiple releases.\nUtilized **GitLab** for version control and collaboration, maintaining a clean codebase and facilitating smoother development processes through effective **test design techniques** and continuous integration practices.\nParticipated in the architecture design using **client-server architecture** principles to optimize application performance, contributing to a **20% improvement** in load times for critical financial services.\nExecuted thorough **manual testing** procedures across various financial platforms, ensuring compliance with enterprise quality standards and reducing post-release bugs by **40%**.\nDeveloped test cases and documentation using **Jira** and **Confluence**, enabling clear communication of testing processes and results among cross-functional teams in an **Agile development methodology** environment.\nMonitored application performance and logging through tools like **Grafana**, **Sentry**, and **Kibana**, significantly enhancing the team's capability to diagnose issues in real-time and improve user experience.\nCollaborated with the development team to adopt **websockets** and implement **network technologies** for seamless communication between front-end and back-end components, ensuring scalability across systems.\nConducted performance testing on financial transactions utilizing **VPN** setups to mimic real-world scenarios, ensuring reliable data integrity and security under different network conditions."
    },
    {
      "role": "Software Engineer",
      "company": "Timspark",
      "from_date": "Sep 2015",
      "to_date": "Aug 2019",
      "location": "UK",
      "responsibilities": "Conduct comprehensive **manual testing** and **API testing** on web applications to ensure quality and functionality, utilizing tools such as **BrowserStack** and **GitLab**.\nPerform rigorous **website testing** by analyzing frontend components built with **HTML** and **CSS**, ensuring compatibility across all major browsers and devices.\nCollaborate with cross-functional teams to design and implement **test design techniques** focused on enhancing product reliability and security, leveraging **client-server architecture** for effective testing.\nUtilize **websockets** for real-time feature testing, ensuring robust communication during high-volume transactions in the e-commerce environment.\nMonitor application performance and error tracking using tools such as **Grafana**, **Sentry**, and **Kibana** to facilitate fast resolutions of issues affecting user experience.\nEngage in Agile development methodology practices through the use of **Jira** and **Confluence**, participating in sprint planning and retrospectives to enhance team collaboration and product quality.\nTest and analyze network protocols such as **DNS**, **TCP/IP**, and **VPN** to ensure robust server communication and data integrity.\nEnsure compliance with industry standards in the fintech sector by performing tests aligned with security best practices, leading to increased user trust and satisfaction.\nCollaborate closely with developers to implement feedback loops, supporting continuous improvement strategies that enhance application performance and reliability.\nUtilize **qase.io** for efficient test case management and documentation, structuring testing efforts to align with project timelines and objectives."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, JavaScript, TypeScript\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n **Frontend Frameworks:**\n\tReact, Vue, Angular, HTML, CSS\n\n **API Technologies:**\n\tAPI testing, websockets\n\n **Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n **Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose, Grafana, Sentry, Logz, Kibana\n\n **Cloud & Infrastructure:**\n\tAWS, Azure, network technologies, DNS, TCP/IP, VPN\n\n **Other:**\n\tManual testing, website testing, client-server architecture, test design techniques, Agile development methodology, Jira, Confluence, BrowserStack, qase.io, fintech, iGaming, Keycloak, JWT, OAuth2, Let’s Encrypt, Nginx, Certbot"
}