{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Software Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "As a Senior Software Engineer with 8 years of experience, I specialize in **Kotlin** and **Spring Boot** for building scalable and high-performance applications. My technical expertise includes implementing **event-driven architectures** and working with **Pub/Sub systems** and **event streaming** to enhance system responsiveness and efficiency. I have a strong focus on data storage strategies, ensuring **data accuracy** and the performance of **OLAP systems** for analytics purposes. \n\nMy background in **infrastructure as code** allows me to efficiently provision cloud resources, optimizing deployment processes. I excel in **query optimization** and designing systems that prioritize scalability and performance under varying loads. I am a collaborative problem-solver who thrives in fast-paced environments, leveraging best practices to deliver innovative solutions. \n\nAdditionally, I have a proven track record in full-stack development utilizing **JavaScript**, **TypeScript**, **React**, **Node.js**, and **Django**, and have hands-on experience with **cloud platforms** such as **Azure** and **AWS**. My robust background in CI/CD automation, combined with experience in AI/ML integration for intelligent solutions, positions me as a versatile asset to any software development team.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Software Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Utilized **Kotlin** and **Spring Boot** to develop and maintain scalable, high-performance applications within an event-driven architecture, enhancing system responsiveness and user engagement.\nImplemented **Pub/Sub systems** to facilitate efficient event streaming and real-time data processing, improving application responsiveness and data accuracy by **30%**.\nDesigned and built **OLAP systems** for querying large datasets, optimizing query performance by **50%** through data storage strategies and indexing best practices.\nArchitected infrastructure using **Infrastructure as Code** principles, allowing for dynamic provisioning of cloud resources, resulting in a deployment time reduction by **40%**.\nCollaborated with cross-functional teams to craft solutions that leverage cloud technologies, ensuring seamless integration and scalability of services across multiple environments.\nDevised and executed strategies for **query optimization**, improving data retrieval efficiency and application performance in line with accessibility needs for end-users.\nFocused on building scalable applications that prioritize data accuracy and system reliability through innovative problem-solving techniques and agile methodologies.\nFostered a collaborative environment, leading teams through complex challenges, ensuring shared success and aligning with project goals while maintaining quality standards."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Designed and implemented an event-driven architecture leveraging **Kotlin**, **Spring Boot**, and embedded **Pub/Sub systems**, enhancing system scalability and responsiveness for high-volume financial transactions.\nOptimized query performance and data accuracy by utilizing OLAP systems for analytics, ensuring efficient retrieval and processing of financial datasets.\nCollaborated with cross-functional teams to deploy infrastructure as code solutions, streamlining the provisioning of **cloud resources** and establishing best practices for maintenance and scalability across financial platforms.\nConducted thorough assessments and improvements of existing data storage strategies, which resulted in a **30%** increase in retrieval speeds and enhanced data integrity for complex financial systems.\nProblem-solved real-time event streaming challenges using **Kafka** and **RabbitMQ**, designing a reactive system capable of handling **100,000+** transactions per minute.\nUtilized **Azure Service Bus** to facilitate asynchronous communication, providing a seamless flow of information across the platform and improving transaction processing times by **40%**.\nFostered a culture of collaboration among Software Engineers, Data Scientists, and Operations teams to drive innovative solutions tailored to complex banking compliance workflows and transaction monitoring systems."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Leveraged **Kotlin** and **Spring Boot** to design and optimize robust backend services focused on high availability and scalability for e-commerce platforms, achieving an uptime of **99.9%** across core functionalities including checkout and order fulfillment.\nEngineered real-time features utilizing **event-driven architecture** and **Pub/Sub systems** with **Kafka** and **RabbitMQ**, facilitating efficient order updates and dynamic inventory tracking, leading to a **30%** reduction in latency.\nImplemented **OLAP systems** to enhance data analytics capabilities and ensure data accuracy, improving reporting speed by **25%** through sophisticated query optimization techniques.\nCollaborated with cross-functional teams to adopt **Infrastructure as Code** practices, streamlining cloud resources provisioning using **Terraform** and ensuring compliance with deployment standards.\nEmployed foundational data storage strategies using **MongoDB** and **PostgreSQL** to facilitate fault-tolerant data access, achieving a **40%** enhancement in data retrieval times for high-traffic workloads.\nDeveloped comprehensive solutions by integrating **cloud resources** for seamless scalability, resulting in improved support for concurrent users by **50%** during peak sessions.\nUtilized problem-solving skills to address technical issues promptly and effectively, fostering collaboration among team members and contributing to successful project delivery.\nOptimized legacy applications with new components, implementing scalable microservices architecture to align with organizational growth goals and ensure future-ready infrastructure."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, JavaScript, TypeScript, Kotlin\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django, Spring Boot\n\n **Frontend Frameworks:**\n\tReact, Vue, Angular\n\n **API Technologies:**\n\tJWT, OAuth2, Keycloak (OIDC, RBAC)\n\n **Serverless and Cloud Functions:**\n\tAWS (Lambda), Azure (App Services)\n\n **Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, CI/CD & Infrastructure as Code (Terraform, Ansible, Helm, Docker Compose)\n\n **Cloud & Infrastructure:**\n\tAWS (ECS, RDS, S3), Azure (Blob, SQL), Cloud resources provisioning\n\n **Other:**\n\tArtificial Intelligence & Machine Learning (MLflow, Airflow, Kubeflow), Event-driven architecture, Pub/Sub systems, Event streaming, OLAP systems, Data storage strategies, Query optimization, Data accuracy, Scalability, Collaboration, Problem-solving",
  "apply_company": "Sequence"
}