{
  "name": "Tomasz Lee",
  "role_name": "Senior ML Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Results-driven Senior ML Engineer with over 9 years of experience in developing innovative machine learning solutions. Proficient in utilizing **PyTorch**, **TorchVision**, **OpenCV**, **Pillow**, and AWS platforms to deploy and scale applications effectively. Expertise in containerization and orchestration with **Docker** and **Kubernetes**, along with a solid understanding of monitoring and observability tools such as **Prometheus**, **Grafana**, and **OpenTelemetry**. Skilled in creating APIs with **FastAPI** and managing infrastructure using **AWS CDK**. Recognized for optimizing performance and collaborating seamlessly across teams to drive project completion.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Senior ML Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Leveraged **AWS** and **Docker** for deploying scalable ML models in production, effectively managing compute resources and ensuring high availability.\nUtilized **Kubernetes** for orchestrating containerized applications, enhancing deployment efficiency and resource utilization by **50%**.\nDeveloped and optimized machine learning pipelines using **FastAPI** for real-time model serving, improving response times by **30%**.\nImplemented data processing workflows using **OpenCV** and **Pillow** to enhance image preprocessing accuracy, contributing to better model performance.\nIntegrated **PyTorch** and **TorchVision** for building and training deep learning models, achieving an accuracy improvement of **15%** on benchmark datasets.\nMonitored ML model performance with **Prometheus** and **Grafana**, ensuring model reliability and timely detection of anomalies.\nCollaborated with cross-functional teams to gather requirements and design scalable architecture, enhancing system performance and maintainability.\nEmployed **ZenML** for automating ML workflows, streamlining the development process and reducing project turnaround time by **25%**.\nImplemented observability with **OpenTelemetry** to capture and analyze application metrics, leading to improved system diagnostics.\nContributed to writing clear and concise documentation for ML processes and model management, facilitating better team collaboration."
    },
    {
      "role": "Software Engineer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "Leveraged **AWS** and **Docker** to deploy machine learning models, achieving a deployment scalability increase by **40%**.\nDesigned and implemented RESTful APIs using **FastAPI** for seamless integration with machine learning models, ensuring real-time data processing.\nUtilized **OpenCV** and **Pillow** for advanced image processing tasks, resulting in a **25%** improvement in model accuracy for image classification.\nDeveloped and optimized machine learning pipelines with **PyTorch** and **TorchVision**, significantly reducing training time by **30%**.\nImplemented container orchestration using **Kubernetes**, ensuring high availability and fault tolerance for ML applications.\nMonitored and visualized system performance using **Prometheus** and **Grafana**, enhancing observability and troubleshooting capabilities for deployed models.\nEmployed **ZenML** for ML workflow management, improving reproducibility and efficiency by streamlining CI/CD practices.\nConducted regular code reviews and provided mentorship in ML practices to junior engineers, fostering a culture of continuous learning.\nCollaborated with cross-functional teams to gather requirements and define project roadmaps, ensuring alignment with business objectives and timely delivery.\nEstablished data processing architectures that integrated with **AWS CDK**, improving deployment speed by **20%**."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "Developed and deployed machine learning models using **PyTorch** and **TorchVision**, achieving an accuracy improvement of **15%** over previous models.\nDesigned and implemented image processing pipelines with **OpenCV** and **Pillow**, enhancing image processing efficiency by **30%**.\nLeveraged **AWS** services for scalable model training and deployment, reducing infrastructure costs by **25%** compared to on-premise solutions.\nUtilized **Docker** for containerization of applications, ensuring consistent development and production environments.\nManaged orchestration of containers using **Kubernetes**, enabling automated scaling and resilience of ML applications.\nImplemented infrastructure as code using **AWS CDK**, streamlining resource provisioning and management processes.\nBuilt REST APIs for model inference with **FastAPI**, optimizing response times to under **100ms**.\nIntegrated monitoring solutions with **Prometheus** and **Grafana** for tracking model performance and system metrics, allowing proactive adjustments.\nEmployed **OpenTelemetry** to enhance observability within deployed services, leading to **20%** faster incident response times.\nCollaborated with cross-functional teams to align ML initiatives with business objectives, ensuring project success and timely delivery."
    }
  ],
  "skills": " **Programming Languages**\n\tPython, TypeScript\n\n**Backend Frameworks**\n\tFastAPI, NodeJS, ExpressJS, NestJS, C#, .NET, Entity Framework, Microservices\n\n**Frontend Frameworks**\n\tReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n**API Technologies**\n\tRESTful API, GraphQL\n\n**Serverless and Cloud Functions**\n\tAWS CDK\n\n**Databases**\n\tMSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB\n\n**DevOps**\n\tDocker, Kubernetes, AWS, Azure, CI/CD pipelines, Prometheus, Grafana, OpenTelemetry\n\n**Cloud & Infrastructure**\n\tAWS\n\n**Other**\n\tUX/UI Design, Git, GitHub, Redis, Apache Kafka, RabbitMQ, Testing Tools: NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest, Blockchain: Solidity, Ether.js, Web3.js, Ethereum, ZenML, OpenCV, Pillow, TorchVision, PyTorch",
  "apply_company": "celebrate company"
}