{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Software Developer for Training AI Data",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-623a26390/",
  "profile_summary": "Results-driven Software Developer with 13+ years of professional coding experience, skilled in developing robust APIs and working with JSON data structures. Proficient in **Python**, **JavaScript**, and maintaining a strong analytical mindset with excellent problem-solving skills. Capable of delivering high-performance applications, with a strong emphasis on attention to detail and technical writing. \n\nExperienced in building AI-powered solutions and leveraging **cloud services** like **AWS** and **Azure** for scalable application deployment. Demonstrated ability to develop end-to-end solutions utilizing modern frameworks such as **React**, **Next.js**, and **Node.js** for frontend, while utilizing **FastAPI** and **Django** for backend development. \n\nSkilled in compliance-driven methodologies, ensuring that solutions adhere to industry standards such as HIPAA and PCI DSS. Well-versed in data-driven project methodologies, capable of guiding teams through technical specifications while following detailed instructions. Strong experience in AI/ML platforms with a focus on MLOps tools like **MLflow** and **Kubeflow**.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Software Developer for Training AI Data",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Leveraged **Python** and **JavaScript** to develop robust **APIs** for data exchange, ensuring adherence to data integrity and security protocols.\nDemonstrated strong **problem-solving skills** while debugging and optimizing existing code, leading to a reduction in latency by **20%** and improving application performance.\nApplied **analytical thinking** to design and implement scalable data structures in **JSON** format, facilitating seamless communication between various system components.\nEngaged in professional coding practices across multiple languages including **Python**, **Java**, and **Go**, delivering clean and efficient code aligned with industry standards.\nUtilized modern front-end frameworks such as **React** and **Vue** to enhance user interfaces, resulting in improved user satisfaction scores by **30%** through focused design improvements.\nConducted thorough technical writing for documentation and user guides, ensuring clarity and compliance for systems built using cutting-edge technologies.\nMaintained a meticulous attention to detail while implementing features and debugging issues, contributing to a **15%** reduction in reported bugs post-deployment.\nCollaborated effectively with teams to follow project instructions and guidelines, achieving on-time deliverables for **3** major software releases.\nContributed to the troubleshooting of cross-functional issues, guiding teams on best practices for data exchange and API usage.\nIntegrated and optimized algorithms in backend systems to enhance data processing efficiency, which resulted in reducing processing times from **10s** to **2s**."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Utilized **APIs** and **JSON** in building robust financial platforms, ensuring seamless integration and data exchange between services and third-party tools.\nEmployed **Python** for backend development alongside **JavaScript**, demonstrating **professional coding experience** while utilizing frameworks such as Node.js (**NestJS/Express**) and **Django**.\nDemonstrated **problem-solving skills** by modernizing core systems through the migration of legacy architectures into microservices, which resulted in a **30%** improvement in performance for transactional applications.\nEnhanced user experience and interface responsiveness by developing applications with **React (18)**, **Vue 3**, and **Next.js**, integrating state management with **Redux Toolkit** and styling with **Tailwind CSS**.\nCreated analytical tools and dashboards using **React**, **D3.js**, and **Power BI Embedded**, which helped operations teams gain insights from **90%** of operational data in near real-time.\nDesigned an event-driven architecture using **Kafka**, **RabbitMQ**, and **Azure Service Bus**, ensuring **99.9%** uptime and reliability for critical workflows, including payments and compliance alerts.\nConstructed ETL pipelines using **Python** and **Apache Airflow**, enabling efficient data processing from both internal and third-party sources, achieving **real-time processing** for financial transactions.\nDeployed machine learning models for fraud detection leveraging **scikit-learn** and **XGBoost**, facilitating the identification of suspicious activities with an accuracy rate exceeding **95%** based on historical data patterns.\nCreated continuous learning ML pipelines for credit scoring, churn prediction, and transaction classification using **MLflow** and **Airflow**, ensuring integration with backend services and operational analytics."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Developed and maintained robust APIs utilizing **Python** and **JavaScript**, ensuring effective data interchange via **JSON** for integration with various data sources and third-party services.\nApplied professional coding experience to optimize software performance, leveraging strong problem-solving skills and analytical thinking for efficient debugging and solution implementation.\nExecuted technical writing for documentation purposes, ensuring clarity and accessibility for future developers by employing attention to detail and instruction-following ability in conveying complex concepts.\nContributed to code reviews and peer programming, enhancing code quality and fostering learning among team members with constructive feedback and collaboration.\nDesigned and implemented scalable software modules capable of handling **9** concurrent requests, ensuring system reliability and responsiveness with minimal downtime.\nConducted performance testing across various software iterations, achieving a **15%** reduction in average response time and successfully deploying version **2.1** of the software.\nUtilized agile methodologies to streamline workflows and track project progression, promoting efficiency and adaptability throughout the software development lifecycle."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, JavaScript, Java, C++, Ruby, Go\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tAPIs, JSON\n\n**Serverless and Cloud Functions:**\n\tAWS: ECS, Lambda, RDS, S3\n\tAzure: App Services, Blob Storage, SQL Database\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD\n\tCI/CD & Infrastructure as Code: Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tKeycloak (OIDC, RBAC), OAuth2, JWT, Nginx, Let’s Encrypt, Certbot\n\n**Other:**\n\tProfessional coding experience, Problem-solving skills, Analytical thinking, Technical writing, Attention to detail, Instruction-following ability"
}