{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Cloud Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "As a Senior Cloud Engineer with 8 years of experience, I excel in implementing **Azure**, utilizing **Infrastructure as Code** tools such as **Terraform**, **ARM Templates**, and **Bicep** to create resilient cloud solutions. My proficiency in **Zero-Trust-Security** principles, combined with tools like **Defender for Cloud** and **Sentinel**, ensures robust security and compliance with industry standards. I have a strong track record in developing cloud-first strategies and aligning governance practices with cloud services while adhering to compliance requirements.\nIn addition to my cloud expertise, I am a seasoned Full Stack Developer skilled in modern **JavaScript/TypeScript** and **Python**, with hands-on experience in **Flutter** technologies. I have built high-performance platforms leveraging frameworks like **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**. My background in developing enterprise-grade solutions that incorporate AI/ML capabilities for predictive analytics and real-time data processing showcases my ability to deliver innovative solutions. I possess a robust foundation in microservices architecture, event-driven systems, and CI/CD automation, which further supports my commitment to building secure applications in compliance with standards such as HIPAA, FHIR, PCI DSS, and SOC 2. Additionally, I have experience in developing machine learning pipelines and implementing MLOps workflows using **MLflow**, **Airflow**, and **Kubeflow**. Fluent in both German and English, I can effectively communicate within diverse teams.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Cloud Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Implemented **Azure** cloud solutions while ensuring compliance and governance with industry standards such as HIPAA and PCI DSS.\nArchitected and managed infrastructure as code utilizing **Terraform**, **ARM Templates**, and **Bicep** to automate deployments and maintain configuration consistency.\nEnhanced security postures through **Zero-Trust Security** practices, leveraging tools such as **Defender for Cloud** and **Sentinel** to monitor and respond to threats across cloud environments.\nDesigned and deployed scalable infrastructures in alignment with a **Cloud-First Strategy**, optimizing performance and resource utilization for applications across **Microsoft 365** and Azure services.\nCollaborated with cross-functional teams to address security and compliance requirements, ensuring adherence to regulations while implementing advanced features in both English and German.\nLed the migration and optimization of existing infrastructure to foster more efficient resource management, achieving a **20%** reduction in operational costs.\nBuilt automated CI/CD pipelines for seamless integration and deployment across multiple environments, reducing deployment time by **50%**.\nProvided expert guidance on governance frameworks to maintain compliance across all cloud projects, allowing streamlined operations which supported over **100+** applications simultaneously.\nUtilized advanced monitoring and logging tools to ensure system performance and security, improving system reliability by **30%**."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Implemented **Azure** Cloud solutions with a focus on **Infrastructure as Code** utilizing tools such as **Terraform**, **ARM Templates**, and **Bicep** to ensure scalable and maintainable environments for financial applications.\nDesigned and enforced a **Cloud-First Strategy** aimed at enhancing organizational agility and minimizing cloud-related costs while ensuring compliance with **Zero-Trust Security** principles.\nManaged security and compliance frameworks within the Azure ecosystem, leveraging tools like **Defender for Cloud** and **Sentinel** to proactively safeguard systems and maintain governance across various workloads.\nLed a cross-functional team in developing automated deployment pipelines that improved provisioning speed by **30%**, enhancing overall operational efficiency.\nFacilitated the integration of **Microsoft 365** tools to streamline collaboration and communication within the team, boosting productivity by **25%**.\nConducted security audits and compliance assessments, ensuring adherence to regulatory standards, reducing compliance gaps by **40%**.\nCollaboration with multilingual teams to support projects in both **German** and **English**, facilitating a diverse and inclusive work environment."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Implemented **Cloud-First Strategy** utilizing **Azure** services to enhance infrastructure and application deployment.\nDesigned and managed **Infrastructure as Code** solutions using **Terraform** and **ARM Templates** to streamline resource provision and environment setup, reducing deployment times by **30%**.\nDeveloped automated security compliance frameworks leveraging **Defender for Cloud** and **Sentinel** to ensure adherence to **Zero-Trust Security** principles, palpably enhancing the system's resilience against threats.\nManaged governance policies and compliance issues for cloud resources, ensuring alignment with organizational guidelines and regulatory requirements, achieving **100% compliance audit success**.\nCollaborated with cross-functional teams to optimize cloud resources, implementing scalability solutions that allowed for a **50% increase** in service capability without downtime.\nExtended Microsoft 365 functionalities by integrating security solutions for improved data protection and user access management, leveraging **RBAC** systems and **OAuth 2.0** for secure customer interaction.\nProvided strategic guidance in securing cloud applications, directly contributing to a **20% reduction** in security incidents over a year, bolstering trust with clients.\nConducted training sessions in both German and English, empowering teams to adopt cloud practices effectively and promoting a culture of security compliance across the organization.\nStreamlined communication and collaboration across engineering teams through a modernized cloud platform and governance strategy, improving project delivery timelines by **25%**."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, JavaScript, TypeScript\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n **Frontend Frameworks:**\n\tReact, Vue, Angular\n\n **API Technologies:**\n\tJWT, OAuth2\n\n **Serverless and Cloud Functions:**\n\tAWS (Lambda), Azure\n\n **Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD\n\n **Cloud & Infrastructure:**\n\tTerraform, Azure (App Services, Blob, SQL), ARM Templates, Bicep, Defender for Cloud, Sentinel, Governance, Compliance\n\n **Other:**\n\tArtificial Intelligence & Machine Learning (MLflow, Airflow, Kubeflow), Nginx, Certbot, Keycloak (OIDC, RBAC), Zero-Trust Security, Cloud-First Strategy, Microsoft 365, German, English\n",
  "apply_company": "SelectLine Holding GmbH"
}