{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Fullstack Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "Results-driven Senior Full Stack Engineer with 8 years of experience specializing in high-performance web applications. Proficient in **React**, **Node.js**, **TypeScript**, **Redux**, **Express**, **REST**, **GraphQL**, **Python**, **PostgreSQL**, and **Mongo**. Skilled in implementing modern front-end and back-end technologies to create seamless web experiences while ensuring optimal performance, security, and compliance with standards like PCI DSS.\nDemonstrated expertise in cloud solutions including **AWS** with strong capabilities in CI/CD automation to enhance deployment efficiency. Passionate about leveraging analytics and automation tools for continuous improvement and performance tuning using **Lighthouse** and **Axe** for enhanced user experiences. Committed to building robust applications through deep knowledge of microservices architecture, web security practices, and best coding standards. Experience in leading cross-functional teams to achieve project goals and deliver innovative solutions across various industries.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Fullstack Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Developed and maintained robust applications utilizing **React** (17-18), **Node.js**, and **TypeScript**, ensuring high performance and adherence to coding standards.\n- Integrated state management seamlessly through **Redux** and **Hooks**, optimizing user interactions and data flow.\n- Architected back-end services using **Express**, with rich APIs built on **REST** and **GraphQL** for efficient data handling and queries.\n- Designed data storage solutions leveraging **PostgreSQL** and **MongoDB**, allowing for efficient data management in line with industry best practices.\n- Implemented CI/CD processes to automate deployments and ensure continuous integration, enhancing development agility and code quality.\n- Prioritized application security, applying measures that comply with regulatory standards, ensuring safe data handling for both healthcare and financial domains.\n- Configured cloud services on **AWS** for scalable deployment strategies, achieving fault tolerance and high availability.\n- Developed responsive user interfaces using **HTML** and **CSS**, ensuring cross-browser compatibility and mobile-first strategies.\n- Employed performance optimization techniques and tools, such as **Lighthouse** for front-end auditing and enhancing application speed.\n- Collaborated with cross-functional teams to integrate **Firebase** for real-time capabilities, enhancing user engagement and experience.\n- Led initiatives to implement automated testing frameworks such as Jest and Cypress, achieving over **90% code coverage** across applications, ensuring reliability.\n- Established security protocols for sensitive data handling and application integrity, addressing vulnerabilities through thorough assessments.\n- Authored extensive documentation for codebases and APIs to facilitate team collaboration and onboarding, resulting in a **30% reduction** in onboarding time.\n- Integrated various third-party APIs to enhance application features and user experiences, facilitating direct access to essential data and services."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "• Utilized **Node.js** (NestJS/Express) and **Python** (FastAPI, Django) to lead the development and modernization of financial platforms, incorporating a microservices-based architecture that enhanced scalability, maintainability, and throughput for high-volume transaction systems.\n• Developed dynamic, user-focused front-end applications leveraging **React** (18), **TypeScript**, and **Redux**, integrating **Tailwind CSS** for responsive design, crucial for financial dashboards and admin portals.\n• Constructed real-time transaction monitoring and analytics dashboards employing **React**, **D3.js**, and **Power BI** Embedded, empowering operations teams to effectively track financial activity and detect anomalies, achieving a **30% increase** in actionable insights generated.\n• Established a robust event-driven architecture by integrating **Kafka**, **RabbitMQ**, and **Azure Service Bus**, facilitating asynchronous communication and real-time event processing for transactions, alerts, and compliance workflows.\n• Built and orchestrated ETL pipelines using **Python**, **Apache Airflow**, and **Azure Data Factory**, enabling efficient batch and real-time ingestion of financial data from both internal and third-party sources.\n• Implemented AI/ML-powered fraud detection systems using **scikit-learn**, **XGBoost**, and **Azure Machine Learning**, analyzing transaction patterns to proactively identify and flag suspicious activities, reducing fraud incidents by **25%**.\n• Created ML pipelines for credit scoring, churn prediction, and transaction classification utilizing **MLflow** and **Airflow**, integrating model inference directly into backend services to support real-time decision-making.\n• Ensured application performance and security by conducting regular audits with **Lighthouse** and **Axe**, driving improvements in system responsiveness and security measures."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "• Developed scalable and high-performance web applications using **React (18)**, **Node.js (NestJS, Express)**, and **TypeScript**, ensuring optimal user experience through responsive design and efficient state management with **Redux** and **Hooks**.\n• Implemented RESTful and GraphQL APIs, fostering a seamless connection between frontend and backend services while adhering to industry best practices for **security** and **performance**.\n• Engineered robust backend services with **Python** frameworks (FastAPI, Django) to support vital e-commerce functionalities, achieving a high availability rate of **99.9%** and minimal latency across features.\n• Leveraged **PostgreSQL** and **MongoDB** for efficient data storage, employing advanced query optimization techniques to handle **1000+** concurrent database operations smoothly.\n• Integrated CI/CD pipelines to automate deployment processes, reducing release cycles by **30%** and ensuring continuous integration stability.\n• Conducted performance audits using **Lighthouse** and **Axe**, identifying bottlenecks and applying enhancements that improved load times by up to **40%**.\n• Applied **AWS** services for cloud infrastructure management, optimizing costs and improving data redundancy and availability while managing a portfolio of over **500,000+** user records securely.\n• Employed secure coding practices with an emphasis on GDPR compliance and implemented role-based access control (RBAC) using **OAuth 2.0** for enhanced user data protection.\n• Collaborated with cross-functional teams to design and deliver web solutions in line with business objectives, achieving an increase in user engagement metrics by **25%**."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, TypeScript\n\n **Frontend Frameworks:**\n\tReact, Vue, Angular, Redux, Hooks, HTML, CSS\n\n **Backend Frameworks:**\n\tNode.js, FastAPI, Flask, Django, Express\n\n **API Technologies:**\n\tREST, GraphQL\n\n **Serverless and Cloud Functions:**\n\tAWS (Lambda), Azure (App Services)\n\n **Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming)\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:**\n\tAWS (ECS, RDS, S3), Azure (Blob, SQL)\n\n **Other:**\n\tMLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, Redis, Firebase, Performance, Security, Lighthouse, Axe",
  "apply_company": "AccessiWay"
}