{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Webflow Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Senior Webflow Engineer with 13+ years of experience in delivering high-performance web applications. Proficient in **Webflow**, **Responsive Design**, and **SEO**, with a keen eye for **Microinteractions** and **Animations**. Demonstrated ability in leveraging **Figma** for designing intuitive user interfaces and simplifying **Site Integrations** while employing **Analytics** to drive insights. Skilled in remote collaboration, enabling seamless teamwork and project execution.\n\nAn accomplished Full Stack Developer, well-versed in **JavaScript**, **TypeScript**, **Python**, and **Flutter**. Extensive hands-on experience with a variety of frontend frameworks such as **React**, **Next.js**, and **Vue**, in addition to backend technologies like **Node.js**, **FastAPI**, and **Django**. Experienced in developing AI/ML-powered platforms and deploying cloud-native systems on **AWS** and **Azure**. Strong knowledge in implementing microservices, event-driven architectures, and CI/CD pipelines, adhering to compliance standards including HIPAA and PCI DSS.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Webflow Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Designed and implemented responsive web solutions using **Webflow**, ensuring optimal user experience through advanced **Responsive Design** strategies and enhancing site performance with proper **SEO** practices.\nUtilized **Figma** for high-fidelity prototyping, effectively collaborating with cross-functional teams to integrate user feedback into design iterations, ensuring high-quality deliverables in a **remote collaboration** environment.\nCreated and managed dynamic site integrations, ensuring seamless workflows and data flow using **web analytics** tools to monitor user behavior and site performance, optimizing for higher engagement.\nDeveloped microinteractions and animations to enhance user interfaces, contributing to a more engaging user experience and improving site usability metrics by over **15%**.\nLed efforts in implementing performance analytics, generating detailed reports that informed design adjustments, directly enhancing site conversion rates by **20%**.\nFacilitated site functionality through integrations with third-party tools and services, resolving challenges that arose during deployment and enhancing overall site efficiency.\nCollaborated with design teams to deliver unique visual experiences using **Svelte** for component-based development, achieving a development cycle reduction of **30%**.\nEnsured accessibility standards were met throughout design and development processes, creating inclusive websites for diverse user demographics.\nOffered technical support and training for team members on **Webflow** functionalities, fostering a shared knowledge environment that increased team efficiency.\nContinuously researched and implemented the latest design trends, aiding the innovation of cutting-edge **microinteractions** and ensuring the final product stayed ahead of market expectations."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Focused on enhancing **Responsive Design** through the use of **Webflow** to create visually appealing and user-friendly web applications.\nCollaborated with design teams using **Figma** to ensure seamless integration of creative assets and adherence to brand guidelines.\nImplemented analytics frameworks to monitor site performance and user engagement, facilitating data-driven decisions to improve overall user experience.\nConstructed microinteractions and animations to foster engaging user experiences, increasing user retention rates by **30%**.\nProvided guidance on **Site Integrations** to connect various services and tools, streamlining workflows and enhancing overall product capabilities.\nEngaged in **Remote Collaboration** with cross-functional teams, ensuring all project milestones were met on time and within budget constraints, achieving a **100%** on-time delivery rate.\nDeveloped and maintained multiple projects simultaneously, averaging **5-6** active projects at any time without compromising quality or performance."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Developed and implemented responsive designs using **Webflow**, ensuring high-quality user experiences across various devices while optimizing for SEO and accessibility (WCAG 2.1).\nUtilized **Figma** for design collaboration and prototyping, enhancing team communication and project efficiency during the design phase with feedback from at least 9 stakeholders.\nCreated engaging microinteractions and animations, increasing user engagement and retention rates by up to **30%**.\nConducted thorough analytics on design performance and user interactions, using tools like Google Analytics, resulting in actionable insights to refine site integrations and user flows.\nCollaborated remotely with cross-functional teams to integrate site components, ensuring seamless user experiences and consistent brand messaging across all channels, effectively coordinating with teams across **3** different time zones.\nLeveraged **Svelte** for developing high-performance web applications, improving site load times by up to **40%** compared to older frameworks.\nEnsured all designs adapted to project requirements, maintaining responsive UI elements through thorough testing and iterations, achieving a defect ratio of less than **2%** in delivered projects.\nIntegrated various site integrations and ensured compatibility with existing platforms, enhancing overall functionality and user experience across all web applications."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython: FastAPI, Flask, Django\n\tJavaScript/TypeScript: React, Vue, Angular\n\n**Frontend Frameworks:**\n\tSvelte\n\tWebflow\n\n**Other:**\n\tResponsive Design\n\tSEO\n\tFigma\n\tMicrointeractions\n\tAnimations\n\tAnalytics\n\tSite Integrations\n\tRemote Collaboration\n\n**Backend Frameworks:**\n\tPython: FastAPI, Flask, Django\n\n**API Technologies:**\n\tKeycloak (OIDC, RBAC), OAuth2, JWT\n\n**Serverless and Cloud Functions:**\n\tAWS: ECS, Lambda, RDS, S3\n\tAzure: App Services, Blob Storage, SQL Database\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare)\n\tMongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes\n\tGitHub Actions, GitLab CI/CD\n\tTerraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS: ECS, Lambda, RDS, S3\n\tAzure: App Services, Blob Storage, SQL Database\n",
  "apply_company": "HKR"
}