{
  "name": "Tomasz Lee",
  "role_name": "Frontend Tech Lead",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-477994390/",
  "profile_summary": "Results-driven Frontend Tech Lead with 9+ years of experience in overseeing the design and development of user-centric applications. Proficient in **React**, **TypeScript**, and **Next.js**, with a strong foundation in implementing i18n lifecycle strategies and utilizing **Crowdin** for localization. Expertise in managing **third-party integrations** and APIs, ensuring seamless functionality across platforms. Demonstrated success in leveraging analytics for A/B testing and optimizing SEO and PageSpeed for enhanced user experience. Adept at collaborating with cross-functional teams, utilizing tools like **Figma** for UI/UX design, and excelling in communication and leadership roles. Committed to delivering innovative solutions that meet client needs.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Frontend Tech Lead",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Apr 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "• Led the development and optimization of frontend applications utilizing **React**, **Next.js**, and **TypeScript**, enhancing performance metrics by **30%**.\n• Spearheaded A/B testing initiatives and SEO optimizations, resulting in a **15%** increase in web traffic and user engagement.\n• Integrated **i18n lifecycle** for internationalization, ensuring seamless user experiences across multiple languages supported by **Crowdin**.\n• Coordinated the UX/UI design improvements using **Figma**, collaborating closely with designers to ensure a consistent and user-friendly interface.\n• Developed and maintained RESTful APIs that facilitated third-party integrations, ensuring robust data exchange and enhanced functionality.\n• Utilized **Turborepo** and **NX** for efficient monorepo management, leading to a **20%** reduction in build times.\n• Leveraged analytics tools for performance monitoring and enhancement, providing insights that drove decision-making.\n• Engaged in regular communication with stakeholders to align project objectives and deliverables, fostering a collaborative work environment.\n• Championed the implementation of automated testing tools, improving code quality and reducing bugs reported in production by **25%**."
    },
    {
      "role": "Full Stack Developer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "Designed and developed responsive web applications using **React**, **TypeScript**, and **Next.js** to enhance user experience and engagement, leading to a **25%** improvement in platform usage.\nImplemented **i18n lifecycle** processes and integrated **Crowdin** for efficient localization and internationalization of applications, supporting users across **10+** languages.\nUtilized **Turborepo** and **NX** for monorepo management, enhancing development workflow efficiency, and reducing build times by **20%**.\nDeveloped and maintained RESTful APIs for third-party integrations, ensuring seamless connectivity with other platforms and services to enrich application functionality.\nConducted **A/B testing** and analytics to evaluate feature performance and user engagement, driving data-informed decisions that enhanced application features by **15%**.\nOptimized web applications for **SEO** and **PageSpeed improvements**, resulting in increased visibility and loading times, boosting traffic by **30%**.\nCollaborated with design teams using **Figma** to create intuitive UI/UX components, ensuring alignment with user needs and business goals.\nLed and mentored junior developers, conducting code reviews and fostering a culture of collaboration and continuous improvement within the team.\nEffectively communicated project progress and challenges to stakeholders in English, facilitating transparency and timely decision-making."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "Led the development and implementation of responsive user interfaces using **React** and **Next.js**, enhancing user experience and boosting engagement metrics by **30%**.\nUtilized **TypeScript** to ensure type safety and improve code maintainability across the frontend architecture, reducing bugs by **25%**.\nOrchestrated **i18n lifecycle** integration to support multilingual capabilities, facilitating localization efforts using **Crowdin** with **80%** market coverage.\nManaged third-party integrations and APIs effectively, streamlining data interactions and enhancing functionality for client projects.\nEmployed **analytics** tools to measure user interactions and improve overall application performance through targeted **A/B testing**, achieving a **15%** increase in user retention.\nImplemented **SEO optimizations** techniques leading to a **40%** improvement in organic traffic and **PageSpeed** score enhancements, significantly boosting page load times.\nCollaborated with UX/UI designers using **Figma** to refine application design, ensuring adherence to the latest UI/UX best practices.\nUtilized **NX** and **Turborepo** for efficient monorepo management, reducing build times and improving project scalability.\nFacilitated effective communication across teams, ensuring alignment with project goals and maintaining high standards through regular code reviews.\nProvided mentorship and guidance to junior developers, enhancing team skills and facilitating knowledge transfer."
    }
  ],
  "skills": "Frontend Technologies: React, TypeScript, Next.js, HTML, CSS, JavaScript, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n\tBackend Technologies: NodeJS, ExpressJS, NestJS, C#, .NET, Entity Framework, Microservices\n\n\tAPI Technologies: RESTful API, GraphQL, API, third-party integrations\n\n\tMessaging & Caching: Apache Kafka, RabbitMQ, Redis\n\n\tDatabase Systems: MSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB\n\n\tCloud & Infrastructure: AWS, Azure, CI/CD pipelines\n\n\tDevOps: NX, Turborepo\n\n\tOther Skills: UX/UI Design, Figma, A/B testing, analytics, SEO optimizations, PageSpeed improvements, English skills, communication, Git, GitHub, Python, Redux\n\n\tBlockchain: Solidity, Ether.js, Web3.js, Ethereum\n\n\tTesting Tools: NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest\n\n\tServerless and Cloud Functions: i18n lifecycle, Crowdin"
}