{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Network Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Senior Network Engineer with a robust background in developing and maintaining high-performance network solutions, equipped with 13+ years of experience in the healthcare and financial sectors. Proficient in implementing **Docker**, **Kubernetes**, and **Terraform** for automated deployments, and well-versed in CI/CD methodologies. Hands-on expertise in network security and management via **Cisco**, **Juniper**, **PaloAlto**, and **CheckPoint** technologies. Skilled in Python programming for developing **REST-APIs**, and proficient in orchestration and automation using **Ansible**. Solid foundation in ITIL practices and DevOps strategies, ensuring compliance with industry standards. Capable of utilizing **JSON** and **YAML** for configuration management and proficient in network protocols such as **routing** and **VLAN**. Adept at leveraging real-time analytics and predictive modeling in developing IT solutions. Strong advocate for aligning technical solutions with compliance-driven frameworks.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Network Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Implemented and managed **CI/CD** pipelines using **Docker**, **Kubernetes**, and **Ansible**, ensuring streamlined deployment processes and minimal downtime for network applications.\nDesigned and maintained secure **REST APIs** for network management and device configuration, utilizing tools like **Postman** and adhering to **ITIL** best practices.\nConfigured and managed enterprise-level networking solutions utilizing **Cisco**, **Juniper**, and **PaloAlto** devices, ensuring optimal performance and reliability for over **500** users.\nLeveraged **Terraform** for infrastructure as code (IaC), enabling automated provisioning and management of networking resources in **AWS** and other cloud environments.\nExecuted network architecture strategies, incorporating **VLAN** configurations and **routing** protocols to enhance data flow and security for localized and remote connections.\nDeveloped comprehensive network monitoring solutions, integrating analytics tools to visualize traffic patterns, reduce latency by **25%**, and ensure quality of service.\nEnsured compliance with industry standards by implementing security protocols and conducting vulnerability assessments on **CheckPoint** firewalls and routers, resulting in a **30%** reduction in security incidents.\nConducted training sessions for teams on **YANG**, **JSON**, and **YAML** configurations to foster a robust understanding of network automation practices across the organization.\nCollaborated with interdisciplinary teams to deploy enhancements and security patches, significantly improving the uptime of critical network infrastructure to **99.9%**.\nUtilized version control systems effectively, employing **Git** for versioning configurations and scripts, facilitating easier collaboration and rollback capabilities."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Implemented CI/CD pipelines for seamless deployment of network configurations and services, leveraging **Docker** and **Kubernetes** to enhance deployment efficiency and consistency in production environments.\nConfigured and managed network appliances using **Ansible** and **Terraform**, ensuring automated provisioning and scalability of network infrastructure across **Cisco**, **Juniper**, and **PaloAlto** devices.\nMonitored and optimized network performance utilizing **REST-APIs** for integration with network tools and systems, providing actionable insights and real-time troubleshooting.\nConducted thorough network assessments and reported findings using **JSON** and **YAML** formats, supporting strategic planning and compliance audits under **ITIL** frameworks.\nDesigned and implemented VLAN configurations and routing protocols based on **CCNA**, **CCNP**, and **CCIE** standards, improving network efficiency and communication across **9** departments.\nUtilized **Postman** to test and validate network APIs, ensuring accurate data flow and connectivity between network services.\nIntegrated network security features by deploying policies via **CheckPoint** and real-time monitoring through **Cisco** systems, reinforcing network integrity against cyber threats."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Designed and optimized network architectures and services using **Python (Django)** and **REST-APIs** to enhance network reliability and performance, ensuring fault tolerance across critical network components for high-traffic environments.\nEngineered automated deployment pipelines with **Docker**, **Kubernetes**, and **Terraform** for consistent and scalable network configuration management, facilitating zero-downtime deployments across **10+** network sites.\nDeveloped network monitoring and management tools utilizing **Ansible** and **CI/CD** practices to identify and mitigate potential network outages, achieving a **95%** reduction in incident response times.\nLeveraged network protocols for efficient data routing and connectivity, implementing **YANG**, **JSON**, and **YAML** for direct **REST-API** integrations with network devices to streamline configuration processes.\nImplemented advanced configurations and architecture using **Cisco**, **Juniper**, **PaloAlto**, and **CheckPoint** products to enhance security and optimize routing, serving **2M+** users across the platform.\nDesigned and managed VLANs and routing protocols to minimize broadcast domains, improving network efficiency and stability by up to **40%**.\nConducted performance tuning and optimization of network policies resulting in a more robust and secure environment, meeting **ITIL** and **DevOps** standards for operational excellence.\nCreated extensive documentation using **Postman** for REST API endpoints to facilitate seamless team collaboration and ensure comprehensive knowledge sharing, maintaining a **99%** accuracy rate in network documentation."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tJavaScript/TypeScript: React, Vue, Angular\n\n**API Technologies:**\n\tREST-APIs, Postman, JSON, YAML\n\n**Serverless and Cloud Functions:**\n\tAWS: Lambda, ECS, RDS, S3\n\tAzure: App Services, Blob Storage, SQL Database\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, CI/CD, Ansible, Terraform, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tITIL\n\n**Other:**\n\tCisco, Juniper, PaloAlto, CheckPoint, CCNA, CCNP, CCIE, Routing, VLAN, Keycloak (OIDC, RBAC), OAuth2, JWT, Nginx, Let’s Encrypt, Certbot, MLflow, Airflow, Kubeflow, YANG",
  "apply_company": "nscon network, security & consulting gmbh"
}