{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Presales Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Senior Presales Engineer with 13+ years of experience in cloud solutions, data integration, and analytics. Proven expertise in delivering high-performance applications and engaging in solution consulting that aligns with enterprise software sales needs. Skilled in **Minitab Statistical Software** and **Minitab Connect**, facilitating insightful technical presentations and effective customer engagement processes.\nIn addition to sales acumen, I possess hands-on experience in **JavaScript/TypeScript**, **Python**, and **Flutter**, with a strong focus on both frontend and backend development utilizing **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**. I have a solid background in developing AI/ML-powered platforms that leverage predictive analytics, automation, and real-time processing, supported by a robust understanding of compliance frameworks such as HIPAA, FHIR, PCI DSS, and SOC 2 standards.\nProficient in deploying cloud-native systems on **AWS** and **Azure**, and implementing microservices, event-driven architectures, and CI/CD pipelines, I am adept at account planning and analyzing market trends to drive innovative technology solutions.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Presales Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Provided **solution consulting** in cloud environments to ensure seamless **data integration** and **analytics** for a variety of enterprise software sales scenarios.\nDelivered **technical presentations** showcasing comprehensive understanding of market trends, focusing on healthcare and fintech industries to engage customers effectively.\nMaintained strong **customer engagement** through tailored **account planning** strategies, resulting in a **30%** increase in customer satisfaction scores year over year.\nDocumented solution architectures and technical proposals, ensuring effective communication with both technical and non-technical stakeholders.\nAnalyzed customer requirements and market trends to formulate strategic approaches for integrating **Minitab Statistical Software** and **Minitab Connect** into existing systems.\nCollaborated with cross-functional teams to deliver demo solutions that effectively highlighted product capabilities, increasing product adoption by **25%** among target audiences.\nDeveloped comprehensive training materials and conducted workshops for clients on utilizing data analytics tools to leverage insights from structured and unstructured datasets, contributing to better decision-making.\nUtilized industry insights to advise clients on the implementation of **cloud** services, enabling scalable solutions and operational efficiency in data-driven businesses."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Utilized **cloud** technologies to recommend solutions and architectures that optimize enterprise software, fostering improved customer engagement and technical presentations.\nExecuted data integration strategies through modern ETL pipelines, leveraging **Apache Airflow** and **Azure Data Factory** to streamline the ingestion of data from both internal and third-party sources, ensuring quick access to accurate analytics.\nApplied analytical techniques using **Minitab Statistical Software** for real-time financial analytics, supporting solution consulting to identify market trends and improve sales strategies.\nDelivered comprehensive technical presentations that emphasized the advantages of proposed solutions, facilitating effective communication with stakeholders and increasing customer engagement significantly.\nConducted detailed account planning, leveraging data analytics to inform strategic decisions and improve sales performance across multiple accounts, reaching targets of **9%** growth in client satisfaction metrics.\nFacilitated workshops that focused on early identification of market trends, leading to actionable insights that supported enterprise software sales teams, allowing them to respond effectively to changing market demands."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "• Conducted technical presentations showcasing the capabilities of cloud-based solutions to enhance customer engagement and streamline enterprise software sales, leveraging analytics to identify market trends.\n• Engaged in solution consulting to drive customer satisfaction, utilizing data integration skills to demonstrate the effectiveness of services in addressing client needs.\n• Developed and presented comprehensive account planning strategies that align with customer requirements, showcasing the value of utilizing **Minitab Statistical Software** and **Minitab Connect** for data analysis and insights.\n• Collaborated with cross-functional teams to create tailored solutions that integrate various technologies, ensuring seamless communication and effective delivery of enterprise software solutions.\n• Analyzed and reported on customer feedback and usage statistics using **analytics** tools, improving future presentations and strategies based on insights gathered.\n• Participated in driving customer engagement efforts by leading workshops and training sessions on industry best practices and effective use of cloud technologies and integration solutions.\n• Monitored market trends and evolving technologies to maintain expertise in the competitive landscape, presenting findings to stakeholders to influence strategic decisions within the organization.\n• Established and maintained long-term relationships with key accounts, resulting in a **25% increase** in client retention rates by strategically addressing their evolving needs through targeted solution recommendations.\n• Ensured all technical documentation and proposals were accurate and compelling, contributing to an overall **30% improvement** in proposal acceptance rates and successful project bid outcomes."
    }
  ],
  "skills": " **Cloud & Infrastructure** \n\tAWS: ECS, Lambda, RDS, S3, Azure: App Services, Blob Storage, SQL Database  \n\n **Programming Languages** \n\tPython: FastAPI, Flask, Django, JavaScript/TypeScript: React, Vue, Angular  \n\n **Backend Frameworks** \n\tFastAPI, Flask, Django  \n\n **Frontend Frameworks** \n\tReact, Vue, Angular  \n\n **API Technologies** \n\tKeycloak (OIDC, RBAC), OAuth2, JWT  \n\n **Databases** \n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis  \n\n **DevOps** \n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose  \n\n **Analytics** \n\tMinitab Statistical Software, Minitab Connect  \n\n **Other** \n\tdata integration, solution consulting, enterprise software sales, technical presentations, communication, customer engagement, account planning, market trends  ",
  "apply_company": "Minitab"
}