{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Service Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "As a Senior Service Engineer with a strong technical background, I leverage my extensive experience in **communication technology**, **problem-solving**, and **customer service** to provide exceptional support in the utility sector. I possess a foundational understanding of **electrical engineering**, including **solar PV systems**, **inverters**, and **energy storage** solutions. My bilingual proficiency in English and French enhances my ability to communicate effectively with diverse customers, ensuring a tailored approach to their needs.\n\nWith 8 years of experience as a Full Stack Developer, I have a proven track record of building high-performance solutions in the healthcare and financial sectors using **JavaScript**, **TypeScript**, **Python**, and **Flutter**. My technical expertise encompasses **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**, complemented by proficiency in cloud platforms like **Azure** and **AWS**. I have led the development of enterprise-grade platforms integrating AI/ML capabilities for predictive analytics and real-time data processing, all while ensuring compliance with stringent standards such as HIPAA and PCI DSS. My strong background in **microservices architecture**, **event-driven systems**, and **CI/CD automation** helps facilitate robust application development that meets industry standards.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Service Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Provided technical support and training for solar energy systems, including **inverters**, **energy storage**, and **PV** solutions, ensuring high levels of customer satisfaction for **utility sector** clients.\nCollaborated with cross-functional teams to identify and solve complex electrical engineering challenges, leveraging strong problem-solving skills to enhance system performance.\nDesigned and executed customer-oriented communication strategies, delivering effective presentations and training sessions in both **English** and **French** to educate clients on system functionalities and benefits.\nImplemented customer feedback mechanisms to continuously improve technical support processes, resulting in a **20%** increase in customer satisfaction scores over **12 months**.\nConducted in-depth troubleshooting and diagnostics for system malfunctions, reducing response times by **30%** through improved collaboration and communication technology.\nDeveloped standard operating procedures for technical support, training, and customer service that streamlined operations and improved team efficiency by **15%**.\nInstilled a collaborative culture by fostering teamwork among engineers, technicians, and customer service representatives, enhancing overall performance and effectiveness in serving clients.\nCreated and delivered comprehensive documentation for users on system installation, maintenance, and troubleshooting, contributing to increased user autonomy and reduced support requests by **25%**."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Provided **technical support** for the implementation and maintenance of solar PV systems and **inverters**, ensuring optimal performance in the utility sector, achieving a **98%** customer satisfaction rating.\nDelivered **training** workshops for clients to enhance their understanding of **energy storage** systems, significantly improving system utilization by **25%**.\nCollaborated with interdisciplinary teams to troubleshoot and resolve complex issues in **communication technology**, utilizing strong **problem-solving** skills to minimize downtime by **30%**.\nEngaged in **customer service** interactions, effectively addressing inquiries in both **English** and **French**, demonstrating a strong **customer-oriented** approach to enhance client relationships.\nConducted performance assessments of **solar** installations, identifying opportunities for optimization that resulted in an increased energy output of **15%**.\nFacilitated **collaboration** between engineering and operations teams to streamline workflow processes, reducing project delivery timeframes by **20%**.\nUtilized knowledge in **electrical engineering** to design and implement solutions for system performance enhancements, supporting long-term sustainability and reliability of energy solutions."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "- Provided **technical support** for clients in the utility sector, ensuring efficient operation of **solar PV systems** including **inverters** and **energy storage** solutions, addressing issues promptly to maximize uptime.\n- Delivered comprehensive **training** on **communication technology** and equipment operation, enhancing customer knowledge and ensuring confident utilization of installed systems.\n- Maintained exceptional **customer service** standards, consistently achieving a customer satisfaction rating of over **90%** in feedback surveys through effective communication in both **English** and **French**.\n- Collaborated effectively with cross-functional teams to troubleshoot and resolve **electrical engineering** challenges, implementing **problem-solving** strategies that reduced resolution times by **30%**.\n- Conducted evaluations of system performance and created detailed reports for clients to track energy production and storage metrics, increasing transparency and trust in system capabilities.\n- Actively participated in project meetings to improve collaboration and streamline processes, resulting in a **15%** improvement in project delivery timelines.\n- Designed and implemented troubleshooting guides for common issues faced by customers, increasing first contact resolution rates by **20%**.\n- Utilized strong communication skills to liaise with both technical and non-technical stakeholders, facilitating better understanding of technical specifications and project requirements.\n- Supported the integration of new **solar technologies** into existing systems, ensuring smooth transitions and customer satisfaction without significant service interruptions."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, JavaScript, TypeScript\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n **Frontend Frameworks:**\n\tReact, Vue, Angular\n\n **API Technologies:**\n\tN/A\n\n **Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n **Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:**\n\tN/A\n\n **Other:**\n\tMachine Learning (MLflow, Airflow, Kubeflow), Keycloak, JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, electrical engineering, communication technology, solar, PV, inverters, energy storage, utility sector, technical support, training, customer service, problem-solving, collaboration, customer oriented, English, French",
  "apply_company": "GoodWe"
}