{
  "name": "Tomasz Lee",
  "role_name": "Senior Cloud Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Dynamic Senior Cloud Engineer with 9+ years of experience in driving successful cloud transformation initiatives and platform engineering projects. Proficient in **Azure**, **Google Cloud**, and observability tools, with a strong focus on hybrid IT environments. Expertise in client collaboration, providing technical leadership, and engaging in sales activities to propel business growth. Adept at proposal development and delivering executive presentations that enhance customer focus. Originally trained as a .NET Full Stack Developer, skilled in **microservices architecture**, leveraging tools like **Apache Kafka**, **RabbitMQ**, **Redis**, **ReactJS**, **NextJS**, and **.NET** to design and implement complex applications. Committed to promoting a growth mindset and fostering diversity and inclusion within teams.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Senior Cloud Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Led cloud transformation initiatives utilizing **Azure** and **Google Cloud**, ensuring optimal performance and cost efficiency.\nShowcased technical leadership by implementing observability strategies, enhancing system monitoring and troubleshooting.\nCollaborated with clients to understand their needs, delivering customized solutions that increased customer satisfaction by 30%.\nSpearheaded platform engineering projects that integrated hybrid IT architectures, resulting in a **15%** reduction in operational costs.\nConducted executive presentations and proposal developments that secured **$1M** in contracts.\nFostered a culture of diversity and inclusion within teams, promoting innovative ideas and collaboration.\nAdopted financial operation practices (FinOps) to optimize cloud spending, leading to a **20%** budget reduction.\nEnhanced client collaboration techniques, increasing project efficiency and stakeholder engagement by **25%**.\nDrove growth mindset initiatives through training sessions, which improved team performance metrics by **18%**.\n\n"
    },
    {
      "role": "Full Stack Developer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "Leveraged **Azure** and **Google Cloud** to design and implement a cloud-based project management tool, resulting in a **15%** increase in team collaboration efficiency.\nExecuted cloud transformation strategies while collaborating with clients to define system requirements and development timelines, ensuring timely project delivery.\nApplied **Platform Engineering** principles by creating a microservices architecture with **RabbitMQ** for task orchestration and **Apache Kafka** for handling event-driven data streams, enhancing system scalability.\nOptimized performance by integrating **Redis** as a caching layer, leading to a **25%** boost in system performance by reducing latency in frequent API calls.\nDeveloped robust RESTful APIs with **.NET Core** and integrated them with a **PostgreSQL** database for real-time data access, improving service reliability.\nEnhanced user experience by building and maintaining **ReactJS** and **Tailwind CSS** components, resulting in a **25%** improvement in user engagement on the platform.\nImplemented CI/CD pipelines using **GitHub Actions**, successfully reducing production deployment errors by **30%**.\nManaged **MSSQL** and **MySQL** databases for efficient data storage and retrieval while optimizing queries for better performance.\nDemonstrated technical leadership by mentoring junior developers through code reviews, improving overall team productivity and fostering a growth mindset.\nPresented executive-level updates and proposals to stakeholders, ensuring a customer-focused approach that included emphasizing diversity and inclusion."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "Led cloud transformation initiatives using **Azure** and **Google Cloud**, enhancing system capabilities and operational efficiency by **30%**.\nExecuted strategies for observability in cloud environments, resulting in a **25%** reduction of incident response times.\nCollaborated with cross-functional teams to establish platform engineering best practices, promoting client collaboration and technical leadership.\nImplemented FinOps principles to optimize cloud costs across hybrid IT infrastructure, achieving savings of **15%**.\nFacilitated executive presentations and proposal developments, tailored to drive customer focus and secure new business opportunities.\nFostered a growth mindset within the team, encouraging diversity and inclusion in all engineering practices.\nManaged and refined client relationships, ensuring alignment with business goals and enhancing the overall client experience.\nProvided mentorship and guidance to junior engineers, strengthening the technical capabilities of the team and fostering innovation.\nDelivered technical documentation for cloud solutions, improving knowledge transfer among teams and supporting continuous learning."
    }
  ],
  "skills": "Programming Languages: Python, JavaScript, TypeScript\n\n\tBackend Frameworks: NodeJS, ExpressJS, NestJS, C#, .NET, Entity Framework, Microservices\n\n\tFrontend Frameworks: HTML, CSS, ReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n\tAPI Technologies: RESTful API, GraphQL\n\n\tServerless and Cloud Functions: Azure, AWS\n\n\tDatabases: MSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB\n\n\tDevOps: CI/CD pipelines\n\n\tCloud & Infrastructure: Google Cloud, Hybrid IT, Cloud Transformation, Platform Engineering, Observability\n\n\tOther: UX/UI Design, Git, GitHub, Redux, Blockchain, Solidity, Ether.js, Web3.js, Ethereum, Apache Kafka, RabbitMQ, Redis, NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest, Client Collaboration, Technical Leadership, Sales Activities, Proposal Development, Executive Presentations, Customer Focus, Growth Mindset, Diversity and Inclusion",
  "apply_company": "Kyndryl"
}