{
  "name": "Patryk Zaslawski",
  "role_name": "Senior Frontend Engineer",
  "email": "patrykzas0428@outlook.com",
  "phone": "+48669862402",
  "address": "Gdanski, Poland",
  "linkedin": "https://www.linkedin.com/in/patryk-z-9b9455391/",
  "profile_summary": "As a results-driven Senior Frontend Engineer with 8+ years of software engineering expertise, I excel in crafting scalable, high-performance applications using **JavaScript**, **TypeScript**, and **React**. I possess extensive experience in developing **RESTful APIs** and implementing **Microservices** architecture, ensuring robust and maintainable solutions. My proficiency extends to **Next.js**, **React Native**, and state management tools such as **MobX**, **Redux**, and **Zustand**, facilitating seamless user experiences. I prioritize security by employing best practices from **OWASP** and mitigating risks related to threats like **XSS** and **CSRF**. My solid foundation in software engineering principles such as **SOLID**, **DRY**, **YAGNI**, and **KISS**, along with design patterns from the **GoF Patterns**, guides my approach to developing high-quality software. Additionally, I am experienced in CI/CD tools like **Docker**, **CircleCI**, and **GitLab**, leveraging cloud services such as **AWS** (including **Lambdas**, **API Gateway**, and **DynamoDB**) for efficient deployment and scalability. My commitment to delivering enterprise-level solutions aligns with industry best practices, enhanced by my collaborative mindset and focus on UI component library design.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2014",
      "to_year": "2017",
      "location": "United Kingdom",
      "university": "The University of Manchester"
    }
  ],
  "experience": [
    {
      "role": "Senior Frontend Engineer",
      "company": "Binary Studio",
      "from_date": "Aug 2023",
      "to_date": "Present",
      "location": "United Kingdom (Remote)",
      "responsibilities": "Designed and developed **RESTful APIs** and **microservices** using **JavaScript** and **TypeScript** to ensure seamless integration with backend services and enhance user experience.\nImplemented modern **JavaScript** libraries and frameworks including **React**, **Next.js**, and **Redux** to create interactive, responsive user interfaces for applications handling sensitive healthcare data.\nApplied best practices of **SOLID**, **DRY**, **YAGNI**, and **KISS** principles in code architecture to improve maintainability and scalability across frontend components.\nUtilized **Docker** for containerization of micro-frontend applications, optimizing deployment pipelines and ensuring consistency across environments.\nIntegrated third-party tools and services, including **AWS** services like **Lambdas** and **API Gateway**, to enhance application functionality while maintaining a robust architecture.\nLed successful implementation of CI/CD pipelines with **CircleCI** and **GitLab**, resulting in improved automated testing and quicker deployment cycles by **30%**.\nDeveloped dynamic UIs using **MobX**, **Redux**, and **Zustand** for state management, optimizing application performance and responsiveness.\nConducted comprehensive testing strategies including **OWASP** security assessments to identify vulnerabilities related to **XSS** and **CSRF**, ensuring compliance with industry standards.\nChampioned best practices in UI component library design to facilitate reuse and consistency across frontend applications, enhancing development efficiency for a team of **10+** engineers.\nMentored junior engineers on modern **JavaScript** frameworks and architectural patterns, fostering a culture of knowledge sharing and continuous improvement.\nCollaborated closely with backend teams to map out data flow and ensure efficient communications between **React** applications and backend services using **PostgreSQL** and other databases.\nSupported agile methodologies, participating in sprint reviews and retrospectives while ensuring alignment with project goals and timelines."
    },
    {
      "role": "Software Engineer",
      "company": "Ardigen",
      "from_date": "Mar 2020",
      "to_date": "Aug 2023",
      "location": "Poland",
      "responsibilities": "Developed and maintained user-centric frontends using **React**, **Next.js**, and integrated state management with **Redux** and **MobX**, ensuring responsive and efficient UI experiences.\nDesigned and implemented RESTful APIs for seamless communication with backend services, ensuring adherence to **OWASP** guidelines to eliminate vulnerabilities such as **XSS** and **CSRF**.\nCollaborated on microservices architecture, employing **Docker** and **Kubernetes** for containerization and orchestration, ensuring high scalability and performance across **AWS** environments.\nIntegrated complex UI component libraries to align with project requirements and initiated best practices in component design, following principles like **SOLID**, **DRY**, **YAGNI**, and **KISS**.\nLed the transformation of legacy systems to **micro-frontend** architectures, improving code maintainability and deployment speeds through modular architectures.\nImplemented CI/CD pipelines using **CircleCI** and **GitLab**, enforcing automated testing and quality assurance processes for consistent delivery.\nOptimized application performance through effective use of **PostgreSQL** and **DynamoDB**, ensuring quick data access and high reliability.\nParticipated in code reviews and established coding standards, mentoring team members on best practices in **JavaScript** and **TypeScript** development.\nContributed to architectural discussions, promoting event-driven designs and microservices using technologies like **AWS Lambdas** and **API Gateway** to enhance application responsiveness.\nCreated secure and scalable applications while implementing measures to safeguard against evolving threats and vulnerabilities in the digital landscape."
    },
    {
      "role": "Software Engineer",
      "company": "Altum Software",
      "from_date": "Oct 2017",
      "to_date": "Feb 2020",
      "location": "United Kingdom",
      "responsibilities": "Implemented responsive and dynamic frontends with **React**, **Next.js**, and **TypeScript** to enhance user experience and accessibility across various devices, ensuring compatibility with the underlying backend services.\nLeveraged **RESTful APIs** for seamless data integration between frontends and backend systems, handling significant user interactions and improving overall performance.\nDesigned modular micro-frontend architecture utilizing **MobX**, **Redux**, and **Zustand** for state management, enhancing maintainability and scalability of frontend resources.\nEnsured adherence to security best practices (OWASP) by preventing vulnerabilities such as **XSS** and **CSRF** in web applications, achieving a reduction in security issues by **30%**.\nAutomated deployment pipelines using **Docker** and **CircleCI**, streamlining the workflow and reducing deployment time by **25%** through efficient CI/CD practices.\nConducted thorough unit and integration testing, employing testing frameworks that ensured code quality and robustness across the frontend, contributing to a **20%** improvement in test coverage.\nImplemented design patterns such as **SOLID**, **DRY**, **YAGNI**, and **KISS** to maintain clean and efficient code architecture, facilitating easier updates and feature additions.\nWorked with backend teams to integrate **PostgreSQL** services with **AWS Lambda** for optimized data retrieval and processing, effectively reducing data query latency.\nParticipated in architecture discussions around **microservices** and **Hexagonal** design, promoting a unified engineering approach and knowledge sharing across teams.\nDesigned and maintained UI component libraries to promote consistency in design and ensure rapid prototyping, leading to a decrease in development time by **15%** across projects."
    }
  ],
  "skills": " **Programming Languages:**\n\tJavaScript, TypeScript, Python, Java, Go\n\n**Frontend Frameworks:**\n\tReact, Angular (1–16), Next.js, Vue.js (2/3), React Native, Blazor\n\n**Backend Frameworks:**\n\tFastAPI, Django, Flask, Spring Boot, Microservices, Hexagonal\n\n**API Technologies:**\n\tRESTful APIs, REST & gRPC APIs, API Gateway, OWASP, JWT, OAuth2\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis, DynamoDB\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, CircleCI, AWS, Azure, Lambdas\n\n**Cloud & Infrastructure:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Other:**\n\tSQLAlchemy, Pydantic, Celery, MobX, Redux, Zustand, Micro-frontend, Camunda, UI component library design, Maven, Gradle, SOLID, DRY, YAGNI, KISS, GoF Patterns, XSS, CSRF, Keycloak (OIDC, RBAC), Let’s Encrypt, Nginx, Certbot",
  "apply_company": "Unspecified FinTech Company"
}