{
  "name": "Patryk Zaslawski",
  "role_name": "Software Engineer in Test",
  "email": "patrykzas0428@outlook.com",
  "phone": "+48669862402",
  "address": "Gdanski, Poland",
  "linkedin": "https://www.linkedin.com/in/patryk-z-107978395/",
  "profile_summary": "Results-driven Software Engineer in Test with over 8 years of experience in software engineering. Highly skilled in **Playwright**, **REST Assured**, **k6**, **GitLab CI/CD**, **Docker**, **Java**, **TypeScript**, and **SQL**, ensuring robust testing processes and strong test design techniques. Proven ability to develop and implement efficient testing frameworks while fostering collaboration within teams. Strong programming background complemented by a clear communication style and exceptional time management. As a former Senior Python Full Stack Developer, I bring expertise in **Python** (FastAPI, Django, Flask, SQLAlchemy) and frontend frameworks like **Angular**, **Vue**, **React**, and **Next.js**. I also possess experience with cloud platforms like **AWS** and **Azure**, optimizing databases in **PostgreSQL**, **MySQL**, and **MongoDB** to enhance application performance and reliability, showcasing attention to detail for delivering high-quality software solutions.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2014",
      "to_year": "2017",
      "location": "United Kingdom",
      "university": "The University of Manchester"
    }
  ],
  "experience": [
    {
      "role": "Software Engineer in Test",
      "company": "Binary Studio",
      "from_date": "Aug 2023",
      "to_date": "Present",
      "location": "United Kingdom (Remote)",
      "responsibilities": "- Developed and executed robust automated testing processes using **Playwright** and **REST Assured** to ensure seamless integration and functionality of Python microservices.\n- Employed **k6** for load testing and performance validation of APIs, achieving a **50%** reduction in response times and enhancing overall system reliability.\n- Configured and managed CI/CD pipelines with **GitLab CI/CD** to automate testing and deployments, ensuring high-quality code releases with zero downtime.\n- Developed comprehensive testing strategies that included test design techniques for both functional and non-functional requirements, leading to a **30%** increase in test coverage.\n- Collaborated closely with cross-functional teams of **10+** engineers to maintain clear communication and timely delivery of software solutions while ensuring adherence to best practices in testing.\n- Conducted thorough code reviews and mentoring sessions to elevate the proficiency of junior engineers in **Python**, promoting a collaborative learning environment.\n- Utilized **Docker** to containerize applications for consistency in test environments, enhancing deployment speed and simplifying infrastructure management.\n- Designed and implemented SQL-based test cases to validate data integrity and accuracy in response to various user scenarios.\n- Stressed the importance of attention to detail in test execution, resulting in meticulous documentation and identification of potential bugs during the early stages of development.\n- Demonstrated exceptional time management skills by delivering high-priority tasks and projects within tight deadlines without compromising quality.\n- Actively participated in Agile ceremonies to ensure clear communication of testing statuses and deliverables, facilitating transparency and alignment among teams.\n- Championed the adoption of test automation frameworks and best practices to streamline the software testing lifecycle, contributing to an overall higher quality product release.\n- Applied programming skills in **Java** and **TypeScript** to develop scalable test scripts and frameworks, extending the automation capabilities of the team."
    },
    {
      "role": "Software Engineer",
      "company": "Ardigen",
      "from_date": "Mar 2020",
      "to_date": "Aug 2023",
      "location": "Poland",
      "responsibilities": "Developed and executed comprehensive testing processes using **Playwright** and **REST Assured** for API testing, ensuring high-quality software delivery.\nDesigned and implemented test automation frameworks with **k6** for load testing, validating system performance under varying conditions.\nCollaborated with cross-functional teams to enhance the development workflow while utilizing tools such as **Docker** for consistent test environment setups.\nManaged continuous integration and continuous deployment (CI/CD) pipelines using **GitLab CI/CD**, promoting seamless integration and faster delivery cycles.\nConducted thorough SQL database testing to verify data integrity and performance across various database systems, ensuring robust data handling.\nCreated detailed test design techniques for functional and non-functional testing, maintaining a focus on system usability and reliability.\nEnsured clear communication and collaboration among team members to streamline the testing process, enhancing overall project outcomes.\nDemonstrated strong time management and attention to detail throughout the testing lifecycle, from test case design to execution and reporting.\nUtilized **Java** and **TypeScript** for writing automated test scripts, ensuring that tests are maintainable, reliable, and scalable over time.\nProvided mentorship and support to junior team members, fostering a culture of knowledge sharing and continuous improvement in testing practices."
    },
    {
      "role": "Software Engineer",
      "company": "Altum Software",
      "from_date": "Oct 2017",
      "to_date": "Feb 2020",
      "location": "United Kingdom",
      "responsibilities": "Implemented and optimized testing processes with **Playwright** and **REST Assured**, ensuring robust integration testing for e-commerce platforms and enhancing application reliability.\nDeveloped efficient load and performance tests using **k6** and **JMeter**, successfully simulating up to **1000** concurrent users to validate backend performance under peak traffic conditions.\nCollaborated with cross-functional teams to design clear test strategies while maintaining effective communication to align with business objectives and project timelines.\nDesigned and executed test cases for RESTful APIs, leveraging **Docker** containers to streamline testing environments and ensure consistency across development and production setups.\nUtilized **GitLab CI/CD** pipelines to automate testing and deployment processes, enhancing feature delivery speed and accuracy by **30%**.\nPerformed manual and automated testing of applications using **Java** and **TypeScript**, applying strong attention to detail to identify and rectify defects early in the development cycle.\nContributed to test design techniques, ensuring comprehensive coverage for features related to cart, checkout, and order fulfillment workflows.\nCoordinated with developers to refine testing documentation and ensure alignment with coding standards, improving overall code quality and maintainability.\nLeveraged SQL for backend database testing, performing data validation and ensuring correct transaction processing and storage within **PostgreSQL** and **MySQL** databases.\nManaged time effectively to balance multiple project deliverables, meeting deadlines while maintaining high-quality standards in testing deliverables."
    }
  ],
  "skills": " **Programming Languages:** \n\tPython, Java, TypeScript, SQL \n\n **Backend Frameworks:** \n\tFastAPI, Django, Flask, Spring Boot \n\n **Frontend Frameworks:** \n\tAngular (1–16), React (15–18), Next.js, Vue.js (2/3), Blazor \n\n **API Technologies:** \n\tREST & gRPC APIs, REST Assured \n\n **Serverless and Cloud Functions:** \n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL) \n\n **Databases:** \n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis \n\n **DevOps:** \n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD \n\n **Cloud & Infrastructure:** \n\tNginx, Certbot \n\n **Other:** \n\tPydantic, Celery, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Testing processes, Test design techniques, Programming, Collaboration, Clear communication, Time management, Attention to detail, k6, Playwright",
  "apply_company": "ProgressSoft Corporation"
}