{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior QA Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "As a Senior QA Engineer with 8 years of experience, I excel in automation testing and quality assurance processes, leveraging a robust skill set that includes **Python**, **JavaScript**, and testing frameworks like **PyTest** and **Playwright**. My expertise in REST API testing and cloud services such as **Azure DevOps** and **Azure Pipelines** ensures high-quality deliverables in fast-paced environments. I effectively manage project tracking and collaboration using tools like **Jira** and **TestRail**, streamlining workflows and improving team efficiency.\n\nI have a deep understanding of database technologies, including **Cosmos DB** and **MongoDB**, which supports my testing strategies for data-driven applications. Additionally, I am skilled in utilizing performance monitoring tools such as **Datadog** to identify and resolve issues proactively. With experience in integrating Active Directory and **Entra ID**, I ensure application security and compliance with industry standards. I bring strong analytical and problem-solving abilities, developing and implementing comprehensive test plans that align with business goals.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior QA Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Implemented comprehensive testing strategies and validated REST API functionalities using **Python** and **JavaScript**, employing tools such as **PyTest** and **Playwright** to ensure robust quality assurance across applications.\nDeveloped and maintained automated test suites in **Azure DevOps**, integrating them with **Azure Pipelines** for seamless Continuous Integration and Continuous Deployment (CI/CD) processes.\nCollaborated closely with development teams to analyze test results, file defects in **Jira**, and ensure issues are tracked and resolved throughout the development lifecycle while adhering to Agile methodologies.\nUtilized **Git** for version control, maintaining code integrity and facilitating collaboration among team members during the testing phases.\nExecuted performance and load testing scenarios, assessing system resilience and response times under varying loads, with a focus on achieving a benchmark of 99.9% uptime during production deployments.\nConducted thorough reviews of applications deployed in **Cosmos DB** and **MongoDB** environments, ensuring adherence to quality standards and functional requirements while optimizing test coverage across services.\nImplemented test documentation strategies using **TestRail** to streamline test case creation, execution, and result reporting, achieving a **30%** reduction in manual testing time through improved test management.\nMaintained efficient log and monitoring practices with **Datadog**, enabling proactive identification and resolution of issues before impacting end-users.\nFacilitated onboarding for new QA team members to ensure they are well-versed in quality standards and testing frameworks, contributing to a **20%** increase in team productivity during sprints.\nEngaged in cross-functional collaboration to integrate security testing practices into the QA process, enhancing application security posture and compliance with standards like HIPAA and GDPR.\nPerformed regular audits of test environments to guarantee complete alignment with production configurations, ensuring consistency across the development, testing, and production lifecycle."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Ensured high quality in software development by implementing automated testing strategies using **PyTest**, **Playwright**, and **REST API** to validate functionalities across applications.\nUtilized **Azure DevOps** for continuous integration and continuous deployment (CI/CD) pipelines, resulting in a 30% reduction in deployment time, enhancing overall project efficiency.\nCollaborated with development teams to integrate testing frameworks into the development cycle, leveraging **Jira** and **TestRail** for effective bug tracking and management, achieving a 95% test coverage across key modules.\nConducted performance testing and monitoring using **Datadog**, identifying bottlenecks and optimizing the system architecture to improve response times by 25%.\nParticipated in code reviews and maintained version control using **Git**, ensuring adherence to coding standards and best practices to uphold software integrity.\nAssisted in the migration of databases to **Cosmos DB** and **MongoDB**, optimizing data models and retrieval performance, which improved data processing speeds by up to 40%.\nImplemented security measures in collaboration with infrastructure teams, utilizing **Active Directory** and **Entra ID** to manage user access and authentication, thus enhancing data protection against unauthorized access.\nWorked closely with stakeholders to gather requirements and provide feedback, contributing to the development of user stories and acceptance criteria for successful project deliverables."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Designed and executed comprehensive test strategies using **Python** and **JavaScript** to ensure robust functionality of backend services within a global e-commerce environment.\nImplemented automated testing frameworks with **PyTest** and **Playwright** to validate user interfaces and APIs, reducing manual testing efforts by **40%** and increasing test coverage to **95%**.\nManaged continuous integration and delivery processes through **Azure Pipelines**, streamlining deployment cycles and enhancing collaboration among development teams using **Azure DevOps** and **Git**.\nEmployed various testing methodologies including **REST API** testing to validate service responses and integration correctness across e-commerce features leading to a **30%** decrease in post-deployment defects.\nUtilized **TestRail** and **Jira** for efficient test case management and defect tracking, ensuring alignment with project timelines and quality benchmarks.\nConducted performance testing using tools like **Datadog**, ensuring high availability and low latency of services under load conditions with metrics highlighting peak requests handling of over **1000** concurrent users.\nIntegrated automated testing with existing CI/CD pipelines ensuring real-time feedback to development teams, contributing to a **20%** faster turn-around time for bug fixes.\nCollaborated with cross-functional teams to implement user access controls utilizing **Active Directory** and **Entra ID**, ensuring security measures adhere to GDPR compliance and protect user data effectively.\nExecuted thorough testing on cloud databases like **Cosmos DB** and **MongoDB**, ensuring data integrity and performance for high-traffic e-commerce transactions.\nLeveraged insights from testing to inform strategic decisions that improved overall system performance and customer experience on the platform."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, JavaScript\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n **Frontend Frameworks:**\n\tReact, Vue, Angular\n\n **API Technologies:**\n\tREST API\n\n **Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL), Azure DevOps\n\n **Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), MongoDB, Cosmos DB, Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose, Azure Pipelines, Git\n\n **Cloud & Infrastructure:**\n\tAWS, Azure\n\n **Other:**\n\tMLflow, Airflow, Kubeflow, PyTest, Playwright, TestRail, Jira, Active Directory, Entra ID, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, Datadog",
  "apply_company": "One Identity"
}