{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Google Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Results-driven Senior Google Engineer with 13+ years of experience in technical consulting, project management, and customer service, skilled in **Google Cloud**, **Windows**, **Exchange**, and **Active Directory**. Proven ability in executing successful migrations and optimizing networking solutions while delivering exceptional customer service. Fluent in both English and German, facilitating team collaboration and training.\n\nLeverage extensive technical background as a Full Stack Developer with hands-on expertise in **JavaScript/TypeScript**, **Python**, and **Flutter** for developing high-performance applications in both frontend and backend environments using **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**. Adept at building AI/ML-powered platforms with a strong grasp of **MLOps**, employing frameworks like **MLflow**, **Airflow**, and **Kubeflow** to enhance predictive analytics and automation. Experienced in deploying cloud-native systems on **AWS** and **Azure**, along with implementing microservices and CI/CD pipelines, ensuring compliance with industry standards such as HIPAA, FHIR, PCI DSS, and SOC 2.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Google Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Delivered technical consulting and training on **Google Workspace** for efficient collaboration and project management, enhancing team productivity by **30%**.\n- Managed end-to-end migration projects to **Google Cloud**, ensuring minimal downtime and data integrity with a **99.9%** success rate.\n- Provided exceptional customer service by troubleshooting **Windows**, **Exchange**, and **Active Directory** issues, achieving a **95%** satisfaction rating from users.\n- Implemented networking solutions within **Google Cloud**, optimizing data flow and communication for remote teams, supporting **100+** simultaneous users.\n- Conducted project management activities, organizing resources and timelines effectively, resulting in the completion of projects **10%** ahead of schedule.\n- Fostered team collaboration through structured workshops and training sessions in **German** and **English**, improving cross-functional communication and workflow.\n- Led technical training initiatives for new tools and processes within the organization, enhancing skillsets, and increasing team efficiency by **25%**.\n- Collaborated with diverse teams to ensure the successful integration of new technology aligned with organizational goals, facilitating smooth transitions to **Google Cloud** services.\n- Analyzed customer feedback and system performance data to refine processes and improve service delivery, contributing to a **20%** increase in operational efficiency."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Provided technical consulting for migration projects in **Google Cloud**, effectively transitioning core services to enhance operational efficiency.\nManaged user access and permissions through **Active Directory** and **Google Workspace**, ensuring secure and streamlined access to tools and resources for teams.\nLed project management initiatives to design and implement technical training sessions, focusing on **Google Cloud** technologies for cross-functional teams.\nCollaborated with IT and networking teams to optimize systems, leveraging strong **customer service** skills to address and resolve technical issues.\nFacilitated team collaboration by documenting processes and best practices, utilizing tools such as **Google Workspace** to enhance communication and project tracking.\nDeveloped strategies for migrating legacy systems to **Google Cloud**, improving scalability and reducing operational costs by **30%**.\nOversaw technical training for team members in both **German** and **English**, ensuring a comprehensive understanding of systems and processes.\nImplemented networking solutions to streamline connectivity for remote work, significantly improving team productivity metrics by **25%**."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Applied project management skills to lead migration efforts to **Google Cloud**, ensuring seamless transition of services with zero downtime.\nProvided technical consulting and training for team members on **Google Workspace** integration, enhancing overall productivity and collaboration across departments.\nManaged Active Directory setups and migrations, ensuring secure user access and streamlined directory management for improved customer service.\nFacilitated team collaboration through effective networking strategies, providing solutions to enhance operational efficiency in a hybrid work environment while supporting **Windows** and **Exchange** services.\nDelivered exceptional customer service through prompt resolution of technical issues, maintaining high satisfaction levels among stakeholders.\nProduced detailed technical documentation and reports, improving communication within teams and supporting project management best practices.\nConducted training sessions for team members to enhance their knowledge in **Networking** and cloud services, fostering a culture of continuous improvement.\nUtilized bi-lingual communication skills (German and English) to provide support and training materials for diverse teams, ensuring clear understanding in technical processes and requirements.\nLeveraged team collaboration tools and methodologies to streamline processes and enhance productivity during project deployments and maintenance phases."
    }
  ],
  "skills": " **Programming Languages:**\n\t•\tPython: FastAPI, Flask, Django\n\t•\tJavaScript/TypeScript: React, Vue, Angular\n\n **Backend Frameworks:**\n\t•\tFastAPI\n\t•\tFlask\n\t•\tDjango\n\n **Frontend Frameworks:**\n\t•\tReact\n\t•\tVue\n\t•\tAngular\n\n **API Technologies:**\n\t•\tKeycloak (OIDC, RBAC)\n\t•\tOAuth2\n\t•\tJWT\n\n **Serverless and Cloud Functions:**\n\t•\tAWS: Lambda\n\t•\tGoogle Cloud\n\n **Databases:**\n\t•\tPostgreSQL (Fintech)\n\t•\tMySQL (Healthcare)\n\t•\tMongoDB (Gaming)\n\t•\tRedis\n\n **DevOps:**\n\t•\tDocker\n\t•\tKubernetes\n\t•\tGitHub Actions\n\t•\tGitLab CI/CD\n\n **Cloud & Infrastructure:**\n\t•\tAWS: ECS, RDS, S3\n\t•\tAzure: App Services, Blob Storage, SQL Database\n\n **Other:**\n\t•\tGoogle Workspace\n\t•\tMigration\n\t•\tWindows\n\t•\tExchange\n\t•\tActive Directory\n\t•\tNetworking\n\t•\tCustomer Service\n\t•\tProject Management\n\t•\tTechnical Consulting\n\t•\tTechnical Training\n\t•\tTeam Collaboration\n\t•\tGerman\n\t•\tEnglish\n",
  "apply_company": "PCG DACH"
}