{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Software Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Senior Software Engineer with 13+ years of experience delivering high-performance applications in diverse environments. Proficient in **Go**, **Linux**, and **Postgres** to implement scalable solutions. Skilled in **Java**, **C#**, and **C++** for software development and maintenance. Experienced in automation and distributed systems, enabling seamless integration and enhancement of applications.\nDemonstrated ability to build AI/ML-powered platforms supporting predictive analytics and real-time processing, combining skills in **JavaScript/TypeScript**, **Python**, and **Flutter**. Capable of frontend and backend development utilizing **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**.\nAdept at deploying cloud-native systems on **AWS** and **Azure**, implementing microservices, and CI/CD pipelines with a strong background in compliance-driven development, ensuring alignment with standards such as HIPAA, FHIR, PCI DSS, and SOC 2. Additionally experienced in MLOps, focusing on model training and orchestration with **MLflow**, **Airflow**, and **Kubeflow**.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Software Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Developed and implemented distributed systems using **Go** and **Java** to enhance application performance and scalability.\n- Designed and optimized databases using **Postgres** to ensure high availability and efficient data management.\n- Automated system processes and workflows in **Linux** environments, resulting in a **30%** increase in operational efficiency.\n- Conducted in-depth **Malware Analysis** to strengthen system security and improve application integrity.\n- Collaborated with cross-functional teams to integrate **C#** and **C++** modules, enhancing application features and performance.\n- Leveraged **QEMU** for virtualization and testing of server environments, ensuring compatibility and reliability across various platforms.\n- Delivered software solutions that adhered to best practices and compliance standards, including automation testing with **Jest** and **Cypress**.\n- Contributed to code reviews and design discussions to uphold high-quality standards in software development.\n- Engaged in continuous integration and deployment processes using tools such as **GitHub Actions** and **CircleCI** to streamline releases.\n- Established monitoring and logging practices for distributed systems to ensure quick identification and resolution of performance bottlenecks."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Leveraged **Go** for developing high-performance services, contributing to a scalable and efficient distributed system architecture.\nImplemented solutions on **Linux** servers, optimizing deployment processes and maintaining system reliability across multi-environment setups.\nDesigned and managed **Postgres** databases to ensure robust data storage solutions, improving transaction efficiency by **30%** through optimized query performance.\nUtilized **QEMU** for virtualization and testing environments, facilitating development processes with consistent and isolated test environments.\nConducted in-depth **Malware Analysis** to secure applications and systems, enhancing overall security posture and contributing to incident response strategies.\nDeveloped applications in **Java**, **C#**, and **C++**, ensuring robustness and performance across various technology stacks.\nAutomated CI/CD pipelines to enhance deployment frequency by **50%** and reduce lead time for changes through scripting and strategic tooling.\nParticipated in the design and implementation of **Distributed Systems**, improving fault tolerance and scalability of service-oriented architecture.\n"
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Utilized **Go** for developing scalable backend services and microservices in a **Linux** environment, focusing on performance and reliability to improve overall system efficiency by **30%**.\nDesigned and implemented automated deployment processes, increasing deployment speed by **50%** and reducing downtime during updates using **QEMU** for virtualization.\nOptimized data storage solutions in **Postgres** for handling complex queries, achieving a data retrieval speed improvement of **40%** while ensuring data integrity across distributed systems.\nConducted malware analysis and strengthened security protocols, leading to a **20%** decrease in vulnerabilities across the platform.\nCollaborated in cross-functional teams to integrate automated testing frameworks, which reduced bugs in production by **25%** and improved code quality.\nLeveraged **Java** and **C#** for developing high-performance frontend services, ensuring seamless integration and compatibility with existing systems.\nEngaged actively in code reviews and mentoring junior engineers, fostering a culture of knowledge sharing and continuous improvement within the team.\nDesigned efficient distributed systems architecture to handle heavy loads, resulting in improved load balancing and resource utilization across services."
    }
  ],
  "skills": " **Programming Languages:** \n\tGo, Java, C#, C++, Python, JavaScript, TypeScript \n\n **Backend Frameworks:** \n\tFastAPI, Flask, Django \n\n **Frontend Frameworks:** \n\tReact, Vue, Angular \n\n **API Technologies:** \n\tKeycloak (OIDC, RBAC), OAuth2, JWT \n\n **Serverless and Cloud Functions:** \n\tAWS: ECS, Lambda, RDS, S3, Azure: App Services, Blob Storage, SQL Database \n\n **Databases:** \n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis \n\n **DevOps:** \n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD \n\n **Cloud & Infrastructure:** \n\tTerraform, Ansible, Helm, Docker Compose, Linux \n\n **Other:** \n\tMLflow, Airflow, Kubeflow, QEMU, Distributed Systems, Automation, Nginx, Let’s Encrypt, Certbot, Malware Analysis",
  "apply_company": "Recorded Future"
}