{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior SAP Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "As a Senior SAP Engineer with a strong focus on **SAP** systems and configuration, I leverage 8 years of experience in troubleshooting and conducting root-cause analysis to enhance operational efficiency. I excel in process improvement initiatives that drive team collaboration and optimize performance metrics. My strong analytical skills, combined with effective communication abilities, allow me to work seamlessly within cross-functional teams to deliver high-quality solutions. My technical proficiency extends to full-stack development, employing modern JavaScript/TypeScript, **Python**, and **Flutter**., along with deep knowledge of **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**. Furthermore, I have expertise in cloud platforms like **Azure** and **AWS**, and a solid background in microservices architecture and CI/CD automation, ensuring compliance with standards like HIPAA and PCI DSS. I am passionate about integrating advanced technologies, implementing AI/ML capabilities, and developing efficient ML pipelines, utilizing tools such as **MLflow**, **Airflow**, and **Kubeflow**.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior SAP Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Conducted **configuration** and **troubleshooting** for SAP modules, ensuring effective integration with UK Payroll systems to meet regulatory requirements.\n- Executed **root-cause analysis** for issues within SAP environments, identifying and resolving **9** critical pain points that improved system reliability.\n- Spearheaded **process improvement** initiatives resulting in a **15%** increase in payroll processing efficiency through enhanced SAP functionalities.\n- Demonstrated strong **analytical skills** by analyzing payroll data and system processes to ensure compliance with UK regulations and improve accuracy.\n- Fostered **communication** and **team collaboration** across cross-functional teams to facilitate best practices in SAP configurations and troubleshooting methodologies.\n- Delivered training sessions for team members on **SAP** best practices, enhancing knowledge sharing and technical capabilities across the team.\n- Contributed to documentation for system enhancements ensuring clear communication and continuity for team members and stakeholders, achieving a **100%** improvement in documentation accuracy.\n- Assisted in data migration projects, leveraging analytical skills to ensure **99%** data integrity during the transfer process.\n- Participated in system audits and assessments, providing recommendations for **process improvement** strategies to enhance system performance."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Utilized **SAP** for troubleshooting and configuration of financial platforms, leading to improved process efficiency by **30%**.\nConducted root-cause analysis to identify system issues related to UK Payroll operations, enhancing payroll processing accuracy by **25%**.\nImplemented process improvements that streamlined onboarding procedures for new employees, reducing the overall time by **15%**.\nCollaborated with cross-functional teams to enhance system capabilities and ensure seamless integration of payroll systems with existing architecture, fostering effective team collaboration.\nEngaged in regular communication with stakeholders to relay system updates and gather feedback, thus improving transparency and project alignment.\nApplied analytical skills to assess payroll data discrepancies and recommend actionable solutions to enhance system reliability and user satisfaction."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "- Utilized strong **analytical skills** to troubleshoot and resolve configuration issues within the **SAP** environment, ensuring smooth payroll processes and adherence to UK regulations.\n- Conducted **root-cause analysis** to identify and rectify critical payroll discrepancies, enhancing system reliability for a user base of over **5,000 employees**.\n- Developed and implemented process improvements that increased payroll processing efficiency by **20%**, streamlining workflows and reducing overall processing time.\n- Collaborated effectively within cross-functional teams, leveraging exceptional **communication** and **team collaboration** skills to deliver solutions that meet business requirements.\n- Managed system configurations for **SAP Payroll** modules, ensuring compliance with UK legislation and timely updates on regulatory changes.\n- Engaged in regular audits and compliance checks, leading to a **30% reduction** in payroll-related errors and improved accuracy in reporting.\n- Provided guidance and training for junior staff members on best practices and troubleshooting techniques, fostering a knowledge-sharing environment and team growth.\n- Facilitated discussions and meetings to gather requirements for system enhancements, ensuring that stakeholder input drove **process improvement** initiatives."
    }
  ],
  "skills": "**Programming Languages:**\n\tPython, JavaScript, TypeScript\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tJWT, OAuth2\n\n**Serverless and Cloud Functions:**\n\tAWS (Lambda), Azure (App Services)\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS (ECS, RDS, S3), Azure (Blob, SQL), Nginx, Certbot\n\n**Other:**\n\tSAP, UK Payroll, troubleshooting, configuration, root-cause analysis, process improvement, analytical skills, communication, team collaboration",
  "apply_company": "Support Revolution"
}