{
  "name": "Tomasz Lee",
  "role_name": "Linux Operations Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Dedicated Linux Operations Engineer with 9+ years of experience in automating and optimizing performance across various platforms. Proficient in managing **Linux**, **Docker**, and orchestrating applications with **Kubernetes**. Experienced in using **Ansible** for configuration management and **Bash** for scripting. Familiar with monitoring tools like **Prometheus** and **Grafana**, along with logging solutions such as **ELK** and **OpenSearch**. Skilled in incident management, change management, and problem management, ensuring seamless operations in dynamic environments. Proven ability to collaborate across teams and lead projects to successful outcomes, alongside strong knowledge in **PostgreSQL** and version control systems like **Git**, **GitLab**, and **GitHub**. Adept at documentation, leveraging **ITIL** frameworks, and utilizing **Networking** principles to enhance operational efficiency.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Linux Operations Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Leveraged **Linux** and **Bash** scripting to develop and maintain robust automation solutions, enhancing operational efficiency by **30%**.\nImplemented **Ansible** for configuration management, enabling rapid deployment of environments and reducing setup time by **50%**.\nUtilized **Docker** to containerize applications, facilitating smooth development-to-production transitions and ensuring environment consistency.\nManaged production workloads using **Kubernetes**, orchestrating microservices and ensuring high availability and reliability across clusters.\nDeveloped monitoring solutions with **Prometheus** and **Grafana**, improving system observability and reducing incident resolution time by **40%**.\nEmployed **ELK** and **OpenSearch** for log aggregation and analysis, enabling proactive issue detection and troubleshooting.\nExecuted backup and recovery procedures, utilizing **PostgreSQL** to ensure data integrity and availability, achieving a **99.9%** uptime.\nCollaborated in a **GitOps** environment using **Git**, **GitHub**, and **GitLab** for version control, promoting effective collaboration among development and operations teams.\nAdhered to ITIL frameworks in incident, problem, and change management, contributing to streamlined operational processes and improved service delivery.\nCreated detailed documentation for automation processes and system configurations to facilitate knowledge transfer and onboarding of new team members."
    },
    {
      "role": "Full Stack Developer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "Utilized **Linux** environments to design and develop a cloud-based project management tool using **Angular** and **.NET Core**, achieving a **15%** increase in team collaboration efficiency.\nImplemented **Kubernetes** for container orchestration alongside **Docker**, optimizing the deployment of multiple services in the project.\nDeveloped a **CI/CD** pipeline using **GitHub Actions**, reducing production deployment errors by **30%** and enhancing deployment frequency.\nAutomated infrastructure management with **Ansible**, streamlining configurations and deployments for development teams.\nCreated RESTful APIs and integrated them with a **PostgreSQL** database for real-time data access, ensuring database security and performance.\nEnhanced application scalability by creating a microservices architecture with **RabbitMQ** and **Apache Kafka**, providing efficient task orchestration and event handling.\nEmployed **Prometheus** and **Grafana** for monitoring system performance metrics, resulting in a **25%** boost in system performance.\nManaged **MSSQL** and **MySQL** databases, optimizing queries for better performance, and performed **Bash** scripting for automation.\nCollaborated closely with stakeholders to outline system requirements and ensure on-time project delivery with thorough **documentation** practices.\nConducted code reviews and mentorships for junior developers, improving team capabilities and productivity through knowledge sharing."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "- Managed and maintained **Linux** systems ensuring optimal performance and reliability, leveraging **Kubernetes** for container orchestration.\n- Implemented **Ansible** for automating configuration management, streamlining the installation processes by **30%**.\n- Developed and deployed monitoring and logging solutions using **Prometheus** and **Grafana**, achieving a **15%** reduction in downtime incidents.\n- Utilized **Docker** for creating reproducible environments, enhancing development efficiency and consistency across teams.\n- Wrote and optimized **Python** scripts to automate operational tasks, reducing manual effort by **25%**.\n- Collaborated with cross-functional teams to implement **GitOps** practices for continuous deployment, increasing integration speed by **40%**.\n- Managed incident and problem management processes, ensuring timely resolution of issues and minimizing impact to operations.\n- Provided technical support and documentation for ITIL processes, ensuring compliance with best practices and standards.\n- Developed monitoring metrics and dashboards using **ELK** and **OpenSearch**, improving visibility into system health and performance.\n- Engaged in regular code reviews and standups to promote collaboration and maintain coding standards across the operation team.\n- Conducted training sessions on **Bash** scripting and **Networking** fundamentals, enhancing team skillsets and knowledge retention."
    }
  ],
  "skills": "  **Programming Languages**\n\tPython, JavaScript, TypeScript\n\n  **Backend Frameworks**\n\tNodeJS, ExpressJS, NestJS, C#, .NET, Entity Framework, Microservices\n\n  **Frontend Frameworks**\n\tHTML, CSS, ReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n  **API Technologies**\n\tRESTful API, GraphQL\n\n  **Serverless and Cloud Functions**\n\t\n\n  **Databases**\n\tMSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB\n\n  **DevOps**\n\tAWS, Azure, CI/CD pipelines, Docker, Ansible, Kubernetes, GitOps, Incident Management, Problem Management, Change Management\n\n  **Cloud & Infrastructure**\n\tLinux, SLURM, Bash, PXE, Kickstart, MUNGE, Networking, ITIL\n\n  **Other**\n\tUX/UI Design, Git, GitLab, Prometheus, Grafana, ELK, OpenSearch, LDAP, Active Directory, RabbitMQ, Apache Kafka, Redis, Testing Tools: NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest, Blockchain: Solidity, Ether.js, Web3.js, Ethereum, Collaboration, Documentation"
}