{
  "name": "Tomasz Lee",
  "role_name": "Senior Field Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Results-driven Senior Field Engineer with a strong background in **diagnostics**, **problem solving**, and **remote service**. Bringing over 9 years of experience in **electro-engineering**, specializing in the installation and maintenance of healthcare systems. Proficient in ensuring adherence to **regulatory standards** and executing preventative maintenance strategies. Leveraging technical expertise alongside strong customer service skills to enhance client satisfaction and operational efficiency. Additionally skilled in technology solutions development with experience in **.NET**, **C#**, **ReactJS**, **NextJS**, and cloud services, successfully implementing robust applications and streamlining processes across diverse developmental environments.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Senior Field Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Utilized problem-solving skills to perform **remote service** and **installation** of advanced **healthcare systems**, ensuring compliance with regulatory standards.\nLed **preventative maintenance** initiatives, improving system reliability by **30%** through effective diagnostics and issue resolution.\nProvided **customer service** support by addressing complex **network diagnosis** issues, increasing client satisfaction ratings by **20%**.\nLeveraged expertise in **electro-engineering** to implement robust diagnostic tools that enhanced system performance, resulting in a **15%** reduction in downtime.\nExecuted troubleshooting processes for imaging systems, using technical skills to solve **3 major** operational challenges in the field.\nCollaborated with cross-functional teams to ensure alignment on project deliverables and implementation strategies, demonstrating strong teamwork and communication skills.\nCreated training materials and conducted workshops to educate staff on new technologies, leading to a **25%** increase in operational efficiency.\nMonitored compliance with healthcare regulations, ensuring systems adhered to standards and protocols for patient data security."
    },
    {
      "role": "Software Engineer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "• Conducted comprehensive imaging diagnostics to ensure optimal performance and functionality of healthcare systems, adhering to regulatory standards.\n• Utilized electro-engineering principles to troubleshoot network diagnosis issues, resolving problems effectively to enhance system reliability.\n• Provided remote service support for healthcare systems, improving customer service satisfaction ratings by 20%.\n• Executed preventative maintenance protocols, resulting in a **30%** reduction in system downtimes.\n• Installed and configured complex medical equipment, ensuring compliance with safety and operational guidelines.\n• Developed problem-solving strategies for rapid resolution of technical issues in field installations, reducing service call duration by **15%**.\n• Collaborated with healthcare professionals to assess system requirements and streamline installation processes for new technologies.\n• Conducted training sessions for staff on new diagnostics tools, enhancing overall team competence and effectiveness.\n• Managed service documentation and compliance checks to uphold high standards of operational integrity.\n• Maintained detailed records of installations and service calls, aiding in the analysis of performance metrics and service improvements."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "• Managed and executed **installation** and **preventative maintenance** for diagnostic imaging systems, ensuring compliance with regulatory standards and enhancing system reliability.\n• Provided exceptional **customer service** and technical support, resolving **network diagnosis** issues promptly, and improving customer satisfaction ratings by **30%**.\n• Utilized strong **problem-solving** skills to troubleshoot and diagnose electro-engineering issues in various healthcare systems.\n• Collaborated with cross-functional teams to implement remote service solutions, reducing onsite visits by **40%** and improving service efficiency.\n• Conducted comprehensive diagnostics and inspections on imaging equipment, adhering to strict **healthcare systems** protocols and ensuring optimal functionality.\n• Trained and supported staff on the use and maintenance of advanced imaging technology, leading to a **25%** reduction in operational mishaps.\n• Developed and enforced **preventative maintenance** schedules, resulting in a **15%** increase in system uptime across all serviced units.\n• Documented technical processes and service reports, enhancing knowledge transfer and **imaging** practices across the engineering team."
    }
  ],
  "skills": "**Programming Languages**\n\tPython, JavaScript, TypeScript\n\n**Frontend Frameworks**\n\tReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n**Backend Frameworks**\n\tNodeJS, ExpressJS, NestJS, C#, .NET, Entity Framework, Microservices\n\n**API Technologies**\n\tRESTful API, GraphQL\n\n**Databases**\n\tMSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB\n\n**DevOps**\n\tAWS, Azure, CI/CD pipelines\n\n**Cloud & Infrastructure**\n\tCloud services\n\n**Other**\n\tUX/UI Design, Git, GitHub, Blockchain: Solidity, Ether.js, Web3.js, Ethereum, Messaging & Caching: Apache Kafka, RabbitMQ, Redis, Testing Tools: NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest, Imaging, Diagnostics, Electro-engineering, Network diagnosis, Remote service, Problem solving, Customer service, Preventative maintenance, Installation, Healthcare systems, Regulatory standards",
  "apply_company": "Philips"
}