{
  "name": "Rei Taro",
  "role_name": "Senior Backend Developer",
  "email": "rei515@outlook.com",
  "phone": "+48732529451",
  "address": "Warszawa, Poland",
  "linkedin": "https://www.linkedin.com/in/rei-taro-28639a395/",
  "profile_summary": "Results-oriented Senior Backend Developer with over 10 years of experience in building scalable and high-performance backend systems, specializing in financial platforms and data processing. Proficient in **Java 17**, **Dropwizard**, **Restler**, **MongoDB**, **ClickHouse**, **Redis**, **Apache Kafka**, **Kafka Streams**, **Elasticsearch**, **OpenSearch**, and **Airflow**. Expertise in CI/CD and test-driven development ensures robust and efficient code delivery. Strong problem-solving and analytical skills complement a proven ability to collaborate effectively as a team player. Adept at leveraging cloud infrastructure to create automation tools and enhance operational efficiency, with a successful background contributing to notable projects at organizations like VISA, Sii Poland, and Reply Polska.",
  "education": [
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2010",
      "to_year": "2015",
      "location": "Japan",
      "university": "Keio University"
    }
  ],
  "experience": [
    {
      "role": "Senior Backend Developer",
      "company": "Leobit",
      "from_date": "Aug 2022",
      "to_date": "Present",
      "location": "Poland",
      "responsibilities": "Engineered backend services in **Java 17** using **Dropwizard** to streamline document automation, user onboarding, and reporting workflows.\nDeveloped event-driven solutions with **Apache Kafka** and **Redis** to manage asynchronous processing for financial transaction requests.\nDeployed microservices on **Cloud infrastructure** using **CI/CD** practices, ensuring seamless deployment and management of applications across environments.\nCreated and maintained data pipelines for regulatory data exchange with **Apache Airflow**, ensuring timely and accurate data flow with **99%** on-time delivery.\nIntegrated **Test Driven Development** (TDD) methodologies to enhance code quality and reliability, achieving a **95%** test coverage.\nLed security assessments and integrated **OAuth2** for secure, scalable authentication systems, improving security compliance by **30%**.\nCollaborated with cross-functional teams to address system integration challenges, ensuring compliance and effective release strategies, contributing to a **20%** reduction in downtime."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Innovature",
      "from_date": "Nov 2018",
      "to_date": "Jun 2022",
      "location": "Japan",
      "responsibilities": "Designed and developed robust backend systems using **Java 17** and **Dropwizard** to enhance system performance and reliability, achieving a **30% increase** in response times for API calls.\nImplemented RESTful APIs with **MongoDB** as the database layer, ensuring efficient data retrieval and storage, which led to a **25% reduction** in data query times.\nCreated and managed microservices architecture integrating **Kafka** and **Redis** for real-time data processing and caching, which improved transaction response efficiency by **40%**.\nConfigured CI/CD pipelines with **Airflow** for automated deployment and testing processes, reducing the deployment cycle by **50%** and increasing team productivity.\nApplied test-driven development (TDD) practices to ensure high code quality and optimal performance, resulting in lower defect rates in production.\nUtilized **ClickHouse** for analytical processing of large datasets, providing insights that enhanced decision-making and reporting capabilities.\nActively engaged in problem-solving sessions and collaborated with other teams to establish best practices in cloud infrastructure management, utilizing **Azure** services and tools for infrastructure optimization.\nDemonstrated strong communication skills to liaise effectively with stakeholders and team members, fostering a collaborative environment for project success."
    },
    {
      "role": "Software Developer",
      "company": "Wizcorp",
      "from_date": "Apr 2015",
      "to_date": "Nov 2018",
      "location": "Japan",
      "responsibilities": "• Developed backend services for trade execution, portfolio management, and account tracking leveraging **Java 17**, **Dropwizard**, and **MongoDB** to optimize trading operations.\n• Engineered real-time data processing systems utilizing **Apache Kafka**, **Kafka Streams**, and **Redis** to provide instant trading information for high-frequency transactions.\n• Collaborated with frontend teams to deliver seamless data through **REST APIs** and enhanced communication channels, ensuring a responsive user experience on the platform.\n• Ensured compliance with regulatory standards, including MiFID II and GDPR, while maintaining high internal data security protocols and risk management practices.\n• Implemented robust testing frameworks using **Test Driven Development (TDD)** principles with **JUnit** and **Mockito**, resulting in a **40%** reduction in bug rates and improved QA processes.\n• Introduced job scheduling and automation solutions with **Airflow** and **Celery**, streamlining backend task execution and enhancing process efficiency by **25%**.\n• Optimized data storage and retrieval processes with **ClickHouse** and **Elasticsearch**, achieving a **50%** improvement in query response times and overall performance."
    }
  ],
  "skills": "**Programming Languages**\n\tJava 17, Python (3.8+), SQL, Bash, JavaScript\n\n**Backend Frameworks**\n\tFastAPI, Flask, Django, Celery, Dropwizard, Restler\n\n**Frontend Frameworks**\n\t\n\n**API Technologies**\n\tREST/gRPC APIs, Microservices\n\n**Serverless and Cloud Functions**\n\tAWS (EC2, S3, Lambda), Azure, Docker, Kubernetes, Azure DevOps\n\n**Databases**\n\tPostgreSQL, MySQL, MongoDB, Redis, ClickHouse\n\n**DevOps**\n\tGitHub Actions, CI/CD, Automation\n\n**Cloud & Infrastructure**\n\tCloud infrastructure\n\n**Other**\n\tApache Kafka, Kafka Streams, Elasticsearch, OpenSearch, Airflow, MLflow, Pandas, NumPy, scikit-learn, Test driven development, Data processing, Problem-solving, Analytical skills, Communication skills, Team player"
}