{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior .Net Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "As a highly skilled Senior .NET Engineer with 8 years of experience, I excel in leveraging **.NET**, **C#**, **ASP.NET**, and **SQL Server** to build high-performance and secure applications. My technical expertise extends to web services and data integration utilizing **XML** and **T-SQL**, ensuring robust solutions that meet industry standards. I bring a proven ability to work with major platforms like **Salesforce**, **PeopleSoft**, **SAP**, **Oracle**, and **Siebel**, enhancing system interoperability and data alignment.\n\nWith a strong foundation in **JavaScript**, I have a track record of developing user-friendly interfaces, and my communication skills enable effective collaboration with cross-functional teams to solve complex technical problems. I have successfully led projects that leverage cloud solutions for scalability and deployment, driving operational efficiency and compliance with regulations. My capacity to guide teams and stakeholders through the development lifecycle is complemented by my passion for continuous improvement and innovation in tech.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior .Net Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Utilized **.NET** framework and **C#** to architect and develop robust financial and healthcare platforms, ensuring smooth performance and security in compliance with local regulations and industry standards.\nLeveraged **SQL Server** for designing and managing relational databases, optimizing data storage and retrieval for large-scale applications.\nImplemented **Web services** using **ASP.Net** and **T-SQL** for data exchanges and functionality enhancement across different modules.\nDeveloped interactive front-end components using JavaScript, HTML, and **XML**, enhancing user experience and interface functionality across applications.\nEmployed technical problem-solving skills to troubleshoot issues in application performance and integration, leading to a **30% reduction** in system downtime.\nCollaborated effectively with cross-functional teams to gather requirements and translate them into technical specifications, ensuring project alignment and timely deliverables.\nIntegrated third-party services like **Salesforce**, **PeopleSoft**, and **SAP**, allowing seamless communication and enhancing the overall ecosystem.\nExecuted unit tests and utilized automated testing tools to ensure the reliability and effectiveness of the solutions delivered.\nDesigned and implemented advanced user authentication and authorization features using **SAML**, enhancing security protocols within applications.\nParticipated in code reviews and maintained best practices in coding standards, contributing to a **15% improvement** in application performance through optimized code efficiency.\nFostered strong communication skills within teams, simplifying the technical problem-solving process and ensuring clarity in project objectives and deliverables."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Utilized **.NET** framework and **C#** to build and enhance applications within financial systems, ensuring compatibility with existing platforms and fostering seamless data integration.\nDeveloped web services using **ASP.Net** and **XML**, focusing on robust data handling and effective communication between applications in high-volume transaction scenarios.\nDesigned and implemented SQL queries utilizing **SQL Server** and **T-SQL** to streamline data retrieval and reporting processes, improving performance by **30%** in transaction processing.\nCollaborated with cross-functional teams to integrate **Salesforce**, **PeopleSoft**, and **SAP** solutions, enhancing overall system interoperability and data accuracy.\nApplied strong technical problem solving to troubleshoot and optimize legacy applications, reducing downtime by **25%** by refining existing codebases and addressing performance bottlenecks.\nEngaged in effective communication with stakeholders to gather requirements and translate functional needs into technical specifications, ensuring project alignment with business objectives.\nLeveraged **JavaScript**, **HTML**, and React (18) to develop user interfaces, enhancing user experience with modern design principles and responsive layouts.\nImplemented secure communication protocols like **SAML** to protect sensitive customer data across web services and applications.\nFacilitated enterprise application integration (EAI) solutions to synchronize data across disparate systems such as **Oracle** and **Siebel**, ensuring consistency and reliability of information handling."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Utilized **.NET** and **C#** to develop and maintain scalable backend services, ensuring optimal performance across multiple applications and services within the e-commerce platform.\nImplemented web services architecture using **ASP.Net** for efficient data exchange and driving integration with third-party systems like **Salesforce** and **SAP**.\nDesigned and executed complex SQL queries using **T-SQL** and **SQL Server** to handle high-volume transactional data efficiently, achieving a **99.9%** uptime in data processing applications.\nDeveloped interactive user interfaces employing **JavaScript**, **HTML5**, and **XML** while ensuring cross-browser compatibility and adherence to best practices in web design and development.\nLeveraged advanced technical problem-solving skills to optimize system performance and troubleshoot issues, reducing response times by **30%** through effective debugging and refactoring strategies.\nCollaborated with cross-functional teams, enhancing communication skills to effectively convey and gather requirements, driving project success within defined timelines.\nApplied security principles, including **SAML** and role-based access control (RBAC), to safeguard user data and ensure compliance with industry standards such as GDPR throughout the development lifecycle.\nEngaged with enterprise applications like **PeopleSoft** and **Oracle**, integrating them seamlessly to support business operations and enhance data availability across the platform.\nConducted performance tuning and optimization of existing applications, resulting in an improved load time of **40%** for critical user-facing services."
    }
  ],
  "skills": " **Programming Languages:**\n\tC#, JavaScript/TypeScript, Python\n\n **Backend Frameworks:**\n\tASP.Net, FastAPI, Flask, Django\n\n **Frontend Frameworks:**\n\tReact, Vue, Angular, HTML\n\n **API Technologies:**\n\tWeb services, XML, SAML\n\n **Serverless and Cloud Functions:**\n\tAWS (Lambda), Azure\n\n **Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis, SQL Server, Oracle\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:**\n\tAWS (ECS, RDS, S3), Azure (App Services, Blob, SQL)\n\n **Other:**\n\tMLflow, Airflow, Kubeflow, technical problem solving, communication skills, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, Salesforce, PeopleSoft, SAP, Siebel, EAI",
  "apply_company": "Cornerstone OnDemand"
}