{
  "name": "Patryk Zaslawski",
  "role_name": "Senior Software Engineer",
  "email": "patrykzas0428@outlook.com",
  "phone": "+48669862402",
  "address": "Gdanski, Poland",
  "linkedin": "https://www.linkedin.com/in/patryk-zaslawski-6b04a8397/",
  "profile_summary": "As a Senior Software Engineer with 8+ years of experience in software development, I excel in building high-performance applications using **Node.js**, **GraphQL**, and **AWS**. My strong expertise in database management with **PostgreSQL** complements my solid foundation in Test-Driven Development (TDD) ensuring reliability and maintainability in projects. I possess excellent analytical skills and problem-solving abilities, which I leverage to collaborate effectively with cross-functional teams. Additionally, I have a proven track record in designing and delivering solutions across e-commerce, financial, and healthcare sectors, specializing in modern, secure architectures and optimized systems.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2014",
      "to_year": "2017",
      "location": "United Kingdom",
      "university": "The University of Manchester"
    }
  ],
  "experience": [
    {
      "role": "Senior Software Engineer",
      "company": "Binary Studio",
      "from_date": "Aug 2023",
      "to_date": "Present",
      "location": "United Kingdom (Remote)",
      "responsibilities": "• Developed and maintained scalable applications using **Node.js** and **GraphQL** for efficient data exchange and improved API performance.\n• Engineered robust database solutions with **PostgreSQL**, ensuring high availability and optimized performance through indexing and partition strategies.\n• Spearheaded Test-Driven Development (TDD) practices, creating comprehensive test suites to ensure code reliability and facilitate smoother deployment processes.\n• Collaborated closely with cross-functional teams to identify and resolve complex technical problems, leveraging strong analytical skills and innovative problem-solving techniques.\n• Designed and implemented RESTful APIs, enhancing the integration of back-end services while ensuring adherence to security best practices.\n• Contributed to cloud-native architecture strategies using **AWS**, optimizing resource utilization and enabling seamless horizontal scaling.\n• Delivered high-quality software solutions as part of a team of 10+, fostering a collaborative environment to drive project success and efficiency.\n• Led architectural reviews, guiding teams through effective system design while mentoring junior engineers in best practices and modern frameworks.\n• Established CI/CD methodologies, leveraging automation and tools to ensure continuous integration, testing, and deployment across all codebases.\n• Analyzed and optimized application performance metrics, identifying bottlenecks and utilizing advanced debugging techniques to enhance overall system efficiency.\n• Championed the integration of monitoring solutions, enabling proactive detection of issues and minimizing downtime across deployed applications."
    },
    {
      "role": "Software Engineer",
      "company": "Ardigen",
      "from_date": "Mar 2020",
      "to_date": "Aug 2023",
      "location": "Poland",
      "responsibilities": "• Developed and maintained microservices applications using **Node.js** and **PostgreSQL**, ensuring adherence to best practices and scalability metrics.\n• Designed and implemented **GraphQL** APIs for effective data querying, leading to a **40%** reduction in response time and improved client-side performance.\n• Leveraged **AWS** services to enhance application deployment and reliability, resulting in a **30% increase** in system uptime.\n• Applied Test-Driven Development (TDD) principles to ensure code reliability and maintainability, achieving **95%** test coverage across critical systems.\n• Collaborated with cross-functional teams to solve complex problems and deliver high-quality software solutions, resulting in reduced development time by **25%**.\n• Conducted code reviews and mentored junior developers, fostering a culture of continuous improvement and collaboration within the team.\n• Analyzed application performance and user feedback to implement enhancements that improved user engagement by **20%**.\n• Integrated CI/CD pipelines using **GitHub Actions** for automated deployment, increasing deployment frequency by **50%**.\n• Utilized **AWS** for infrastructure management, contributing to a cost-effective and scalable solution for cloud-based applications.\n• Implemented logging and monitoring solutions with tools like **ELK Stack** to ensure application health and quick troubleshooting capabilities."
    },
    {
      "role": "Software Engineer",
      "company": "Altum Software",
      "from_date": "Oct 2017",
      "to_date": "Feb 2020",
      "location": "United Kingdom",
      "responsibilities": "Utilized **Node.js** and **GraphQL** for building scalable backend services, improving transaction processing efficiency by **30%** in high-traffic scenarios.\nDesigned and optimized relational databases with **PostgreSQL**, ensuring rapid data retrieval with a **25%** reduction in query response times through advanced indexing techniques.\nApplied **Test-Driven Development (TDD)** principles in Node.js applications, resulting in a **40%** decrease in bugs post-deployment and increased maintainability of the codebase.\nCollaborated with cross-functional teams to deliver features on time, demonstrating strong **analytical skills** to identify requirements and **problem-solving** capabilities for complex challenges.\nDeveloped comprehensive testing strategies to enhance code reliability and performance, leveraging modern CI/CD tools for streamlined deployments.\nArchitected robust API services and real-time data interactions to ensure seamless user experiences, utilizing best practices within the **AWS** ecosystem for cloud functionalities.\nIntegrated multiple third-party services and tools to enrich application features, while maintaining modular and reusable code structures for future developments.\nConducted performance testing for backend systems with both load and stress testing methodologies, ensuring application resilience under various traffic conditions.\nEnhanced communication protocols between services to foster better collaboration and data consistency across the system architecture.\nParticipated in design reviews to contribute insights and improvements based on data-driven analysis, promoting continuous improvement in software development practices."
    }
  ],
  "skills": " \n\n**Programming Languages:**\n\tPython, Node.js\n\n**Backend Frameworks:**\n\tFastAPI, Django, Flask, Spring Boot\n\n**Frontend Frameworks:**\n\tAngular (1–16), React (15–18), Next.js, Vue.js (2/3), Blazor\n\n**API Technologies:**\n\tREST & gRPC APIs, GraphQL\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD\n\n**Cloud & Infrastructure:**\n\tNginx, Certbot, Let’s Encrypt\n\n**Other:**\n\tSQLAlchemy, Pydantic, Celery, Keycloak (OIDC, RBAC), JWT, OAuth2, Analytical Skills, Problem Solving, Collaboration, Test-Driven Development"
}