{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Fullstack Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Senior Fullstack Engineer with 13+ years of experience in delivering high-performance applications, particularly focusing on **Python**, **FastAPI**, **TypeScript**, **Vue.js**, and **React**. Proficient in database management using **SQL** and **PostgreSQL**, and adept in leveraging LLM APIs and prompt engineering for enhanced application functionality. \nSkilled in both frontend and backend development, contributing to the successful deployment of cloud-native systems on **AWS** and **Azure**. Experienced in implementing microservices and event-driven architectures, ensuring high reliability and performance in complex applications. Strong commitment to compliance-driven development, aligning with industry standards such as HIPAA and PCI DSS. Background in building AI/ML-powered platforms supports automation and real-time processing, alongside a solid foundation in MLOps practices.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Fullstack Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Developed full-stack applications using **Python** (FastAPI), **TypeScript**, and **React** (17–18), ensuring high-quality deliverables and compliance with industry standards.\n- Implemented robust database solutions with **PostgreSQL** and efficient querying using SQL to enhance data management and accessibility.\n- Leveraged **Vue.js** and **React** for dynamic and responsive user interfaces, enhancing user experience across various platforms.\n- Designed and maintained RESTful APIs to support integration with **LLM APIs**, facilitating advanced functionalities like natural language processing.\n- Collaborated with cross-functional teams to define and implement prompt engineering strategies that improve application performance and user engagement.\n- Conducted thorough unit and integration testing, utilizing testing frameworks to ensure reliability and performance of the applications.\n- Optimized application performance by applying best practices in code quality and deploying updates in agile sprints.\n- Mentored junior engineers in best practices of software development and application architecture.\n- Contributed to architectural decisions and participated in code reviews, enhancing team productivity and code quality, resulting in a **30%** reduction in bugs post-launch.\n- Managed deployments and CI/CD processes to streamline workflow and reduce time to production by **20%**."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "• Developed and maintained applications using **Python** and **FastAPI** to ensure efficient back-end functionality in line with business requirements.\n• Designed and implemented front-end solutions with **React** (v18) and **TypeScript** to create intuitive user experiences for financial technology platforms.\n• Collaborated in building applications utilizing **Vue.js** for enhanced client-side interactivity and efficient state management.\n• Optimized and managed relational databases with **PostgreSQL**, ensuring high availability and performance for transaction-heavy applications.\n• Applied advanced data handling techniques through **SQL** for effective data retrieval and manipulation to support analytical needs.\n• Participated in prompt engineering and integration of **LLM APIs** to enhance process automation and decision support systems.\n• Delivered modern, responsive web applications that improved user interaction and reduced load times by **30%**.\n• Implemented CI/CD practices for seamless deployment, resulting in a **20%** reduction in downtime during application updates.\n• Contributed to system architecture discussions, providing insights on scalability and performance improvements based on **microservices** approach."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Leveraged **Python** with frameworks such as **FastAPI** to design and optimize backend services for a global e-commerce platform, ensuring high availability, low latency, and scalability across key modules like checkout, cart, and order fulfillment.\nDeveloped responsive frontend applications using **React** (18), **Vue.js** (3), and **TypeScript**, delivering fast user experiences on both web and mobile platforms, while maintaining SEO-friendly architecture.\nUtilized **PostgreSQL** as the primary SQL database and enforced data integrity across the platform through effective schema design and query optimization.\nEngineered real-time features using WebSockets, enhancing operational efficiency  by ensuring dynamic inventory tracking and responsive order updates with up to **200%** faster feedback loops.\nCreated and integrated AI-driven recommendation systems leveraging **LLM APIs**, significantly improving search relevance and boosting conversion rates by **30%** based on real-time behavioral data.\nImplemented robust authentication and authorization protocols using OAuth 2.0 for secure customer access, ensuring compliance with GDPR regulations.\nApplied modern frontend technologies such as **Tailwind CSS** for styling and **Redux Toolkit** for state management, leading to a reduction in page load times by **40%** across applications.\nExecuted feature flags and blue-green deployment strategies through **Kubernetes** and **LaunchDarkly**, allowing for controlled rollouts and A/B testing frameworks, ensuring minimal user disruption during updates.\nEmployed role-based access control (RBAC) to guarantee user data privacy and maintain compliance against the latest security standards, while optimizing backend services to handle **up to 10,000** concurrent users during peak traffic.\n"
    }
  ],
  "skills": "**Programming Languages:**\n\tPython, TypeScript\n\n**Backend Frameworks:**\n\tFastAPI\n\n**Frontend Frameworks:**\n\tVue.js, React\n\n**API Technologies:**\n\tLLM APIs, prompt engineering\n\n**Databases:**\n\tPostgreSQL, SQL\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS: ECS, Lambda, RDS, S3, Azure: App Services, Blob Storage, SQL Database\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), OAuth2, JWT, Nginx, Let’s Encrypt, Certbot, MySQL, MongoDB, Redis",
  "apply_company": "Braintrust"
}