{
  "name": "Mariusz Jan Skobel",
  "role_name": "Senior Multimedia Engineer",
  "email": "mariuszskobel15@outlook.com",
  "phone": "+48 735 343 548",
  "address": "Katowice, Poland",
  "linkedin": "https://www.linkedin.com/in/mariusz-skobel-927764397/",
  "profile_summary": "Senior Multimedia Engineer with over 10 years of experience delivering high-performance software solutions, specializing in **C**, **C++**, and **Python**. Proven expertise in multimedia technologies including **GStreamer**, **FFmpeg**, and various **video and audio codecs**, alongside strong proficiency in **DASH**, **HLS**, and **WebRTC** protocols. Equipped with a profound understanding of **Linux**, **Windows**, and **OS X** environments, and skilled in debugging, testing, and employing build systems like **autotools**, **meson**, **CMake**, **Visual Studio**, and **XCode**. Adept at problem-solving and communication, with a commitment to creating efficient, maintainable software that contributes to robust multimedia applications.\nFurther complemented by hands-on experience in cloud-native application development, leading the architecture of scalable systems, and enhancing operational workflows with automation tools such as **CI/CD** methodologies. Passionate about leveraging technology to deliver impactful multimedia solutions.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2012",
      "to_year": "2015",
      "location": "UK",
      "university": "University of Bristol"
    }
  ],
  "experience": [
    {
      "role": "Senior Multimedia Engineer",
      "company": "EitBiz",
      "from_date": "Oct 2022",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Developed and maintained multimedia processing applications using **C**, **C++**, and **Python**, ensuring compatibility across **Linux**, **Windows**, and **OS X** systems.\n• Implemented advanced **video** and **audio codecs** leveraging **GStreamer** and **FFmpeg** to enhance multimedia quality and performance in applications.\n• Designed and deployed adaptive streaming solutions utilizing **DASH** and **HLS**, facilitating seamless media delivery across diverse platforms.\n• Integrated **WebRTC** for real-time communication features, enhancing interaction within multimedia applications.\n• Conducted extensive debugging and testing, employing best practices to ensure software reliability and performance metrics meeting a target of **99.9% uptime**.\n• Optimized cross-platform applications by employing build systems such as **autotools**, **meson**, and **CMake**, reducing build times by up to **40%**.\n• Utilized **Visual Studio** and **XCode** for efficient application development and debugging processes.\n• Collaborated with cross-functional teams to troubleshoot and resolve complex problems, leveraging strong **communication** and **problem-solving** skills.\n• Created comprehensive documentation and test strategies, using testing frameworks to achieve high-quality standards in both software and multimedia output.\n• Deployed automated test scripts across CI/CD pipelines, achieving a reduction in deployment failures by **25%**."
    },
    {
      "role": "Software Engineer",
      "company": "Tvn S.A.",
      "from_date": "Oct 2019",
      "to_date": "Sep 2022",
      "location": "Poland",
      "responsibilities": "Applied strong **Python** skills to develop and modernize multimedia applications, ensuring robust functionality within Linux, Windows, and OS X environments.\nUtilized **C** and **C++** for performance-critical components, enhancing efficiency by up to **30%** through optimized coding practices and use of advanced video codecs.\nImplemented **GStreamer** and **FFmpeg** for multimedia processing, achieving lower latency and improved output quality for real-time applications.\nLed debugging and testing efforts across multiple platforms, improving defect resolution times by **40%** through rigorous troubleshooting and problem-solving approaches.\nEmployed **DASH** and **HLS** standards for adaptive streaming solutions, increasing user engagement by **25%** with seamless video delivery.\nOversaw the integration of **WebRTC** technology for real-time communication, enabling applications to support peer-to-peer interactions with a **99.9%** uptime.\nUtilized **autotools**, **meson**, **CMake**, and IDEs like **Visual Studio** and **XCode** for effective build and deployment processes, achieving consistent delivery with **0%** build failures over the last **6** months.\nFacilitated cross-functional communication to align multimedia project objectives, enhancing team problem-solving capabilities and improving overall project outcomes."
    },
    {
      "role": "Software Engineer",
      "company": "Timspark",
      "from_date": "Sep 2015",
      "to_date": "Aug 2019",
      "location": "UK",
      "responsibilities": "Utilized **C**, **C++**, and **Python** to design and optimize multimedia processing frameworks, enhancing efficiency and performance for audio and video codec implementations (including **GStreamer** and **FFmpeg**).\nEngineered high-quality multimedia streaming solutions using **DASH** and **HLS**, ensuring compatibility across diverse platforms like **Linux**, **Windows**, and **OS X** with minimal latency.\nDeveloped and tested multimedia applications leveraging advanced **video codecs** and **audio codecs**, achieving significant improvements in compression rates and playback quality.\nImplemented real-time communication features using **WebRTC**, facilitating seamless interaction and collaboration in multimedia applications.\nConducted rigorous debugging and testing processes utilizing tools such as **Visual Studio** and **XCode**, ensuring high-quality deliverables through **autotools**, **meson**, and **CMake**.\nDesigned robust problem-solving strategies for integrating advanced features into multimedia projects, resulting in refined user experiences and enhanced functionality.\nCollaborated effectively with cross-functional teams to optimize workflows, apply best practices, and improve overall project outcomes through clear and concise **communication**.\nLed projects that resulted in a 30% increase in processing speed by streamlining pipeline efficiencies and implementing state-of-the-art techniques in multimedia engineering."
    }
  ],
  "skills": " **Programming Languages:**\n\tC, C++, Python\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tJavaScript, TypeScript, React, Vue, Angular\n\n**API Technologies:**\n\tWebRTC, DASH, HLS\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tLinux, Windows, OS X\n\n**Other:**\n\tGStreamer, FFmpeg, video codecs, audio codecs, debugging, testing, autotools, meson, Visual Studio, XCode, CMake, communication, problem-solving",
  "apply_company": "Fluendo"
}