{
  "name": "Mariusz Jan Skobel",
  "role_name": "Senior Mechanical Engineer",
  "email": "mariuszskobel15@outlook.com",
  "phone": "+48 735 343 548",
  "address": "Katowice, Poland",
  "linkedin": "https://www.linkedin.com/in/mariusz-skobel-927764397/",
  "profile_summary": "Experienced Senior Mechanical Engineer with a strong focus on **mechanical design** and **capital project engineering**. Proven ability to lead cross-functional teams and provide **technical leadership** while ensuring compliance with **ISO** and **ASME standards**. Skilled in **CAD** and **CAE** technologies, emphasizing innovative **industrial automation** solutions and **strategic problem-solving**. With over 10 years of experience in delivering high-performance designs and optimizing project outcomes, I excel in managing complex projects and driving efficiency. My background in software development lends a unique perspective, enhancing collaboration between engineering and technology disciplines to create robust solutions that have a significant real-world impact.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2012",
      "to_year": "2015",
      "location": "UK",
      "university": "University of Bristol"
    }
  ],
  "experience": [
    {
      "role": "Senior Mechanical Engineer",
      "company": "EitBiz",
      "from_date": "Oct 2022",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "•\tExhibited strong **technical leadership** by overseeing the design and implementation of mechanical systems and components while ensuring compliance with **ISO** and **ASME standards**.\n•\tUtilized **CAD** tools for mechanical design, producing detailed drawings and specifications that meet project requirements while adhering to **ISO standards**.\n•\tEngineered and managed capital projects, ensuring timely delivery and alignment with strategic project goals, showcasing **strategic problem-solving** capabilities throughout the lifecycle.\n•\tCollaborated cross-functionally with design, manufacturing, and quality assurance teams to facilitate seamless project execution and optimize product performance.\n•\tConducted thorough design analysis using **CAE** software, enabling the enhancement of product reliability and cost-effectiveness for large-scale mechanical systems.\n•\tImplemented automation strategies in manufacturing processes that led to a **15% reduction** in operational costs and increased production efficiency.\n•\tMentored junior engineers and team members, fostering an environment of continual learning, skill development, and **cross-functional collaboration**.\n•\tLed troubleshooting and root cause analysis initiatives that resulted in a **25% improvement** in system reliability metrics across various projects, enhancing performance outcomes.\n•\tOrganized and executed regular design reviews to ensure adherence to established **ISO** and **ASME standards**, while promoting best practices in engineering design.\n•\tProvided technical expertise and consultation to cross-functional teams, addressing complex engineering problems and driving innovative solutions."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Tvn S.A.",
      "from_date": "Oct 2019",
      "to_date": "Sep 2022",
      "location": "Poland",
      "responsibilities": "Applied strategic problem-solving to lead capital project engineering initiatives in mechanical design, ensuring compliance with **ISO standards** and **ASME standards** for high-quality deliverables.\nUtilized **CAD** and **CAE** tools to create and refine mechanical designs, enhancing product functionality and manufacturability for projects with budgets exceeding **$1M**.\nFostered cross-functional collaboration across engineering, production, and quality assurance teams to streamline project workflows, resulting in a **20%** reduction in project timelines.\nProvided technical leadership by mentoring junior engineers and conducting design reviews, improving overall team performance and adherence to engineering best practices.\nImplemented industrial automation solutions that increased production efficiency by **30%**, using advanced technologies and methodologies to optimize manufacturing processes.\nConducted rigorous testing and analysis to ensure compliance with industry standards, enhancing product reliability and customer satisfaction scores by **15%**.\n"
    },
    {
      "role": "Software Engineer",
      "company": "Timspark",
      "from_date": "Sep 2015",
      "to_date": "Aug 2019",
      "location": "UK",
      "responsibilities": "Leveraged **CAD** and **CAE** tools to design and optimize mechanical components, ensuring compliance with **ISO standards** and **ASME standards** for a range of capital projects, resulting in a 20% increase in design efficiency.\nUtilized advanced **mechanical design** techniques to develop solutions, enhancing product performance and reducing manufacturing costs by **15%** through strategic problem-solving and innovative engineering methodologies.\nCollaborated cross-functionally with electrical and software teams to integrate industrial automation systems, streamlining project timelines by **30%** and improving overall project delivery.\nProvided technical leadership during project development stages, mentoring junior engineers and establishing best practices that improved team productivity and project quality.\nExecuted project planning and implementation strategies, achieving project milestones within the allocated budget and reducing risks through proactive assessment and management of potential challenges.\nDesigned and conducted thorough testing of prototypes using state-of-the-art tools and methodologies, leading to successful product launches that met rigorous industry standards and client specifications.\nFacilitated effective communication among stakeholders to ensure alignment on project goals, fostering a collaborative environment that enhanced problem-solving capabilities and innovation in design.\nIntegrated automation technology into existing workflows, which decreased time to market for new products by **25%**, driving competitive advantages in a rapidly evolving marketplace."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, JavaScript/TypeScript\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n **Frontend Frameworks:**\n\tReact, Vue, Angular\n\n **API Technologies:**\n\tJWT, OAuth2\n\n **Serverless and Cloud Functions:**\n\tAWS (Lambda), Azure\n\n **Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:**\n\tAWS (ECS, RDS, S3), Azure (App Services, Blob, SQL)\n\n **Other:**\n\tKeycloak (OIDC, RBAC), Let’s Encrypt, Nginx, Certbot, MLflow, Airflow, Kubeflow, mechanical design, capital project engineering, CAD, CAE, industrial automation, ISO standards, ASME standards, strategic problem-solving, cross-functional collaboration, technical leadership",
  "apply_company": "Iron Mountain"
}