{
  "name": "DANIEL HE",
  "role_name": "Senior Frontend Engineer",
  "email": "daniel.he8@outlook.com ",
  "phone": "+48 730 743 032",
  "address": "Rzeszów, Poland",
  "linkedin": "https://www.linkedin.com/in/daniel-he-a5a536397/",
  "profile_summary": "Results-driven Senior Frontend Engineer with extensive expertise in **React**, **Next.js**, **JavaScript**, and **TypeScript**, excelling in crafting responsive and user-friendly UI components. Skilled in API integration and utilizing tools such as **Postman** for effective testing and debugging. Demonstrated passion for accessibility and usability, ensuring products meet the needs of diverse users. Adaptable and highly detail-oriented, with a strong autonomy to drive projects forward. Proven track record in healthcare, eCommerce, and finance sectors, focusing on enhancing user experiences through meticulous design and a commitment to clean, efficient code.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2012",
      "to_year": "2016",
      "location": "Beijing, China ",
      "university": "Tsinghua University "
    }
  ],
  "experience": [
    {
      "role": "Senior Frontend Engineer",
      "company": "Britenet",
      "from_date": "Feb 2023 ",
      "to_date": "Present",
      "location": "Warsaw, Poland",
      "responsibilities": "Developed responsive user interfaces utilizing **React** and **Next.js**, enhancing usability and accessibility across web applications.\nCollaborated closely with backend teams to consume and integrate **APIs** using **JavaScript** and **TypeScript**, resulting in improved application performance and user experience.\nConducted rigorous debugging and cross-browser testing, achieving a 30% reduction in bug reports post-launch.\nImplemented product thinking methodologies, prioritizing customer feedback in the design process, which resulted in a 25% increase in user satisfaction.\nMaintained meticulous attention to detail in code reviews, ensuring adherence to design specifications and coding standards.\nExhibited curiosity and a commitment to continuous learning by staying updated with the latest trends in **front-end technologies** and frameworks.\nFostered autonomy in project management by leading initiatives to enhance development workflows, contributing to a 20% increase in team productivity."
    },
    {
      "role": "Software Engineer",
      "company": "Alibaba Group",
      "from_date": "Oct 2020 ",
      "to_date": "Dec 2022",
      "location": "Hangzhou, China",
      "responsibilities": "Designed and developed responsive user interfaces using **React** and **Next.js**, improving overall user engagement by 30%.\nImplemented robust APIs and integrated **JavaScript** and **TypeScript** to enhance functionality while ensuring a seamless user experience.\nConducted thorough testing using **Postman** and various debugging methodologies, leading to a **20% reduction** in reported issues post-launch.\nFocused on accessibility and usability best practices, increasing the product's reach and satisfaction ratings by **15%**.\nEngaged in product thinking and iterations, demonstrating autonomy and a high attention to detail, which contributed to the timely delivery of 5 major features over the last **6 months**."
    },
    {
      "role": "Software Engineer ",
      "company": "Huawei Technologies Co., Ltd",
      "from_date": "May 2016 ",
      "to_date": "Sep 2020",
      "location": "Shenzhen, China ",
      "responsibilities": "Designed and developed responsive user interfaces using **React** and **Next.js**, ensuring seamless component integration with backend **APIs**.\nUtilized **JavaScript** and **TypeScript** for robust frontend development, enhancing code quality and maintainability.\nConducted thorough debugging processes and usability testing, improving application accessibility by **25%**.\nImplemented effective HTTP request management using **Postman**, achieving a streamlined development workflow.\nFocused on attention to detail in UI design, which enhanced overall user experience and engagement metrics by **15%**.\nDemonstrated autonomy in project management while meeting tight deadlines, successfully delivering **3** major feature updates per quarter."
    }
  ],
  "skills": "Programming Languages: Java, JavaScript, TypeScript, Go, Python, SQL, Swift, Kotlin\n\n\tBackend Frameworks: Spring Boot, Spring Security, Hibernate, Node.js, Express.js, JPA, Kafka, RabbitMQ\n\n\tFrontend Frameworks: React, Vue.js, Angular, Pixi.js, Redux, Next.js, React Router, Material-UI, Ant Design, D3.js, Webpack, Babel, Jest, Responsive UI, Accessibility, Usability\n\n\tAPI Technologies: APIs, HTTP, Postman, RESTful API design\n\n\tServerless and Cloud Functions: AWS Lambda, API Gateway\n\n\tDatabases: MySQL, PostgreSQL, Redis, MongoDB\n\n\tDevOps: Docker, Kubernetes (AWS EKS), Jenkins, GitHub Actions, Terraform, AWS CodePipeline\n\n\tCloud & Infrastructure: AWS (EKS, RDS, CloudFront, S3), CloudWatch, ELK Stack, Infrastructure as Code (IaC)\n\n\tOther: Microservices, CI/CD, Data structures and algorithms, Agile/Scrum methodologies, Debugging, Product Thinking, Attention to Detail, Curiosity, Autonomy",
  "apply_company": "DualEntry"
}