{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Web Frontend Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-187801395/",
  "profile_summary": "Results-driven Senior Web Frontend Engineer with 13+ years of experience specializing in **React.js**, **TypeScript**, and **MobX** for effective state management and frontend performance optimization. Proven track record in collaborating across teams to deliver high-quality applications, ensuring alignment with project goals through clear communication and a pragmatic approach.\nSkilled in integrating AI tooling to enhance user experiences and drive iterative development, while demonstrating the ability to work autonomously in dynamic environments. Demonstrated expertise in leveraging a robust tech stack comprising **JavaScript**, **Flutter**, and leveraging cloud services like **AWS** and **Azure** to build scalable, high-performance applications tailored to the healthcare and financial sectors.\nExperienced in backend technologies like **Node.js**, **FastAPI**, and **Django**, delivering comprehensive solutions with a strong understanding of AI/ML-powered platforms and compliance standards such as HIPAA and PCI DSS.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Web Frontend Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Utilized **React.js** and **TypeScript** to design and build high-performance frontend applications, focusing on **frontend performance optimization** for enhanced user experience.\nImplemented state management solutions, leveraging **MobX** for efficient data flow and real-time updates in complex applications, ensuring smooth interactions across all platforms.\nCollaborated effectively with cross-functional teams to iterate on product features, bringing pragmatic solutions and strong **communication skills** to the development process.\nProvided autonomy in the frontend development lifecycle, proactively addressing challenges and optimizing application performance through rigorous testing and profiling.\nLed the development of interactive user interfaces by integrating intelligent features powered by **AI tooling**, facilitating predictive alerts and personalized user experiences.\nConducted regular code reviews and iterative enhancements based on user feedback, ensuring quality and functionality in line with project timelines and objectives.\nCommunicated complex technical concepts effectively to non-technical stakeholders, fostering transparency and collaboration throughout the development process.\nAnalyzed frontend performance metrics, continuously iterating on solutions that resulted in a **30%** reduction in load times and improved user engagement by **15%**.\nEnsured all applications adhered to best practices in **frontend performance optimization** and maintained a high standard of code quality and reusability through the implementation of design patterns and architectural principles."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Utilized **React.js (18)**, **TypeScript**, and **MobX** to build interactive and high-performance front-end applications, enhancing user experience in financial tools and admin panels.\nEmployed state management techniques and **frontend performance optimization** strategies to ensure responsive interfaces, leading to a **30%** improvement in load times.\nCollaborated with cross-functional teams to gather requirements, showcase iterative designs, and communicate progress effectively, resulting in a **25%** increase in project alignment and stakeholder satisfaction.\nIntegrated **AI tooling** for enhancing application features and maintaining a competitive edge in the financial sector, ensuring innovation and up-to-date functionalities.\nDemonstrated strong **communication skills** through presenting technical concepts to non-technical stakeholders, facilitating better collaboration across teams.\nMaintained a high degree of **autonomy** in project development, taking ownership of deliverables and driving initiatives from concept to implementation.\nExhibited **pragmatism** in decision-making, navigating challenges swiftly to ensure project milestones were met within set timelines.\nIterated on application features based on user feedback, implementing enhancements that led to a **15%** increase in user engagement."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "• Developed high-performance frontend applications leveraging **React.js (v18)** and **TypeScript**, focusing on frontend performance optimization to deliver fast and responsive user experiences across various platforms.\n• Implemented effective state management solutions using **MobX** to enhance application efficiency and maintainability.\n• Collaborated with cross-functional teams to iterate on product features, ensuring that all developments aligned with user requirements and business goals.\n• Utilized AI tooling to enhance user interactions and experiences while maintaining autonomy in delivering project components.\n• Fostered strong communication skills within the team to facilitate seamless cooperation in achieving project milestones and improving overall team productivity.\n• Achieved 30% improvement in application loading times through frontend optimizations and performance tuning.\n• Participated actively in code reviews and agile iterations to uphold high standards and pragmatism in the development process.\n• Designed and built mobile-first e-commerce UIs with **Next.js** and **HTML5/CSS3**, compliant with **WCAG 2.1** accessibility standards to ensure an inclusive user experience.\n• Contributed to continuous delivery practices by implementing versioned feature flags, enabling efficient iteration and controlled updates."
    }
  ],
  "skills": "**Frontend Frameworks:**\n\tReact.js, Vue, Angular, TypeScript, MobX, state management, frontend performance optimization\n\n**Backend Frameworks:**\n\tPython: FastAPI, Flask, Django\n\n**Artificial Intelligence & Machine Learning:**\n\tMLflow, Airflow, Kubeflow, AI tooling\n\n**API Technologies:**\n\tAuthentication & Security: Keycloak (OIDC, RBAC), OAuth2, JWT\n\tNginx, Let’s Encrypt, Certbot\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD\n\n**Cloud & Infrastructure:**\n\tAWS: ECS, Lambda, RDS, S3, Azure: App Services, Blob Storage, SQL Database\n\n**CI/CD & Infrastructure as Code:**\n\tTerraform, Ansible, Helm, Docker Compose\n\n**Other:**\n\tcollaboration, communication skills, autonomy, pragmatism, iteration"
}