{
  "name": "Tomasz Lee",
  "role_name": "Senior Backend Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Accomplished Senior Backend Engineer with 9+ years of experience specializing in **microservices** architecture and proficient in **Kotlin**, **AWS**, **Kubernetes**, and **PostgreSQL**. Strong expertise in building scalable applications and optimizing system performance. Proven track record in using **JUnit** and **Testcontainers** for effective testing strategies. Demonstrated problem-solving skills with a collaborative approach to driving projects to success. Additionally skilled in various technical frameworks, including **ReactJS**, **NextJS**, and **.NET**, ensuring comprehensive development capabilities and efficiencies in both frontend and backend processes.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Senior Backend Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Leveraged **Kotlin** to enhance back-end functionalities, improving system performance and reliability.\nDesigned and implemented a **microservices** architecture to facilitate modular development and scalability.\nDeployed applications on **AWS**, utilizing **Kubernetes** for container orchestration, ensuring high availability and scalability of services.\nOptimized database management and performance with **PostgreSQL**, resulting in a reduction of data retrieval time by **30%**.\nConducted unit testing and integration testing using **JUnit** and **Testcontainers**, ensuring code quality and functionality through **95%** test coverage.\nSet up monitoring and alerting systems with **Grafana** to analyze application metrics, leading to improved system reliability and issue resolution time by **50%**.\nCollaborated closely with cross-functional teams to address and resolve complex technical challenges, enhancing overall project delivery.\nExhibited strong problem-solving skills to troubleshoot and resolve production incidents swiftly, maintaining a high level of service continuity.\nImplemented best practices in code reviews and continuous integration, ensuring a clean and efficient codebase.\n"
    },
    {
      "role": "Software Engineer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "Utilized **Kotlin** to develop robust backend services, enhancing application functionality and performance.\nImplemented a **microservices** architecture with **AWS** for deployment and scalability, managing over **10** microservices to optimize resource usage.\nLeveraged **PostgreSQL** for data management and real-time access, ensuring a **99.99%** system uptime.\nEmployed **JUnit** and **Testcontainers** for comprehensive testing, achieving a **30%** reduction in bugs before deployment.\nManaged orchestration of services using **Kubernetes**, improving system availability and efficiency of deployments.\nIntegrated **Grafana** for monitoring system performance metrics, leading to timely identification and resolution of issues.\nFostered a culture of **collaboration**, working closely with cross-functional teams and stakeholders to gather requirements and deliver projects on time.\nDrove problem-solving initiatives, creating solutions that enhanced the overall project development process and team dynamics.\nMentored junior developers, leading to a **20%** improvement in task completion rates and productivity across the team.\n"
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "Utilized **Kotlin** and **microservices** architecture to design and implement scalable backend solutions, enhancing system efficiency and response times by **30%**.\nDeployed applications on **AWS**, leveraging **Kubernetes** for container orchestration to streamline management and deployment processes, achieving a **40%** reduction in infrastructure costs.\nImplemented **PostgreSQL** as the primary database, optimizing data storage and retrieval methods, which improved query performance by **25%**.\nDeveloped unit and integration tests using **JUnit** and **Testcontainers**, ensuring code quality and reducing bug tracking time by **50%**.\nMonitored system health and performance using **Grafana**, enabling real-time performance insights and proactive issue resolution.\nCollaborated across teams to troubleshoot and resolve complex problems, fostering a culture of collaboration and knowledge sharing.\nParticipated in agile ceremonies including daily standups and retrospectives, aligning project deliverables with strategic goals.\nProvided mentoring and guidance to junior developers, enhancing team skill sets and improving overall project deliverance.\nDelivered comprehensive technical documentation for backend services, improving onboarding efficiency by keeping teams informed.\n"
    }
  ],
  "skills": "  **Programming Languages**\n\tJavaScript, TypeScript, C#, .NET, Kotlin, Python, Solidity\n\n  **Backend Frameworks**\n\tNodeJS, ExpressJS, NestJS, microservices\n\n  **Frontend Frameworks**\n\tHTML, CSS, ReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n  **API Technologies**\n\tRESTful API, GraphQL\n\n  **Serverless and Cloud Functions**\n\tAWS, Azure\n\n  **Databases**\n\tMSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB\n\n  **DevOps**\n\tCI/CD pipelines, Kubernetes\n\n  **Cloud & Infrastructure**\n\tGrafana\n\n  **Other**\n\tUX/UI Design, Git, GitHub, NUnit, xUnit, JUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest, Testcontainers, problem-solving, collaboration",
  "apply_company": "Pleo"
}