{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Network Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-187801395/",
  "profile_summary": "Senior Network Engineer with over 13 years of experience in delivering high-performance network solutions, specializing in **Data Center Networking** and **Network Tools**. Adept in **BGP** configuration and troubleshooting, ensuring operational excellence and flawless architecture across complex systems. Proven ability to implement innovative operational strategies while maintaining compliance with industry standards.\nSkilled in collaborating with cross-functional teams to drive improvements and optimize network operations, leveraging expertise in operational workflows. Strong background in using advanced analytics for network performance monitoring and enhancement.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Network Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Implemented robust **BGP** configurations and strategies to enhance network reliability and performance in data center environments.\nDirected the operational excellence of network systems by utilizing advanced **network tools** for monitoring and troubleshooting, ensuring minimal downtime and optimal performance metrics.\nDesigned and maintained network architecture that supports scalable operations and efficient data flow within large-scale data centers, adhering to best practices and industry standards.\nTroubleshot complex networking issues with a focus on root cause analysis, achieving a resolution rate of **95%** on the first attempt.\nOptimized data center networking protocols and processes, enhancing operational efficiency and reducing latency by up to **30%**.\nCollaborated with cross-functional teams to implement innovative architectural solutions, improving overall network resilience and adaptability.\nConducted regular performance audits and assessments, utilizing metrics to drive continuous improvement in network operations and architecture.\nMentored junior network engineers, providing guidance on troubleshooting techniques and operational best practices, ultimately increasing team productivity by **20%**.\nDeveloped and enforced comprehensive documentation for network architecture and operations, ensuring knowledge transfer and continuity across team members."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Optimized network infrastructure by implementing advanced **Data Center Networking** strategies, ensuring high availability and reduced latency across 9 data centers.\nExecuted thorough **Troubleshooting** protocols, resolving network issues with a 95% first-time fix rate and minimizing downtime for critical operations.\nDesigned robust **Architectural** solutions for network security, integrating operational excellence that resulted in a 20% increase in network efficiency and user satisfaction.\nUtilized comprehensive **Network Tools** to monitor and manage network performance, achieving a 30% improvement in response times to incidents.\nStreamlined operational processes, leading teams in executing network changes with a success rate of 98% and optimized utilization of resources.\nEstablished and maintained best practices for **Operations**, contributing to a 25% decrease in operational costs through effective resource management and strategic planning."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "- Ensured **operational excellence** by designing and implementing optimized **data center networking** solutions, enhancing system performance and reliability across global platforms.\n- Collaborated on network architecture design to integrate robust **troubleshooting** methodologies, improving incident response times by up to **30%**.\n- Utilized advanced **network tools** and monitoring systems to maintain high availability and low latency for critical infrastructure, achieving an uptime of **99.9%**.\n- Spearheaded **operations** initiatives focused on enhancing network performance and reliability, leading to a **25%** reduction in service disruptions.\n- Conducted extensive **network troubleshooting** to identify and resolve connectivity issues, resulting in a **40%** faster resolution rate. \n- Implemented a structured approach to **architecture** design that streamlined operation workflows and improved efficiency across network teams, contributing to a **20%** increase in productivity.\n- Developed and maintained comprehensive documentation for operational processes, resulting in enhanced training materials that improved team onboarding efficiency by **35%**.\n- Collaborated with cross-functional teams to ensure robust network security measures were in place, aligning with industry standards and compliance regulations."
    }
  ],
  "skills": " **Programming Languages:** \n\tPython, JavaScript, TypeScript \n\n **Backend Frameworks:** \n\tFastAPI, Flask, Django \n\n **Frontend Frameworks:** \n\tReact, Vue, Angular \n\n **API Technologies:** \n\tOAuth2, JWT, Keycloak (OIDC, RBAC) \n\n **Serverless and Cloud Functions:** \n\tAWS: Lambda, Azure: App Services \n\n **Databases:** \n\tPostgreSQL, MySQL, MongoDB, Redis \n\n **DevOps:** \n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD \n\n **Cloud & Infrastructure:** \n\tAWS: ECS, RDS, S3, Azure: Blob Storage, SQL Database \n\n **Other:** \n\tBGP, Data Center Networking, Network Tools, Architecture, Operations, Troubleshooting, Operational Excellence"
}