{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Forward Deployed Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-karol-kotlinski-bb2520397/",
  "profile_summary": "Driven Full Stack Developer with 8 years of experience, specializing in **Python** and **TypeScript**, adept at creating robust **REST APIs** and developing scalable solutions. I have a demonstrated capability in **speech-to-text** technology, **embeddings**, and **diarization**, which enhances user interaction and data processing. My technical problem-solving skills enable me to tackle complex challenges efficiently, while my client interaction and business acumen ensure solutions are aligned with user needs and business objectives.\nI possess extensive expertise in building high-performance solutions particularly in healthcare and financial sectors, employing **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**. With a deep understanding of cloud services in **Azure** and **AWS**, I’ve successfully led the development of enterprise platforms integrating AI/ML capabilities for advanced analytics and automation. My experience with microservices architecture, CI/CD automation, and compliance frameworks such as HIPAA and PCI DSS ensures the security and reliability of the applications I create.\nAdditionally, I have hands-on experience in developing machine learning pipelines and implementing MLOps workflows using tools such as **MLflow**, **Airflow**, and **Kubeflow**, further showcasing my ability to leverage technology for innovative solutions.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Forward Deployed Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Developed REST APIs using **Python** and **TypeScript** for scalable solutions in healthcare and financial sectors, ensuring high-level technical problem-solving and client interaction for user-centric designs.\nArchitected efficient integrations for speech-to-text functionalities in healthcare applications, leveraging AI-enhanced capabilities.\nUtilized embeddings and diarization techniques to refine client-facing services, showcasing strong communication skills and business acumen while addressing client needs.\nDesigned and implemented **SDK development** for seamless interaction with third-party tools tailored for healthcare scenarios, enhancing the user experience and operational efficiency.\nDemonstrated proficiency in technical problem-solving by leading the integration of advanced **machine learning** models to optimize service delivery, including patient risk predictions and financial anomaly detection.\nCollaborated with cross-functional teams to establish and execute strategies for deploying robust solutions via **REST APIs**, focusing on real-time data utilization and analytical insights.\nDelivered significant improvements in project outcomes through effective client interactions, translating technical requirements into practical solutions, ensuring customer satisfaction at all levels.\nEstablished metrics to measure project success and efficacy, achieving a **25%** reduction in response time for client requests by optimizing system performance.\nParticipated actively in requirement gathering sessions with stakeholders to align technical solutions with business objectives, demonstrating effective communication and understanding of business priorities.\nImplemented iterative processes for continuous improvement, focusing on client feedback and evolving technology landscapes, leading to enhanced product offering satisfaction."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Utilized **Python**, **TypeScript**, and **REST APIs** to develop and optimize sophisticated solutions, enhancing both technical problem-solving and client interaction measures.\nDemonstrated strong business acumen and communication skills while leading the development of user-focused applications, ensuring seamless interactions between technical teams and clients.\nDesigned and modernized architectures using **microservices** that improve scalability and maintainability, resulting in a **30%** increase in system throughput.\nBuilt dynamic front-end applications leveraging **React (18)** and **Next.js**, achieving an improvement in user experience with response times reduced by **40%**.\nDeveloped comprehensive dashboards integrating **D3.js**, real-time monitoring tools, and analytics powered by **Power BI Embedded**, allowing operational teams to track and respond to financial activities effectively.\nStreamlined asynchronous communication by integrating **Kafka**, **RabbitMQ**, and **Azure Service Bus**, facilitating a response time improvement for alerts and transactions by **25%**.\nCreated and managed ETL pipelines using **Apache Airflow** and **Azure Data Factory**, enabling batch and real-time ingestion of financial data, which reduced processing times by **35%**.\nImplemented fraud detection systems powered by **AI/ML** technologies such as **scikit-learn** and **XGBoost**, successfully flagging suspicious activities with an accuracy of **90%**.\nEstablished ML pipelines for critical processes like credit scoring and transaction classification utilizing **MLflow**, improving real-time decision-making capabilities by integrating model inference directly into backend services."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Utilized **Python** to develop and optimize **REST APIs** for backend services, ensuring high performance and reliability in real-time operations, thus enhancing technical problem-solving abilities.\nEmployed **Typescript** in frontend applications to create user-friendly interfaces, streamlining client interaction and improving communication with stakeholders.\nDemonstrated expertise in **SDK development** for seamless integration with existing e-commerce functionalities, delivering on business acumen and addressing client needs effectively.\nActively engaged in technical problem-solving for complex issues, leading to a **40%** reduction in bug resolution times, enhancing user experience and satisfaction.\nLed efforts in developing innovative **speech-to-text** features, enabling efficient communication and interaction within the platform, showcasing adaptability to new technologies.\nContributed to the implementation of embedding techniques for real-time textual analysis, improving search functionalities by **30%** and driving higher engagement with relevant content.\nEngaged in **diarization** to enhance customer service capabilities, allowing for a **25%** increase in efficiency in handling real-time customer support inquiries.\nDeveloped and maintained detailed documentation and clear communication with both technical teams and business stakeholders, ensuring alignment and transparency throughout the deployment processes.\n"
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, Typescript\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n **Frontend Frameworks:**\n\tReact, Vue, Angular\n\n **API Technologies:**\n\tREST APIs\n\n **Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n **Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD\n\n **Cloud & Infrastructure:**\n\tTerraform, Ansible, Helm, Docker Compose\n\n **Other:**\n\tMLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, speech-to-text, embeddings, diarization, sdk development, technical problem-solving, client interaction, business acumen, communication skills"
}