{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Front-End Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-187801395/",
  "profile_summary": "Senior Front-End Engineer with 13+ years of experience in crafting high-performance applications, adept in **React**, **TypeScript**, **JavaScript**, **HTML**, **CSS**, and testing frameworks like **Cypress** and **Jest**. Proven expertise in performance optimization and creating user-focused solutions that enhance accessibility and observability. Highly skilled in using **Tailwind**, **SCSS**, and **Nx monorepo** for responsive design and component-driven architecture, along with **Storybook** for UI development. Demonstrated ability to work in Agile environments through effective collaboration and documentation practices. With a strong foundation in backend technologies such as **Node.js**, **FastAPI**, and **Django**, and cloud services like **AWS** and **Azure**, I bring a comprehensive viewpoint that elevates frontend development by aligning with backend processes and cloud deployment strategies.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Front-End Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Developed responsive and high-performance web applications using **React (17–18)**, **TypeScript**, and **JavaScript**, ensuring a seamless user experience while adhering to best practices in **Performance optimization** and **Accessibility**.\nImplemented state management techniques with **React Query** to efficiently handle data fetching and caching, enhancing overall application performance by **30%**.\nUtilized **Tailwind** and **SCSS** for crafting modern, visually appealing UI components in collaboration with design teams, resulting in a **20%** improvement in user engagement metrics.\nLed the execution of testing strategies using **Cypress** and **Jest**, achieving over **90%** code coverage and ensuring high-quality deliverables through comprehensive **Documentation**.\nDesigned and maintained modular components using **Nx monorepo** and **Storybook**, facilitating reusability and collaboration across teams while reducing development time by **25%**.\nChampioned Agile methodologies, collaborating with cross-functional teams to deliver features that directly enhance **User value**, meet deadlines, and align with users' needs and feedback.\nCreated observability practices to monitor application performance and user interactions, leading to improved troubleshooting processes and heightened application reliability.\n"
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Utilized **React (18)**, **TypeScript**, and **Tailwind CSS** to build interactive, user-centric front-end applications that enhance user experience and accessibility, adhering to the latest web standards.\nImplemented performance optimization strategies using **React Query** and **Jest** to ensure fast, responsive applications with high accessibility and observability.\nParticipated in Agile development processes, fostering collaboration among cross-functional teams to effectively document and deliver features that provide user value.\nLeveraged **HTML** and **CSS** skills in conjunction with **SCSS** for styling and layout, ensuring a consistent look and feel across financial tools and admin panels.\nContributed to the architecture of the front-end with **Nx monorepo** and **Storybook** to streamline component development and enhance maintainability.\nApplied best practices in testing and validation using **Cypress** and **Jest** to ensure high-quality code and customer satisfaction.\nEngaged in continuous performance assessments and optimization efforts to identify and address bottlenecks, achieving reduction of load times by **30%**.\nCollaborated with back-end teams to integrate APIs and enhance data flow for real-time transaction processing, increasing efficiency by **20%**."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "• Developed responsive e-commerce applications utilizing **React (18)**, **TypeScript**, and **Tailwind CSS**, ensuring high performance and user engagement with **WCAG 2.1** accessibility compliance.\n• Implemented unit and integration testing using **Jest** and **Cypress**, resulting in a 40% reduction in bug reports during production phases and ensuring robust application reliability.\n• Optimized frontend performance through advanced techniques such as code splitting and lazy loading, enhancing loading times by **30%** and improving overall user experience.\n• Led collaboration with cross-functional teams to deliver features on time and within scope in an **Agile** environment, fostering effective communication and project success.\n• Created comprehensive documentation for new features and system architecture using **Storybook**, improving team onboarding time by **25%**.\n• Enhanced data management and performance by integrating **React Query** for efficient server state management and caching, significantly reducing data fetching time.\n• Developed scalable and maintainable code structures within a **Nx monorepo**, enabling streamlined development across multiple teams and projects.\n• Focused on observability by integrating metrics and monitoring tools, achieving a **50%** increase in actionable insights for continuous improvement.\n• Championed user-centric design principles to ensure that delivered applications aligned perfectly with user value and expectations, leading to a **20%** increase in UX satisfaction scores.\n• Prioritized accessibility considerations throughout the development process, ensuring all user interfaces met industry standards for inclusive design."
    }
  ],
  "skills": "{"
}