{
  "name": "Tomasz Lee",
  "role_name": "Data Warehouse Developer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Results-driven Data Warehouse Developer with 9+ years of experience in SQL, PL/SQL, and Oracle Database, specializing in designing and developing data integration solutions. Proficient in implementing ETL processes and ensuring data quality and integrity across complex systems. Hands-on expertise in Oracle ERP, Power BI, Oracle Analytics, and Tableau for insightful data analysis and visualization. Demonstrated ability to lead projects autonomously while maintaining professionalism and versatility in a fast-paced environment. Strong background in documenting processes and collaborating effectively with cross-functional teams.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Data Warehouse Developer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "• Conducted data analysis to identify needs and improve data integrity, ensuring accuracy and consistency across the **Oracle Database** and **Data Warehouse** systems.\n• Developed and optimized SQL queries and PL/SQL scripts for data extraction and transformation, significantly improving data retrieval times by **30%**.\n• Designed and implemented ETL processes to streamline data integration from diverse sources into the **Oracle ERP** environment.\n• Utilized **Power BI** and **Tableau** for data visualization, creating dashboards that enhance data quality and facilitate decision-making.\n• Spearheaded documentation initiatives to improve data governance and maintain comprehensive records of data workflows and processes.\n• Emphasized autonomy and versatility in project management, successfully collaborating with cross-functional teams to align data strategies with business goals.\n• Maintained professionalism in all communications and deliverables, ensuring that stakeholders are informed and engaged throughout the data warehousing projects.\n• Achieved a **25%** improvement in data processing efficiency through careful data quality management and integration techniques.\n• Assisted in the development of Oracle Analytics solutions, providing actionable insights that supported strategic planning and operational efficiency."
    },
    {
      "role": "Full Stack Developer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "Utilized **SQL** and **PL/SQL** to optimize and manage data queries on **Oracle Database**, ensuring data integrity and quality for a robust Data Warehouse solution.\nImplemented efficient ETL processes for data integration from various sources into the Data Warehouse, enhancing data accessibility for business insights.\nDeveloped and maintained reporting solutions using **Power BI**, **Oracle Analytics**, and **Tableau**, which improved data visualization and analysis capabilities by **40%**.\nDesigned and documented data workflow processes to promote transparency and consistency in data handling practices, fostering better team collaboration.\nConducted rigorous data quality checks and audits, achieving a **99%** data accuracy rate in reporting.\nCollaborated with cross-functional teams to gather requirements and deliver timely analytics solutions, showcasing versatility and professionalism in project execution.\nProvided autonomy to junior developers through mentorship and training sessions, boosting overall team efficiency by **20%**.\nLeveraged skills in data integrity to ensure compliance with industry standards during data migration projects.\nImplemented best practices in data documentation and analysis, resulting in improved operational workflows.\nAnalyzed data trends and patterns, delivering actionable insights for strategic decision-making."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "Utilized **SQL** to optimize complex queries and enhance data retrieval processes, achieving a **30%** improvement in performance metrics.\nEmployed **ETL** strategies to facilitate efficient data integration from **Oracle Database** into the data warehouse, ensuring high standards of **Data Quality** and **Data Integrity**.\nDeveloped insightful dashboards using **Power BI** and **Tableau**, providing stakeholders with real-time analytics that improved decision-making speed by **25%**.\nCreated comprehensive documentation to outline the data workflows and structures, promoting easy understanding and knowledge sharing among team members.\nImplemented **Oracle Analytics** for advanced data analysis, allowing for deeper insights into operational performance.\nConducted data validation and cleansing procedures, ensuring accuracy and reliability of data utilized within the **Oracle ERP** system.\nCollaborated with cross-functional teams to assess integration needs, demonstrating **Versatility** in managing diverse project requirements.\nMaintained strict adherence to company protocols, exhibiting **Professionalism** and a commitment to quality deliverables in all tasks.\nEngaged in autonomous problem-solving to identify and resolve data-related issues, reflecting *strong initiative and responsibility* in my role."
    }
  ],
  "skills": " **Programming Languages**\n\tJavaScript, TypeScript, C#, Python, SQL, PL/SQL\n\n **Backend Frameworks**\n\tNodeJS, ExpressJS, NestJS, .NET, Entity Framework, Microservices\n\n **Frontend Frameworks**\n\tHTML, CSS, ReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n **API Technologies**\n\tRESTful API, GraphQL\n\n **Serverless and Cloud Functions**\n\tAWS, Azure\n\n **Databases**\n\tMSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB, Oracle Database, Data Warehouse\n\n **DevOps**\n\tCI/CD pipelines\n\n **Cloud & Infrastructure**\n\tOracle ERP, Data Integration, Data Quality, Data Integrity\n\n **Other**\n\tMessaging & Caching: Apache Kafka, RabbitMQ, Redis, Testing Tools: NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest, Blockchain: Solidity, Ether.js, Web3.js, Ethereum, UX/UI Design, Git, GitHub, Power BI, Oracle Analytics, Tableau, Data Analysis, Documentation, Autonomy, Versatility, Professionalism"
}