{
  "name": "Tomasz Lee",
  "role_name": "Senior Rust Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Results-driven developer with 9+ years in backend development, specializing in **microservices**, **event-driven architecture**, and **domain-driven design**. Proficient in **RabbitMQ**, **Kafka**, and adept in **functional programming** with extensive experience in **Rust** and **Elixir**. Strong advocate for **TDD** and Agile methodologies, focusing on high-quality code reviews and collaboration. Proven track record of troubleshooting and debugging complex systems, driving problem-solving initiatives, and optimizing performance in a collaborative environment. Committed to delivering robust and innovative solutions while leading projects to successful completion.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Senior Rust Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "• Led backend development initiatives utilizing **Rust** for robust application performance, enhancing system efficiency by **30%**.\n• Designed and implemented a microservices architecture, employing **event-driven architecture** principles, which increased scalability and maintainability of the system.\n• Utilized **RabbitMQ** for seamless message queuing and **Kafka** for real-time event streaming, improving data processing rates by **45%**.\n• Applied **domain-driven design** methodologies to better structure complex business logic within the applications.\n• Developed, maintained, and reviewed code for high-quality outputs while fostering **collaboration** through regular **code reviews**.\n• Embraced **Agile** practices to manage workflow effectively, improving team delivery timelines by **25%**.\n• Implemented **TDD** principles to ensure code robustness, reducing the number of bugs in production by **40%**.\n• Engaged in **troubleshooting** and **debugging** initiatives, effectively resolving issues to ensure a seamless user experience.\n• Cultivated a problem-solving mindset within the team, facilitating a culture of continuous improvement and innovation.\n• Integrated advanced logging and monitoring frameworks, ensuring system reliability and keeping uptime above **99.5%**."
    },
    {
      "role": "Software Engineer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "Leveraged **Rust** and **Elixir** to develop backend services, enhancing system reliability and performance in a microservices architecture.\nDesigned and optimized event-driven architectures using **RabbitMQ** and **Kafka**, leading to a 20% increase in system throughput.\nImplemented domain-driven design principles to ensure scalable and maintainable code, contributing to a 15% reduction in development time.\nAdopted functional programming paradigms and Test-Driven Development (TDD) to improve code quality and foster a culture of continuous integration.\nConducted rigorous code reviews, instilling best practices and enhancing team collaboration by 30%.\nFacilitated Agile development processes, ensuring projects adhered to timelines and stakeholder requirements, which resulted in a 95% on-time delivery rate.\nPerformed advanced troubleshooting and debugging, resolving issues swiftly for a seamless user experience.\nMentored junior developers, increasing overall team productivity by 25%.\nEngaged with cross-functional teams to define system requirements and evolve architecture for optimal performance, impacting business outcomes positively."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "• Led **backend development** initiatives utilizing **Rust** and **Elixir**, ensuring robust and scalable systems aligned with **microservices** architecture principles.\n• Implemented **event-driven architecture** using **RabbitMQ** for handling asynchronous communication, significantly enhancing application responsiveness during peak operations by **30%**.\n• Advocated for **domain-driven design** and **functional programming** methodologies to optimize code structure and simplify problem-solving, improving team velocity by **25%**.\n• Conducted **TDD** practices to ensure code reliability and maintainability, thereby minimizing bugs by **40%** in production.\n• Collaborated in an **Agile** environment, participating in daily standups and **code reviews** to align with project goals and improve coding standards.\n• Developed strategies for **troubleshooting** and **debugging** legacy systems, facilitating a smoother transition to modern architectures.\n• Engaged in effective **collaboration** with cross-functional teams to deliver high-quality software solutions on time, fostering a culture of continuous improvement.\n• Mentored junior engineers in best practices for software development, enhancing overall team performance.\n• Produced comprehensive documentation and design specifications to aid future maintenance and development efforts."
    }
  ],
  "skills": "**Programming Languages**\n\tRust, Elixir, Python, JavaScript, TypeScript\n\n**Backend Frameworks**\n\tNodeJS, ExpressJS, NestJS, C#, .NET, Microservices\n\n**Frontend Frameworks**\n\tHTML, CSS, ReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n**API Technologies**\n\tRESTful API, GraphQL\n\n**Serverless and Cloud Functions**\n\t\n\n**Databases**\n\tMSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB\n\n**DevOps**\n\tAWS, Azure, CI/CD pipelines, Agile\n\n**Cloud & Infrastructure**\n\t\n\n**Other**\n\tUX/UI Design, Git, GitHub, Testing Tools: NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest, Blockchain: Solidity, Ether.js, Web3.js, Ethereum, Messaging & Caching: Apache Kafka, RabbitMQ, Troubleshooting, Debugging, Problem-solving, Collaboration, Code reviews, TDD, Functional programming, Event-driven architecture, Domain-driven design",
  "apply_company": "Prima"
}