{
  "name": "Patryk Zaslawski",
  "role_name": "Senior iOS Engineer",
  "email": "patrykzas0428@outlook.com",
  "phone": "+48669862402",
  "address": "Gdanski, Poland",
  "linkedin": "https://www.linkedin.com/in/patryk-z-9b9455391/",
  "profile_summary": "As a seasoned Senior iOS Engineer with 8+ years in software engineering, I possess extensive knowledge in developing high-performance applications using **Swift**, **SwiftUI**, **Combine**, and **Swift Concurrency**. I am adept in employing architectural patterns such as **MVVM** and utilizing tools like **SPM** for seamless package management. My technical expertise encompasses **Kotlin**, **Compose**, **Coroutines**, and **Room**, enhancing my versatility in multi-platform development. Additionally, I have experience in employing **gRPC** for efficient communication between services. My proficiency extends to cloud technologies like **GCP**, **GKE**, and data management solutions including **PostgreSQL** and **Redis**, enabling me to deliver robust back-end integrations. I bring exceptional leadership and communication skills to drive projects forward while adhering to industry best practices.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2014",
      "to_year": "2017",
      "location": "United Kingdom",
      "university": "The University of Manchester"
    }
  ],
  "experience": [
    {
      "role": "Senior iOS Engineer",
      "company": "Binary Studio",
      "from_date": "Aug 2023",
      "to_date": "Present",
      "location": "United Kingdom (Remote)",
      "responsibilities": "Led the architectural design of scalable applications, leveraging **Swift**, **SwiftUI**, and **Combine** for seamless user experiences in mobile healthcare solutions.\nImplemented advanced asynchronous programming patterns using **Swift Concurrency**, ensuring high-performance and responsive application interactions.\nDeveloped and maintained CI/CD pipelines using **Github** for effective version control and collaboration on code changes supporting **Swift** based projects.\nUtilized **Kotlin** and **Coroutines** to enhance mobile applications, optimizing multi-threading capabilities for better performance and responsiveness.\nArchitected real-time communication features using **gRPC** to enable efficient data exchange across platforms and improve user engagement metrics.\nDesigned data storage solutions with **Room**, ensuring local persistence and quick access to healthcare records for users.\nSpearheaded cross-platform development strategies integrating **Node.js** and **NestJS** to support backend services that enhance mobile functionality.\nGuided a team of engineers on best practices in **MVVM** architecture, fostering clean code principles and promoting efficient UI development strategies.\nDeveloped analytics capabilities using **Amplitude** and **Tableau**, providing insights from user interactions and improving decision-making processes based on usage data.\nOptimized application performance through the implementation of caching strategies with **Redis**, improving loading times by up to **40%**.\nEnsured effective communication across teams and leadership roles, driving project successes and fostering collaborative work environments in product development.\nMentored junior engineers in **Swift**, encouraging the adoption of best coding practices and advancement in mobile software engineering skills.\nFacilitated workshops on user experience (UX) best practices, ensuring that the applications not only meet functional requirements but are also user-friendly and visually appealing.\nExecuted data management strategies on **PostgreSQL**, enabling secure transactions and compliance with healthcare regulations."
    },
    {
      "role": "Software Engineer",
      "company": "Ardigen",
      "from_date": "Mar 2020",
      "to_date": "Aug 2023",
      "location": "Poland",
      "responsibilities": "• Led the migration and development of applications using **Swift**, **SwiftUI**, and **Combine**, enhancing user experience and performance across iOS platforms.\n• Designed and implemented MVVM architecture to ensure clean separation of concerns in application development, increasing maintainability and scalability.\n• Developed RESTful and gRPC APIs for iOS applications, improving communication and data exchange between mobile frontends and backend services.\n• Integrated Firebase for real-time data synchronization in applications, enabling instant updates and enhancing user engagement metrics.\n• Smoothed the deployment process by configuring CI/CD pipelines using **GitHub** for seamless integration and continuous delivery, reducing deployment time by **30%**.\n• Conducted code reviews and implemented best practices for Swift development, utilizing **Swift Concurrency** to enhance performance of asynchronous tasks.\n• Leveraged **Room** for efficient local database management, optimizing data retrieval and storage for mobile applications.\n• Collaborated with UX designers to produce high-fidelity app interfaces, achieving user satisfaction ratings above **90%**.\n• Architected solutions using **Node.js** backends, ensuring robust communication between mobile and server systems.\n• Implemented effective performance monitoring tools like **Amplitude** and **Tableau** to analyze user metrics and improve application features accordingly.\n• Contributed to the development of an event-driven architecture using **Kotlin**, facilitating high-throughput transactions within iOS applications.\n• Managed and optimized cloud services like **GKE** and **GCP** for mobile application scalability, improving response times and reducing latency.\n• Established clear communication across teams to foster collaboration in developing user-friendly features, exemplifying strong leadership skills and project management.\n• Designed and built dynamic UI components in **SwiftUI** and **Compose**, ensuring a responsive experience across various devices."
    },
    {
      "role": "Software Engineer",
      "company": "Altum Software",
      "from_date": "Oct 2017",
      "to_date": "Feb 2020",
      "location": "United Kingdom",
      "responsibilities": "Designed and implemented user-centric mobile applications using **Swift** and **SwiftUI**, focusing on **MVVM** architecture to enhance the user experience and maintain scalable codebases.\nDeveloped asynchronous features using **Combine** and **Swift Concurrency** to handle real-time data processing, ensuring quick and responsive applications.\nCollaborated with backend teams utilizing **gRPC** for efficient communication between services, ensuring seamless integration and low-latency performance.\nLeveraged **Kotlin** and **Compose** to create cross-platform solutions, integrating effective **Coroutines** for smooth user interactions and state management.\nAdopted **Node.js** and **NestJS** as backend frameworks to create scalable microservices, enabling a robust architecture capable of handling **up to 5000** concurrent users.\nUtilized **Firebase** for seamless authentication and data management, enhancing app robustness while providing a secure user environment.\nImplemented data persistence strategies using **Room** for local storage in mobile applications, optimizing data retrieval and management.\nExecuted analytics tracking with **Amplitude** and visualization using **Tableau**, driving insights for UX improvements and business decisions.\nMaintained strong communication practices with cross-functional teams, showcasing leadership skills to drive collaboration and innovation in project delivery.\nEnsured continuous integration and delivery using **Github** for version control, optimizing development workflows and team collaboration.\nConducted user-testing sessions to gather feedback and iteratively improve UX designs, delivering applications with high user satisfaction ratings of **over 90%**.\nPerformed troubleshooting and debugging to ensure smooth operation and performance of applications across various devices and operating systems.\nEngaged in regular code reviews, promoting best practices and enhancing team knowledge sharing to uplift overall code quality."
    }
  ],
  "skills": "Programming Languages:\n\\tSwift, SwiftUI, Combine, Swift Concurrency, SPM, Kotlin, Go, Node.js, Typescript\n\n**Backend Frameworks:**\n\tnestJS\n\n**Frontend Frameworks:**\n\tAngular (1–16), React (15–18), Next.js, Vue.js (2/3), Blazor, Compose\n\n**API Technologies:**\n\tREST & gRPC APIs, gRPC\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL), Firebase\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis, Spanner\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD\n\n**Cloud & Infrastructure:**\n\tGCP, GKE\n\n**Other:**\n\tSQLAlchemy, Pydantic, Celery, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, Amplitude, Tableau, UX, communication, leadership",
  "apply_company": "BeReal"
}