{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior DevOps Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Results-oriented Senior DevOps Engineer with 13+ years of experience in building and delivering robust applications, leveraging technologies such as **JavaScript**, **Node.js**, **AWS**, and **Azure**. Demonstrated expertise in developing cloud-native solutions and implementing **Serverless architectures** to optimize performance and cost-efficiency.\nProficient in **MongoDB** and adept at applying **Express** for backend development, ensuring responsive and scalable system design. Strong emphasis on **Clean Code** principles and thorough documentation to enhance maintainability and team collaboration.\nExceptional technical leadership and team management skills, fostering a proactive and empathetic work environment. Well-versed in problem-solving techniques, and demonstrating team orientation, I effectively communicate in English to bridge gaps and drive project success.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior DevOps Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Utilized **Node.js** and **MongoDB** to engineer scalable backend solutions, ensuring high availability and performance in line with business requirements.\n• Leveraged **AWS** and **Azure** for cloud service management and deployment of serverless architectures, driving operational efficiency.\n• Demonstrated strong **Technical Leadership** by guiding cross-functional teams on projects, fostering a culture of **Empathy** and effective **Team Management**.\n• Advocated for **Clean Code** principles in software development processes, enhancing maintainability and reducing technical debt.\n• Implemented proactive strategies for problem-solving, addressing potential issues before they escalated into critical incidents.\n• Established comprehensive documentation protocols to support team members and ensure clarity in project deliverables.\n• Orchestrated CI/CD pipelines using **GitHub Actions** and **Azure DevOps**, achieving deployment success rates of **99%** across multiple environments.\n• Champion advanced security measures to protect sensitive data, ensuring compliance with industry standards across projects.\n• Facilitated effective communication with stakeholders and team members in **English**, ensuring alignment on project objectives and timelines.\n• Conducted regular code reviews and team training sessions, promoting knowledge sharing and continuous improvement in coding practices."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Utilized **JavaScript**, **Node.js** (Express) for modernizing core financial platforms by migrating to a microservices architecture, improving scalability and performance for high-volume transactional systems.\nLed the technical direction for the development team, ensuring **clean code** practices and thorough **documentation** were maintained in all projects.\nManaged team operations effectively, demonstrating strong **technical leadership** and **team management** skills through the successful delivery of software solutions in a dynamic environment.\nBuilt interactive front-end applications leveraging **MongoDB**, **React** (18), **Vue 3**, **Next.js**, and **TypeScript**, employing **Redux Toolkit** and **Tailwind CSS** to design sleek, responsive interfaces for financial tools and admin panels, impacting **9** major financial products.\nDelivered real-time analytics dashboards integrating **React**, **D3.js**, and **Power BI Embedded**, providing operations teams with instant insights into transactions and anomalies, resulting in a **30%** increase in operational efficiency.\nDesigned and deployed an event-driven architecture using **Kafka**, **RabbitMQ**, and **Azure Service Bus**, ensuring seamless asynchronous communication across critical workflows such as payments and compliance, thereby facilitating **100% uptime** during peak transactions.\nDeveloped ETL pipelines for ingesting financial data from internal and third-party sources using **Python**, **Apache Airflow**, and **Azure Data Factory**, supporting both batch and real-time processing, including the ingestion of financial data from **5** different sources.\nImplemented and deployed machine learning models for fraud detection using **scikit-learn**, **XGBoost**, and **Azure ML**, enabling proactive detection of suspicious activity based on user behavior and transaction patterns with a **95%** accuracy rate.\nCreated ML pipelines for real-time credit scoring, churn prediction, and transaction classification, leveraging **MLflow** and **Airflow** to integrate model inference into backend services, resulting in a significant reduction in processing time by **40%**."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "• Demonstrated **Technical Leadership** by designing and optimizing backend services for a global e-commerce platform using **Node.js (Express)**, ensuring high availability, low latency, and scalability across essential modules like checkout and order fulfillment.\n• Employed **JavaScript** in developing resilient web applications, enhancing user interaction and efficiency throughout the platform.\n• Leveraged **AWS** and **Azure** for scalable cloud infrastructure management, effectively supporting a high-traffic environment with over **100,000** daily users.\n• Applied **Serverless** architecture for deployment efficiency, significantly reducing costs and deployment time by up to **30%**.\n• Engineered real-time features utilizing **Kafka** for event-driven architecture, enabling responsive order updates and dynamic inventory tracking with less than **5 seconds** of latency.\n• Oversaw team management and collaboration, fostering a culture of **Proactivity** and **Empathy** that improved team engagement scores by **25%**.\n• Developed and maintained clean code documentation as part of best practices, ensuring maintainability and project cohesiveness across a team of **12** developers.\n• Engaged in problem-solving sessions that led to successful troubleshooting of efficiency issues, resolving **95%** of production incidents within the first hour.\n• Delivered thorough reviews and feedback on code via pair programming, cultivating a team-oriented approach that improved code quality and reduced technical debt by **40%**.\n• Ensured compliance with GDPR and security standards through implementation of role-based access control (RBAC) and **OAuth 2.0** protocols, securing user data effectively.\n• Utilized team orientation and strong communication skills in mentoring junior developers, contributing to their professional growth and enhancing overall team performance."
    }
  ],
  "skills": "**Programming Languages:**\n\tJavaScript/TypeScript\n\tPython\n\n**Backend Frameworks:**\n\tExpress\n\tFlask\n\tFastAPI\n\tDjango\n\n**Frontend Frameworks:**\n\tReact\n\tVue\n\tAngular\n\n**API Technologies:**\n\tNodeJS\n\tKeycloak (OIDC, RBAC)\n\tOAuth2\n\tJWT\n\n**Serverless and Cloud Functions:**\n\tAWS: Lambda\n\tAzure: App Services\n\n**Databases:**\n\tPostgreSQL (Fintech)\n\tMySQL (Healthcare)\n\tMongoDB (Gaming)\n\tRedis\n\n**DevOps:**\n\tDocker\n\tKubernetes\n\tGitHub Actions\n\tGitLab CI/CD\n\n**Cloud & Infrastructure:**\n\tAWS: ECS, RDS, S3\n\tAzure: Blob Storage, SQL Database\n\tTerraform\n\tAnsible\n\tHelm\n\tDocker Compose\n\n**Other:**\n\tTechnical Leadership\n\tTeam Management\n\tClean Code\n\tDocumentation\n\tProblem Solving\n\tProactivity\n\tEmpathy\n\tTeam Orientation\n\tEnglish Fluency",
  "apply_company": "Lumenalta"
}