{
  "name": "Tomasz Lee",
  "role_name": "Senior Cybersecurity Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Experienced Senior Cybersecurity Engineer with 9+ years of expertise in ISO 27001, ISO 42001, NIST, SOC 2, NIS2, and IEC 62443 frameworks. Proficient in Governance, Risk Management, and Compliance (GRC) strategies to ensure security best practices within software development life cycles. Skilled in integrating AI solutions into security operations, utilizing analytical skills to identify vulnerabilities and protect organizational assets. Known for building strong relationships across teams to foster collaboration and enhance security protocols. Previously specialized as a .NET Full Stack Developer with hands-on experience in **microservices architecture**, **Apache Kafka**, **RabbitMQ**, **Redis**, **ReactJS**, **NextJS**, **.NET**, **C#**, and **cloud services**. Proven track record of delivering robust and secure solutions while optimizing performance and streamlining development processes.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Senior Cybersecurity Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "• Ensured compliance with **ISO 27001**, **ISO 42001**, and **NIST** standards while spearheading security protocols for the web-based customer management platform.\n• Conducted risk assessments and implemented **SOC 2** and **NIS2** frameworks to enhance organizational security posture and improve incident response by **30%**.\n• Developed and maintained Governance, Risk, and Compliance (**GRC**) strategies to align with **IEC 62443** regulations while managing cybersecurity policies and procedures.\n• Leveraged **AI** technology for threat detection and prevention, increasing the effectiveness of security measures by **25%**.\n• Fostered strong relationships with cross-functional teams to enhance cybersecurity awareness and collaboration across departments, leading to a **20%** increase in security training participation.\n• Utilized analytical skills to monitor security metrics and derive actionable insights, ensuring continuous improvement in security measures.\n• Led initiatives to document security policies and procedures, ensuring alignment with industry best practices and standards.\n• Established and managed a comprehensive security audit program to evaluate adherence to security frameworks and protocols, reducing vulnerabilities by **40%**."
    },
    {
      "role": "Software Engineer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "- Ensured compliance with **ISO 27001**, **SOC 2**, and **NIST** standards in all cybersecurity initiatives, improving risk management by 20%.\n- Developed and maintained a robust **Governance, Risk and Compliance (GRC)** framework, facilitating the alignment of cybersecurity strategies with business objectives.\n- Implemented security best practices in cloud environments, resulting in a **30% reduction** of vulnerabilities across systems.\n- Conducted risk assessments and audits aligning with **ISO 42001** and **IEC 62443**, leading to a **15% increase** in overall security posture.\n- Strengthened relationship-building with stakeholders by defining cybersecurity requirements that enhanced collaboration in achieving business goals.\n- Leveraged **AI** technologies to analyze cybersecurity threats, improving detection rates by **25%**.\n- Employed analytical skills in monitoring and analyzing security events, resulting in the prompt identification of potential security breaches.\n- Collaborated with cross-functional teams to integrate cybersecurity measures from project inception to deployment, ensuring the sustainability of security practices.\n- Mentored junior cybersecurity professionals, enhancing the team's overall analytical capabilities and effectiveness.\n- Developed comprehensive security policies and procedures reflecting **NIS2** regulations, contributing to a company-wide culture of security awareness."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "• Implemented cybersecurity frameworks in compliance with **ISO 27001** and **SOC 2**, strengthening company policies and procedures by 30%.\n• Developed and maintained security controls based on **NIST** and **IEC 62443** standards, reducing vulnerability rates by 25%.\n• Led risk assessments and compliance initiatives for **NIS2** and **ISO 42001**, ensuring alignment with regulatory requirements.\n• Collaborated with cross-functional teams to establish a GRC (Governance, Risk Management, and Compliance) approach, improving audit readiness for 3 major assessments.\n• Conducted data analysis using AI tools, enhancing threat detection capabilities by 40%.\n• Fostered relationships with internal stakeholders and external auditors, resulting in improved communication and compliance efforts.\n• Delivered training sessions to staff on cybersecurity best practices, increasing awareness and adherence to protocols by 50%.\n• Maintained and updated technical documentation to reflect the changing compliance landscape, ensuring all materials were version **1.2** compliant.\n• Participated in regular security reviews and assessments, utilizing analytical skills to prioritize vulnerabilities and drive remediation strategies.\n"
    }
  ],
  "skills": "•\t**Programming Languages**\n\tJavaScript, TypeScript, C#, Python, Solidity\n\n•\t**Backend Frameworks**\n\tNodeJS, ExpressJS, NestJS, .NET, Entity Framework\n\n•\t**Frontend Frameworks**\n\tReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n•\t**API Technologies**\n\tRESTful API, GraphQL\n\n•\t**Serverless and Cloud Functions**\n\tAWS, Azure\n\n•\t**Databases**\n\tMSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB\n\n•\t**DevOps**\n\tCI/CD pipelines\n\n•\t**Cloud & Infrastructure**\n\tGRC, ISO 27001, ISO 42001, NIST, SOC 2, NIS2, IEC 62443\n\n•\t**Other**\n\tUX/UI Design, Git, GitHub, analytical skills, AI, relationship building, Messaging & Caching: Apache Kafka, RabbitMQ, Redis, Testing Tools: NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest, Blockchain: Ether.js, Web3.js, Ethereum",
  "apply_company": "KairosVector"
}