{
  "name": "Andrzej Ito",
  "role_name": "Senior Go Engineer",
  "email": "andrzej.ito@outlook.com",
  "phone": "+48 732 126 371",
  "address": "Rzeszów, Poland",
  "linkedin": "https://www.linkedin.com/in/andrzej-ito-2872a4391/",
  "profile_summary": "As a Senior Go Engineer, I possess extensive expertise in **Go**, **Node.js**, and **API** development, with over 9 years of experience in delivering scalable software solutions. My proficiency in **Docker**, **OAuth2**, **SAML**, and **SSO** ensures secure and efficient application management and user authentication. I excel in implementing **CI/CD** pipelines and utilizing **infrastructure-as-code** for optimal deployment practices. I am adept at **debugging**, **documentation**, and fostering effective **communication** across cross-functional teams. Additionally, I have a proven history of mentoring junior engineers and leading impactful projects aimed at enhancing user experience, performance, and innovation.",
  "education": [
    {
      "degree": "Bachelor of Science",
      "category": "Computer Science",
      "from_year": "2010",
      "to_year": "2014",
      "location": "Osaka, Japan",
      "university": "Osaka University"
    }
  ],
  "experience": [
    {
      "role": "Senior Go Engineer",
      "company": "Allegro.pl",
      "from_date": "08/2022",
      "to_date": "",
      "location": "Poznan, Poland",
      "responsibilities": "• Lead the development of key services within **Go** and **Node.js** cloud-based applications, focusing on API design and Microservices Architecture.\n• Designed and developed Hybrid Single Page Application using **React** 17, **Redux** 4.2.1, and **Node.js**, enhancing user experience through improved APIs.\n• Implemented **Docker** for seamless deployment and management of applications across dev/fqt and production environments.\n• Automated CI/CD pipeline processes using **Jenkins**, ensuring efficient code integration and deployment, significantly reducing deployment times by **30%**.\n• Experience in implementing authentication and authorization protocols such as **OAuth2**, **SAML**, and **SSO** for secure user access.\n• Developed user interfaces by utilizing **React HOC**, Flux/Redux for SPA development, and enhanced them using **module bundling** techniques.\n• Worked on UI layer using **Angular 14**, HTML5, CSS, and Bootstrap to create rich, user-interactive web pages, improving engagement by **25%**.\n• Hands-on experience with **Core Java** for performance optimization with Multithreading, Concurrency, and Data Structures, ensuring robust application performance.\n• Proficient with database management using Oracle, MySQL, MS SQL, and PostgreSQL, contributing to data integrity and performance across applications.\n• Engaged in thorough debugging and documentation processes, ensuring clarity in communication and project management across teams."
    },
    {
      "role": "Full Stack Developer",
      "company": "Paypay Corporation",
      "from_date": "05/2017",
      "to_date": "07/2022",
      "location": "Tokyo, Japan",
      "responsibilities": "• Developed and maintained APIs using **Node.js** to ensure seamless data communication within the application.\n• Implemented **Docker** to streamline deployment processes, enhance scalability and maintain consistent environments.\n• Collaborated with team members to leverage **OAuth2** and **SAML** for secure Single Sign-On (SSO) authentication.\n• Designed and developed user interfaces leveraging **React** 12, enhancing the user experience through dynamic components and efficient state management.\n• Established Continuous Integration and Continuous Deployment (CI/CD) pipelines to automate the workflow, reducing deployment time by **30%**.\n• Maintained comprehensive documentation of APIs and backend services, ensuring clarity and ease of use for developers.\n• Applied module bundling techniques for optimized application performance, utilizing frameworks such as **Webpack**.\n• Debugged applications rigorously, addressing issues efficiently to maintain high performance and reliability.\n• Communicated effectively with cross-functional teams to gather requirements and ensure alignment on project objectives.\n• Enabled infrastructure-as-code strategies to improve deployment consistency and traceability across development and production environments."
    },
    {
      "role": "Full Stack Developer",
      "company": "Fujitsu Ltd",
      "from_date": "06/2014",
      "to_date": "04/2017",
      "location": "Tokyo, Japan",
      "responsibilities": "• Developed and maintained APIs using **Go** to enhance backend functionality, ensuring high performance and reliability.\n• Designed and implemented **Node.js** applications for efficient server-side processes, focusing on REST services and CORS implementation.\n• Utilized **Docker** for containerization, streamlining deployment processes and ensuring consistency across environments.\n• Integrated **OAuth2** and **SAML** for secure authentication processes, emphasizing Single Sign-On (SSO) capabilities to improve user experience.\n• Implemented CI/CD pipelines to automate deployment processes, successfully reducing deployment time by **30%**.\n• Applied debugging techniques to troubleshoot and resolve issues, improving application uptime by **25%**.\n• Worked with **React** to develop dynamic user interfaces, converting Adobe Photoshop and Figma designs into semantic and efficient JSX components.\n• Collaborated on documentation practices to ensure clarity and maintainability of codebase, facilitating smoother team communication.\n• Managed infrastructure using **infrastructure-as-code** methodologies to enhance scalability and optimize resource usage across **AWS**, **Azure**, and **GCP** platforms.\n• Leveraged module bundling techniques to improve application performance, achieving load times reduced to under **2 seconds**."
    }
  ],
  "skills": " **Programming Languages** \n\t Java, C++, C#, Python, SQL, PLSQL, Kotlin, Go \n\n **Backend Frameworks** \n\t Spring, Spring Boot, Hibernate, Struts, JPA, Node.js \n\n **Frontend Frameworks** \n\t React, Vue, Angular \n\n **API Technologies** \n\t API, OAuth2, SAML, SSO, REST APIs, SOAP \n\n **Serverless and Cloud Functions** \n\t   \n\n **Databases** \n\t MS SQL Server, Oracle, MongoDB, Rabbit MQ, PostgreSQL, Redis \n\n **DevOps** \n\t Docker, CI/CD, infrastructure-as-code \n\n **Cloud & Infrastructure** \n\t   \n\n **Other** \n\t SOLID, DRY, LINQ, module bundling, debugging, documentation, communication, Microservices",
  "apply_company": "a leading global management consulting firm"
}