{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior AI Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "As a Senior AI Engineer with 8 years of experience, I specialize in harnessing **Python**, **TypeScript**, and AI methodologies, including **LLMs** and **prompt engineering**, to drive innovative solutions. My deep expertise in **DevOps** practices and **CI/CD** processes enhances my ability to deliver high-quality, scalable models efficiently. I have solid cloud proficiency with **Azure** and **AWS**, allowing me to deploy AI applications in versatile environments.\nI possess a robust background in full-stack development, effectively leveraging frameworks like **React**, **Node.js**, and **FastAPI** to build secure and compliant platforms. My experience extends to developing enterprise applications within the healthcare and financial sectors, ensuring adherence to standards such as HIPAA and PCI DSS. In addition, I excel in communication, ensuring cross-functional collaboration and alignment with stakeholders, while driving forward-thinking projects that integrate AI capabilities and intelligent automation.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior AI Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Utilized **Python** and **TypeScript** to build and optimize AI-driven healthcare solutions, with a strong focus on integrating **LLMs** for enhanced predictive capabilities and natural language processing tasks.\nDesigned and implemented **DevOps** practices, leveraging tools like GitHub Actions and CircleCI to streamline **CI/CD** pipelines for continuous integration and efficient deployment of AI models.\nDeveloped cloud-native applications using **Cloud** services such as AWS and Azure, ensuring scalable architecture and compliance with healthcare regulations.\nExecuted prompt engineering techniques to fine-tune AI models, improving the efficacy of real-time user interactions and data processing for healthcare applications.\nCollaborated cross-functionally with stakeholders to communicate AI project goals and progress, ensuring alignment with business objectives and effective resource allocation.\nArchitected scalable AI solutions to address complex healthcare challenges, driving innovation through the application of cutting-edge technologies including **FastAPI**, **Docker**, and **Kubernetes**.\nImplemented integrated CI/CD processes for AI/ML deployments using **Azure DevOps**, enhancing automation and reducing time to market by **30%**.\nConducted performance benchmarking and optimizations of machine learning models, resulting in efficiency improvements of over **25%** in processing time.\nBuilt interactive dashboards and visualizations to communicate insights derived from AI solutions, enabling stakeholders to make data-driven decisions effectively.\nFacilitated AI workshops and knowledge-sharing sessions, enhancing team skill sets on **DevOps**, **AI**, and machine learning best practices, fostering collaboration and innovation."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Utilized **Python** and **TypeScript** to design and implement AI-powered solutions, focusing on machine learning algorithms and models for financial applications.\nEngineered and deployed CI/CD pipelines leveraging **DevOps** practices to streamline development and operational workflows, ensuring consistent product delivery and quality.\nCollaborated across cross-functional teams, enhancing **communication** channels to ensure alignment on project goals and deliverables, resulting in a **30%** faster project completion time.\nEmployed cloud technologies to host and scale AI solutions, optimizing resource usage and operational costs within a corporate cloud environment.\nDeveloped advanced **LLMs** for processing and analyzing large datasets, improving the accuracy of financial predictions and insights.\nDesigned and implemented **prompt engineering** methodologies to enhance model responses, leading to a **25%** improvement in user engagement with AI-driven features.\nContributed to the integration of AI systems with existing platforms, enhancing the functionality and usability of financial products.\n"
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Utilized **Python** for backend service development, ensuring high reliability and efficiency in global e-commerce applications, while integrating **LLMs** for enhanced customer interactions and prompt responses.\nEmployed **TypeScript** to develop scalable and maintainable code, facilitating seamless communication between team members and stakeholders in the development process.\nAdvanced the CI/CD pipeline through the implementation of **DevOps** practices, significantly reducing deployment times by **30%** and enhancing code quality with automated testing strategies.\nIntegrated cloud services to improve scalability and performance, managing workload effectively across server instances and optimizing costs with usage tracking.\nLeveraged advanced AI techniques, including prompt engineering with **AI** models, to develop features enhancing user experience and product recommendations, leading to a **15%** increase in conversion rates.\nCollaborated cross-functionally to communicate technical requirements and project updates effectively, fostering a strong team synergy and improving project delivery timelines by **20%**.\nDesigned and its implemented backend microservices architecture for a robust e-commerce platform using **FastAPI** and **Django**, ensuring high availability and fault tolerance for over **1M** users.\nBuilt and optimized frontend components with **React (18)**, **Vue 3**, and **Angular**, focused on mobile responsiveness and fast load times, contributing to a **25%** uplift in user satisfaction scores.\nManaged comprehensive data storage solutions with **MongoDB** and **PostgreSQL**, supporting efficient data retrieval processes and ensuring data integrity under high-load conditions.\nImplemented security protocols, including role-based access control (RBAC) and **OAuth 2.0**, ensuring compliance with data protection regulations while maintaining seamless user access."
    }
  ],
  "skills": "**Programming Languages:**\n\tPython, TypeScript\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tN/A\n\n**Serverless and Cloud Functions:**\n\tAWS (Lambda), Azure (App Services)\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS (ECS, RDS, S3), Azure (Blob, SQL)\n\n**Other:**\n\tArtificial Intelligence, Machine Learning, MLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, CI/CD, communication, prompt engineering, LLMs",
  "apply_company": "Rounds"
}