{
  "name": "Mariusz Jan Skobel",
  "role_name": "Senior Backend Engineer",
  "email": "mariuszskobel15@outlook.com",
  "phone": "+48 735 343 548",
  "address": "Katowice, Poland",
  "linkedin": "https://www.linkedin.com/in/mariusz-skobel-927764397/",
  "profile_summary": "Seasoned Senior Backend Engineer with 10+ years of experience in delivering robust software solutions, specializing in **.NET**, **C#**, **ASP.NET Core**, **Web API**, and **Entity Framework**. Proficient in leveraging **SQL Server**, **PostgreSQL**, and **Oracle** for database management, ensuring data integrity and performance optimization. Experienced in utilizing **NUnit** for testing and validation, and adept at version control with **Git** and **SVN**. Strong background in developing scalable applications using **JavaScript**, **TypeScript**, and frameworks such as **Angular**. \nAdditionally, skilled in building and deploying microservices-based architectures and event-driven systems while maintaining compliance with industry regulations. Passionate about crafting efficient back-end solutions that drive significant business impact and enhance end-user experience.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2012",
      "to_year": "2015",
      "location": "UK",
      "university": "University of Bristol"
    }
  ],
  "experience": [
    {
      "role": "Senior Backend Engineer",
      "company": "EitBiz",
      "from_date": "Oct 2022",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Designed and developed robust APIs using **ASP.NET Core**, **C#**, and **Entity Framework**, ensuring high performance and scalability for backend services.\n• Implemented unit testing frameworks like **NUnit** and mocking libraries to enhance code quality and reliability through comprehensive test coverage.\n• Collaborated with front-end engineers to integrate responsive web applications leveraging **JavaScript**, **TypeScript**, and **Angular** emphasizing intuitive user interfaces and seamless data exchange.\n• Optimized database interactions with **MS SQL Server**, **PostgreSQL**, and **Oracle**, ensuring efficient data retrieval and manipulation for large-scale applications.\n• Managed version control of source code with **Git** and **SVN**, enabling consistent and organized code development practices.\n• Utilized **CSS** and **SASS** to create visually appealing and user-friendly layouts, maintaining adherence to modern web design principles.\n• Developed and deployed microservices architecture enabling independent scaling and development, ensuring maintainability and fault tolerance across distributed systems.\n• Programmed with secure coding practices to comply with industry standards and regulations such as HIPAA and GDPR, resulting in enhanced data protection and system security.\n• Facilitated code reviews and knowledge sharing sessions, mentoring junior developers to improve team performance and foster professional growth."
    },
    {
      "role": "Software Engineer",
      "company": "Tvn S.A.",
      "from_date": "Oct 2019",
      "to_date": "Sep 2022",
      "location": "Poland",
      "responsibilities": "Utilized **.NET** and **C#** to develop and modernize backend services, enhancing scalability and performance across financial platforms.\nDesigned and implemented robust **Web API** services and **ASP.NET Core/MVC** applications, reducing system response time by **30%** and improving user engagement on admin portals.\nConducted testing with **NUnit** and **Mock** frameworks to ensure code quality and reliability, achieving a **95%** pass rate in automated tests.\nManaged version control and collaborative code development using **Git** and **SVN**, leading to a **20%** reduction in deployment time through efficient CI/CD practices.\nCollaborated with front-end teams to integrate **TypeScript** and **JavaScript** frameworks like **Angular** and **React**, ensuring seamless communication between client and server-side applications.\nOptimized database performance with **MS SQL Server**, **PostgreSQL**, and **Oracle**, implementing complex queries that increased data retrieval efficiency by **40%**.\nEnsured high-quality UI implementation with **CSS** and **SASS**, contributing to the development of intuitive and responsive user interfaces.\nProvided mentorship to junior developers, sharing best practices in using modern backend technologies and fostering a collaborative work environment."
    },
    {
      "role": "Software Engineer",
      "company": "Timspark",
      "from_date": "Sep 2015",
      "to_date": "Aug 2019",
      "location": "UK",
      "responsibilities": "Developed and optimized backend services using **.NET** and **C#** for a high-performance web application, ensuring high availability, low latency, and scalability.\nImplemented robust **Web API** architectures with **ASP.NET Core** and **ASP.NET MVC**, enhancing system integration and improving service response times by **35%**.\nDesigned and executed unit testing strategies using **NUnit** and **Mock** frameworks, achieving over **90%** code coverage and significantly reducing production bugs.\nUtilized **MS SQL Server**, **PostgreSQL**, and **Oracle** for database management, ensuring efficient data storage and retrieval, resulting in a **25%** improvement in query performance.\nIntegrated **JavaScript** and **TypeScript** functionalities within the application, enhancing the interactivity of user interfaces and user experience by implementing **Angular** for responsive design.\nManaged version control and collaborative development using **Git** and **SVN**, leading to seamless feature incorporation and streamlined deployment processes.\nEnhanced frontend styling through the application of **CSS** and **SASS**, improving site visual appeal and user engagement metrics by **20%**.\nPerformed code reviews and mentored junior developers, fostering a culture of continuous improvement and technical excellence within the team.\n"
    }
  ],
  "skills": " **Programming Languages:**\n\tC#, .NET, JavaScript, TypeScript\n\n **Backend Frameworks:**\n\tASP.NET Core, ASP.NET MVC, FastAPI, Flask, Django, Entity Framework, Web API\n\n **Frontend Frameworks:**\n\tReact, Vue, Angular, DOM, CSS, SASS\n\n **API Technologies:**\n\tJWT, OAuth2, Keycloak (OIDC, RBAC)\n\n **Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda), Azure (App Services)\n\n **Databases:**\n\tPostgreSQL, MySQL, Oracle, MongoDB, Redis, MS SQL Server\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:**\n\tAWS (RDS, S3), Azure (Blob, SQL)\n\n **Other:**\n\tMLflow, Airflow, Kubeflow, Nginx, Certbot, NUnit, Mock, Git, SVN",
  "apply_company": "Creatio"
}