{
  "name": "Patryk Zaslawski",
  "role_name": "Staff Software Engineer",
  "email": "patrykzas0428@outlook.com",
  "phone": "+48669862402",
  "address": "Gdanski, Poland",
  "linkedin": "https://www.linkedin.com/in/patryk-zaslawski-6b04a8397/",
  "profile_summary": "As an expert Staff Software Engineer with 8+ years in software development, I excel in crafting high-performance solutions with a focus on **Ruby on Rails**, **Postgres**, and **performance optimization**. My experience includes building robust **data ingestion** and **reconciliation pipelines**, particularly in the fintech and taxtech domains. I have a proven track record of contributing to **open-source** projects, collaborating effectively within teams, and adopting an ownership mindset to ensure project success. I am also skilled in **async communication** and providing technical direction, which allows for clear communication of complex concepts. My background includes proficiency in managing full-stack components with an emphasis on system reliability and enhancement. Leveraging my knowledge of software engineering best practices, I am committed to delivering innovative solutions aligned with industry standards.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2014",
      "to_year": "2017",
      "location": "United Kingdom",
      "university": "The University of Manchester"
    }
  ],
  "experience": [
    {
      "role": "Staff Software Engineer",
      "company": "Binary Studio",
      "from_date": "Aug 2023",
      "to_date": "Present",
      "location": "United Kingdom (Remote)",
      "responsibilities": "Led the technical direction and architectural design of a high-performance, scalable application using **Ruby on Rails** and **Postgres**, enhancing data ingestion and reconciliation pipelines in the fintech and taxtech domains.\nFacilitated collaboration across cross-functional teams, ensuring clear communication and ownership mindset among team members in delivering key financial solutions by leveraging **Performance Optimization** techniques.\nDeveloped and maintained robust integrations for open banking and blockchain technologies within existing frameworks, aligning with industry standards and best practices in fintech.\nImplemented async communication strategies to improve application efficiency and responsiveness, actively contributing to open-source projects within the fintech space.\nManaged performance optimization efforts, achieving a **30%** reduction in transaction processing time through advanced querying techniques in **Postgres**.\nDesigned and executed reconciliation pipelines, leading to a **15%** increase in data accuracy and reliability while adhering to compliance standards.\nMentored and coached team members on best practices, fostering a culture of continuous improvement and professional growth within the engineering team.\nUtilized Git for version control and collaboration on codebases, ensuring streamlined contributions to open-source initiatives.\nDrove adoption of agile methodologies to enhance workflow efficiencies, resulting in a **25%** increase in project delivery speed.\nMonitored system performance and implemented scaling strategies to accommodate growing user bases and transaction volumes in a dynamic production environment."
    },
    {
      "role": "Software Engineer",
      "company": "Ardigen",
      "from_date": "Mar 2020",
      "to_date": "Aug 2023",
      "location": "Poland",
      "responsibilities": "• Led technical direction and performance optimization efforts, ensuring the delivery of scalable and efficient systems as a Staff Software Engineer.\n• Designed and implemented reconciliation pipelines using **Postgres** and achieving improvements in data accuracy by **30%** through enhanced data ingestion techniques.\n• Collaborated within cross-functional teams to develop fintech solutions, cultivating clear communication and ownership mindsets to align project objectives and timelines.\n• Contributed to open-source projects related to **Ruby on Rails** and **async communication**, fostering community engagement and knowledge sharing in the financial technology space.\n• Developed and maintained systems for open banking initiatives, integrating blockchain technologies to enhance transaction transparency and security.\n• Spearheaded the optimization of existing processes, resulting in a **25%** increase in overall system performance while facilitating seamless data reconciliation across platforms.\n• Engaged in open technology discussions and provided insights on the latest trends in taxtech and fintech to drive innovative solutions.\n"
    },
    {
      "role": "Software Engineer",
      "company": "Altum Software",
      "from_date": "Oct 2017",
      "to_date": "Feb 2020",
      "location": "United Kingdom",
      "responsibilities": "Developed and optimized backend services for fintech applications using **Ruby on Rails** and **Postgres**, enhancing performance and scalability of data ingestion and reconciliation pipelines.\nCollaborated closely with cross-functional teams to ensure clear communication and alignment on technical direction and project goals.\nLed initiatives in performance optimization, achieving a **20%** improvement in transaction processing times and **30%** reduction in query latency through effective database management and indexing strategies.\nActively contributed to open-source projects in fintech and taxtech domains, enhancing community tools and earning recognition for innovative solutions.\nImplemented async communication patterns to improve system responsiveness and user experience in taxtech workflows, ensuring efficient handling of simultaneous transactions.\nDesigned robust data ingestion strategies that streamlined processing of high-volume data for open banking applications, resulting in significantly improved data processing capabilities.\nPlayed a pivotal role in the design and implementation of secure APIs using **Ruby on Rails**, ensuring compliance with banking regulations and facilitating open banking functionalities.\nDemonstrated an ownership mindset in leading a project to migrate legacy systems to modern architectures, ensuring seamless integration of blockchain technologies for enhanced security and transaction reliability.\nMentored junior developers and fostered an environment of collaboration, enhancing team productivity and coding standards.\nExecuted load testing with modern tools, simulating up to **10,000** concurrent users to validate system resilience and stability under peak conditions.\nBuilt features that leverage advanced caching strategies with **Redis**, resulting in reduced load times by **50%** for frequently accessed financial data.\nCreated comprehensive technical documentation and presented findings on system performance and optimization strategies to stakeholders, ensuring transparency and guidance on future technical directions."
    }
  ],
  "skills": "**Programming Languages:**\n\tPython, Ruby\n\n**Backend Frameworks:**\n\tFastAPI, Django, Flask, Ruby on Rails, Spring Boot\n\n**Frontend Frameworks:**\n\tAngular (1–16), React (15–18), Next.js, Vue.js (2/3), Blazor\n\n**API Technologies:**\n\tREST & gRPC APIs\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda), Azure (App Services)\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD\n\n**Cloud & Infrastructure:**\n\tAWS (RDS, S3), Azure (Blob, SQL), Nginx\n\n**Other:**\n\tSQLAlchemy, Pydantic, Celery, JWT, OAuth2, Let’s Encrypt, Certbot, data ingestion, reconciliation pipelines, open-source contributions, taxtech, open banking, blockchain, async communication, performance optimization, collaboration, clear communication, ownership mindset, technical direction"
}