{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Webflow Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "As a skilled **Senior Webflow Engineer** with 8 years of experience, I excel in creating responsive designs and implementing web integrations utilizing **JavaScript**, **Svelte**, and **Webflow**. My proficiency in **Figma** ensures seamless design-to-development transitions, while my strong understanding of SEO practices helps deliver optimized web solutions. I possess a keen eye for **animations** and **microinteractions**, enhancing user experience and engagement.\nI have a solid background in full-stack development, applying modern tools like **React**, **Next.js**, and **Node.js** to build high-performance solutions, particularly in healthcare and financial sectors. My cloud knowledge with **Azure** and **AWS** enhances my ability to create scalable applications. Strong analytical skills enable me to leverage data insights effectively, ensuring that all projects align with industry best practices and standards.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Webflow Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Implemented responsive design principles and microinteractions to enhance the user experience on websites built using **Webflow**.\nUtilized **JavaScript** and **Svelte** to create dynamic and interactive website features, improving user engagement and site performance metrics by over **30%**.\nConducted SEO audits and integrated best practices into site architectures, resulting in a significant increase in organic traffic by **25%** over a **6-month** period.\nCollaborated on Figma designs to translate UI/UX concepts into fully functional web pages, adhering to project timelines and quality standards.\nIntegrated analytics tools to track user behavior and site performance, leveraging insights to optimize campaigns and improve conversion rates.\nExecuted site integrations with third-party tools and APIs, enhancing website functionalities and overall user experience.\nDesigned and developed animations for improved user interaction, contributing to a modern and engaging aesthetic for various web projects.\nLed cross-functional meetings to ensure alignment on project objectives and deliverables, enhancing team productivity and communication.\nEstablished best practices for version control and deployment processes to streamline development workflows across projects.\nProvided mentorship and training to junior engineers in responsive design techniques and **Webflow** functionalities, fostering a collaborative and skill-enhanced work environment."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Focused on developing responsive web applications using **Webflow** and **JavaScript**, ensuring accessibility and optimal UX/UI through modern design principles and **Figma** integration.\nUtilized responsive design techniques to optimize web layouts for various devices, resulting in a **25%** increase in user engagement and satisfaction scores.\nImplemented SEO best practices across all web platforms, achieving a **40%** improvement in organic search rankings and increasing site traffic.\nCollaborated on site integrations with third-party APIs to enhance functionality, ensuring seamless user experiences and efficient data flow across platforms.\nCreated and maintained microinteractions and animations, improving user interface responsiveness and interactivity, leading to a **30%** reduction in user drop-off rates.\nAnalyzed user behavior and site analytics to guide iterative design improvements, enhancing overall site performance metrics and contributing to informed decision-making.\nDemonstrated English proficiency in technical communication, facilitating effective collaboration with cross-functional teams to meet project deadlines and objectives."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Utilized **Webflow** to design and develop responsive e-commerce websites, effectively translating client requirements into engaging, dynamic layouts that align with UX best practices.\nCollaborated on responsive design projects focusing on UI/UX best practices, ensuring seamless user interactions across various devices.\nImplemented SEO strategies to enhance site visibility and organic traffic, utilizing analytics tools for performance tracking and optimization.\nCreated animations and microinteractions using **JavaScript** to improve user engagement and provide a polished user experience.\nDeveloped site integrations with third-party APIs, ensuring smooth functionality and enhanced features.\nDesigned visual mockups and prototypes using **Figma**, facilitating effective communication of design concepts to stakeholders.\nAnalyzed user behavior and feedback to continuously improve website performance and user satisfaction.\nEnsured cross-browser compatibility and adherence to accessibility standards, enhancing overall site usability (WCAG 2.1 compliant).\nWorked with a team to iterate on design elements based on A/B testing results, refining features for improved user engagement.\nCommunicated effectively in English to present design ideas and collaborate with international teams, fostering a productive work environment."
    }
  ],
  "skills": "{",
  "apply_company": "HKR"
}