{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Backend Developer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-karol-kotlinski-bb2520397/",
  "profile_summary": "As a Backend Developer with 8 years of experience, I excel in creating high-performance backend solutions utilizing **Kotlin**, **Spring Boot**, and **RESTful APIs** within an agile environment. My technical expertise extends to working with relational databases and **NoSQL databases**, ensuring data integrity and optimization. I am proficient in **AWS**, **Azure**, and **GCP** cloud services, along with containerization technologies like **Docker** and **Kubernetes**. I have a solid foundation in **continuous integration** and **continuous deployment** (CI/CD) best practices, actively contributing to the delivery of reliable and scalable applications.\nIn addition to my backend skills, I possess strong problem-solving abilities, attention to detail, and effective communication skills. My experience with **frontend build tools** and **testing frameworks** complements my backend capabilities, allowing for seamless integration and maintenance of solutions across healthcare and financial sectors. I am committed to aligning applications with compliance standards such as HIPAA, FHIR, PCI DSS, and SOC 2.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Backend Developer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Developed and maintained **RESTful APIs** for scalable backend systems, leveraging **Kotlin** and **Spring Boot** to ensure efficient data handling with **relational** and **NoSQL databases** like PostgreSQL and MongoDB.\n- Integrated **Git** for version control, ensuring collaborative development and streamlined deployment workflows, utilizing **continuous integration** and **continuous deployment** methodologies to enhance efficiency.\n- Architected microservices using **Docker** and **Kubernetes**, facilitating container orchestration for improved scalability and fault tolerance in cloud environments, particularly on **AWS** and **Azure**.\n- Collaborated in an **agile** environment, actively participating in sprint planning, daily stand-ups, and retrospectives to improve team communication and project delivery.\n- Enhanced web service performance and response times through effective problem-solving techniques and attention to detail in application design and execution.\n- Designed automated testing strategies using **testing frameworks** such as **JUnit** and **Mockito**, achieving over **95%** test coverage for critical code paths.\n- Implemented efficient data storage solutions through the use of advanced **frontend build tools** and optimized querying techniques.\n- Actively contributed to improving application quality through peer code reviews and team knowledge-sharing sessions focused on best practices in **web services** and agile methodologies.\n- Monitored system performance and reliability, achieving a **99.9%** uptime through proactive maintenance and troubleshooting strategies.\n- Delivered tailored backend solutions that supported complex frontend functionalities developed with **Angular** and related technologies.\n- Developed and maintained documentation for backend processes to facilitate understanding and on-boarding of new developers within the team."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Utilized **Spring Boot** and **Kotlin** to develop and maintain robust **RESTful APIs** for financial platforms, enhancing system reliability and improving performance metrics by **25%**.\nLeveraged **Docker** and **Kubernetes** for container orchestration and microservices deployment, achieving a **40%** reduction in deployment time through automated continuous integration and continuous deployment (CI/CD) practices.\nImplemented scalable back-end architectures with emphasis on agile methodologies, ensuring seamless integration with both **relational databases** and **NoSQL databases** for diverse data handling needs.\nCollaborated with front-end developers to design and integrate **Angular** components, improving user experience and driving engagement metrics upward by **30%**.\nMaintained version control and collaborative development practices using **Git**, fostering effective team communication and project management under agile frameworks.\nApplied **AWS**, **Azure**, and **GCP** cloud services for deploying and managing scalable software solutions, optimizing application performance across various platforms.\nEngaged in rigorous testing frameworks to ensure code quality, addressing issues proactively with significant attention to detail, resulting in a **15%** decrease in post-deployment bugs.\nDemonstrated strong problem-solving skills by swiftly identifying and resolving software defects, enhancing overall application stability.\n"
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Utilized **Kotlin** and **Spring Boot** to design and implement robust backend services for scalable applications, achieving **99.9%** uptime across all services.\nDeveloped and consumed **RESTful APIs** and **Web Services**, facilitating seamless integration between the frontend and backend systems, enhancing overall system interoperability.\nEnsured efficient data handling by leveraging **relational databases** like PostgreSQL and **NoSQL databases** such as MongoDB; achieved data retrieval times under **200ms** for high-traffic queries.\nImplemented **Docker** and **Kubernetes** for container orchestration, streamlining deployment processes and maintaining consistent development and production environments.\nAdopted **agile methodologies** to drive collaboration and delivery, resulting in a **30%** increase in team productivity and faster feature rollouts.\nExecuted **continuous integration** and **continuous deployment (CI/CD)** practices using **Git** to manage code repositories, ensuring reliable and efficient development cycles with **75%** success rates on initial deployments.\nEnhanced frontend capabilities with **Angular** to deliver dynamic, responsive user interfaces, which improved client-side performance metrics by **40%** across all pages.\nDemonstrated strong **problem-solving** and **attention to detail** skills by conducting thorough code reviews and optimizing existing codebases, resulting in a **20%** reduction in bug-related incidents after releases.\nCollaborated with cross-functional teams effectively, showcasing strong **communication skills**, which improved stakeholder engagement and project alignment.\nConducted rigorous testing using industry-standard **testing frameworks**, ensuring high-quality deliverables and compliance with project specifications."
    }
  ],
  "skills": "**Programming Languages:**\n\tPython, JavaScript, TypeScript, Kotlin\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django, Spring Boot\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tRESTful APIs, Web Services\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL), GCP\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis, relational databases, NoSQL databases\n\n**DevOps:**\n\tDocker, Kubernetes, Git, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS, Azure, GCP\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, agile methodologies, continuous integration, continuous deployment, testing frameworks, problem-solving, attention to detail, communication skills"
}