{
  "name": "Tomasz Lee",
  "role_name": "Senior Fullstack Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Results-driven Senior Full Stack Engineer with 9+ years of experience in designing and implementing scalable, high-performance applications. Proficient in **JavaScript**, **TypeScript**, **Node.js**, **React**, **Next.js**, and **NestJS**, with a strong grasp of database management using **PostgreSQL**. Experienced in building secure, maintainable application architectures, leveraging **GraphQL** for efficient data retrieval and **AWS** for cloud-based solutions. Expertise in **Kubernetes** for container orchestration, ensuring robust deployment and management of microservices architecture. Proven track record of optimizing performance and enhancing maintainability while leading cross-functional teams to success.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Senior Fullstack Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Utilized **JavaScript**, **TypeScript**, and **React** to develop a state-of-the-art web application, enhancing performance and maintainability based on user feedback, which improved user retention by **30%**.\nEngineered the backend using **Node.js** and **NestJS**, building a robust microservices architecture that supports high scalability and fault tolerance.\nSeamlessly integrated **PostgreSQL** for database management and optimized query performance, achieving a reduction in average response times by **25%**.\nLeveraged **GraphQL** for efficient data fetching, allowing for precise query capabilities that improved overall application performance by **20%**.\nImplemented security best practices and strategies, including JWT-based authentication, ensuring secure data transactions across the platform.\nDeployed applications on **AWS**, utilizing services like **EC2** and **S3**, contributing to a significant improvement in deployment efficiency and reliability.\nOrchestrated containers using **Kubernetes**, streamlining development processes and enhancing the scalability of applications.\nCollaborated with cross-functional teams to maintain a focus on performance optimization, resulting in an overall performance increase of **15%**.\nWorked closely with the design team to improve user interfaces, which directly contributed to an enhancement in user experience metrics.\n"
    },
    {
      "role": "Full Stack Developer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "Utilized **JavaScript** and **TypeScript** to design and develop interactive web applications, streamlining user interfaces with **React** and **Next.js**.\nImplemented a **Node.js** backend with **NestJS** to create RESTful and **GraphQL** APIs, enhancing real-time data access for applications.\nDeployed cloud solutions on **AWS**, ensuring high availability and scalability with **Kubernetes** for container orchestration.\nOptimized application performance by conducting thorough performance analysis, resulting in a **25%** improvement in load times and system responsiveness.\nMaintained **PostgreSQL** databases for efficient data management, optimizing queries and ensuring data integrity for improved access speed.\nCollaborated with cross-functional teams to define project requirements and establish development timelines, leading to an on-time project delivery rate of **95%**.\nCreated and implemented testing strategies to ensure code **maintainability** and **security**, significantly reducing vulnerabilities by **40%**.\nMentored junior engineers on best practices and coding standards, contributing to a **20%** increase in team output.\nImplemented CI/CD methodologies to streamline deployment processes, resulting in a **30%** reduction in production errors.\nUtilized third-party libraries and tools to enhance project functionality and user experience, driving a **15%** improvement in customer satisfaction."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "Utilized **JavaScript**, **TypeScript**, and **React** to develop interactive web applications, enhancing user engagement by **25%**.\nImplemented **Node.js** and **NestJS** for server-side development, ensuring high scalability and performance optimization for applications serving over **10,000** users.\nDesigned and maintained RESTful APIs using **GraphQL**, improving data retrieval efficiency by **30%** while maintaining security best practices.\nHandled database management with **PostgreSQL**, optimizing query performance which led to a **15%** reduction in response time for data requests.\nEmphasized code maintainability by enforcing clean coding standards and conducting regular code reviews within the team, resulting in a **40%** decrease in bugs reported post-deployment.\nEngaged in cloud service management using **AWS** and effective orchestration through **Kubernetes**, supporting deployment operations and enhancing reliability.\nContributed to improving application performance through profiling and debugging techniques to reduce load times significantly.\nCollaborated with cross-functional teams to integrate security measures into the development process, ensuring compliance with industry standards.\nProvided mentorship to junior developers, facilitating knowledge transfer and fostering a collaborative team environment.\nCreated comprehensive technical documentation for developed features, promoting better understanding and maintenance across the organization."
    }
  ],
  "skills": " **Programming Languages**\n\tJavaScript, TypeScript, Python\n\n**Backend Frameworks**\n\tNode.js, NestJS, ExpressJS, .NET\n\n**Frontend Frameworks**\n\tReact, ReactJS, Next.js, VueJS, NuxtJS, Angular, Flutter, Three.js, D3.js, Material UI, Chakra UI, TailwindCSS\n\n**API Technologies**\n\tRESTful API, GraphQL\n\n**Serverless and Cloud Functions**\n\tAWS, Azure\n\n**Databases**\n\tPostgreSQL, MongoDB, DynamoDB, CosmosDB, MSSQL Server, MySQL\n\n**DevOps**\n\tCI/CD pipelines, Kubernetes\n\n**Cloud & Infrastructure**\n\tAWS, Azure\n\n**Other**\n\tUX/UI Design, Git, GitHub, performance optimization, maintainability, security, Microservices, Apache Kafka, RabbitMQ, Redis, Testing Tools: NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest, Solidity, Ether.js, Web3.js, Ethereum",
  "apply_company": "Maze"
}