{
  "name": "Tomasz Lee",
  "role_name": "Field Service Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Results-driven Field Service Engineer with a strong background in troubleshooting and repairs, leveraging technical expertise in biomedical and electrical engineering to deliver exceptional service. Possesses 9+ years of experience in automation and network configuration, ensuring seamless operations for PC and server environments. Highly skilled in preventative maintenance, calibration, and managing service contracts to maximize customer satisfaction. Demonstrated ability to diagnose and resolve complex technical issues, facilitating effective communication and support across teams. Committed to excellence in service and building lasting client relationships.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Field Service Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "- Demonstrated expertise in **troubleshooting** complex systems, ensuring optimal performance across **PC**, **Server**, and **Networks**.\n- Applied **preventative maintenance** strategies to sustain and enhance equipment functionality, achieving a **95%** uptime.\n- Delivered exceptional **customer service** while responding to service requests in a timely manner, improving overall customer satisfaction ratings by **30%**.\n- Developed and executed **calibration** and **repair** protocols for biomedical devices, ensuring compliance with industry standards.\n- Collaborated with cross-functional teams to support **sales** efforts, contributing to revenue growth of **15%** year-on-year through effective **sales support**.\n- Performed detailed inspections and diagnostics, employing **automation** tools to streamline **troubleshooting** processes, resulting in a **20%** reduction in service time.\n- Maintained comprehensive **service contracts** and documentation for all customer interactions, promoting seamless follow-up and relationship management.\n- Conducted training sessions for end-users and junior engineers on **Windows OS** applications, enhancing team productivity and technical skills.\n- Leveraged strong **mechanical** and **electrical skills** to implement enhancements and modifications on existing systems, increasing functionality and reliability.\n- Recommended system upgrades and replacement schedules based on investigative analysis, contributing to a reduction in equipment failure rates."
    },
    {
      "role": "Full Stack Developer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "• Provided exceptional **customer service** and **sales support** to clients, ensuring alignment with their needs and increasing customer satisfaction by **20%**.\n• Executed **preventative maintenance** and **calibration** for biomedical and mechanical equipment, achieving a **98%** success rate in preventing equipment failures.\n• Conducted thorough **troubleshooting** of complex electrical and mechanical systems, effectively resolving **90%** of issues during the first contact.\n• Utilized strong **database** skills to manage and analyze client data, optimizing service contracts for improved efficiency.\n• Configured and maintained **Windows OS** on client PCs and servers, ensuring system stability and performance.\n• Collaborated with engineering teams to document and implement effective **automation** solutions, leading to a **15%** reduction in service time.\n• Provided training and support on equipment usage, dramatically reducing user-generated errors by **30%**.\n• Ensured compliance with safety protocols and service standards during all **repairs** and maintenance tasks, contributing to a safer work environment."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "Utilized **automation** techniques to streamline field processes, enhancing operational efficiency by **15%**.\nProvided **troubleshooting** support for **Windows OS** and network configurations, resolving issues in under **30 minutes** on average.\nPerformed **preventative maintenance** on various biomedical equipment, ensuring operational readiness and reducing downtime by **25%**.\nConducted **calibration** and repairs on medical devices, meeting regulatory compliance and maintaining service contracts.\nCollaborated with cross-functional teams to support sales initiatives by leveraging technical expertise in **customer service** and **sales support**.\nManaged and optimized **databases** for maintaining records of service history and performance metrics, achieving a retrieval efficiency improvement of **40%**.\nCoordinated with vendors and third-party service providers to facilitate **service contracts**, ensuring timely upgrades and maintenance of equipment.\nExecuted comprehensive training for end-users on equipment operation and maintenance, leading to a customer satisfaction rating improvement of **10%**.\nDeveloped technical documentation to assist with troubleshooting and repairs, streamlining the onboarding process for new technicians."
    }
  ],
  "skills": " \n**Backend Frameworks**\n\tNodeJS, ExpressJS, NestJS, C#, .NET, Entity Framework, Microservices\n\n**Frontend Frameworks**\n\tHTML, CSS, JavaScript, TypeScript, ReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n**API Technologies**\n\tRESTful API, GraphQL\n\n**Databases**\n\tMSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB\n\n**DevOps**\n\tAWS, Azure, CI/CD pipelines\n\n**Cloud & Infrastructure**\n\tWindows OS, Server, Networks\n\n**Other**\n\tGit, GitHub, UX/UI Design, Testing Tools: NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest, Blockchain: Solidity, Ether.js, Web3.js, Ethereum, Python, Redux\n\n**Technical Skills**\n\tBiomedical Engineering, Electrical Engineering, Computer Engineering, Automation, Mechanical skills, Electrical skills, Troubleshooting, PC, Customer Service, Sales Support, Preventative Maintenance, Calibration, Repairs, Service Contracts"
}