{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Frontend Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "As a proficient Senior Frontend Engineer with 8 years of experience, I excel in utilizing **React**, **TypeScript**, and **JavaScript** to create high-performance and accessible applications. My technical expertise includes performance optimization and integrating with tools like **CDN** and **Sentry** to enhance user experiences. I am committed to mentoring junior developers, fostering effective collaboration, and driving strategic thinking to solve complex problems efficiently.\n\nBeyond frontend development, I have a deep understanding of full-stack solutions with technologies like **Node.js**, **Next.js**, and **Flutter**. I also possess experience in cloud services such as **Azure** and **AWS**, and I've developed enterprise-grade platforms equipped with AI/ML capabilities for predictive analytics. My strong foundation in microservices architecture, compliance standards like HIPAA and PCI DSS, and CI/CD automation ensures that I deliver robust, secure applications that meet business needs.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Frontend Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Developed high-performance and accessible web applications using **React** (17-18) and **TypeScript**, ensuring outstanding user experiences and responsiveness by implementing performance optimization strategies.\n- Collaborated closely with cross-functional teams, employing strong **communication** and **collaboration** skills to design and execute engaging user interfaces while mentoring junior developers.\n- Implemented tracking and error monitoring with tools like **Sentry** for real-time performance enhancements, increasing user satisfaction and minimizing downtime by **30%**.\n- Devised and maintained effective caching strategies with a CDN to enhance application load times, decreasing page load latency by **25%**.\n- Conducted regular code reviews and fostered a culture of **mentoring** within the team, guiding developers in best practices for using **JavaScript** and **React** effectively.\n- Engaged in strategic thinking to solve complex user interface challenges, demonstrating **problem-solving** abilities that improved workflow efficiency by **15%**.\n- Spearheaded initiatives to ensure product accessibility, increasing compliance with ADA standards, thus expanding the user base for the web applications.\n- Integrated advanced testing methods using **Jest** and **Cypress**, achieving a test coverage of over **85%**, resulting in robust applications with fewer production issues.\n- Enhanced application architecture through innovative approaches that incorporated user feedback, showcasing a commitment to continuous improvement and user-centric design."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Focused on **React** (18), **TypeScript**, and **JavaScript** to develop high-performance and accessible user interfaces as a core competency in front-end application development.\nOptimized performance and accessibility for financial dashboards, implementing best practices that led to a **25%** increase in user engagement and a **30%** reduction in load times.\nMentored junior developers and fostered collaboration among cross-functional teams to enhance strategic thinking and problem-solving capabilities within the development process.\nLeveraged **CDN** for improved content delivery and site performance, ensuring seamless user experiences across platforms.\nImplemented monitoring solutions using **Sentry** to track and resolve front-end issues promptly, maintaining a high standard of code quality and user satisfaction.\nParticipated in code reviews and knowledge-sharing sessions to cultivate a culture of continuous improvement and teamwork, enhancing the overall development workflow."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Developed high-performance frontend applications using **React (18)** and **TypeScript**, optimizing user interfaces for speed and responsiveness, achieving a **30% improvement** in load times.\nImplemented performance optimization strategies including lazy loading and code splitting to enhance user experience, resulting in a **25% increase** in user engagement.\nEnsured accessibility compliance with WCAG 2.1 standards, leading to an enhanced user experience for diverse user demographics, achieving positive feedback from accessibility audits.\nMentored junior developers and facilitated knowledge sharing sessions, fostering a collaborative team environment and improving overall team performance.\nUtilized **JavaScript** to integrate with **CDN** for efficient content delivery and application performance enhancements, achieving a **20% reduction** in server response times.\nLeveraged **Sentry** for real-time error tracking and monitoring, enabling rapid response to application issues and maintaining high product quality.\nApplied strategic thinking and effective problem-solving techniques to identify areas for improvement in frontend architecture, contributing to continuous codebase enhancements.\nActively participated in team meetings and collaborated with cross-functional teams to align on project goals and timelines, enhancing communication within the team."
    }
  ],
  "skills": " \n**Programming Languages:**\n\tPython, JavaScript, TypeScript\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**API Technologies:**\n\t\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda), Azure (App Services)\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD\n\n**Cloud & Infrastructure:**\n\tAWS (RDS, S3), Azure (Blob, SQL), Terraform, Ansible, Helm, Docker Compose\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, CDN, Sentry, performance optimization, accessibility, mentoring, collaboration, strategic thinking, problem solving, communication",
  "apply_company": "Paddle"
}