{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Cloud Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "As a Senior Cloud Engineer with 8 years of experience, I have a strong foundation in **Azure**, **M365**, and **Identity** management, ensuring compliance and security across cloud services. My expertise includes hands-on experience with **PowerShell** for automation and administration, enabling efficient **migration** strategies and **architecture** for cloud solutions. I excel in implementing **Zero-Trust** security models, managing **MFA**, and supporting BYOD initiatives to enhance enterprise security posture.\n\nMy technical skills also extend to developing infrastructure as code (IaC) solutions and architecting **Azure Landing Zones** for scalable cloud environments. With a proven track record in **3rd-Level-Support**, I solve complex technical challenges to ensure smooth operation and security compliance.\n\nIn addition to cloud engineering, I am proficient in full-stack development utilizing **JavaScript/TypeScript**, **Python**, and **Flutter**. My experience spans frameworks like **React**, **Next.js**, **Node.js**, and **FastAPI**, complemented by a strong background in microservices architecture and CI/CD automation. I have successfully led projects in the healthcare and financial sectors, integrating AI/ML capabilities for predictive analytics and real-time data processing.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Cloud Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Ensured **Security** and **Compliance** of cloud solutions, including **Azure** services, by implementing **Zero-Trust** architecture and adhering to regulatory standards like GDPR and HIPAA.\n- Designed and maintained enterprise-level **Azure Landing Zones**, facilitating efficient **Migration** of applications while optimizing resource utilization and automation through **PowerShell** and Infrastructure as Code (IaC).\n- Developed and executed testing and assessment strategies for cloud infrastructure, focusing on **Identity** management, **MFA**, and user access controls while leveraging **Microsoft 365** (M365) services for enhanced security.\n- Collaborated on a **Proof of Concept (PoC)** for deploying and integrating **Exchange**, **Intune**, and **Autopilot** services into existing infrastructure to streamline user experiences and enhance device management capabilities across **BYOD** policies.\n- Provided **3rd-Level Support** for critical security incidents, utilizing **EDR**, **XDR**, and **SIEM** tools to monitor, analyze, and resolve security threats.\n- Implemented continuous monitoring and incident response strategies using cloud-native tools and services to ensure high availability and performance within deployed solutions.\n- Successfully migrated over **50 TB** of data to **Azure Cloud**, ensuring security and compliance throughout the process while minimizing downtime through careful planning and execution.\n- Established policies and procedures for ongoing assessment and auditing of cloud applications to ensure adherence to best practices in **Security** and **Compliance** in alignment with industry standards.\n- Supported the organization's cloud transformation initiatives through design and maintenance of secure, scalable architecture for multiple projects, enhancing productivity and collaboration."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "- Designed and implemented secure cloud infrastructures in **Azure**, ensuring compliance with security standards and **Zero-Trust** architecture principles, enhancing overall system integrity.\n- Led migration projects for **M365** services, providing strategic assessments and recommendations to streamline processes and improve operational efficiency while minimizing downtime.\n- Developed automation scripts using **PowerShell** for managing identities and enhancing compliance measures in enterprise environments.\n- Evaluated and deployed **EDR** and **SIEM** solutions to monitor and respond to security threats, reducing incident response time by **40%**.\n- Guided teams in creating and maintaining Azure Landing Zones, helping to establish a robust cloud framework and determining best practices for architecture and governance.\n- Collaborated on **3rd-Level-Support** for identity management solutions, resolving complex issues faster and improving user satisfaction.\n- Delivered Proof of Concept (PoC) projects for new security tools and workflows, leading to the successful adoption of cutting-edge technologies in the organization.\n- Conducted assessments of existing cloud architectures, providing recommendations for enhancements and compliance with security policies, leading to improved risk management.\n- Implemented **MFA** solutions and initiated **BYOD** policies to ensure secure access to corporate resources, increasing user compliance and satisfaction.\n- Participated in developing **Infrastructure as Code (IaC)** solutions, streamlining deployment processes and reducing operational overhead by **20%**."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "- Developed and implemented **Azure** solutions to enhance security and compliance for cloud environments, ensuring alignment with industry standards and reduced vulnerabilities.\n- Designed migration strategies for seamless transition to **Azure** services, leveraging **PowerShell** for automation and orchestration, resulting in a **40%** reduction in downtime during transitions.\n- Facilitated user identity management and security enhancements through **Identity** solutions, implementing **MFA** and **Zero-Trust** strategies to elevate user and data security.\n- Conducted comprehensive assessments of cloud architecture to ensure **Security** and **Compliance** with GDPR guidelines, achieving **100%** compliance in all evaluations.\n- Architected and managed deployment of **Intune** and **Autopilot** for device management, resulting in streamlined device provisioning across **3** locations.\n- Oversaw successful migrations of **Exchange** services to **M365**, improving collaboration and productivity for over **200** employees.\n- Led the implementation of **3rd-Level-Support** structures, enhancing incident response and resolution times by **30%** through optimized procedures.\n- Developed Proof of Concept (PoC) environments for **EDR** and **XDR** integrations, demonstrating increased threat detection capabilities and reducing false positives by **25%**.\n- Utilized **SIEM** solutions for monitoring cloud environments, ensuring rapid detection and response to security incidents across various platforms.\n- Advocated for **Azure Landing Zones** and Infrastructure as Code (**IaC**) practices, streamlining cloud resource management and provisioning, leading to a **50%** efficiency gain in resource allocation."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, JavaScript, TypeScript\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n **Frontend Frameworks:**\n\tReact, Vue, Angular\n\n **API Technologies:**\n\n **Serverless and Cloud Functions:**\n\tAWS Lambda, Azure Functions\n\n **Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:**\n\tAWS, Azure, Azure Landing Zones\n\n **Other:**\n\tMLflow, Airflow, Kubeflow, Keycloak, JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, M365, Identity, Security, Compliance, Exchange, Intune, Autopilot, PowerShell, Zero-Trust, Migration, MFA, BYOD, Assessment, Architecture, PoC, 3rd-Level-Support, EDR, XDR, SIEM, IaC",
  "apply_company": "SBIT AG"
}