{
  "name": "Andrzej Ito",
  "role_name": "Senior COBOL Engineer",
  "email": "andrzej.ito@outlook.com",
  "phone": "+48 732 126 371",
  "address": "Rzeszów, Poland",
  "linkedin": "https://www.linkedin.com/in/andrzej-ito-2872a4391/",
  "profile_summary": "As a Senior COBOL Engineer, I possess extensive expertise in **COBOL**, **JCL**, **DB2**, **CICS**, and **VSAM**, with over 9 years of experience in building and optimizing scalable software solutions. I am adept at Quality Control, Technical Documentation, and Process Improvement, ensuring high-quality outputs and adherence to industry standards. With strong communication skills and a keen attention to detail, I excel in mentoring junior engineers and leading cross-functional teams to deliver impactful projects. I prioritize training development and providing technical feedback to foster learning and innovation, all while maintaining effective time management to drive projects to successful completion.",
  "education": [
    {
      "degree": "Bachelor of Science",
      "category": "Computer Science",
      "from_year": "2010",
      "to_year": "2014",
      "location": "Osaka, Japan",
      "university": "Osaka University"
    }
  ],
  "experience": [
    {
      "role": "Senior COBOL Engineer",
      "company": "Allegro.pl",
      "from_date": "08/2022",
      "to_date": "",
      "location": "Poznan, Poland",
      "responsibilities": "• Improved process efficiency and quality control by applying best practices in **Technical Documentation** for COBOL applications, ensuring clarity and consistency.\n• Delivered training development sessions on **COBOL**, **JCL**, and **DB2**, enhancing team capabilities and knowledge transfer.\n• Provided technical feedback on code quality and compliance, leveraging attention to detail to maintain high programming standards.\n• Utilized strong **communication skills** to collaborate effectively with cross-functional teams, facilitating smooth project execution and timely completion.\n• Implemented process improvement strategies in **CICS** and **VSAM** environments, leading to enhanced system performance.\n• Managed time effectively across multiple projects, completing deliverables within **9** weeks and aligning with project milestones.\n• Conducted quality control reviews on legacy systems, ensuring adherence to organizational standards and protocols."
    },
    {
      "role": "Full Stack Developer",
      "company": "Paypay Corporation",
      "from_date": "05/2017",
      "to_date": "07/2022",
      "location": "Tokyo, Japan",
      "responsibilities": "• Utilized **COBOL** for legacy application development, ensuring high performance and reliability in processing large datasets.\n• Implemented quality control measures to improve software functionality and reduce bugs by **20%**.\n• Developed detailed technical documentation to assist in onboarding and training, enhancing team communication efficiency by **30%**.\n• Engaged in process improvement initiatives, successfully streamlining workflows and reducing redundancy.\n• Provided technical feedback to peers, fostering a collaborative environment and enhancing code quality.\n• Conducted training development sessions, increasing team proficiency and reducing onboarding time by **15%**.\n• Demonstrated exceptional attention to detail, which minimized errors and ensured adherence to project specifications.\n• Managed multiple tasks effectively under tight deadlines, maintaining high standards of code quality."
    },
    {
      "role": "Full Stack Developer",
      "company": "Fujitsu Ltd",
      "from_date": "06/2014",
      "to_date": "04/2017",
      "location": "Tokyo, Japan",
      "responsibilities": "Utilized **DB2** for database management and query optimization to enhance application performance by **30%**.\n• Developed and maintained COBOL programs, focusing on **CICS** for transaction processing, improving system reliability.\n• Ensured quality control through rigorous testing and documentation processes, resulting in a **20%** reduction in bugs and errors during deployment.\n• Designed and implemented technical documentation for software specifications, enhancing team understanding and facilitating knowledge transfer.\n• Delivered training development sessions for junior team members, promoting skills improvement and effective communication within the team.\n• Emphasized process improvement initiatives that streamlined workflows, leading to a **15%** increase in project efficiency.\n• Managed project timelines effectively, leveraging strong time management skills to meet deadlines consistently.\n• Provided technical feedback during code reviews, promoting best practices and enhancing overall code quality.\n• Maintained an attention to detail in all programming work, ensuring compliance with company standards and user requirements."
    }
  ],
  "skills": "Programming Languages:\n\tJava, C++, C#, Python, SQL, PLSQL, COBOL, JCL\n\nBackend Frameworks:\n\tSpring, Spring Boot, Hibernate, Struts, JPA\n\nFrontend Frameworks:\n\tNode.js, React, Vue, Angular\n\nAPI Technologies:\n\tSOAP, REST APIs, Microservices\n\nServerless and Cloud Functions:\n\t\n\nDatabases:\n\tMS SQL Server, Oracle, MongoDB, Rabbit MQ, PostgreSQL, Redis, DB2\n\nDevOps:\n\t\n\nCloud & Infrastructure:\n\t\n\nOther:\n\tQuality Control, Technical Documentation, Process Improvement, Training Development, Technical Feedback, Communication Skills, Attention to Detail, Time Management, SOLID, DRY, LINQ",
  "apply_company": "World Wide"
}