{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Frontend Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Senior Frontend Engineer with 13+ years of expertise in delivering high-performance applications, particularly in the healthcare and financial sectors. Proficient in **JavaScript**, **TypeScript**, and **React**, focusing on optimizing web performance and creating intuitive user interfaces. Experienced in system architecture and database design, ensuring robust and scalable solutions. Adept at frontend coding practices and leveraging Agile methodologies for efficient project execution. \n\nAdditionally, skilled in **Flutter** for mobile applications, and possess a strong foundation in backend technologies including **Node.js**, **FastAPI**, and **Django**. Proven ability to integrate AI/ML capabilities for enhanced functionalities while deploying cloud-native solutions on **AWS** and **Azure**. Committed to compliance with industry standards such as HIPAA and PCI DSS, and experienced in mentoring junior developers to foster a collaborative team environment.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Frontend Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Utilized **JavaScript** and **TypeScript** to develop high-performance web applications and optimize user interfaces ensuring seamless user experiences.\nDesigned and implemented responsive components using **React** (17–18) for dynamic user interactions in SaaS products.\nCollaborated with cross-functional teams in an **Agile** environment to define system architecture and enhance web performance across multiple deployments.\nExecuted advanced **Frontend coding** strategies to produce maintainable and scalable code, fostering a culture of **mentoring** within the development team.\nApplied effective **communication** skills to liaise with stakeholders for aligning project goals and ensuring deliverable quality.\nConducted thorough **problem-solving** exercises to address complex issues in database design and system optimization, improving application efficiency.\nDeveloped user-friendly interfaces through iterative testing and feedback, enhancing overall user satisfaction and engagement metrics by **30%**.\nPartnered with back-end teams to ensure robust API integration and efficient data handling, leading to a **20%** reduction in load times.\nChampioned the development and execution of UI/UX best practices, incorporating methods for optimizing web server performance and improving page responsiveness.\nMentored junior developers in leveraging **React** and **TypeScript** to improve their coding skills and ensure adherence to project standards."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "• Developed highly interactive user interfaces using **React (18)** and **TypeScript**, ensuring optimal web performance and a seamless user experience.\n• Designed and implemented scalable, efficient front-end architectures that align with SaaS principles, utilizing both **Next.js** and **Vue 3** for varied project requirements.\n• Conducted performance optimization for web servers, resulting in a **30% reduction** in loading times for critical components.\n• Mentored junior developers in front-end coding best practices and effective communication strategies, fostering a collaborative team environment.\n• Led the development of responsive admin panels using **Redux Toolkit** and **Tailwind CSS**, enhancing the user experience with modern design techniques.\n• Actively participated in agile development processes, facilitating effective problem-solving sessions to streamline workflows and improve team efficiency.\n• Utilized robust system architecture strategies to ensure maintainability and scalability of frontend applications.\n• Fostered strong communication lines between engineering teams and stakeholders to clearly define project requirements and deliverables."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "• Developed and optimized high-performance user interfaces using **JavaScript**, **TypeScript**, and **React (18)**, ensuring web performance and responsiveness for seamless user interactions.\n• Collaborated on system architecture to create scalable SaaS solutions, implementing best practices for database design and web server optimization.\n• Mentored junior developers in frontend coding standards and user interface design principles, fostering a culture of continuous improvement.\n• Engaged in Agile methodologies to deliver project milestones effectively, contributing to team communication and problem-solving initiatives.\n• Designed and implemented web performance strategies, achieving a **90%** or higher score on key performance metrics through adopted best practices.\n• Optimized frontend code for cross-platform functionality, demonstrating expertise in **HTML5/CSS3**, to enhance accessibility compliance (WCAG 2.1).\n• Facilitated improvements in user experience (UX) through rigorous testing and feedback loops, resulting in a **25%** reduction in customer complaints related to interface usability.\n• Drove initiatives for responsive design across various devices, leading to a **30%** increase in mobile user engagement and retention rates.\n• Assisted in the integration of modern JavaScript tools and libraries, utilizing frameworks like **Next.js** and applying state management tools like **Redux Toolkit** for a cohesive application experience."
    }
  ],
  "skills": " **Programming Languages:**\n\tJavaScript, TypeScript, Python\n\n **Frontend Frameworks:**\n\tReact, Vue, Angular\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n **API Technologies:**\n\tKeycloak (OIDC, RBAC), OAuth2, JWT\n\n **Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD\n\n **Cloud & Infrastructure:**\n\tAWS: ECS, Lambda, RDS, S3, Azure: App Services, Blob Storage, SQL Database\n\n **Other:**\n\tMLflow, Airflow, Kubeflow, Terraform, Ansible, Helm, Docker Compose, SaaS, Web performance, System architecture, Database design, Web server optimization, Frontend coding, User interfaces, Communication, Problem-solving, Mentoring, Agile",
  "apply_company": "PLAYTOMIC"
}