{
  "name": "Patryk Zaslawski",
  "role_name": "Senior Front Engineer",
  "email": "patrykzas0428@outlook.com",
  "phone": "+48669862402",
  "address": "Gdanski, Poland",
  "linkedin": "https://www.linkedin.com/in/patryk-z-9b9455391/",
  "profile_summary": "As a Senior Front Engineer with 8+ years of experience in software engineering, I excel in front-end development using **JavaScript**, **HTML**, **HAML**, and **SASS**. My strong foundation in **Agile** methodologies and best practices in **Clean Code** ensures efficient project management and code maintainability. I am proficient in **GitHub** for version control, emphasizing the importance of **Refactoring** and **Code Review** to deliver high-quality software solutions. Additionally, my background includes expertise in **Python** (FastAPI, Django, Flask, SQLAlchemy) and utilizing cloud platforms like **AWS** and **Azure**. I am committed to building secure and high-performing applications while adhering to industry standards.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2014",
      "to_year": "2017",
      "location": "United Kingdom",
      "university": "The University of Manchester"
    }
  ],
  "experience": [
    {
      "role": "Senior Front Engineer",
      "company": "Binary Studio",
      "from_date": "Aug 2023",
      "to_date": "Present",
      "location": "United Kingdom (Remote)",
      "responsibilities": "• Developed responsive and user-friendly front-end components using **JavaScript**, **HTML**, and **SASS**, enhancing user engagement across healthcare platforms.\n• Collaborated with cross-functional teams in an **Agile** environment, ensuring seamless integration between back-end services (Python microservices) and front-end applications.\n• Implemented best practices for **Clean Code** and **Refactoring** in all front-end code, resulting in a **30%** reduction in code complexity and increased maintainability.\n• Executed comprehensive **Code Review** processes to uphold quality standards across projects, enhancing collaboration and knowledge sharing among team members.\n• Leveraged **GitHub** for version control, effectively managing codebases and collaborating on shared projects with an average of **50+** pull requests per month.\n• Integrated **AI-tools** to optimize user experience on the front end, resulting in a **25%** increase in user satisfaction metrics.\n• Championed documentation and adherence to front-end development standards, leading to a **40%** improvement in team onboarding efficiency.\n• Utilized modern front-end frameworks, collaborating with back-end teams to improve architectural design and deployment speeds by **20%** through efficient workflows."
    },
    {
      "role": "Software Engineer",
      "company": "Ardigen",
      "from_date": "Mar 2020",
      "to_date": "Aug 2023",
      "location": "Poland",
      "responsibilities": "Focused on implementing front-end solutions using **JavaScript**, enhancing user experience through **HTML**, **HAML**, **SASS**, and modern frameworks while ensuring compliance with best practices in code quality and maintainability.\nEmployed **Agile** methodologies to streamline development cycles, foster collaboration, and improve project delivery timelines by **30%**.\nContributed to code quality through rigorous **Code Review** processes, ensuring adherence to **Clean Code** principles and maintaining a **95%** project completion rate without critical issues.\nLed refactoring initiatives to enhance existing codebases, significantly improving performance and scalability while reducing technical debt by **20%**.\nUtilized **GitHub** for version control, collaborating with cross-functional teams to implement effective versioning strategies that minimized integration conflicts.\nIntegrated AI-tools to improve development efficiency, adopting intelligent code suggestions and automated testing, leading to reduced regression bug rates by **15%**.\nApplied a rigorous approach to testing, including unit tests and integration tests to ensure reliable releases and rapid deployment cycles in line with CI/CD methodologies.\nPromoted knowledge sharing and mentorship within the team by leading workshops on **JavaScript** best practices and new technologies, fostering a continuous learning environment."
    },
    {
      "role": "Software Engineer",
      "company": "Altum Software",
      "from_date": "Oct 2017",
      "to_date": "Feb 2020",
      "location": "United Kingdom",
      "responsibilities": "Implemented **JavaScript** frameworks (React, Angular, Vue) to develop responsive and interactive frontends, ensuring a seamless user experience across devices.\nUtilized **HTML5**, **SASS**, and **HAML** to create mobile-friendly layouts, adhering to modern design standards and improving accessibility by **15%**.\nConducted code reviews and enforced **Clean Code** principles in all development processes, leading to a **20%** reduction in bugs and an improvement in overall code quality.\nEmployed **GitHub** for version control to manage project repositories and collaborate effectively with team members, ensuring consistency across various development environments.\nLed Agile development practices within the team to enhance project delivery speed, contributing to a **30%** increase in sprint velocity.\nImplemented **AI-tools** to streamline frontend development workflows, reducing repetitive tasks and increasing productivity by **25%**.\nRefactored legacy code to align with contemporary standards, improving maintainability and reducing technical debt by **40%**.\nUtilized **Version Control** systems to manage changes and track contributions, ensuring efficient collaboration among team members.\nDeveloped and optimized CI/CD pipelines to automate the deployment process, achieving reliable releases with **99%** uptime post-launch.\nCollaborated with cross-functional teams to integrate frontend applications with Python backends, enhancing overall system performance.\nProvided mentoring to junior developers in frontend technologies and best practices, fostering a culture of knowledge sharing and continuous learning."
    }
  ],
  "skills": "**Frontend Frameworks:**\n\tJavaScript, HTML, HAML, SASS, Angular (1–16), React (15–18), Next.js, Vue.js (2/3), Blazor\n\n**Backend Frameworks:**\n\tPython (FastAPI, Django, Flask), Spring Boot\n\n**API Technologies:**\n\tREST & gRPC APIs\n\n**Cloud & Infrastructure:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD\n\n**Other:**\n\tSQLAlchemy, Pydantic, Celery, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, AI-tools, Agile, Clean Code, Refactoring, Version Control, Code Review",
  "apply_company": "Gatekeeper"
}