{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Azure Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Senior Azure Engineer with a robust background in **Azure**, **Linux**, **Kubernetes**, and **Docker**, complemented by over 13 years of experience in full-stack development and IT infrastructure. Proficient in cloud services, ensuring high availability and reliability through SLA monitoring and effective change management. Proven ability to collaborate within teams and deliver documentation that aligns with customer support and predictive maintenance goals.\n\nEquipped with advanced problem-solving skills and bilingual proficiency in German and English, I also bring expertise in building high-performance applications in the healthcare and financial sectors. Specialized in deploying **cloud-native** systems and architectures, I have hands-on experience with **JavaScript**, **TypeScript**, **Python**, **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**. My work has involved leveraging AI/ML technologies for predictive analytics and automation, ingraining compliance with **HIPAA**, **FHIR**, **PCI DSS**, and **SOC 2** standards across development practices.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Azure Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Leveraged **Azure** cloud services to design and implement scalable solutions for managing IT infrastructure across healthcare and fintech domains.\n• Utilized **Kubernetes** and **Docker** for orchestrating containerized applications, ensuring high availability and efficient resource utilization.\n• Conducted **SLA Monitoring** to ensure compliance with service agreements while supporting **Change Management** processes to minimize downtime during deployments.\n• Collaborated with cross-functional teams to improve **customer support** initiatives, ensuring seamless integration of services while enhancing user experience.\n• Developed documentation practices that streamline workflows, promote **team collaboration**, and facilitate knowledge sharing across **Linux** environments.\n• Implemented predictive maintenance strategies in evolving solutions that capitalize on **IIoT** technologies to preemptively address system issues.\n• Resolved complex issues through advanced **problem solving** skills, effectively collaborating with stakeholders to find efficient solutions.\n• Provided support for both **German** and **English**-speaking clients, fostering better communication and understanding of technical concepts.\n• Designed and built full-stack platforms for healthcare and fintech using **Python** (**FastAPI**), **TypeScript**, and **Node.js**, paired with modern front-end frameworks like **React** (17–18), **Next.js**, and **Vue 3**, ensuring full compliance with HIPAA, FHIR, GDPR, PCI DSS, and SOX.\n• Delivered mobile applications for iOS and Android using **Flutter** and **React Native**, implementing native modules and managing state with Provider and Redux to support secure, real-time user interactions.\n• Created CI/CD pipelines tailored for mobile using **Fastlane** and **App Center**, incorporating test automation, release workflows, and crash analytics with **Firebase Crashlytics** and **Sentry**.\n• Led the transformation of legacy systems into microservices architectures, leveraging **Docker**, **Kubernetes** (AKS/EKS), and serverless functions via **AWS Lambda** and **Azure Functions** for fault-tolerant, scalable deployments.\n• Built and maintained data infrastructure using **PostgreSQL**, **MongoDB**, **Redis**, and **GraphQL**, designed to support heavy data ingestion and real-time analytics for both health and finance domains.\n• Deployed ML models for risk scoring, fraud detection, and document classification using **scikit-learn**, **PyTorch**, and **TensorFlow**, with backend inference integrated into live systems.\n• Implemented MLOps workflows using **MLflow**, **DVC**, and **Airflow**, managing model training, validation, and deployment pipelines across development and production.\n• Integrated intelligent features into frontend applications, such as personalized dashboards, predictive health alerts, and financial summaries, powered by models hosted on **Azure ML** and **AWS Sagemaker**.\n• Built DevOps pipelines using **GitHub Actions**, **CircleCI**, and **Azure DevOps**, with full test automation, linting, security checks, and multi-environment deployment workflows.\n• Developed advanced data visualization tools with **D3.js**, **Chart.js**, and **Power BI Embedded**, enabling real-time analysis of financial activity, fraud trends, and operational KPIs.\n• Collaborated closely with ML teams to deploy NLP models (**spaCy**, **Hugging Face Transformers**) for document parsing and anomaly detection, exposed through secured REST APIs.\n• Defined and enforced robust testing strategies across the stack using **Jest**, **Cypress**, **Postman**, and **PyTest** to cover unit, integration, E2E, and contract-level tests.\n• Integrated search capabilities with **Azure Cognitive Search** and **Elasticsearch**, supporting fast and flexible querying across structured and unstructured health and financial datasets."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Implemented and managed cloud services on **Azure**, ensuring high availability and scalability for IT infrastructure, driving performance improvements by **40%**.\nCollaborated with cross-functional teams for effective change management, enhancing service uptime and performance monitoring that improved SLA adherence by **25%**.\nUtilized **Docker** and **Kubernetes** for container orchestration, managing deployment processes for applications across **20+** servers, leading to more efficient resource utilization and streamlined workflows.\nDeveloped comprehensive documentation for cloud architecture and processes, facilitating better team collaboration and knowledge sharing among **15+** team members.\nEmploying predictive maintenance strategies to minimize downtime and ensure **99.9%** system availability by analyzing system logs and performance metrics.\nProvided exceptional customer support in both **German** and **English**, resolving technical issues for clients while maintaining a customer satisfaction rate above **90%**.\nInstalled and configured **Linux** environments for enhanced application performance, improving response times in backend services by **30%**.\nEngaged in proactive problem solving to identify bottlenecks in system performance, contributing to a **50%** reduction in issue resolution time."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Leveraged **Azure** services to deploy, manage, and optimize cloud infrastructure, ensuring high availability and scalability for IT systems.\nImplemented **Kubernetes** for orchestrating containerized applications using **Docker**, improving deployment efficiency and enabling seamless rollbacks during updates.\nMonitored and maintained SLAs by employing proactive troubleshooting strategies, demonstrating strong **Problem Solving** skills to address IT infrastructure challenges swiftly.\nCollaborated with cross-functional teams to ensure successful implementation of **IT Infrastructure** projects, enhancing team synergy through effective **Team Collaboration** techniques.\nDocumented system processes, architecture, and changes for clarity and compliance, leading to improved knowledge sharing and ongoing support.\nExecuted predictive maintenance strategies within **IIoT** frameworks to pre-emptively address potential failures, enhancing operational reliability and minimizing downtime.\nProvided customer support and training in both **German** and **English**, ensuring effective communication of technical solutions to clients and stakeholders.\nEngaged in **Change Management** processes to promote smooth transitions and minimize disruption during system upgrades or maintenance.\nDeveloped and improved **Documentation** practices for operational processes and system configurations, leading to enhanced team efficiency and knowledge retention.\n"
    }
  ],
  "skills": " **Programming Languages:**\n\tPython: FastAPI, Flask, Django\n\tJavaScript/TypeScript: React, Vue, Angular\n\n **Backend Frameworks:**\n\tNone\n\n **Frontend Frameworks:**\n\tNone\n\n **API Technologies:**\n\tNone\n\n **Serverless and Cloud Functions:**\n\tAWS: ECS, Lambda, RDS, S3\n\tAzure: App Services, Blob Storage, SQL Database\n\n **Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare)\n\tMongoDB (Gaming), Redis\n\n **DevOps:**\n\tDocker\n\tKubernetes\n\tGitHub Actions, GitLab CI/CD\n\tTerraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:**\n\tAzure\n\tCloud Services\n\tIT Infrastructure\n\tLinux\n\n **Other:**\n\tDocumentation\n\tSLA Monitoring\n\tPredictive Maintenance\n\tIIoT\n\tChange Management\n\tCustomer Support\n\tTeam Collaboration\n\tProblem Solving\n\tGerman\n\tEnglish",
  "apply_company": "ifm"
}