{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Angular Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "As a Senior Angular Engineer with 8 years of Full Stack Development experience, I have honed my skills in **Angular**, **TypeScript**, and **Tailwind**, focusing on designing responsive, mobile-compatible web applications. My background in Agile and Scrum methodologies facilitates seamless collaboration within cross-functional teams, ensuring efficient delivery and problem-solving throughout the development lifecycle.\nI possess a comprehensive technical skill set in **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**, complemented by extensive cloud experience with **Azure** and **AWS**. My expertise includes building high-performance solutions in healthcare and financial sectors, integrating AI/ML capabilities for predictive analytics and real-time data processing.\nAdditionally, I have a strong foundation in microservices architecture, event-driven systems, and CI/CD automation, ensuring the applications I develop are robust, secure, and compliant with standards such as HIPAA, FHIR, PCI DSS, and SOC 2. My hands-on experience also extends to developing machine learning pipelines and implementing MLOps workflows using **MLflow**, **Airflow**, and **Kubeflow**.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Angular Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Developed responsive, adaptive web applications utilizing **Angular** and **TypeScript**, ensuring a seamless user experience across devices.\n- Implemented mobile compatibility features and responsive web design principles to enhance accessibility and user engagement in applications.\n- Collaborated with cross-functional teams in an **Agile** and **Scrum** environment to deliver high-quality software products, meeting project deadlines and maintaining stakeholder satisfaction.\n- Engaged in problem-solving activities to identify and rectify issues, enhancing application performance and reliability.\n- Architected and developed scalable, full-stack healthcare and financial platforms using TypeScript and **modern front-end frameworks** including **React (17-18)**, **Next.js**, and **Vue (3.x)** while ensuring compliance with HIPAA, FHIR, GDPR, and financial regulatory standards (e.g., PCI DSS, SOX).\n- Led the re-architecture of monolithic applications into microservices-based ecosystems employing **Docker**, **Kubernetes (AKS/EKS)**, and serverless architectures (AWS Lambda, Azure Functions), enabling high availability and fault tolerance.\n- Integrated AI-based features into client-facing applications, such as smart financial dashboards and personalized health recommendations, powered by trained models and **APIs** hosted on **Azure ML** and **AWS Sagemaker**.\n- Established test strategies using **Jest**, **Cypress**, **PyTest**, and **Postman**, covering unit, integration, E2E, and contract testing across both front-end and backend services.\n- Delivered complex financial data visualization tools using **D3.js**, **Chart.js**, and **Power BI Embedded**, enabling real-time insights into transaction trends, fraud detection, and operational KPIs, ultimately boosting decision-making efficiency by **25%**."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Utilized **Angular** (latest version) and **TypeScript** to develop responsive web applications with a focus on **Responsive Web Design** and **Mobile Compatibility**, enhancing user experience and accessibility.\nApplied **Tailwind CSS** to create visually appealing and adaptive UI, ensuring optimal performance across all devices and screens.\nCollaborated in an **Agile** environment, participating in **Scrum** meetings and contributing to planning sessions to drive project success and meet deadlines effectively.\nLed problem-solving initiatives by optimizing application logic and workflow, directly impacting overall project efficiency by **20%**.\nImplemented best practices in collaboration with cross-functional teams, fostering a cooperative environment that improved project delivery speed by **15%**.\nMentored junior developers in **Angular** development and modern front-end technologies, enhancing team competency and cohesion.\nLeveraged strong analytical skills to troubleshoot and resolve complex web application issues, improving system uptime by **30%** through proactive maintenance.\n"
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Utilized **Angular** (versions 12+), **TypeScript**, and **Tailwind CSS** to design and develop responsive web applications, ensuring high performance and optimal **mobile compatibility**.\nApplied **Agile** methodologies and **Scrum** practices to lead development efforts, fostering collaboration across teams to meet project deadlines and deliver results successfully.\nEnhanced user experience through **responsive web design** techniques, ensuring accessibility compliance with WCAG 2.1 standards, particularly on mobile platforms.\nManaged and mentored junior developers, promoting **problem-solving** and collaborative workflows to improve team productivity and code quality.\nDesigned and optimized backend services for a global e-commerce platform, ensuring high availability, low latency, and scalability across key modules.\nIntegrated AI/ML-based recommendation engines to personalize product listings, improving conversion rates based on real-time behavioral data.\nImplemented feature flags and blue-green deployments, enabling controlled rollouts and risk mitigation during major platform updates.\nLeveraged modern development tools and libraries to streamline processes and enhance application performance across various environments."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, JavaScript, TypeScript\n\n**Frontend Frameworks:**\n\tAngular, React, Vue, Tailwind\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**API Technologies:**\n\tKeycloak (OIDC, RBAC), JWT, OAuth2\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda), Azure (App Services)\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD\n\n**Cloud & Infrastructure:**\n\tAWS (RDS, S3), Azure (Blob, SQL), Terraform, Ansible, Helm, Docker Compose\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, Agile, Scrum, ProblemSolving, Collaboration, ResponsiveWebDesign, MobileCompatibility, Let’s Encrypt, Nginx, Certbot",
  "apply_company": "Gizli"
}