{
  "name": "Tomasz Lee",
  "role_name": "Senior Test Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Detail-oriented Senior Test Engineer with 9+ years of experience in software quality assurance and testing, possessing advanced skills in **Git**, **Perforce**, **Xcode**, **Jenkins**, and **Bamboo**. Expertise in implementing testing strategies with a focus on compliance with **IEC 62304** and **ISO 14971** standards, and familiarity with FDA regulations. Proven track record of enhancing test processes and ensuring high-quality software releases. Strong analytical skills with demonstrated ability to work collaboratively across teams to ensure project success.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Senior Test Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Conducted comprehensive testing for iOS applications, ensuring compliance with **IEC 62304** and **ISO 14971** standards to enhance product safety and efficacy.\nUtilized **Python** for automated testing scripts, improving test coverage by **30%**.\nManaged version control using **Git** and **Perforce**, ensuring smooth collaboration within the development team.\nImplemented CI/CD processes with **Jenkins** and **Bamboo**, which accelerated the release cycle by **25%**.\nDeveloped and executed test plans and strategies to ensure products meet regulatory requirements set by the **FDA**.\nCollaborated with cross-functional teams to understand product requirements and deliver high-quality software iteratively.\nProvided detailed bugs and issues reports and performed root cause analysis leading to a **20%** decrease in critical bugs post-release.\nConducted performance and regression testing, facilitating a consistent user experience across all iOS platforms.\nChampioned the integration of automated testing tools to streamline tests, saving over **15 hours** per week in manual testing effort."
    },
    {
      "role": "Software Engineer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "- Executed rigorous testing and validation processes to ensure compliance with **IEC 62304** and **ISO 14971** standards, ultimately enhancing software quality in the medical domain.\n- Developed test scripts leveraging **Python** for automated testing, significantly increasing testing efficiency by **40%**.\n- Utilized **Git** and **Perforce** for version control in collaborative projects, maintaining code integrity and facilitating seamless integration of new features.\n- Designed and implemented CI/CD pipelines with **Jenkins** and **Bamboo**, which reduced the average deployment time by **25%**.\n- Conducted risk assessments in alignment with **FDA** regulations to mitigate potential flaws in the systems, improving product safety.\n- Collaborated with product managers and developers to accurately define testing requirements and timelines, leading to a **20%** increase in on-time project delivery.\n- Led training sessions and mentorship programs for junior testers, boosting team performance and increasing productivity by **15%**.\n- Performed both manual and automated testing across various platforms, ensuring comprehensive coverage of application functionality and performance."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "Utilized **Xcode** and **Python** for developing and executing test cases, ensuring compliance with **IEC 62304** and **ISO 14971** in medical device software.\nCollaborated with cross-functional teams to define test strategies and plans, reducing software defects by **30%**.\nImplemented version control using **Git** and **Perforce** to manage test scripts and resources, fostering better team collaboration with **95%** code integrity.\nConducted regression testing and validated software changes, adhering to **FDA** regulations for timely product releases.\nAutomated the testing process using **Jenkins** and **Bamboo**, decreasing testing time for releases by **40%**.\nEngaged in conducting risk analysis as mandated by **ISO 14971**, contributing to a comprehensive risk management process for product development.\nParticipated in daily standups and code reviews, ensuring alignment with project goals and maintaining high coding standards.\nDelivered detailed test reports and documentation to facilitate knowledge transfer among teams, improving onboarding processes for new engineers."
    }
  ],
  "skills": "**Programming Languages**\n\tPython, JavaScript, TypeScript\n\n**Backend Frameworks**\n\tNodeJS, ExpressJS, NestJS, C#, .NET, Entity Framework, Microservices\n\n**Frontend Frameworks**\n\tHTML, CSS, ReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n**API Technologies**\n\tRESTful API, GraphQL\n\n**Serverless and Cloud Functions**\n\tNone\n\n**Databases**\n\tMSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB\n\n**DevOps**\n\tAWS, Azure, CI/CD pipelines, Jenkins, Bamboo\n\n**Cloud & Infrastructure**\n\tNone\n\n**Other**\n\tUX/UI Design, Git, GitHub, Redux, Apache Kafka, RabbitMQ, Redis, Testing Tools: NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest, Blockchain: Solidity, Ether.js, Web3.js, Ethereum, iOS, Perforce, Xcode, IEC 62304, ISO 14971, FDA",
  "apply_company": "GlobalLogic"
}