{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Backend Engineer - Integrations",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-623a26390/",
  "profile_summary": "Backend Engineer with 13+ years of experience in API design and integrations, proficient in developing and optimizing high-performance applications. Skilled in **Kotlin**, **Coroutines**, **Docker**, **Kubernetes**, and REST/GraphQL API design, with a strong background in using **Linux** environments. Adept at creating robust backend solutions and implementing integration strategies that streamline data workflows and enhance system interoperability. Demonstrated ability to deliver projects in compliance with industry standards, leveraging experience in healthcare and financial sectors.\n\nFluent in English (C1) and German (B1), I also possess hands-on expertise in **JavaScript/TypeScript**, **Python**, and full development stacks like **Node.js** and **FastAPI**. My experience includes building AI/ML-powered applications and deploying cloud-native systems on **AWS** and **Azure** while ensuring effective CI/CD pipeline integration.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Backend Engineer - Integrations",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Designed and developed REST APIs and **GraphQL** endpoints, ensuring seamless integration of backend services with frontend applications using **Kotlin** and **Coroutines**.\n- Deployed and managed containerized applications on **Kubernetes** and **Docker**, optimizing resource usage and scalability during application deployment phases.\n- Collaborated on designing microservices architectures to enhance system reliability and maintainability, with a focus on **API design** and integration strategies.\n- Developed robust backend solutions that supported data retrieval and manipulation for real-time applications in health and finance domains using **PostgreSQL** and **Redis**.\n- Implemented continuous integration and delivery pipelines with automated testing in place to maintain high code quality and reliability across development and production environments.\n- Conducted system performance testing and optimization, achieving a **30%** reduction in response times for high-traffic APIs compared to previous implementations.\n- Established strong documentation practices, ensuring all endpoints and services were well-defined for internal and external stakeholders, facilitating smoother onboarding for new developers.\n- Enhanced coding standards and practices by integrating security tools into build processes, with a focus on maintaining compliance with industry standards.\n- Provided mentoring and guidance to junior developers on best practices in using **Kotlin**, **Linux**, and container orchestration tools, fostering a collaborative learning environment.\n- Leveraged international communication skills in **English (C1)** and **German (B1)** to facilitate collaboration with diverse teams across different regions."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "- Designed and developed high-performance REST and GraphQL APIs using **Kotlin** and **Coroutines**, ensuring seamless integrations with various financial platforms.\n- Implemented containerization solutions using **Docker** and orchestrated microservices with **Kubernetes** to enhance deployment efficiency and scalability across environments.\n- Streamlined backend processes and optimized server performance on **Linux** platforms, achieving a 30% reduction in response time for API calls.\n- Collaborated on multi-lingual documentation and technical specifications, utilizing **English (C1)** and **German (B1)** proficiency to ensure clear communication across teams.\n- Developed and maintained integrations with third-party services, ensuring secure and efficient data exchange, ultimately supporting financial transactions nearing **1 million** activities per month.\n- Utilized advanced monitoring tools to achieve a 99.9% uptime, ensuring that the backend services are robust and reliable for business-critical applications.\n- Participated in design reviews and contributed to API design strategies that reduced technical debt by **15%**, improving overall code maintainability and scalability."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "- Designed and optimized backend services for integration solutions using **Kotlin** and **Coroutines**, focusing on efficient API design with **REST** and **GraphQL**, ensuring high performance and scalability for various integrations.\n- Developed microservices architecture deployed in **Docker** containers, orchestrated with **Kubernetes**, facilitating seamless deployments and management across different environments.\n- Conducted performance tuning and troubleshooting on **Linux** servers, achieving a reduction in latency by **35%** and ensuring high availability for all backend integrations.\n- Collaborated with frontend teams to provide well-documented APIs, enhancing integration processes and reducing onboarding time for new developers by **25%**.\n- Implemented CI/CD pipelines for automated testing and deployment processes, reducing deployment times from **3 hours** to **30 minutes**.\n- Ensured compliance with industry standards and best practices in API security, incorporating adequate measures for data protection and encryption.\n- Provided support and integration solutions across different platforms, improving cross-functional team collaboration and efficiency by utilizing clear communication in **English (C1)** and **German (B1)**."
    }
  ],
  "skills": " **Programming Languages:**\n\tKotlin, Python, JavaScript/TypeScript\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tAPI design, REST, GraphQL\n\n**Serverless and Cloud Functions:**\n\tAWS: Lambda, Azure: App Services\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, CI/CD & Infrastructure as Code: Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS: ECS, RDS, S3, Azure: Blob Storage, SQL Database\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, Linux, English (C1), German (B1), Keycloak (OIDC, RBAC), OAuth2, JWT, Nginx, Let’s Encrypt, Certbot"
}