{
  "name": "Mariusz Jan Skobel",
  "role_name": "Senior Project Engineer",
  "email": "mariuszskobel15@outlook.com",
  "phone": "+48 735 343 548",
  "address": "Katowice, Poland",
  "linkedin": "https://www.linkedin.com/in/mariusz-skobel-927764397/",
  "profile_summary": "Senior Project Engineer with 10+ years of experience in healthcare software solutions and a strong command of **HL7**, **ETL**, **SQL**, and **Oracle**. Proficient in integrating laboratory information systems and optimizing performance for critical healthcare applications. Skilled in leveraging **Windows**, **IIS**, and **Citrix** for secure deployments, with expertise in **Virtualization** and **VMware** to enhance system reliability and scalability. Demonstrated ability to solve complex problems in fast-paced environments while ensuring compliance with industry regulations.\n\nAs a Full Stack Developer, I possess hands-on experience with **JavaScript/TypeScript**, **Python**, **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**, consistently delivering high-performance software solutions in both healthcare and finance sectors. Experienced in building and deploying cloud-native applications on **Azure** and **AWS**, I have led the development of enterprise platforms that incorporate AI/ML capabilities. My strong background in microservices architecture and CI/CD automation emphasizes secure and maintainable solutions, driving real-world impact through efficient and innovative design.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2012",
      "to_year": "2015",
      "location": "UK",
      "university": "University of Bristol"
    }
  ],
  "experience": [
    {
      "role": "Senior Project Engineer",
      "company": "EitBiz",
      "from_date": "Oct 2022",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "•\tManaged and optimized ETL processes using **Oracle** and **Firebird** for efficient data flow in Healthcare project implementations, ensuring compliance with HL7 standards for seamless information exchange.\n•\tDeveloped and integrated SQL queries for Laboratory Information Systems, enhancing data accessibility and reporting capabilities in line with regulatory requirements in healthcare.\n•\tImplemented virtualization solutions using **VMware** to improve resource management and deployment efficiency across multiple environments in healthcare settings.\n•\tDirected communication strategies and fostered teamwork among cross-functional teams to solve complex project challenges related to **Healthcare** technology solutions.\n•\tConducted root cause analysis on system failures and implemented robust problem-solving methodologies to enhance system uptime and service reliability.\n•\tOptimized performance of Windows servers and IIS configurations for improved application delivery and security compliance in healthcare applications.\n•\tUtilized networking skills involving TCP/IP protocols to ensure secure and reliable data transmission across systems and devices in healthcare environments.\n•\tLed the deployment of business intelligence (BI) tools to visualize laboratory data and improve operational efficiency, generating insights to drive decision-making processes.\n•\tSpearheaded the use of Citrix and Terminal Services to facilitate remote access to critical laboratory systems, enhancing operational continuity and flexibility.\n•\tCollaborated with teams to implement Unix-based systems for enhanced performance in backend processing of healthcare data.\n"
    },
    {
      "role": "Software Engineer",
      "company": "Tvn S.A.",
      "from_date": "Oct 2019",
      "to_date": "Sep 2022",
      "location": "Poland",
      "responsibilities": "Utilized **ETL** processes to facilitate data ingestion and integration for Laboratory Information Systems, enhancing data accessibility and reporting accuracy within the healthcare domain.\nDeveloped and maintained secure databases using **Oracle** and **Firebird**, ensuring data integrity and compliance with industry standards in healthcare applications.\nImplemented communication protocols over **TCP/IP** to optimize data transfer processes and improve integration with various health information systems and devices.\nCollaborated with cross-functional teams to identify and resolve problems, fostering effective **teamwork** and leveraging proactive **problem-solving** strategies to enhance project delivery.\nPerformed virtualization solutions using **VMware** to consolidate IT resources, increase efficiency, and reduce operational costs in lab environments.\nContributed to developing **BI** solutions that transformed complex datasets into insightful analytics, supporting clinical decision-making and strategic planning.\nInterfaced with Citrix and **Terminal Server** technologies to ensure seamless access to laboratory applications for end-users, enhancing their productivity and experience.\nLeveraged **Windows** and **Unix** systems to optimize system performance and security across laboratory systems, driving operational excellence in healthcare settings."
    },
    {
      "role": "Software Engineer",
      "company": "Timspark",
      "from_date": "Sep 2015",
      "to_date": "Aug 2019",
      "location": "UK",
      "responsibilities": "Utilized **SQL** and **Oracle** for effective ETL processes, ensuring data integrity and smooth integration for laboratory information systems.\nCollaborated effectively with cross-functional teams, leveraging strong **communication** skills and **teamwork** to enhance project deliverables in a fast-paced healthcare environment.\nDesigned and developed innovative solutions for laboratory management using **GestLab** and **Firebird**, improving operational efficiency by up to **30%**.\nApplied **Windows** and **Unix** environments, optimizing systems for performance, and ensuring seamless operation of laboratory systems across **TCP/IP** networks.\nImplemented virtualization technologies like **VMware** to enhance system reliability and resource optimization, supporting cost-effective infrastructure management.\nManaged internal and external communications for project progress updates, employing **problem-solving** techniques to address bottlenecks and enhance team collaboration.\nUtilized **Citrix** and **Terminal Server** for remote management of laboratory systems, improving user accessibility and experience.\nConducted training sessions on **HL7** standards and laboratory workflows, ensuring all team members understood system integrations and data communication protocols.\nMonitored and evaluated key performance metrics leveraging **BI** tools, leading to data-driven decisions that enhanced laboratory operations and reporting accuracy."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, JavaScript, TypeScript\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n **Frontend Frameworks:**\n\tReact, Vue, Angular\n\n **API Technologies:**\n\tHL7, JWT, OAuth2\n\n **Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda), Azure (App Services)\n\n **Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis, Oracle, Firebird, SQL\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible\n\n **Cloud & Infrastructure:**\n\tAWS (RDS, S3), Azure (Blob, SQL), Virtualization, VMware\n\n **Other:**\n\tMLflow, Airflow, Kubeflow, GestLab, ETL, Communication, Teamwork, Problem-Solving, Authentication & Security (Keycloak, Nginx, Certbot), Windows, IIS, TCP, IP, Citrix, Terminal Server, Unix, BI, Laboratory Information Systems, Healthcare",
  "apply_company": "Clinisys"
}