{
  "name": "Tomasz Lee",
  "role_name": "Senior Hardware Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Results-driven Senior Hardware Engineer with 9+ years of experience in **analog design**, **digital design**, and **mixed signal design**. Proficient in **PCB layout**, **EMC troubleshooting**, and experienced with **wireless protocols** including **BLE**, **WiFi**, and **5G**. Skilled in **FPGA** and **CPLD** development, as well as **SOM** and **COM** integration for complex projects. Demonstrated expertise in **AC/DC power supply design**, **high power circuits**, and **embedded software** programming using **C** and **C++**. Known for strong problem-solving abilities and analytical skills, facilitating optimal project scheduling and production implementation. Proven track record of collaboration across teams and leading projects to successful completion, leveraging strong English communication skills for cross-functional coordination.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Senior Hardware Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Designed and developed **mixed signal design**, ensuring stability and performance across high power circuits within the hardware architecture.\nLed the **PCB layout** process, effectively optimizing circuit pathways and reducing production costs by **15%** through streamlined design choices.\nImplemented **EMC troubleshooting** strategies to enhance product compliance, resulting in a **30%** decrease in field failures.\nUtilized **FPGA** and **CPLD** technologies to create flexible digital systems, expanding capabilities across various applications.\nDeveloped systems compatible with **wireless protocols** including **WiFi**, **BLE**, and **5G**, achieving enhanced connectivity for the end-user products.\nManaged **project scheduling** and **production implementation**, ensuring projects were delivered within agreed timelines, improving team efficiency by **25%**.\nEmployed **AC/DC power supply design** principles in product development, achieving power efficiency gains of up to **20%**.\nCollaborated with cross-functional teams to resolve complex problems, significantly enhancing product performance and reliability.\nProduced embedded software in **C** and **C++**, ensuring robust operation of hardware components.\nPerformed **DFM** and **DFT** analyses to ensure manufacturability and testability of all designs, leading to a **10%** reduction in rework during production.\nDemonstrated strong **analytical skills** and problem-solving capabilities to troubleshoot and resolve design issues swiftly. \nEffectively communicated in **English** with international teams to ensure alignment on project goals and expectations."
    },
    {
      "role": "Software Engineer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "Led the design and development of **analog and digital circuits** for high-performance performance, ensuring adherence to customer specifications and regulatory standards.\nExecuted **mixed signal design** projects, improving device performance metrics by 20% through innovative design strategies.\nOversaw **PCB layout** design and implementation, achieving a first-pass yield of over 90% during production.\nCompleted **EMC troubleshooting** assessments, successfully resolving compliance issues in 3 major projects, thus enhancing product reliability.\nDeveloped and tested **FPGA** and **CPLD** solutions for various applications, leading to a reduction in design time by up to 30%.\nIntegrated **RF** and **wireless protocols** such as **BLE** and **WiFi**, achieving seamless communication capabilities in devices with a 99% connection stability rate.\nEngineered **5G** compatible systems, contributing to the development of next-gen communication technologies.\nDesigned **AC/DC power supply** solutions for embedded systems, enhancing efficiency and reducing energy costs by 15%.\nCollaborated in full lifecycle **embedded software development** processes using C and C++, ensuring robust product performance.\nUtilized **Yocto Linux** for custom embedded system boots, achieving quicker time-to-market in 2 product lines.\nManaged project scheduling and production implementation, maintaining a 100% on-time delivery rate over the last 5 projects.\nApplied strong problem-solving and analytical skills to troubleshoot complex designs, leading to a decrease in failure rates by 25%.\nConducted English language training sessions for technical documentation, improving team communication and understanding of designs."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "• Designed and developed **analog** and **digital circuits** for embedded systems, ensuring compliance with project specifications and enhancing functionality by **15%**.\n• Executed **PCB layout** and **mixed signal design** for RF applications, optimizing performance under various wireless protocols including **BLE**, **WiFi**, and **5G**.\n• Conducted thorough **EMC troubleshooting** to ensure product reliability and minimize interference, achieving **100% compliance** with industry standards.\n• Implemented **FPGA** and **CPLD** solutions for complex processing tasks, improving processing speeds by **30%**.\n• Developed **AC/DC power supply designs** and high power circuits to support robust embedded applications, achieving efficiency ratings of over **90%**.\n• Collaborated in project scheduling and production implementation, meeting **100%** of deadlines while maintaining quality.\n• Leveraged **Yocto Linux** for embedded software development, enhancing system integration and boot-up times by **25%**.\n• Applied analytical skills to diagnose and resolve design issues, ensuring project milestones are met without compromising quality standards.\n• Facilitated effective communication across team members in English, enhancing cross-disciplinary collaboration and project outcomes."
    }
  ],
  "skills": "  **Programming Languages**\n\tC, C++, Python, JavaScript, TypeScript\n\n  **Backend Frameworks**\n\tNodeJS, ExpressJS, NestJS, C#, .NET, Entity Framework, Microservices\n\n  **Frontend Frameworks**\n\tHTML, CSS, ReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n  **API Technologies**\n\tRESTful API, GraphQL\n\n  **Serverless and Cloud Functions**\n\tAWS, Azure\n\n  **Databases**\n\tMSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB\n\n  **DevOps**\n\tCI/CD pipelines\n\n  **Cloud & Infrastructure**\n\tYocto Linux\n\n  **Other**\n\tUX/UI Design, Git, GitHub, Blockchain, Solidity, Ether.js, Web3.js, Ethereum, Apache Kafka, RabbitMQ, Redis, Testing Tools (NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest), problem solving, analytical skills, project scheduling, production implementation, English, EMC troubleshooting, analog design, digital design, mixed signal design, PCB layout, FPGA, CPLD, SOM, COM, RF, wireless protocols, BLE, WiFi, 5G, AC/DC power supply design, high power circuits, embedded software",
  "apply_company": "Etteplan"
}