{
  "name": "Patryk Zaslawski",
  "role_name": "MLOps Engineer",
  "email": "patrykzas0428@outlook.com",
  "phone": "+48669862402",
  "address": "Gdanski, Poland",
  "linkedin": "https://www.linkedin.com/in/patryk-zaslawski-6b04a8397/",
  "profile_summary": "As an accomplished MLOps Engineer with 8+ years in software engineering, I possess a robust expertise in **MLOps** practices, leveraging technologies like **MLflow**, **Airflow**, **Prefect**, **Docker**, **Kubernetes**, and **AWS** to design and implement high-performance machine learning solutions. Proficient in **Python** (including **FastAPI**) and skilled in **CI/CD** pipelines using **GitHub Actions** and **Jenkins**, I emphasize seamless integration and deployment of machine learning models. My experience extends to monitoring and observability using tools like **Prometheus** and **Grafana** for enhanced system reliability. Additionally, I excel in data engineering and managing **Model Registries**, ensuring efficient data workflows through collaboration and clear communication. My previous roles have honed my ability to deliver enterprise-grade solutions in sectors such as e-commerce, finance, and healthcare.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2014",
      "to_year": "2017",
      "location": "United Kingdom",
      "university": "The University of Manchester"
    }
  ],
  "experience": [
    {
      "role": "MLOps Engineer",
      "company": "Binary Studio",
      "from_date": "Aug 2023",
      "to_date": "Present",
      "location": "United Kingdom (Remote)",
      "responsibilities": "Implemented **MLOps** practices by developing and overseeing data workflows using **Airflow** and **Prefect**, ensuring efficient data processing and model deployments.\nDeveloped scalable **Python** applications with a focus on automation in production environments, leveraging **Docker** and **Kubernetes** for container orchestration and CI/CD processes.\nIntegrated **GitHub Actions** and **Jenkins** for robust continuous integration and continuous deployment pipelines, enhancing code quality and speeding up release cycles by **30%**.\nLed collaboration efforts among cross-functional teams to streamline communication and improve project outcomes for **AWS** integrated solutions, enhancing response times to changes in product requirements.\nEstablished monitoring protocols using **Prometheus** and **Grafana** to maintain system health and performance tracking for deployed models, achieving an uptime of **99.9%**.\nDesigned data architecture for **AWS ECS** implementations with emphasis on **scalability** and **resilience**, enabling effective load management and resource allocation.\nAutomated model versioning and tracking through the implementation of **Model Registry** strategies, facilitating seamless updates and deployments of ML models across production pipelines.\nMentored junior engineers in best practices for **MLOps**, improving team competence in deploying machine learning models and ensuring successful project delivery and collaboration.\nImplemented observability in ML workflows with monitoring tools, promoting proactive issue resolution, which led to a **25%** reduction in model downtime.\nStreamlined data ingestion processes by employing **Python** scripts coupled with **Airflow**, aligning data governance standards and compliance protocols effectively."
    },
    {
      "role": "Software Engineer",
      "company": "Ardigen",
      "from_date": "Mar 2020",
      "to_date": "Aug 2023",
      "location": "Poland",
      "responsibilities": "Implemented **MLOps** practices to streamline the integration and deployment of machine learning models across environments, enhancing collaboration and communication among teams.\nLeveraged **Python** for developing robust data pipelines and integrating models using tools such as **Airflow** and **Prefect**, ensuring high-quality data for model training and inference.\nManaged containerization of applications with **Docker** and orchestrated deployments using **Kubernetes** and **ECS**, achieving a **45%** reduction in deployment time.\nDeveloped CI/CD pipelines with **GitHub Actions** and **Jenkins** to automate model training and deployment processes, increasing release frequency by **30%**.\nMonitored model performance and application health utilizing **Prometheus** and **Grafana**, facilitating real-time insights and proactive adjustments to models.\nCreated and maintained a **Model Registry** to track model versions, enabling rollback capabilities and ensuring compliance with data governance standards.\nUtilized **AWS** services such as S3 and Lambda for scalable data storage and serverless processing, significantly lowering operational costs by **20%**.\nCollaborated with cross-functional teams to ensure alignment on model objectives, methodologies, and performance metrics, enhancing end-user satisfaction.\nConducted regular system evaluations to refine data engineering practices, utilizing tools like **MLflow** for model tracking and experiment management.\nEngaged in continuous improvement practices to enhance data integrity and model accuracy, resulting in a **15%** improvement in predictive performance.\nImplemented monitoring tools to assess model drift and data changes, ensuring sustained model reliability in production environments.\nContributed to knowledge sharing within the team, providing training and resources on **MLOps** frameworks and methodologies, fostering a culture of innovation."
    },
    {
      "role": "Software Engineer",
      "company": "Altum Software",
      "from_date": "Oct 2017",
      "to_date": "Feb 2020",
      "location": "United Kingdom",
      "responsibilities": "Implemented MLOps strategies enhancing model deployment and monitoring capabilities for machine learning projects.\nLeveraged **Python** to develop scalable solutions, focusing on integration with **AWS** cloud services for efficient resource management and deployment.\nDesigned and optimized CI/CD pipelines using **GitHub Actions** and **Jenkins**, facilitating a **45%** reduction in deployment time for machine learning models.\nUtilized **Docker** and **Kubernetes** for container orchestration, helping streamline the deployment process and ensuring scalability across multiple environments.\nDeveloped automated workflows with **Airflow** and **Prefect**, managing complex data pipelines and improving task reliability by **30%**.\nImplemented observability frameworks using **Prometheus** and **Grafana** for real-time performance tracking of deployed models, ensuring operational excellence and proactive issue resolution.\nCreated model registries to track and version machine learning models, providing a structured approach to model management and fostering collaboration among data scientists.\nConducted performance monitoring and data pipeline optimizations using **EvidentlyAI**, resulting in a **25%** increase in model inference performance.\nFacilitated collaboration across teams through effective communication of technical specifications and results, enhancing overall project efficiency.\nUtilized **MLflow** for tracking experiments, facilitating reproducibility and collaboration in model training, and enhancing model governance.\nCollaborated with data engineering teams to ensure the infrastructure supports data ingestion and preprocessing for machine learning workflows, boosting data throughput by **50%**.\nImplemented robust backup and recovery processes within cloud environments to protect critical model data and ensure operational continuity in line with best practices."
    }
  ],
  "skills": "  **Programming Languages:**\n    Python\n\n  **Backend Frameworks:**\n    FastAPI\n    Django\n    Flask\n    Spring Boot\n\n  **Frontend Frameworks:**\n    Angular (1–16)\n    React (15–18)\n    Next.js\n    Vue.js (2/3)\n    Blazor\n\n  **API Technologies:**\n    REST & gRPC APIs\n\n  **Serverless and Cloud Functions:**\n    AWS (ECS, Lambda, RDS, S3)\n    Azure (App Services, Blob, SQL)\n\n  **Databases:**\n    PostgreSQL (Fintech)\n    MySQL (Healthcare)\n    MongoDB (Gaming)\n    Redis\n\n  **DevOps:**\n    Docker\n    Kubernetes\n    GitHub Actions\n    GitLab CI/CD\n    CI/CD\n    Jenkins\n\n  **Cloud & Infrastructure:**\n    AWS\n\n  **Other:**\n    SQLAlchemy\n    Pydantic\n    Celery\n    MLOps\n    MLflow\n    Airflow\n    Prefect\n    EvidentlyAI\n    Prometheus\n    Grafana\n    Monitoring Tools\n    Data Engineering\n    Collaboration\n    Communication\n    Authentication & Security (Keycloak, JWT, OAuth2, Let’s Encrypt, Nginx, Certbot)"
}