{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Desarrollador/a Full Stack",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-152840397/",
  "profile_summary": "Full Stack Developer with 8 years of experience, specializing in high-performance solutions with a strong emphasis on **React**, **Vue**, and **Angular**. Proven ability to design and implement scalable applications utilizing **Spring Native**, **MongoDB**, **Oracle**, and **Redis**. Experienced in applying architectural patterns including **CQRS**, **Event Sourcing**, **SAGA**, and **Circuit Breaker** strategies to enhance application resilience. Proficient in orchestrating containerized environments with **Kubernetes** and **Rancher** to ensure seamless deployment and monitoring.\nAdditionally, I possess deep expertise in developing enterprise-grade platforms across healthcare and financial sectors, utilizing technologies such as **Node.js**, **Python**, **FastAPI**, and **Django**. My qualifications include integrating machine learning capabilities, leading cloud solutions on **Azure** and **AWS**, and implementing CI/CD automation to streamline development processes. Skilled in compliance adherence with standards like HIPAA, FHIR, PCI DSS, and SOC 2, I am adept at project management with tools like **Jira** and **Bitbucket**.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Desarrollador/a Full Stack",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Developed and maintained dynamic web applications using **React**, **Vue**, and modern frameworks for seamless user experiences in financial and healthcare sectors.\nArchitected microservices-based solutions utilizing **Kubernetes** and **Rancher**, enhancing scalability and fault tolerance while employing design patterns such as **CQRS** and **Event Sourcing**.\nImplemented robust data storage solutions with **MongoDB**, **Redis**, and **Oracle** to optimize the performance of large-scale applications, ensuring efficient data retrieval and management.\nUtilized event-driven architecture with **Kafka** to manage real-time data streams, facilitating responsive application designs and improved user interactions.\nIntegrated authentication and authorization frameworks using **Keycloak** to enhance security measures for user data across multiple applications.\nEmployed enterprise-level DevOps tools such as **Jira** and **Bitbucket** for issue tracking, code review, and CI/CD processes to streamline development workflows and enhance product delivery.\nImplemented monitoring and logging strategies to ensure reliability and performance of applications, utilizing modern tools for real-time insights into system behaviors.\nConducted code reviews and provided technical guidance to junior developers, fostering a culture of continuous learning and best practices in software engineering.\nDelivered complex data visualization tools and dashboards to facilitate operational insights, employing advanced techniques to enrich user engagement and decision-making processes.\nCollaborated with cross-functional teams to enhance application capabilities through reactive programming paradigms, improving responsiveness to user interactions and system events."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Utilized **React (18)** and **Vue 3** to build modern, user-friendly front-end applications, enhancing user experience and engagement with a **Redux Toolkit** and **Tailwind CSS** for responsive design.\nDeveloped robust backend services using **Java Spring Native** and **Node.js** (NestJS/Express), ensuring high availability and scalability in an event-driven architecture with integration of **Kafka** and **RabbitMQ** for real-time processing.\nDesigned, implemented, and orchestrated ETL pipelines utilizing **Apache Airflow** and **Azure Data Factory** for efficient batch and real-time data ingestion from multiple sources, maintaining data integrity across **MongoDB** and **Oracle** databases.\nCreated and maintained real-time monitoring systems, leveraging **Keycloak** for authentication and transactions, and **D3.js** with **Power BI Embedded** for effective data visualization and reporting.\nImplemented **Circuit Breaker**, **Retry**, and **Bulkhead** patterns to enhance system reliability and resilience in microservices architecture, effectively managing errors and ensuring high system performance.\nLeveraged **Kubernetes** and **Rancher** for container orchestration, facilitating continuous integration and deployment pipelines to improve operational efficiency and reduce downtime.\nEngaged in **Reactivo programación** to implement efficient logging and monitoring solutions, improving system observability through tools like **Jira** and **Bitbucket** for issue tracking and version control.\nInstrumented AI/ML solutions for fraud detection using **scikit-learn** and **XGBoost**, rigorously analyzing financial transaction data to identify anomalies and mitigate risks.\nDeveloped machine learning pipelines for critical financial use cases, such as credit scoring and transaction classification, integrating directly into backend services for immediate impact."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "• Developed and maintained frontend applications using **React (18)**, **Vue 3**, and **Angular**, ensuring high-performance, responsive interfaces for users across various devices.\n• Engineered and optimized backend services with **Kubernetes** for container orchestration, ensuring scalability and high availability in a distributed architecture.\n• Integrated **Redis** for efficient caching strategies, significantly enhancing application performance and reducing database load, leading to improved response times by **30%**.\n• Implemented event-driven architecture utilizing **Kafka** for robust data streaming, allowing real-time updates and improved user interaction across the platform.\n• Employed **MongoDB** and **Oracle** for reliable data handling and storage, ensuring data integrity and quick access even during peak traffic times.\n• Leveraged **CQRS** and **Event Sourcing** to streamline data management processes, enhancing data retrieval efficiency and maintaining a clean separation between reading and writing operations.\n• Enhanced system reliability through the implementation of **Circuit Breaker** and **Retry** patterns, minimizing downtime and improving overall system robustness.\n• Utilized **Jira** and **Bitbucket** for project management and version control, fostering collaboration and ensuring efficient tracking of feature deployments and bug resolutions.\n• Designed and launched secure RESTful APIs integrated with **Keycloak** for authentication and authorization, ensuring user data protection and compliance with GDPR regulations.\n• Implemented CI/CD strategies using **Rancher** for seamless application deployment, improving release cycles and reducing deployment times by **25%**.\n• Actively participated in **programación reactiva** practices to enhance application responsiveness and user experience, while monitoring and logging crucial system metrics for proactive troubleshooting."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, JavaScript, TypeScript\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django, Spring Native\n\n **Frontend Frameworks:**\n\tReact, Vue, Angular\n\n **API Technologies:**\n\tKrakenD, Keycloak, JWT, OAuth2\n\n **Serverless and Cloud Functions:**\n\tAWS (Lambda), Azure (App Services)\n\n **Databases:**\n\tPostgreSQL, MySQL, MongoDB, Oracle, Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:**\n\tAWS (ECS, RDS, S3), Azure (Blob, SQL), Rancher\n\n **Other:**\n\tMLflow, Airflow, Kubeflow, Jira, Bitbucket, Circuit Breaker, Retry, Bulkhead, CQRS, Event Sourcing, SAGA, Programación reactiva, monitoreo, logging"
}