{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Automation Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Senior Automation Engineer with 13+ years of full-stack development experience, specializing in **JavaScript**, **ETL**, **REST APIs**, and **automation best practices**. Demonstrated proficiency with **webhooks**, **OAuth**, and working with platforms such as **HubSpot**, **Airtable**, **Slack**, **Notion**, and **Stripe**. Proven track record in deploying automated data pipelines and integrating solutions into existing systems, ensuring seamless data flows and real-time processing. \n\nTechnically skilled in building high-performance applications utilizing **Python**, **JavaScript**, **TypeScript**, and frameworks like **React**, **Next.js**, **Node.js**, and **Django**. Experienced in leveraging cloud services such as **AWS** and **Azure** for cloud-native deployments. Holds a solid grasp of structured problem-solving, communication, and ownership, driven by a curious mindset to explore new technologies and optimize workflows.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Automation Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Developed and implemented **automation best practices** for data pipelines using **n8n**, enhancing workflow efficiency by **30%**.\n- Designed and maintained **REST APIs** with **OAuth** authentication, ensuring secure access and data exchange between services such as **HubSpot**, **Airtable**, and **Stripe**.\n- Integrated **webhooks** across multiple platforms, including **Slack** and **Notion**, to enable real-time notifications and updates, improving communication and collaboration among teams.\n- Created **data pipelines** and **ETL processes** that handled over **1 million** records daily, facilitating effective data management and analytics.\n- Led initiatives to enhance **JSON** data handling and transformation strategies, reducing processing time by **20%**.\n- Collaborated with cross-functional teams to troubleshoot and solve complex problems, embodying a strong **problem-solving** attitude and promoting a culture of **curiosity**.\n- Fostered clear **communication** within the team regarding project progress and challenges, ensuring all stakeholders were aligned with project goals.\n- Cultivated a **structured mindset** toward task management and documentation, resulting in improved project deliverability timelines.\n- Demonstrated **ownership** of automation projects, leading to a **25%** reduction in manual intervention and errors in processes."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Designed and implemented **ETL** pipelines using **n8n**, **Apache Airflow**, and **Azure Data Factory**, automating data ingestion processes with efficiency improvements of **30%**.\nDeveloped and optimized **REST APIs** integrating with **HubSpot**, **Airtable**, and **Stripe** to streamline payment processes, improving transaction handling speed by **25%**.\nUtilized **webhooks** for real-time data synchronization and automated notifications in **Slack** and **Notion**, enhancing team communication and operational transparency.\nApplied **JSON** and **JavaScript** in data interchange formats, ensuring smooth API interactions and integrations across multiple platforms.\nFostered a culture of automation best practices by mentoring team members in the use of **automation tools** and promoting a structured mindset towards problem-solving and ownership.\nDemonstrated strong communication skills when collaborating with cross-functional teams to identify opportunities for automation, leading to a reduction in manual work by **40%**.\nEngaged in continuous improvement initiatives driven by curiosity, ensuring that processes remain efficient and up-to-date with the latest technologies and methodologies."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Implemented **REST APIs** and **webhooks** to streamline automation processes and integrate third-party applications such as **Stripe**, **HubSpot**, and **Airtable**, enhancing data flow and operational efficiency.\nDeveloped and maintained **data pipelines** utilizing **n8n** for orchestrating automation tasks, resulting in a **30%** improvement in processing time for routine workflows.\nLeveraged **SQL** for querying databases, ensuring accurate data retrieval and management across automation projects, while applying **ETL** best practices to maintain data integrity and consistency.\nUtilized **JavaScript** for scripting automation tasks while ensuring compatibility with frameworks that enhance user experience and functionality across platforms like **Google Workspace** and **Notion**.\nApplied **OAuth** for secure API authentication, facilitating safe access between internal systems and external partners, adhering to security best practices.\nDesigned and implemented automation solutions that improved communication and collaboration within teams through integrations with tools like **Slack** and **Notion**, boosting productivity metrics by **25%**.\nEmployed structured problem-solving techniques to identify automation opportunities, allowing teams to focus on high-impact projects, thus reducing manual tasks by **40%**.\nMaintained clear documentation and communication with stakeholders to report on automation initiatives and updates, emphasizing a strong sense of ownership and transparent team engagement.\nFostered a culture of continuous learning and curiosity by exploring automation best practices, contributing to team knowledge-sharing sessions and pilot projects for new tools."
    }
  ],
  "skills": "  **Programming Languages:**\n\tPython, JavaScript, TypeScript\n\n  **Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n  **Frontend Frameworks:**\n\tReact, Vue, Angular\n\n  **API Technologies:**\n\tREST APIs, webhooks, OAuth, JSON\n\n  **Serverless and Cloud Functions:**\n\tAWS: Lambda\n\tAzure: App Services\n\n  **Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis, SQL\n\n  **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n  **Cloud & Infrastructure:**\n\tAWS: ECS, RDS, S3, Azure: Blob Storage, SQL Database\n\n  **Other:**\n\tn8n, HubSpot, Airtable, Slack, Notion, Stripe, Google Workspace, MLflow, Airflow, Kubeflow, data pipelines, ETL, automation best practices, problem-solving, communication, structured mindset, curiosity, ownership",
  "apply_company": "Pet Media Group (PMG)"
}