{
  "name": "Tomasz Lee",
  "role_name": "Product Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Results-driven Product Engineer with 9+ years of experience in developing innovative solutions using **Python**, **Django**, and **AWS**. Proficient in front-end technologies such as **Vue.js**, with a strong foundation in **UX/UI design** principles. Skilled in solution architecture and modular design, leveraging agile development methodologies to deliver high-quality products. Demonstrated expertise in team collaboration and stakeholder management, with a focus on problem-solving and driving impactful results. Additionally, experienced in microservices architecture, distributed systems, and employing tools like **Apache Kafka**, **RabbitMQ**, and **Redis** to optimize performance and streamline development processes.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Product Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Utilized **Python** and **Django** to design and develop robust web applications, enhancing system performance by **30%**.\nImplemented **AWS** services for scalable cloud solutions, achieving an uptime of **99.9%**.\nAdopted **Vue.js** for responsive front-end development, which improved loading times by **40%**.\nLeveraged AI tools to enhance decision-making processes and automate repetitive tasks, increasing efficiency by **15%**.\nCollaborated with stakeholders to understand requirements, ensuring alignment with business goals and delivering impactful solutions.\nConducted modular design and solution architecture to improve system maintainability and scalability, reducing development time by **25%**.\nLed agile development practices for iterative project management, enhancing team collaboration and productivity.\nEngaged with UX/UI design teams to create user-centric interfaces, resulting in a **20%** increase in user engagement.\nEffectively solved complex technical challenges with problem-solving skills, driving continuous improvement in product development.\n"
    },
    {
      "role": "Full Stack Developer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "Leveraged **Python** and **Django** to develop and maintain modular web applications, enhancing team collaboration by **15%** through streamlined workflows.\nImplemented **AWS** cloud services for scalability and reliability in deployment, leading to a **30%** reduction in operational costs.\nDesigned and integrated user-centric interfaces using **Vue.js**, resulting in a **25%** increase in user engagement and satisfaction.\nUtilized AI tools to enhance application features, improving problem-solving capabilities by **20%** through intelligent data processing.\nEmployed agile development methodologies to deliver product iterations bi-weekly, ensuring rapid responsiveness to stakeholder feedback.\nConducted stakeholder management sessions to gather requirements effectively, maintaining development timelines and achieving project goals on schedule.\nCollaborated with cross-functional teams to deliver impactful solutions, aligning technical objectives with business outcomes.\nDesigned interactive, modular components with a focus on **UX/UI design**, leading to enhanced user experience across platforms.\nMentored junior developers on best practices in coding and collaborative design, fostering a culture of knowledge sharing and continuous improvement.\nCreated comprehensive documentation to support solution architecture and facilitate future development efforts."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "Utilized **Python** and **Django** to develop and enhance web applications, improving the overall user experience by **30%**. \nDesigned and implemented **AWS** solutions to scale applications effectively, leading to a **25%** reduction in operational costs. \nApplied **modular design** principles to create reusable components in **Vue.js**, accelerating future project development time by **15%**. \nCollaborated in an **agile development** environment, participating in daily standups and ensuring alignment with project goals while promoting **team collaboration**. \nEngaged in **stakeholder management** to gather requirements and address feedback, driving project success and user satisfaction. \nImplemented **UX/UI design** strategies that enhanced the aesthetics and usability of applications, resulting in a **40%** increase in user engagement. \nLeveraged various **AI tools** to integrate intelligent features and improve application functionality, demonstrating strong **problem-solving** skills. \nActively supported solution architecture discussions to enhance system performance and maintainability of existing applications. \nContributed to delivering technical documentation and user guides for internal systems, improving knowledge transfer among teams for a more informed work environment."
    }
  ],
  "skills": " **Programming Languages**\n\tPython\n\n**Backend Frameworks**\n\tDjango\n\n**Frontend Frameworks**\n\tVue.js, ReactJS, NextJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n**API Technologies**\n\tRESTful API, GraphQL\n\n**Serverless and Cloud Functions**\n\tAWS\n\n**Databases**\n\tMSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB\n\n**DevOps**\n\tCI/CD pipelines, Azure\n\n**Cloud & Infrastructure**\n\tAWS\n\n**Other**\n\tUX/UI Design, Git, GitHub, Testing Tools: NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest, Blockchain: Solidity, Ether.js, Web3.js, Ethereum, Agile development, Team collaboration, Stakeholder management, Problem-solving, Impact focus, Modular design, Solution architecture"
}