{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Software Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Experienced Senior Software Engineer with 13+ years in the software development lifecycle, proficient in scripting, debugging, and continuous integration. Adept at utilizing **C**, **C++**, and various source control systems to deliver robust solutions. Strong analytical and problem-solving skills complemented by a customer-oriented approach.\n\nFull Stack Developer skilled in **JavaScript**, **TypeScript**, and **Python**, with hands-on expertise in frontend and backend technologies including **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**. Proven ability to build AI/ML-powered platforms that enhance predictive analytics and automation. \n\nExpert in deploying **cloud-native systems** on **AWS** and **Azure**, implementing microservices, event-driven architectures, and CI/CD pipelines. Well-versed in compliance-driven development, aligning solutions with HIPAA, FHIR, PCI DSS, and SOC 2 standards. Strong background in MLOps, including model training, serving, and orchestration using **MLflow**, **Airflow**, and **Kubeflow**. Fluent in German and English.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Software Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Executed **Software Development Lifecycle** (SDLC) processes to lead the design and development of applications in **C**, **C++**, and Assembler, ensuring effective debugging and troubleshooting protocols.\n• Engaged in **Continuous Integration** practices utilizing modern CI tools to streamline software builds and deployments, enhancing efficiency and reducing cycle times.\n• Produced comprehensive **Technical Documentation** to support application maintenance and facilitate knowledge transfer between cross-functional teams.\n• Applied outstanding **Problem Solving** and **Analytical Skills** to identify, diagnose, and resolve software defects, improving overall system reliability by **30%**.\n• Collaborated with project teams to adapt and implement best practices in **Source Control**, enhancing team productivity by maintaining organized code repositories and version control with tools like Git.\n• Delivered high-quality software solutions with a **Customer Orientation** mindset, gathering user feedback to refine application features and improve user experiences.\n• Utilized effective communication in both **German** and **English** to engage with diverse stakeholders, ensuring clarity and alignment on project requirements.\n• Mentored junior engineers in **Scripting** techniques and **Debugging** methodologies, fostering a culture of continuous learning within the team.\n• Developed automated testing frameworks to improve code quality and reliability, ensuring all software met industry standards before deployment."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "- Demonstrated strong **problem-solving** skills by modernizing core financial platforms, migrating to **microservices architecture** using **Node.js** (NestJS/Express) and **Python** (FastAPI, Django) to enhance scalability and performance for high-volume transactional systems.\n- Implemented **analytical skills** through the development of interactive front-end applications with **React** (18), **Vue 3**, **Next.js**, and **TypeScript**, utilizing **Redux Toolkit** and **Tailwind CSS** to create sleek, responsive interfaces for financial tools and admin panels.\n- Enhanced **customer orientation** by delivering real-time analytics dashboards with **React**, **D3.js**, and **Power BI Embedded**, providing operations teams with instant insights into transactions and anomalies, improving decision-making metrics by **30%**.\n- Utilized **technical documentation** and **source control** strategies to design and deploy a robust event-driven architecture using **Kafka**, **RabbitMQ**, and **Azure Service Bus**, ensuring asynchronous communication across critical workflows such as payments, alerts, and compliance.\n- Developed ETL pipelines for ingesting financial data from internal and third-party sources using **Python**, **Apache Airflow**, and **Azure Data Factory**, facilitating **batch** and **real-time processing** for over **500,000** transactions daily.\n- Applied **software development lifecycle** principles to build and deploy machine learning models for fraud detection using **scikit-learn**, **XGBoost**, and **Azure ML**, enabling proactive detection of suspicious activity based on user behavior and transaction patterns with a **25%** reduction in false positives.\n- Created ML pipelines for real-time credit scoring, churn prediction, and transaction classification, leveraging **MLflow** and **Airflow** to integrate model inference into backend services, enhancing predictive analytics capabilities by **40%**."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Demonstrated strong **problem-solving** skills by designing and optimizing backend services for diverse applications, ensuring efficient and reliable performance.\nUtilized **C** and **C++** for core software development, ensuring robust integration with existing systems while adhering to the **Software Development Lifecycle (SDLC)** methodologies.\nEmploying advanced **scripting** techniques to automate processes and enhance operational efficiency, significantly reducing time spent on repetitive tasks by **30%**.\nConducted comprehensive **debugging** to diagnose and resolve software issues promptly, maintaining system uptime and improving user satisfaction.\nCollaborated using **source control** tools to maintain code integrity and facilitate seamless team coordination.\nImplemented **Continuous Integration (CI)** practices to ensure quality and regular iteration of software delivery, decreasing deployment time by **25%**.\nProduced thorough **technical documentation** that streamlined onboarding for new team members, contributing to overall team efficiency.\nExhibited strong **analytical skills** to troubleshoot complex issues, leading to improved application functionality and performance metrics.\nMaintained a customer-centric focus by aligning development with user needs, achieving a **15%** increase in user engagement and satisfaction.\nDemonstrated **service orientation** in addressing customer feedback and iterating product features with a focus on usability, leading to positive customer reviews in both **German** and **English**."
    }
  ],
  "skills": " **Programming Languages:**\n\tC, C++, Assembler, Python, JavaScript, TypeScript\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n **Frontend Frameworks:**\n\tReact, Vue, Angular\n\n **API Technologies:**\n\tOAuth2, JWT, Keycloak (OIDC, RBAC)\n\n **Serverless and Cloud Functions:**\n\tAWS: Lambda, ECS; Azure: App Services\n\n **Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:**\n\tAWS: RDS, S3; Azure: Blob Storage, SQL Database\n\n **Other:**\n\tContinuous Integration, Software Development Lifecycle, Technical Documentation, Debugging, Scripting, Problem Solving, Analytical Skills, Customer Orientation, Service Orientation, German, English",
  "apply_company": "Fujitsu"
}