{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Performance Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Senior Performance Engineer with 13+ years of experience in delivering high-performance applications, leveraging a deep understanding of system efficiency through meticulous performance tuning and concurrency techniques. Proficient in **C/C++**, **SIMD**, **AVX512**, and **LLVM** to optimize and enhance application performance. Skilled in **Python** and **JavaScript**, supporting robust backend services and ensuring seamless integration across diverse platforms, including **Windows** and **Linux**.\nDemonstrated expertise in employing threading strategies for improved application concurrency, and adept in using version control tools like **Git** and **Mercurial** to manage code effectively. Proven ability to communicate technical concepts clearly, collaborating with cross-functional teams to deliver solutions that meet high standards of performance.\nBringing hands-on experience in the healthcare and financial sectors, with a strong background in cloud deployment on **AWS** and **Azure**, and comprehensive knowledge of AI/ML frameworks for real-time data processing. Committed to compliance with industry standards, ensuring alignment with HIPAA, FHIR, PCI DSS, and SOC 2. Strong familiarity with modern development processes, including CI/CD pipelines. Highly regarded for driving innovation and operational excellence in software engineering.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Performance Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Utilized **C/C++** for performance optimization and **SIMD** techniques including **AVX512** to enhance processing speeds, ensuring efficient data handling in high-performance applications.\nImplemented concurrency and threading strategies to improve application responsiveness and resource management, resulting in reduced latency and increased throughput by up to **30%**.\nCollaborated on the enhancement of compiler designs using **LLVM**, ensuring robust feature sets for various programming functionalities while maintaining compliance with system architecture standards.\nEngaged in performance tuning for diverse applications running on **Linux** and **Windows**, enabling seamless operation and improved user experience across platforms.\nUtilized **Git** and **Mercurial** for version control, streamlining collaboration with development teams and maintaining a clear history of code changes with a focus on code quality and maintainability.\nCommunicated effectively with cross-functional teams to align performance engineering goals with broader project objectives, resulting in the timely delivery of features aligned with user requirements.\nDesigned testing strategies that incorporated both automated and manual testing methods to evaluate application performance under varied conditions, enhancing overall stability by **25%**.\nTrained junior engineers on performance best practices and optimization techniques, fostering a culture of excellence and knowledge sharing within the team.\nRegularly analyzed system performance metrics and generated reports to help guide strategic decisions on application enhancements and infrastructure upgrades."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Optimized system performance through in-depth performance tuning of applications using **C/C++**, achieving improvements of up to **30%** in execution speed and reducing latency in high-load environments.\nApplied threading and concurrency principles to enhance application throughput, utilizing advanced techniques in **SIMD** and **AVX512** to maximize resource efficiency and CPU architecture capabilities.\nContributed to the development of compilers using **LLVM**, ensuring optimized code generation and translating high-level language features effectively.\nImplemented version control using **Git** and **Mercurial**, managing collaborative development with a focus on code integrity and streamlined workflows.\nConducted performance analysis and benchmarking on both **Windows** and **Linux** platforms, ensuring stability and efficiency across operating systems.\nCollaborated effectively with cross-functional teams, exhibiting strong communication skills to bridge gaps between engineering and product management, ensuring alignment on performance goals and project timelines."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Utilized **C/C++** for performance tuning of compilers, implementing advanced techniques such as **SIMD** and **AVX512** to optimize processing speeds by up to **50%**.\nDeveloped and enhanced compiler functionalities using **LLVM**, ensuring high performance and concurrency in code execution across various CPUs and architectures while maintaining compatibility with modern coding standards.\nEmployed threading and concurrency strategies to improve runtime efficiency by **30%**, leveraging concepts of CPU architecture to maximize resource utilization on both **Windows** and **Linux** platforms.\nManaged version control systems effectively using **Git** and **Mercurial**, ensuring smooth collaboration and code integrity across teams.\nCommunicated complex technical concepts clearly to both technical and non-technical stakeholders, fostering an environment of collaboration and understanding.\nMonitored and analyzed performance bottlenecks, generating insights and actionable recommendations that led to a **25%** improvement in overall system performance.\nExecuted rigorous performance tests, documenting results and iterating on code improvements continuously, contributing to a robust and efficient codebase.\nCollaborated with cross-functional teams to integrate feedback loops into the development process, which enhanced the product lifecycle by **15%**.\nDeveloped comprehensive automated testing frameworks that improved testing coverage and ensured scalability of performance testing efforts.\nMaintained up-to-date technical documentation and coding standards, promoting best practices in performance engineering across the organization."
    }
  ],
  "skills": "**Programming Languages:**\n\tPython, C/C++, JavaScript\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tKeycloak (OIDC, RBAC), OAuth2, JWT\n\n**Serverless and Cloud Functions:**\n\tAWS: Lambda\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS: ECS, RDS, S3, Azure: App Services, Blob Storage, SQL Database\n\n**Other:**\n\tCommunication, Performance Tuning, Concurrency, Threading, CPU Architecture, Windows, Linux, SIMD, AVX512, LLVM, Compiler, Git, Mercurial",
  "apply_company": "AMD"
}