{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Fullstack Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Senior Full Stack Engineer with 13+ years of experience proficient in **Java**, **C++**, and **C#**, possessing strong capabilities in **AWS**, **Azure**, and **OCI** cloud services. Excel in building robust distributed systems and implementing **REST**ful architectures within an **Agile** development environment. Proven expertise in **CI/CD** practices, ensuring seamless software delivery and higher observability in production systems. Skilled in **security** best practices and delivering exceptional user experiences through object-oriented design.\nAlso proficient in **AI/ML** technologies, having developed solutions leveraging predictive analytics, real-time processing, and automation. Extensive experience with modern tech stacks including **JavaScript**/**TypeScript**, **Python**, and **Flutter**, with hands-on expertise in frontend and backend frameworks such as **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**. A strong advocate for compliance-driven development with a solid understanding of regulations like HIPAA, FHIR, PCI DSS, and SOC 2 standards. Demonstrated knowledge in MLOps practices utilizing **MLflow**, **Airflow**, and **Kubeflow**.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Fullstack Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Utilized **Java**, **C++**, and **C#** to design and build robust full-stack platforms, ensuring high-quality user experiences in healthcare and fintech sectors.\nEmployed **AWS** and **Azure** cloud services to create and manage scalable distributed systems, streamlining deployment and enhancing application performance.\nImplemented machine learning (ML) and artificial intelligence (AI) solutions aligned with industry standards and best practices, enabling intelligent feature integration for dynamic user engagement.\nDeveloped and maintained secure REST APIs, facilitating seamless communication between front-end and back-end services while adhering to security best practices.\nArchitected CI/CD pipelines using **Azure DevOps** and **GitHub Actions**, resulting in a **30%** reduction in deployment times through automation and streamlined workflows.\nLed Agile development processes, collaborating with cross-functional teams to deliver high-quality software solutions within **2-week** sprint cycles.\nEmphasized observability and security in all systems, implementing advanced monitoring tools and practices to ensure system integrity and responsiveness.\nConducted in-depth code reviews and mentoring for junior developers, promoting object-oriented design principles and coding best practices.\nDesigned user interfaces with an emphasis on enhancing user experience and accessibility, working closely with UI/UX designers.\nAnalyzed project requirements and collaborated with stakeholders to ensure alignment with business objectives and technology strategies."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Utilized **Java** and **C#** to enhance the architecture of core financial platforms, improving scalability and performance for high-volume transactional systems.\nDeveloped and maintained **Azure**-based microservices using **Node.js** (NestJS/Express) and Python (FastAPI, Django) with a focus on effective **Distributed Systems** implementation.\nCreated seamless user experiences with interactive front-end applications using **React** (18), **Vue 3**, **Next.js**, and **TypeScript**, leveraging Redux Toolkit for state management and **Tailwind CSS** for responsive designs.\nImplemented **Agile** methodologies in project management, ensuring quick delivery cycles and efficient team collaboration.\nDelivered real-time analytics dashboards using **React**, **D3.js**, and **Power BI Embedded**, providing operations teams with insights into over **1 million** transactions monthly.\nDesigned robust event-driven architectures procuring asynchronous communication using **Kafka**, **RabbitMQ**, and **Azure Service Bus** for critical workflows such as payments and compliance.\nConstructed **ETL** pipelines for ingesting financial data using **Python**, **Apache Airflow**, and **Azure Data Factory**, optimizing support for both batch and real-time processing needs.\nDeveloped machine learning models for fraud detection using **scikit-learn**, **XGBoost**, and **Azure ML**, allowing proactive detection of potentially fraudulent activities.\nCreated machine learning pipelines for real-time credit scoring and churn prediction, incorporating **MLflow** and **Airflow** for streamlined model inference integration.\nApplied **Observability** techniques to monitor application metrics and ensure **Security** best practices across all developed services."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Utilized **Java** and **C#** to design and optimize backend services for a global e-commerce platform, ensuring high availability and scalability across key modules like checkout, cart, and order fulfillment with response times under **200ms**.\nEngineered real-time features leveraging **AWS** services and **Kafka**, enabling order updates, dynamic inventory tracking, and responsive customer support, achieving an uptime of **99.9%**.\nDeveloped robust frontend applications with **React (18)** and **Angular**, applying **TypeScript** for code maintainability and performance, successfully enhancing user engagement by **30%**.\nImplemented **REST**ful APIs and utilized **MongoDB** and **PostgreSQL** for distributed data storage, achieving efficient data retrieval times under **50ms** and supports for high-traffic workflows.\nIntegrated machine learning capabilities within the platform using **TensorFlow** and **LightGBM**, facilitating AI-driven recommendations that improved conversion rates by **25%** based on user behavior data.\nExecuted **CI/CD** pipelines and utilized **Agile** methodologies, allowing for rapid iteration on features and deploying updates within **hours** rather than days.\nDeveloped user-friendly interfaces compliant with **WCAG 2.1** accessibility guidelines, using **HTML5/CSS3**, ensuring mobile-first responsiveness optimized for a seamless user experience.\nDesigned secure payment workflows integrated with **Stripe** and **PayPal**, applying industry-leading security practices including PCI compliance for protecting sensitive customer data.\nEmployed **security** best practices like **OAuth 2.0** and **RBAC** to ensure that user data protection measures are in place, maintaining adherence to GDPR requirements."
    }
  ],
  "skills": "**Programming Languages:**\n\tJava, C++, C#, Python, JavaScript/TypeScript\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django, .NET\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tREST, OAuth2, JWT\n\n**Serverless and Cloud Functions:**\n\tAWS: ECS, Lambda, RDS, S3\n\tAzure: App Services, Blob Storage, SQL Database\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD\n\tCI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAzure, AWS, OCI\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, AI, ML, Distributed Systems, Agile, Observability, Security, User Experience, Keycloak (OIDC, RBAC), Nginx, Let’s Encrypt, Certbot, Object-oriented design",
  "apply_company": "Oracle"
}