{
  "name": "Rei Taro",
  "role_name": "Senior Electrical Engineer",
  "email": "rei515@outlook.com",
  "phone": "+48732529451",
  "address": "Warszawa, Poland",
  "linkedin": "https://www.linkedin.com/in/rei-taro-81a410391/",
  "profile_summary": "Results-driven Senior Electrical Engineer with over 10 years of experience in substation design, high-voltage systems, and grounding solutions. Proficient in using **AutoCAD**, **MicroStation**, and **Bentley** to create comprehensive bus designs and implement relay coordination strategies. Strong background in SCADA systems and adherence to **NESC** and **IEEE** standards. A collaborative communicator with a proven history of project leadership and mentoring cross-discipline teams. Additionally, I have a solid technical foundation with knowledge in backend development, including expertise in Python (**FastAPI**, **Django**, **Flask**) and cloud services like **AWS** and **Azure**, allowing for seamless integration of electrical systems with innovative technologies.",
  "education": [
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2010",
      "to_year": "2015",
      "location": "Japan",
      "university": "Keio University"
    }
  ],
  "experience": [
    {
      "role": "Senior Electrical Engineer",
      "company": "Leobit",
      "from_date": "Aug 2022",
      "to_date": "Present",
      "location": "Poland",
      "responsibilities": "Led project leadership initiatives focusing on **substation design** and **high voltage** systems while mentoring team members to enhance cross-discipline collaboration.\nUtilized **AutoCAD** and **MicroStation** to create innovative and efficient **bus designs** for complex electrical infrastructure, ensuring compliance with **NESC** and **IEEE** standards.\nConducted thorough **relay coordination** assessments to optimize system performance and reliability across multiple projects, ensuring 100% compliance with regulatory requirements.\nImplemented **SCADA** systems for real-time monitoring and control, resulting in a **15%** improvement in operational efficiency.\nCollaborated with stakeholders to facilitate communication and resolve technical challenges effectively, leading to the timely completion of projects within **10%** of the budget.\nOversaw the grounding design for various projects, ensuring safety and efficiency measures are consistently met in all aspects of electrical engineering."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Innovature",
      "from_date": "Nov 2018",
      "to_date": "Jun 2022",
      "location": "Japan",
      "responsibilities": "Engineered high-voltage systems design focusing on **substation design**, **bus design**, and **grounding** to support innovative project delivery for critical infrastructure.\nLed projects utilizing **AutoCAD** and **MicroStation**, with expertise in **Bentley** software for precise design and visual representation in electrical engineering.\nCoordinated relay systems ensuring compliance with **NESC** and **IEEE** standards, enhancing system safety and performance through effective **relay coordination** strategies.\nDeveloped and implemented **SCADA** systems to monitor and control substation operations, improving operational efficiency by **30%**.\nFostered communication and mentoring within cross-discipline teams to drive project leadership and ensure cohesive teamwork across the engineering spectrum.\nManaged project timelines and deliverables, achieving a **95%** on-time project completion rate while improving stakeholder satisfaction through transparent communication and collaboration.\n"
    },
    {
      "role": "Software Developer",
      "company": "Wizcorp",
      "from_date": "Apr 2015",
      "to_date": "Nov 2018",
      "location": "Japan",
      "responsibilities": "• Led substation design initiatives ensuring adherence to high voltage standards and safety protocols while showcasing expertise in **AutoCAD** and **MicroStation**.\n• Developed grounding and bus design solutions that implemented industry best practices to enhance project deliverables.\n• Spearheaded project leadership efforts while mentoring junior engineers in relay coordination techniques and methods.\n• Integrated SCADA systems for improved communication infrastructure, aligning with **IEEE** and **NESC** standards to optimize system performance.\n• Coordinated cross-discipline teams to streamline project timelines, successfully delivering projects within **9 months** under budget by **15%**.\n• Enhanced project efficiency through meticulous design reviews and collaboration with multidisciplinary stakeholders.\n• Conducted comprehensive training sessions, mentoring **12** engineers on regulatory compliance and technology integration."
    }
  ],
  "skills": " \n**Programming Languages**\n\tPython (3.8+), SQL, Bash, JavaScript\n\n**Backend Frameworks**\n\tFastAPI, Flask, Django, Celery\n\n**Frontend Frameworks**\n\t\n\n**API Technologies**\n\tREST/gRPC APIs\n\n**Serverless and Cloud Functions**\n\tAWS (EC2, S3, Lambda), Azure\n\n**Databases**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps**\n\tDocker, Kubernetes, GitHub Actions, Azure DevOps, CI/CD, PyTest, Git\n\n**Cloud & Infrastructure**\n\t\n\n**Other**\n\tAI/ML Tools: Pandas, NumPy, scikit-learn, TensorFlow, Airflow, MLflow, substation_design, high_voltage, grounding, bus_design, AutoCAD, MicroStation, Bentley, relay_coordination, SCADA, NESC, IEEE, communication, mentoring, project_leadership, cross_discipline",
  "apply_company": "Primera Engineers"
}