{
  "name": "Mariusz Jan Skobel",
  "role_name": "Senior Fullstack Engineer",
  "email": "mariuszskobel15@outlook.com",
  "phone": "+48 735 343 548",
  "address": "Katowice, Poland",
  "linkedin": "https://www.linkedin.com/in/mariusz-skobel-927764397/",
  "profile_summary": "Senior Full Stack Engineer with 10+ years of experience delivering high-performance software solutions with a strong focus on **.NET**, **C#**, **SQL Server**, and **Angular**. Expert in developing scalable web applications using **MVC**, **Entity Framework**, and **Web-API**, complemented by a solid understanding of **REST-API** design and **XML** integration. Proficient in leveraging modern practices in **CI/CD** with tools like **Jenkins** and **AzureDevOps**, alongside agile methodologies to streamline development processes and enhance team productivity. Experienced in writing robust unit tests using **NUnit**, **Moq**, and **Jest** to ensure code quality and maintainability.\n\nPossesses a strong technical background in JavaScript/TypeScript, Python, and Flutter, with hands-on expertise in frameworks such as **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**. Demonstrates a knack for building and deploying cloud-native applications on **Azure** and **AWS**, while also leading the development of enterprise platforms that integrate AI/ML capabilities for real-time analytics and automation. Skilled in microservices architecture and event-driven systems, with a commitment to developing secure, compliant solutions that meet standards including HIPAA, FHIR, PCI DSS, and SOC 2. Passionate about driving real-world impact through technology.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2012",
      "to_year": "2015",
      "location": "UK",
      "university": "University of Bristol"
    }
  ],
  "experience": [
    {
      "role": "Senior Fullstack Engineer",
      "company": "EitBiz",
      "from_date": "Oct 2022",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "•\tDeveloped and maintained scalable, full-stack applications using **.NET**, **C#**, and **SQL Server**, focusing on enhancing application performance and security across multiple healthcare and finance projects.\n•\tCreated dynamic single-page applications with **Angular**, ensuring seamless interactions through proficient use of **REST-API** services and **Web-API** architecture.\n•\tImplemented **Entity Framework** for data access, optimizing database operations through efficient **TSQL** queries, and established a robust data layer with a focus on scalability and maintainability.\n•\tEngineered high-quality back-end services, incorporating **MVC** design principles and leveraging testing frameworks such as **NUnit** and **Moq** to ensure code reliability and performance under high-load conditions.\n•\tDesigned and executed **CI/CD** pipelines using **Jenkins** and **Azure DevOps**, streamlining deployment processes for improved release cycles and reducing deployment errors by **30%**.\n•\tCollaborated in Agile teams to drive project deliverables, contributing to sprint planning and retrospective meetings to refine workflows and enhance team productivity by **25%**.\n•\tIntegrated advanced queuing mechanisms to enhance message processing using **Queue Management**, leading to a **50%** reduction in response times for critical transactions.\n•\tConducted thorough code reviews and established coding standards, achieving a code coverage of over **85%** through rigorous testing strategies across diverse project components.\n•\tFacilitated knowledge-sharing workshops on best practices in full-stack development and tools such as **Git** for version control, improving team skill sets and collaboration.\n•\tLed the migration of legacy systems to modern architectures, resulting in a **40%** decrease in maintenance costs and increased system resilience through structured and efficient solutions."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Tvn S.A.",
      "from_date": "Oct 2019",
      "to_date": "Sep 2022",
      "location": "Poland",
      "responsibilities": "Utilized **.NET** and **C#** to lead the development and modernization of financial platforms, focusing on scalability and maintainability in high-volume transaction systems.\nEmployed **SQL Server** for data management and efficient querying, ensuring data integrity and performance across applications.\nDesigned and implemented robust **REST-API** services using **ASP.NET MVC** and **Web API**, promoting seamless integration with front-end frameworks, enhancing user experience in financial services.\nDeveloped dynamic, user-centric front-end applications using **Angular** and **TypeScript**, leveraging **Entity Framework** to interact with back-end services and ensure responsiveness.\nIncorporated **CI/CD** practices through **Jenkins** and **AzureDevOps**, achieving a deployment frequency increase of **30%** and reducing lead time for changes by **40%**.\nExecuted unit testing using **NUnit** and **Moq**, achieving code coverage of **85%**, ensuring high-quality and bug-free software delivery.\nParticipated in Agile methodologies to collaborate effectively with cross-functional teams, improving project turnaround times and team productivity by **25%**.\nImplemented robust queue management through services like **RabbitMQ** and enhanced system reliability, facilitating asynchronous processing of financial transactions.\nEstablished a strong version control system using **Git**, fostering collaboration and versioning across multiple environments.\nStreamlined communication protocols with XML for data exchange between integrated systems, ensuring standardized data formatting."
    },
    {
      "role": "Software Engineer",
      "company": "Timspark",
      "from_date": "Sep 2015",
      "to_date": "Aug 2019",
      "location": "UK",
      "responsibilities": "Utilized **.NET**, **C#**, and **SQL Server** to design and develop robust web-API services, enhancing application performance and integrating seamlessly into the e-commerce architecture.\nDesigned and implemented scalable front-end solutions with **Angular** and **TypeScript**, ensuring the delivery of a fast and responsible user experience across multiple devices.\nDeveloped automated testing protocols using **NUnit** and **Moq**, achieving over **90%** code coverage and significantly improving code quality across significant product releases.\nEmployed **Jenkins** for CI/CD pipelines, facilitating continuous integration and deployment that reduced release times by **30%**.\nManaged and optimized relational database queries in **TSQL**, enhancing data retrieval efficiency and maintaining system integrity across high-traffic environments.\nParticipated in Agile methodologies, effectively collaborating with cross-functional teams to gather requirements and deliver features within **2-week** sprint cycles.\nImplemented queue management strategies, incorporating asynchronous processing for improved responsiveness and user experience during peak transaction periods.\nDesigned and maintained REST-API endpoints for secure and efficient data exchange, ensuring reliability and performance in all service interactions.\nContributed to version control management using **Git**, ensuring efficient collaboration and tracking of the development process.\nOptimized workflows using **AzureDevOps** for project management and collaboration, leading to streamlined operations and tracking of project timelines and deliverables."
    }
  ],
  "skills": "**Programming Languages:**\n\tC#, Python, JavaScript/TypeScript\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django, .NET, Entity Framework, MVC\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tREST-API, Web-API, JWT, OAuth2\n\n**Serverless and Cloud Functions:**\n\tAWS (Lambda), Azure (App Services)\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, SQL Server, Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Jenkins, AzureDevOps, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS (ECS, RDS, S3), Azure (Blob, SQL)\n\n**Other:**\n\tArtificial Intelligence & Machine Learning (MLflow, Airflow, Kubeflow), Agile, Queue Management, XML, TSQL, NUnit, Moq, Jest",
  "apply_company": "Swedish Enforcement Authority"
}