{
  "name": "Tomasz Lee",
  "role_name": "Senior Technical Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Results-driven Senior Technical Engineer with 9+ years of experience in **Backend** development and **Fullstack** solutions. Proficient in **Java** with a strong foundation in AI and ML concepts. Demonstrated expertise in creating efficient **Data Pipelines**, and implementing **Search** and **Information Retrieval** systems. Adept in **Agile** methodologies, facilitating collaboration and teamwork for optimal project outcomes. Proven track record of delivering innovative solutions and mentoring junior developers while leading projects to successful completion. Skilled in designing and developing applications utilizing **microservices architecture**, **Apache Kafka**, **RabbitMQ**, **Redis**, and **ReactJS**, ensuring robust performance and streamlined processes.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Senior Technical Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Led the development of backend systems using **Java**, focusing on building robust data pipelines and implementing **AI** and **ML** algorithms to enhance platform capabilities.\nImplemented search and information retrieval systems to optimize data access and user interactions, resulting in a 30% increase in data retrieval efficiency.\nDrove collaboration within an Agile environment, mentoring junior developers and fostering a culture of continuous improvement and knowledge sharing.\nDesigned and developed full-stack solutions leveraging **ReactJS** and **Next.js** for frontend development, achieving a user satisfaction increase of **25%**.\nEstablished best practices for system design and architecture, implementing **microservices** to ensure scalability and maintainability of the application.\nUtilized tools such as **Apache Kafka** for data streaming, improving real-time processing performance across services.\nImplemented CI/CD strategies that improved deployment efficiency by **40%**, utilizing **Azure DevOps** as the primary deployment tool.\nCollaborated with cross-functional teams to enhance the user interface and overall UX, boosting conversion rates significantly.\nBuilt interactive data visualizations with **D3.js** and **Three.js**, improving data interpretability and user engagement.\nSecured application access through JWT-based authentication methods, ensuring compliance with best security practices."
    },
    {
      "role": "Full Stack Developer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "Engineered robust **Backend** solutions with **Java**, leading to enhanced performance metrics and streamlined data pipelines.\nApplied **AI** and **ML** techniques to improve system intelligence, resulting in faster decision-making processes by up to **20%**.\nDeveloped scalable microservices for **Information Retrieval** tasks, seamlessly integrating with multiple data storage systems.\nSpearheaded full projects using Agile methodologies to ensure projects are delivered on time, boosting team collaboration by **15%**.\nFacilitated mentorship opportunities for junior developers, enhancing overall team capabilities and productivity by **25%**.\nImplemented and optimized **Data Pipelines** for efficient data handling, achieving a **30%** reduction in processing time compared to the previous systems.\nLed code reviews focusing on best practices in **Search** and retrieval mechanisms, fostering a culture of continuous improvement within the team.\nCollaborated with cross-functional teams to finalize system requirements, resulting in aligned objectives and faster implementation.\nUtilized modern **Fullstack** frameworks and libraries to deliver high-quality, responsive applications, maintaining a user satisfaction rate of over **90%**.\nEngaged in regular feedback sessions to refine processes and foster a collaborative working environment."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "Focused on developing robust **Backend** systems leveraging **Java** to enhance application performance and scalability.\nUtilized **AI** and **ML** techniques to improve data processing and decision-making capabilities, resulting in a **30%** increase in predictive accuracy.\nDesigned and implemented efficient **Data Pipelines** for handling large volumes of data, achieving a throughput improvement of **50%**.\nCollaborated closely with cross-functional teams in an **Agile** environment to ensure alignment on project objectives and deliverables.\nMentored junior engineers, fostering a culture of continuous learning and professional development.\nImplemented effective search algorithms for **Information Retrieval**, enhancing data access and user experience on client platforms.\nParticipated in code review sessions and conducted workshops to promote best practices in software engineering.\nAssisted in integrating complex systems while ensuring high levels of data quality and integrity across platforms.\nEngaged with clients to gather requirements and provide innovative solutions that meet business needs.\nDeveloped technical documentation to facilitate knowledge sharing and onboarding processes within the engineering team."
    }
  ],
  "skills": "**Programming Languages**\n\t Java, Python, JavaScript, TypeScript\n\n**Backend Frameworks**\n\t NodeJS, ExpressJS, NestJS, C#, .NET\n\n**Frontend Frameworks**\n\t ReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n**API Technologies**\n\t RESTful API, GraphQL\n\n**Serverless and Cloud Functions**\n\t AWS, Azure\n\n**Databases**\n\t MSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB\n\n**DevOps**\n\t CI/CD pipelines\n\n**Cloud & Infrastructure**\n\t Microservices\n\n**Other**\n\t UX/UI Design, Git, GitHub, Blockchain, Solidity, Ether.js, Web3.js, Ethereum, Apache Kafka, RabbitMQ, Redis, NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest, AI, ML, Data Pipelines, Search, Information Retrieval, Fullstack, Agile, Mentorship, Collaboration",
  "apply_company": "HubSpot"
}