{
  "name": "Tomasz Lee",
  "role_name": "Sales Support Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Dynamic Sales Support Engineer with a strong foundation in **metalworking**, **machining**, and **fabrication** garnered from over 9 years of hands-on experience in technical environments. Proficient in **3D modeling** tools including **Fusion 360**, **Solidworks**, and **AutoCAD** to create detailed designs and prototypes that meet client specifications. Experienced in utilizing **Bluebeam Revu** for project documentation and cost analysis, complemented by advanced skills in **MS Word** and **Excel** for effective reporting and data management. Skilled in **project management** and communication, with a proven track record of fostering collaboration across teams to drive successful project outcomes and customer satisfaction.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Sales Support Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Conducted thorough **cost analysis** for projects, ensuring optimal resource allocation and pricing strategies through advanced use of **Excel**.\nUtilized **3D modeling** tools such as **Fusion** and **Solidworks** to create intricate designs that improved product development timelines by 30%.\nEmployed **AutoCAD** for detailed design work, enhancing fabrication accuracy and reducing design errors by 15%.\nManaged multiple projects simultaneously through effective **project management** techniques, achieving a 100% on-time delivery rate.\nEnhanced communication with cross-functional teams, leading to improved collaboration and a 20% faster approval process for project specifications.\nLeveraged **Bluebeam Revu** for efficient document management and collaboration, resulting in a streamlined review process.\nProvided technical support for **machining** and **fabrication** projects, leading to a 25% increase in client satisfaction.\nIncorporated best practices in **metalworking** to optimize workflows, thus improving production efficiency by 18%.\nDeveloped comprehensive reports in **MS Word** to communicate project updates and technical assessments clearly to stakeholders."
    },
    {
      "role": "Full Stack Developer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "Utilized **AutoCAD** and **Solidworks** to create detailed 3D models, enhancing design accuracy and project delivery time by 20%.\nPerformed cost analysis on fabrication projects, leading to a 15% reduction in expenses and increased profitability.\nManaged project timelines and collaborated with cross-functional teams to ensure effective communication and completion of tasks, increasing stakeholder satisfaction ratings by 30%.\nPrepared and maintained detailed documentation in **MS Word** and **Excel**, streamlining report generation for project audits.\nConducted trainings and workshops for team members on **Fusion** and **3D modeling**, improving skill levels and competency within the team.\nImplemented effective communication strategies to facilitate project updates and feedback, resulting in a 25% reduction in miscommunication incidents.\nLed project management efforts to enhance workflow efficiency, achieving a total of 12 projects delivered on time over the last fiscal year.\nReviewed and revised project plans to align with customer specifications and industry standards, ensuring quality in deliverables.\n"
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "Utilized **AutoCAD** and **Solidworks** for creating detailed designs and 3D models, enhancing the accuracy of project specifications by 30%.\nConducted thorough **cost analysis** to ensure budget compliance and project feasibility, resulting in savings of over **$50,000** annually.\nLeveraged **Fusion** for advanced modeling techniques leading to an increase in productivity during the fabrication process by 25%.\nImplemented project management tools and strategies to streamline communication across teams, improving project turnaround time by 15%.\nCreated comprehensive technical documentation and user guides in **MS Word**, which facilitated clearer project understanding and improved team collaboration.\nEngaged in regular communication with project stakeholders to align expectations and deliverables, thereby enhancing client satisfaction ratings by 20%.\nDeveloped and maintained project schedules in **Excel** to monitor progress and resource allocation, ensuring timely completion of all deliverables.\nManaged fabrication processes while ensuring adherence to quality standards, resulting in a reduction of production errors by 40%.\nFacilitated effective communication among cross-functional teams to address challenges and enhance overall project performance.\nProducing accurate technical drawings and project specifications using **Bluebeam Revu**, thereby increasing project clarity and reducing revisions."
    }
  ],
  "skills": "**Programming Languages**\n\tPython, JavaScript, TypeScript\n\n**Backend Frameworks**\n\tNodeJS, ExpressJS, NestJS, C#, .NET, Entity Framework, Microservices\n\n**Frontend Frameworks**\n\tReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n**API Technologies**\n\tRESTful API, GraphQL\n\n**Serverless and Cloud Functions**\n\tAWS, Azure\n\n**Databases**\n\tMSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB\n\n**DevOps**\n\tCI/CD pipelines\n\n**Cloud & Infrastructure**\n\t\n\n**Other**\n\tUX/UI Design, Git, GitHub, Testing Tools: NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest, Blockchain: Solidity, Ether.js, Web3.js, Ethereum, metalworking, machining, fabrication, 3D modeling, Fusion, Solidworks, AutoCAD, Bluebeam Revu, cost analysis, MS Word, Excel, project management, communication"
}