{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Software Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-karol-kotlinski-bb2520397/",
  "profile_summary": "As a highly skilled Senior Software Engineer with 8 years of full stack development experience, I excel in creating robust and secure applications with a strong focus on **Ruby on Rails** for backend development and integrating **APIs** effectively. My technical expertise includes designing and implementing **event flows** and ensuring **authentication** and **authorization** protocols, along with managing **webhooks**, **rate limits**, and **retries** to optimize system performance. I bring a comprehensive understanding of **idempotency** to enhance application resilience.\n\nI have successfully led technical strategy initiatives and architected scalable solutions that incorporate **AI services** for intelligent automation. My approach integrates strong **observability** practices, **caching** strategies, and adherence to **data contracts** while facilitating **schema evolution** to accommodate changes seamlessly.\n\nIn addition to my technical prowess, I have a proven track record of mentoring junior developers, conducting thorough **code reviews**, and ensuring compliance with security standards. My experience in leveraging collaboration tools like **Slack** and **Microsoft Teams** enhances my ability to work within cross-functional teams, driving successful project outcomes.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Software Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Designed and implemented **APIs** ensuring optimal **authentication** and **authorization** mechanisms, focusing on **security** with adherence to **data contracts** and **rate limits** across all services.\nDeveloped architectural strategies for scalable applications utilizing **Ruby on Rails**, enabling seamless **event flows** and integration through **webhooks** and **observability** features.\nConducted **code reviews** and provided **mentorship** to junior engineers, fostering a collaborative environment that emphasizes best practices in **architecture** and development workflows.\nIntroduced caching strategies to enhance the performance and responsiveness of applications, employing advanced techniques for **schema evolution**.\nCollaborated effectively using **Slack** and **Microsoft Teams** to facilitate communication among team members and stakeholders, ensuring alignment on project objectives and timelines.\nImplemented robust error handling mechanisms including **retries** and ensuring **idempotency** in various API operations to enhance reliability and user experience.\nLed architectural discussions that drove the integration of **AI services** into existing applications, enhancing functionality and user engagement.\nEstablished strategies for advanced logging and monitoring, integrating **observability** tools to ensure performance tracking and rapid issue resolution across all systems.\nInitiated and executed strategies for efficient **data caching**, reducing response times and improving application performance significantly by up to **40%**.\nDevised innovative solutions for high-stakes projects, contributing to successful deployments with minimal downtime and enhanced system resilience."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Developed and maintained scalable and secure APIs using **Ruby on Rails**, ensuring robust authentication and authorization mechanisms to protect sensitive financial data and services.\nDesigned and implemented event-driven architectures utilizing **event flows** and **webhooks** to facilitate seamless communications between services and enhance system observability and resilience under high transaction loads.\nCollaborated with cross-functional teams using **Slack** and **Microsoft Teams** to drive technical strategy discussions, ensuring smooth alignment on project deliverables and milestones.\nConducted thorough code reviews, providing mentorship to junior engineers, fostering best practices in software development, and enhancing team skills and expertise.\nImplemented caching strategies to optimize application performance while managing schema evolution to ensure compatibility and stability of financial data structures.\nEstablished rigorous observability practices including logging, monitoring, and alerting systems to quickly identify and resolve issues in production environments, ensuring uptime for financial services.\nApplied AI services for predictive analytics and fraud detection, unlocking insights from large transaction datasets while adhering to strict security standards for data protection.\nManaged rate limits and retries within API integrations to enhance reliability and performance, ensuring high availability during peak transaction volumes.\n"
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Designed APIs within a robust architecture using **Ruby on Rails** to streamline backend integrations, focusing on **Rate Limits**, **Retries**, and **Idempotency** to ensure high reliability for client applications.\nEngineered event-driven **Event Flows** leveraging **Webhooks** to enhance real-time communication between services, improving collaboration tools like **Slack** and **Microsoft Teams** for team notifications.\nImplemented secure **Authentication** and **Authorization** protocols, incorporating **role-based access control (RBAC)** to protect user data and maintain security throughout the application.\nApplied **Caching** techniques to optimize system performance, resulting in a **30%** improvement in response times for critical operations, while ensuring efficient **Data Contracts** and schema evolution adherence.\nConducted thorough code reviews and offered **Mentorship** to junior developers, fostering a culture of quality assurance and continual learning in software engineering practices.\nDeveloped a technical strategy focused on **Observability**, facilitating detailed logging and monitoring to quickly identify issues, enhancing system reliability for a user base of over **1 million**.\nArchitected scalable solutions for direct integrations with external **AI Services**, enhancing functionality and user experience as per evolving market demands.\nEnsured compliance with security best practices to safeguard sensitive data and facilitate seamless software updates without compromising system integrity."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, JavaScript/TypeScript, Ruby\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django, Ruby on Rails\n\n **Frontend Frameworks:**\n\tReact, Vue, Angular\n\n **API Technologies:**\n\tAPIs, Webhooks, Authentication, Authorization, Rate Limits, Retries, Idempotency\n\n **Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n **Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:**\n\tAzure, AWS, Security, Observability\n\n **Other:**\n\tAI Services, MLflow, Airflow, Kubeflow, Slack, Microsoft Teams, Event Flows, Technical Strategy, Architecture, Data Contracts, Caching, Schema Evolution, Code Reviews, Mentorship"
}