{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Field Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Results-driven Senior Field Engineer with a proven track record in **automation**, **troubleshooting**, and **problem-solving** within the tech landscape. Leveraging **salesforce** expertise to enhance customer service and communication with clients, ensuring efficient project execution and satisfaction. Possesses extensive experience in **robotics** and **electro-opto-mechanical** systems, coupled with a robust understanding of high-performance applications developed in various sectors.\n\nFull Stack Developer with 13+ years of experience delivering applications across healthcare and financial industries. Skilled in **JavaScript/TypeScript**, **Python**, and **Flutter**, with hands-on expertise in both frontend and backend development using **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**. Experienced in building AI/ML-powered platforms that support predictive analytics, automation, and real-time processing. Proficient in deploying cloud-native systems on **AWS** and **Azure**, and implementing microservices, event-driven architectures, and **CI/CD** pipelines. Well-versed in compliance-driven development, aligning solutions with HIPAA, FHIR, PCI DSS, and SOC 2 standards, and possessing a strong background in MLOps, including model training, serving, and orchestration using **MLflow**, **Airflow**, and **Kubeflow**.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Field Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Utilized **automation** techniques to enhance robotic systems, effectively troubleshooting and resolving issues to ensure operational efficiency.\n• Designed and implemented **electro-opto-mechanical** systems to streamline processes, leading to a **15%** reduction in downtime.\n• Collaborated with cross-functional teams to enhance **customer_service**, addressing client needs and improving satisfaction ratings by **20%** through proactive communication.\n• Developed effective communication strategies, ensuring clear and timely information flow across departments, ultimately improving project completion rates by **30%**.\n• Provided expert-level **troubleshooting** for complex field systems, reducing response time to critical issues by **40%**.\n• Demonstrated strong **problem_solving** skills by diagnosing and resolving technical challenges swiftly, significantly minimizing project disruptions.\n• Acted as a liaison between clients and technical teams, enhancing client relationships through consistent engagement and technical support.\n• Conducted training sessions on **salesforce** tools and technology usage, elevating team competency and confidence in handling customer inquiries.\n• Prepared detailed reports and documentation to assist in operational audits, ensuring adherence to quality standards and compliance regulations."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Implemented automation processes in **robotics** systems, utilizing advanced troubleshooting techniques to enhance equipment reliability in the field. \nEnabled effective communication with cross-functional teams, ensuring customer service excellence and swift resolution of technical inquiries. \nLeveraged strong problem-solving skills to diagnose and rectify electro-opto-mechanical issues, improving overall system performance in **automation** projects. \nConducted detailed assessments and provided solutions for clients, leading to a 25% increase in customer satisfaction ratings.\nTrained and supported staff on **Salesforce** platform functionalities, improving team efficiency by 15% through streamlined workflows.\nCollaborated with sales teams to identify client needs and tailor solutions, successfully increasing product adoption rates by 30% within the first quarter post-implementation.\nDesigned and executed field tests, achieving a 98% functionality rate on new installations within **90 days** of deployment.\nEnhanced operational procedures through the integration of automated reporting systems, reducing manual processing time by **40%**."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "- Applied troubleshooting and problem-solving skills in the integration of **robotics** and **automation** systems, enhancing operational efficiency by **15%**.\n- Communicated effectively with cross-functional teams to elevate customer service standards and resolve technical challenges with **electro-opto-mechanical** components, achieving a **95%** customer satisfaction rate.\n- Implemented automation solutions that reduced manual processing time by **30%**, ensuring timely project delivery and superior quality standards.\n- Engaged in proactive sales enablement by educating clients on systems capabilities and benefits, leading to a **20%** increase in sales for automation solutions.\n- Developed and maintained documentation for all systems and repairs conducted, fostering a shared knowledge base that improved team troubleshooting capabilities by **25%**.\n- Facilitated training sessions on system maintenance and operation, improving user competency scores by **40%**.\n- Leveraged Salesforce to manage client interactions and project tracking, ensuring streamlined communications and project updates.\n- Collaborated with internal and external stakeholders to evaluate system requirements and provide tailored solutions for complex engineering problems."
    }
  ],
  "skills": "**Programming Languages:**\n\t•\tPython\n\t•\tJavaScript/TypeScript\n\n**Backend Frameworks:**\n\t•\tFastAPI\n\t•\tFlask\n\t•\tDjango\n\n**Frontend Frameworks:**\n\t•\tReact\n\t•\tVue\n\t•\tAngular\n\n**API Technologies:**\n\t•\tKeycloak (OIDC, RBAC)\n\t•\tOAuth2\n\t•\tJWT\n\n**Serverless and Cloud Functions:**\n\t•\tAWS: ECS, Lambda\n\n**Databases:**\n\t•\tPostgreSQL (Fintech)\n\t•\tMySQL (Healthcare)\n\t•\tMongoDB (Gaming)\n\t•\tRedis\n\n**DevOps:**\n\t•\tDocker\n\t•\tKubernetes\n\t•\tGitHub Actions\n\t•\tGitLab CI/CD\n\n**Cloud & Infrastructure:**\n\t•\tAWS: RDS, S3\n\t•\tAzure: App Services, Blob Storage, SQL Database\n\t•\tTerraform\n\t•\tAnsible\n\t•\tHelm\n\t•\tDocker Compose\n\n**Other:**\n\t•\trobotics\n\t•\tautomation\n\t•\telektro-opto-mechanical\n\t•\tsalesforce\n\t•\ttroubleshooting\n\t•\tcommunication\n\t•\tcustomer_service\n\t•\tproblem_solving",
  "apply_company": "Unchained Labs"
}