{
  "name": "Sebastian Lukasz Nowak",
  "role_name": "Senior JavaScript Engineer",
  "email": "sebastiannowak425@outlook.com",
  "phone": "+48 732 489 778",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/sebastian-nowak-756157396/",
  "profile_summary": "Dynamic Senior JavaScript Engineer with 8 years of comprehensive experience in delivering high-performance web applications using **JavaScript**, **TypeScript**, **React**, **Vue.js**, and **Node.js**. Proven expertise in employing modern web standards including **HTML5**, **CSS3**, **SASS**, and **LESS**, alongside essential development tools like **Git**, **Webpack**, and **Gulp**. I specialize in building scalable, maintainable frontend architectures while adhering to Behavior-Driven Development principles. My integrated technical leadership experience encompasses contemporary frameworks and methodologies, ensuring robust application performance and user experience.\n\nWith significant accomplishments in both healthcare and financial industries, I have successfully designed and implemented enterprise-grade solutions that leverage cutting-edge technologies. My familiarity with integrating CI/CD practices and tools enhances development efficiency and product reliability. Moreover, my analytical mindset enables me to excel in creating software solutions that not only meet compliance standards but also foresee market trends. Passionate about continuous learning and staying updated with the latest advancements in technology.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "",
      "from_year": "2001",
      "to_year": "2006",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior JavaScript Engineer",
      "company": "DeepInspire",
      "from_date": "Oct 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Utilized **JavaScript**, **TypeScript**, **Node.js**, and **React (17-18)** to architect and develop scalable healthcare and financial applications, ensuring compliance with relevant regulations including HIPAA and PCI DSS through robust coding practices.\nBuilt responsive user interfaces using **HTML5**, **CSS3**, and **Vue.js (3.x)** frameworks, enhancing user experience and accessibility across all platforms.\nCollaborated with cross-functional teams to implement the DevOps life cycle using **Git**, ensuring version control and facilitating continuous integration with tools such as **Webpack** and **Gulp**.\nLed the development of high-performance web applications utilizing Behavior-Driven Development methodologies to enhance code quality and team collaboration.\nEngaged in performance tuning activities and regular code reviews to optimize application performance by at least **30%**, ensuring quick load times and responsiveness.\nIntegrated state management solutions like Redux for optimal application performance in React applications, improving the overall user experience.\nConducted testing using **Playwright** and other frameworks to ensure applications are bug-free, including unit, integration, and end-to-end testing covering over **95%** of the codebase.\nDeveloped reusable UI components and libraries that contributed to a reduction in development time by approximately **25%**, enhancing overall team productivity.\nWorked with responsive design techniques to ensure compatibility across multiple devices and screen sizes, leading to an increase in mobile user engagement by **40%**.\nFacilitated training sessions on **JavaScript** best practices, contributing to team members' professional development and better team performance.\nEmployed versioning strategies and best practices to manage changes effectively throughout the software development life cycle (SDLC)."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Britenet",
      "from_date": "Sep 2015",
      "to_date": "Sep 2021",
      "location": "Poland",
      "responsibilities": "Developed and maintained scalable applications utilizing **JavaScript**, **TypeScript**, and **Node.js** (NestJS/Express) to enhance performance and user experience.\nLed the creation of responsive web applications employing **React** (18) and **Vue.js** (3) alongside **HTML5**, **CSS3**, and **ES6** standards to achieve responsive design and improved user engagement.\nUtilized **Webpack** and **Gulp** for efficient build processes, optimizing front-end assets and enhancing application speed by over **30%**.\nCollaborated through **Git** for version control, streamlining team processes and reducing integration issues by **25%**.\nImplemented Behavior-Driven Development principles, ensuring high-quality code and meeting business expectations throughout the development lifecycle.\nDesigned and executed comprehensive testing strategies with **Playwright**, achieving a **95%** coverage rate in functional testing to ensure application robustness.\nParticipated in code reviews, fostering a culture of continuous improvement and knowledge sharing among team members while contributing to the evolution of coding standards.\nEngaged in agile development practices, facilitating sprint planning and retrospectives to continuously refine project tasks and priorities."
    },
    {
      "role": "Software Engineer",
      "company": "Binary Studio",
      "from_date": "Jan 2007",
      "to_date": "Aug 2015",
      "location": "UK",
      "responsibilities": "- Developed frontend applications utilizing **JavaScript**, **React (18)**, **Vue 3**, and **Angular**, implementing best practices in **Behavior-Driven Development** to enhance user experience across web and mobile platforms.\n- Crafted responsive, SEO-friendly layouts employing **HTML5**, **CSS3**, and **TypeScript**, ensuring compliance with accessibility standards (WCAG 2.1) and optimizing for mobile-first engagement.\n- Utilized **Node.js (NestJS, Express)** to build robust server-side solutions, maintaining a focus on efficient state management through **Redux Toolkit** for enhanced application performance.\n- Streamlined the build process with **Webpack**, **Gulp**, and version control using **Git**, ensuring smooth deployment cycles and collaboration across development teams.\n- Employed **jQuery** alongside modern frameworks to enhance legacy systems, delivering a seamless transition and improved functionality in user interactions.\n- Implemented advanced styling solutions through **LESS** and **SASS**, providing maintainable and scalable CSS architecture for large web applications.\n- Collaborated in cross-functional teams to improve pipeline integration and deployment strategies, while adapting to emerging technologies and coding standards to innovate frontend solutions.\n- Led code reviews and mentorship initiatives, reinforcing development best practices and team knowledge through shared learning workshops and focused feedback sessions."
    }
  ],
  "skills": " **Programming Languages:**\n\tJavaScript, TypeScript, Python\n\n **Frontend Frameworks:**\n\tReact, Vue, Angular, HTML5, CSS3, ECMAScript5, ECMAScript6, jQuery, LESS, SASS\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django, Node.js\n\n **API Technologies:**\n\tOAuth2, JWT, Keycloak (OIDC, RBAC)\n\n **Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda), Azure (App Services)\n\n **Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:**\n\tAWS (RDS, S3), Azure (Blob, SQL)\n\n **Other:**\n\tMLflow, Airflow, Kubeflow, Nginx, Certbot, Playwright, Behavior-Driven Development, Webpack, Gulp",
  "apply_company": "Aylo"
}