{
  "name": "Patryk Zaslawski",
  "role_name": "Senior Smart Engineer",
  "email": "patrykzas0428@outlook.com",
  "phone": "+48669862402",
  "address": "Gdanski, Poland",
  "linkedin": "https://www.linkedin.com/in/patryk-z-107978395/",
  "profile_summary": "As a Senior Smart Engineer with 8+ years in software engineering, I specialize in advanced cryptography, smart contract security audits, and DeFi solutions. My expertise includes working with technologies such as **Solidity**, **EVM**, **Solana**, **MythX**, **Slither**, **Hardhat**, **Foundry**, **Truffle**, and **Remix** for secure and efficient smart contract development. I am proficient in cloud platforms like **AWS**, **Azure**, and **GCP**, which I leverage to enhance multi-chain deployment and cross-chain bridging capabilities. Additionally, I have a strong foundation in building and optimizing systems using **Python** (FastAPI, Django, Flask, SQLAlchemy), and frontend technologies like **Angular**, **Vue**, **React**, and **Next.js**. My extensive experience extends to database optimization with **PostgreSQL**, **MySQL**, and **MongoDB**, ensuring high performance and reliability in all my projects, including those in e-commerce, financial, and healthcare sectors.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2014",
      "to_year": "2017",
      "location": "United Kingdom",
      "university": "The University of Manchester"
    }
  ],
  "experience": [
    {
      "role": "Senior Smart Engineer",
      "company": "Binary Studio",
      "from_date": "Aug 2023",
      "to_date": "Present",
      "location": "United Kingdom (Remote)",
      "responsibilities": "• Designed and deployed secure, scalable smart contract applications using **Solidity** on **EVM** and **Solana**, ensuring compliance with best practices in blockchain development.\n• Conducted comprehensive smart contract security audits utilizing tools such as **MythX**, **Slither**, and **Hardhat**, validating code integrity before deployment.\n• Implemented advanced security measures including **zero-knowledge proofs** and **advanced cryptography** techniques to bolster the security of decentralized applications.\n• Led cross-chain bridging initiatives and multi-chain deployments, optimizing the interoperability of applications across different blockchain networks with **Truffle** and **Remix**.\n• Developed and maintained automated testing frameworks using **Foundry** and continuous integration pipelines for efficient delivery and deployment of decentralized finance (DeFi) solutions.\n• Coordinated with teams to integrate **The Graph** for efficient data querying and retrieval in decentralized applications, improving performance by up to **50%**.\n• Mentored junior engineers in smart contract development and security best practices, fostering a culture of secure coding and collaboration.\n• Championed the implementation of automated bug bounty programs to continually identify and address vulnerabilities in smart contracts, improving the overall security posture of the applications.\n• Navigated cloud environments effectively, utilizing **GCP**, **AWS**, and **Azure** services to host and deploy decentralized applications, achieving seamless scaling.\n• Spearheaded the development of innovative Automated Market Makers (AMMs) and robust DeFi solutions, enhancing liquidity and transaction efficiency.\n• Evaluated and integrated third-party tools and libraries to improve application functionalities and user experience, ensuring modern design patterns and practices are applied.\n• Designed compliance frameworks to adhere to regulatory standards in blockchain technology, maintaining SOC 2 and ISO 27001 compliance as necessary."
    },
    {
      "role": "Software Engineer",
      "company": "Ardigen",
      "from_date": "Mar 2020",
      "to_date": "Aug 2023",
      "location": "Poland",
      "responsibilities": "• Developed and deployed smart contracts using **Solidity** in **Ethereum Virtual Machine (EVM)** environments, ensuring secure and efficient operation in decentralized finance (DeFi) applications.\n• Conducted comprehensive security audits utilizing tools such as **MythX** and **Slither**, achieving a **30%** reduction in vulnerabilities within the code base.\n• Managed cross-chain bridging and multi-chain deployment with **Truffle** and **Hardhat**, enabling seamless transactions across different blockchain platforms.\n• Implemented zero-knowledge proofs and advanced cryptography techniques to enhance security measures for sensitive transactions, ensuring regulatory compliance.\n• Leveraged cloud services like **AWS**, **GCP**, and **Azure** for infrastructure management, optimizing deployment strategies and scalability in smart contract applications.\n• Developed and executed bug bounty programs to identify and fix vulnerabilities in deployed contracts, resulting in a **50%** decrease in successful attacks.\n• Contributed to the design and creation of Automated Market Makers (AMMs) that facilitate efficient trading mechanisms within DeFi platforms, processing over **100,000** transactions daily.\n• Collaborated with cross-functional teams to integrate **The Graph** for efficient data indexing and retrieval in smart contract queries, enhancing application performance.\n• Conducted smart contract testing and auditing using **Remix** and **Foundry** to ensure high confidence in deployment integrity prior to production.\n• Maintained and upgraded existing smart contract infrastructure to adapt to evolving standards, improving transaction speed by **40%** across the network."
    },
    {
      "role": "Software Engineer",
      "company": "Altum Software",
      "from_date": "Oct 2017",
      "to_date": "Feb 2020",
      "location": "United Kingdom",
      "responsibilities": "Implemented secure smart contracts using **Solidity** and integrated them within **EVM** environments, ensuring reliability and security in DeFi applications.\nConducted comprehensive smart contract security audits with **MythX** and **Slither**, identifying vulnerabilities and enhancing code security and robustness before deployment.\nDeveloped and deployed decentralized applications (dApps) on various blockchain networks including **Solana**, utilizing tools like **Hardhat** and **Foundry** for efficient development workflows.\nFacilitated cross-chain bridging and multi-chain deployment strategies for seamless user experiences across different blockchain platforms, improving ecosystem interoperability.\nOptimized smart contract performance through advanced cryptography techniques, including **zero-knowledge proofs**, ensuring privacy and security in transactions.\nUtilized frameworks like **Truffle** and **Remix** for developing, testing, and deploying smart contracts, streamlining the development process and enhancing code quality.\nLeveraged **AWS**, **GCP**, and **Azure** for cloud-based infrastructure deployment, providing scalable solutions for blockchain applications and services.\nExecuted bug bounty programs to identify security weaknesses, processing reports from participants and implementing necessary fixes within a **2-week** timeframe.\nEngaged in advanced cryptography to secure DeFi applications, optimizing contract interactions to ensure efficient liquidity management through **AMMs**.\nPerformed performance testing on all smart contracts using **The Graph** for querying data efficiently, ensuring high accessibility and quick response times under peak loads.\nLed initiatives in smart contract performance optimization, achieving a **30%** reduction in gas costs on average for transactions across deployed contracts.\nIntegrated various blockchain technologies and tools to ensure maximum security and functionality, enabling innovative use cases within the decentralized finance domain."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, Solidity\n\n **Backend Frameworks:**\n\tFastAPI, Django, Flask, Spring Boot\n\n **Frontend Frameworks:**\n\tAngular (1–16), React (15–18), Next.js, Vue.js (2/3), Blazor\n\n **API Technologies:**\n\tREST & gRPC APIs\n\n **Serverless and Cloud Functions:**\n\tAWS (Lambda), Azure (App Services)\n\n **Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, AWS (ECS, RDS, S3), Azure (Blob, SQL)\n\n **Cloud & Infrastructure:**\n\tGCP, AWS, Azure\n\n **Other:**\n\tSQLAlchemy, Pydantic, Celery, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, MythX, Slither, Hardhat, Foundry, Truffle, Remix, The Graph, smart contract security audits, bug bounty, zero-knowledge proofs, advanced cryptography, DeFi, AMMs, cross-chain bridging, multi-chain deployment",
  "apply_company": "Lazer"
}