{
  "name": "Tomasz Lee",
  "role_name": "Lead/Staff Backend Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-477994390/",
  "profile_summary": "Highly skilled Lead/Staff Backend Engineer with 9+ years of experience in developing and implementing complex applications, leveraging proficiency in **Python**, **relational databases**, **data modeling**, **distributed systems design**, and **AWS**. Deep understanding of **SaaS environments**, **infrastructure-as-code**, and **container orchestration**. Proven track record in crafting efficient **DevOps pipelines** and enhancing **platform reliability** through observability practices. Recognized for strong communication skills and a collaborative mindset, driving cross-team initiatives and leading projects to deliver robust solutions. Additionally proficient in **Apache Kafka**, **RabbitMQ**, and **Redis**, alongside frontend technologies like **ReactJS** and **NextJS**, adept at optimizing performance and streamlining development processes.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Lead/Staff Backend Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Apr 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Led the design and implementation of distributed systems using **AWS** and **Python**, ensuring high availability and reliability in a SaaS environment.\nImplemented infrastructure-as-code strategies to streamline deployment processes and enhance observability across services.\nDesigned and optimized relational databases, improving data modeling practices, which resulted in a 30% increase in query performance.\nDeveloped and maintained CI/CD pipelines, reducing deployment time by **40%** and improving overall platform reliability.\nUtilized **container orchestration** tools to manage microservices in a **DevOps** environment, enhancing scalability and fault tolerance.\nSpearheaded strategic initiatives for platform reliability, achieving an uptime of **99.9%** through effective monitoring and incident management.\nCultivated a collaborative team culture by fostering strong communication and teamwork skills while mentoring junior engineers.\nImplemented best practices for data security and compliance within the application architecture.\nConducted regular reviews and optimizations of system performance, leading to a **25%** improvement in response times.\nUtilized a proactive approach to problem-solving in complex system design, ensuring efficient resolution of issues in distributed architectures."
    },
    {
      "role": "Full Stack Developer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "Applied **Python** in designing and developing scalable backend systems within **SaaS environments**, leading to a 20% increase in application reliability.\nEngineered **distributed systems design** using **AWS** and **infrastructure-as-code**, enabling seamless deployment across multiple environments with a **70% reduction** in setup times.\nImplemented data modeling techniques in relational databases, such as **PostgreSQL** and **MySQL**, optimizing for performance and handling over **100,000** concurrent transactions.\nEnhanced platform reliability through monitoring and observability tools, achieving a **99.9% uptime** across all services.\nArchitected and maintained container orchestration solutions using **Docker** and **Kubernetes**, streamlining deployment processes.\nDeveloped and managed **DevOps pipelines** with **GitHub Actions**, reducing integration testing time by **40%**.\nLed cross-functional teams with strong communication skills to define system requirements, resulting in successful on-time projects.\nFostered a collaborative mindset by facilitating code reviews, contributing to improved team cohesion and enhanced output.\nApplied strategic thinking to propose innovative solutions, directly impacting project timelines and overall performance.\nUtilized **D3.js** to create dynamic data visualizations for enhanced reporting capabilities, improving stakeholder engagement by **30%**."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "• Developed robust **SaaS environments** using **Python**, enhancing customer engagement by 30%.\n• Designed data models for relational databases, ensuring data integrity and optimized query performance, resulting in an increase in data retrieval efficiency by **15%**.\n• Engineered distributed systems with a focus on **platform reliability**, achieving a **99.9% uptime** through rigorous testing and monitoring.\n• Implemented infrastructure-as-code strategies using **AWS CloudFormation**, allowing for consistent deployment across environments in less than **10 minutes**.\n• Orchestrated containerized applications using **Kubernetes**, simplifying deployment processes and improving scalability during high traffic periods.\n• Established DevOps pipelines to streamline development workflows, reducing deployment time by **40%**.\n• Integrated observability solutions, leading to a substantial reduction in incident response times by **25%**.\n• Fostered a collaborative mindset within the team, facilitating effective communication and knowledge sharing during daily standups and project meetings.\n• Participated in strategic planning sessions to define and align project goals with organizational objectives, leveraging strong communication skills.\n• Delivered insightful technical documentation, resulting in improved onboarding procedures and a **20% reduction** in support queries."
    }
  ],
  "skills": " **Programming Languages**\n\t Python\n\n**Backend Frameworks**\n\t NodeJS, ExpressJS, NestJS, C#, .NET, Entity Framework, Microservices\n\n**Frontend Frameworks**\n\t HTML, CSS, JavaScript, TypeScript, ReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n**API Technologies**\n\t RESTful API, GraphQL\n\n**Serverless and Cloud Functions**\n\t AWS\n\n**Databases**\n\t MSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB, relational databases, data modeling\n\n**DevOps**\n\t CI/CD pipelines, DevOps pipelines, container orchestration, infrastructure-as-code, observability, platform reliability\n\n**Cloud & Infrastructure**\n\t Azure\n\n**Other**\n\t Messaging & Caching: Apache Kafka, RabbitMQ, Redis, Testing Tools: NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest, Blockchain: Solidity, Ether.js, Web3.js, Ethereum, UX/UI Design, Git, GitHub, Redux, distributed systems design, SaaS environments, strong communication skills, collaborative mindset, strategic thinking"
}