{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Full-Stack Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "Results-driven Senior Full-Stack Engineer with 8 years of comprehensive experience in developing cutting-edge solutions integrating **Java**, **Spring Boot**, **React**, **TypeScript**, and modern **JavaScript** frameworks. Proficient in employing CI/CD methodologies utilizing **GitHub**, **Jenkins**, **GitHub Actions**, and **SonarQube** to enhance development workflows and ensure clean code practices. Demonstrated expertise in creating scalable **microservices** architectures and implementing responsive designs using **HTML** and **CSS** within Agile team environments. \n\nSkilled in building high-performance applications in the healthcare and financial sectors, I lead projects that align with compliance standards including HIPAA and PCI DSS. My solid foundation in **unit testing** and design patterns enhances code quality and maintainability. I also excel in collaboration, driving successful project outcomes through effective teamwork and communication.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Full-Stack Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Developed scalable, full-stack applications utilizing **Java**, **Spring Boot**, **TypeScript**, and **React** while adhering to industry best practices for **clean code** and **design patterns**.\nEngineered microservices architecture to improve system performance and maintainability, ensuring seamless integration with APIs and service endpoints.\nImplemented CI/CD pipelines using **GitHub Actions**, **Jenkins**, and **SonarQube**, resulting in automated testing and deployment processes that reduced release cycles by **50%**.\nApplied **unit testing** practices and collaborated on **Agile** methodologies to ensure high-quality code and timely feature delivery within cross-functional teams.\nDesigned responsive user interfaces using **HTML**, **CSS**, and **JavaScript**, enhancing user experiences across web platforms, ensuring compatibility across desktop and mobile devices.\nContributed in refining development processes through **collaboration** and code reviews, fostering a culture of continuous learning and improvement within the team.\nUtilized advanced visualizations to showcase data insights, leading to a **30%** increase in user engagement with dashboard features and applications.\nExecuted Agile sprint planning sessions that optimized team workflows, achieving **95%** sprint goals consistently.\nConducted training sessions on **microservices** design principles, improving team proficiency and adoption of modern technological practices."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "• Developed robust, microservices-based applications utilizing **Java** and **Spring Boot**, enhancing system scalability and enabling high-volume transaction processing for financial platforms.\n• Architected and built dynamic, user-focused front-end applications using **React (18)** and **TypeScript**, ensuring responsive and performant user interfaces for business-critical dashboards and admin portals.\n• Employed CI/CD practices through **GitHub**, **Jenkins**, and **GitHub Actions** to streamline deployment processes, leading to a 30% reduction in deployment time.\n• Implemented clean code principles and design patterns to enhance code maintainability and readability, resulting in a 25% improvement in team collaboration efficiency.\n• Conducted unit testing and code reviews using **SonarQube** to ensure high code quality and adherence to Agile methodologies, enhancing product reliability.\n• Collaborated with cross-functional teams in an Agile environment, fostering a culture of continuous improvement and innovation.\n• Integrated responsive design practices using **HTML**, **CSS**, and libraries such as **Tailwind CSS** to ensure seamless user experiences across devices.\n• Participated in knowledge sharing and mentorship activities, enhancing team skills and promoting clean coding practices."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "• Developed high-quality, maintainable code using **Java** and **Spring Boot** for backend services, enhancing scalability and performance for a global e-commerce platform.\n• Implemented CI/CD pipelines with tools such as **Jenkins**, **GitHub Actions**, and **SonarQube**, ensuring seamless integration and delivery of features every **2 weeks**.\n• Designed interactive frontend components using **React** (version **18**) and **TypeScript**, enabling responsive user experiences with a focus on accessibility and performance.\n• Employed Agile methodologies to collaborate effectively within cross-functional teams, delivering project milestones on schedule.\n• Created responsive and SEO-friendly designs utilizing **HTML**, **CSS**, and responsive design principles adhering to **WCAG 2.1** for improved user engagement.\n• Leveraged best practices in clean code and design patterns to ensure code quality and maintainability across several microservices.\n• Performed unit testing and code reviews, significantly reducing bugs by **30%** before deployment and enhancing overall product stability.\n• Collaborated in feature brainstorming sessions and sprint planning to align development goals with business objectives, fostering a culture of teamwork and innovation.\n• Integrated **GitHub** for version control, enabling efficient tracking of feature developments and collaboration with team members.\n• Applied design patterns to optimize application architecture, improving response times and user satisfaction metrics by **15%**."
    }
  ],
  "skills": " **Programming Languages:**\n\tJava, Python, JavaScript, TypeScript\n\n **Backend Frameworks:**\n\tSpring Boot, FastAPI, Flask, Django\n\n **Frontend Frameworks:**\n\tReact, Vue, Angular, HTML, CSS\n\n **API Technologies:**\n\t\n\n **Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n **Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Jenkins, SonarQube, Terraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:**\n\t\n\n **Other:**\n\tMLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, CI/CD, Microservices, Responsive Design, Agile, Clean Code, Design Patterns, Unit Testing, Collaboration",
  "apply_company": "Jedox"
}