{
  "name": "Tomasz Lee",
  "role_name": "Senior Graphics Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Dynamic Senior Graphics Engineer with 9+ years of extensive experience in software development and a strong focus on optimization and debugging within graphics programming. Proficient in C++, Rust, OpenGL ES, WebGL, Metal, WebGPU, Vulkan, and DirectX, with a proven track record of enhancing performance and security in graphical applications. Adept at implementing complex solutions and employing effective memory management alongside inter-process communication (IPC). Strong foundation in delivering robust, high-performance graphics solutions while collaborating effectively across teams to achieve project objectives.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Senior Graphics Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Utilized **C++** and **Rust** to design and optimize high-performance graphics algorithms, enhancing rendering speed by **30%**.\nImplemented **OpenGL ES**, **WebGL**, and **Vulkan** for cross-platform graphical applications, achieving compatibility across **3** different operating systems.\nLeveraged **DirectX** for creating immersive real-time graphics and improved debugging techniques that reduced bug resolution time by **25%**.\nConducted thorough optimization of graphics processing tasks, improving overall frame rate stability by **15%**.\nEnhanced security measures within graphical applications through comprehensive testing and implementation of best practices, ensuring user data integrity.\nCollaborated with cross-functional teams to refine graphics pipelines and ensure seamless integration of new rendering technologies.\nDeveloped and maintained IPC mechanisms for efficient communication between graphics processes, significantly reducing data transfer times.\nTrained junior engineers on optimization techniques and graphics debugging strategies, improving overall team output and knowledge sharing."
    },
    {
      "role": "Software Engineer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "• Developed and optimized graphics rendering techniques using **C++** and **OpenGL ES**, achieving a **20% increase** in frame rates across applications.\n• Implemented debugging and optimization strategies for rendering pipelines, enhancing performance efficiency by **30%**.\n• Conducted performance profiling and analysis using **Vulkan**, leading to resolution of critical performance bottlenecks.\n• Collaborated on cross-platform graphics application development leveraging **WebGL** and **Metal**, ensuring compatibility across devices.\n• Resolved security vulnerabilities identified in rendering code, enhancing the security posture of applications by **15%**.\n• Created and maintained GPU-accelerated components using **DirectX**, contributing to smoother visual experiences in software products.\n• Engaged in IPC optimization for data sharing among processes, improving communication efficiency by **25%**.\n• Mentored junior developers in debugging practices and optimization techniques, contributing to improved project timelines and team performance.\n• Leveraged modern rendering techniques with **WebGPU** to enhance graphic fidelity and performance in real-time applications.\n• Developed comprehensive unit tests for graphics components, ensuring robust features and **95% code coverage**."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "Utilized **C++** and **Rust** to develop high-performance graphics applications, ensuring optimal rendering performance and memory management.\nEmployed **OpenGL ES**, **WebGL**, and **Metal** for graphics programming, achieving frame rates of **60 FPS** in demanding graphics environments.\nImplemented **WebGPU** and **Vulkan** to enhance graphics rendering capabilities, leading to a **30%** reduction in latency during rendering tasks.\nDesigned debugging tools and optimization strategies to improve graphical output, resulting in a **25%** decrease in GPU load.\nConducted performance profiling and security assessments to ensure the robustness and safety of graphic applications.\nLed efforts to implement Inter-Process Communication (**IPC**) solutions for efficient data exchange between rendering processes, enhancing resource utilization.\nCollaborated on code optimization projects that improved rendering efficiency by an additional **15%** across various graphics engines.\nEngaged in regular code reviews to maintain high coding standards and foster team collaboration, reinforcing commitment to project success.\nDelivered comprehensive technical documentation and training sessions on graphics development best practices, facilitating knowledge sharing within the team.\nParticipated in agile development processes, effectively coordinating with cross-functional teams to meet project deadlines."
    }
  ],
  "skills": " **Programming Languages**\n\tC++, Rust, Python\n\n**Backend Frameworks**\n\tNodeJS, ExpressJS, NestJS, C#, .NET, Entity Framework, Microservices\n\n**Frontend Frameworks**\n\tHTML, CSS, JavaScript, TypeScript, ReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n**API Technologies**\n\tRESTful API, GraphQL\n\n**Serverless and Cloud Functions**\n\tAWS, Azure\n\n**Databases**\n\tMSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB\n\n**DevOps**\n\tCI/CD pipelines\n\n**Cloud & Infrastructure**\n\tGit, GitHub\n\n**Other**\n\tMessaging & Caching: Apache Kafka, RabbitMQ, Redis, Testing Tools: NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest, Blockchain: Solidity, Ether.js, Web3.js, Ethereum, Debugging, Optimization, Security, IPC, GPU, OpenGL ES, WebGL, Metal, WebGPU, Vulkan, DirectX",
  "apply_company": "Mozilla"
}