{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Angular Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Results-oriented Senior Angular Engineer with 13+ years of experience in delivering high-performance applications in the healthcare and financial sectors. Proficient in **Angular**, **TypeScript**, and **Tailwind**, with a strong focus on **Responsive Design** and **Mobile Compatibility**. Demonstrated ability to optimize performance and debug complex systems to ensure seamless user experiences.\nSkilled in Agile methodologies and Scrum practices, fostering collaboration within cross-functional teams to drive project success. Experienced in full-stack development using **JavaScript**, **Python**, **React**, and **Node.js**, along with CI/CD pipelines and cloud deployment on **AWS** and **Azure**. Adept at compliance-driven development, maintaining alignment with HIPAA and PCI DSS standards, and specializing in AI/ML-powered platforms with a solid foundation in MLOps using **MLflow** and **Airflow**.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Angular Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Developed and implemented responsive web applications using **Angular** and **TypeScript**, ensuring seamless **mobile compatibility** and adherence to **responsive design** principles.\n• Optimized performance for frontend applications, utilizing techniques to enhance load speed and user experience while maintaining high standards of **debugging** and performance checks.\n• Led agile development processes employing **Scrum** methodologies to facilitate collaboration within cross-functional teams, resulting in faster delivery times and increased project visibility.\n• Produced comprehensive **technical documentation** for system architectures, ensuring clear communication of design choices and methods among team members and stakeholders.\n• Collaboratively refined application features and addressed bugs through iterative testing and feedback, fostering an environment of continual improvement.\n• Engaged in code reviews and performance assessments, applying best practices to ensure high-quality output and compliance with industry standards.\n• Participated in the full software development lifecycle, from analysis and design through coding and testing, maintaining focus on delivering business value through technology."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Utilized **Angular** and **TypeScript** to modernize front-end applications, ensuring mobile compatibility and responsive design for enhanced user experience across financial platforms.\nImplemented performance optimization techniques and debugging practices to improve application speed and reliability, resulting in a **30%** increase in load times across key interfaces.\nCollaborated in an **Agile** environment, applying **Scrum** methodologies to accelerate the development cycle and enhance team productivity by **25%**.\nCreated detailed technical documentation to guide future development efforts and facilitate onboarding of new team members, reducing onboarding time by **15%**.\nDeveloped interactive front-end components using **Tailwind CSS** for a sleek, responsive design, ensuring seamless integration with back-end services in **Node.js** and **Python** frameworks.\nEnhanced existing applications for better mobile compatibility, achieving a **40%** increase in mobile user engagement.\nLed code reviews and implemented best practices in coding standards to maintain high-quality deliverables while fostering a knowledge-sharing culture within the team."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "• Developed dynamic frontend applications using **Angular** (latest version) and **TypeScript**, implementing **responsive design** principles to ensure optimal viewing experiences across devices.\n• Applied **Tailwind CSS** for custom styling solutions that enhance the **mobile compatibility** and accessibility of the applications, achieving a mobile-first design that complies with WCAG 2.1 standards.\n• Collaborated in an **Agile** environment utilizing **Scrum** methodologies to streamline project workflows and improve team performance, contributing to a **30%** increase in delivery efficiency.\n• Engaged in **performance optimization** techniques to ensure applications maintain low latency and high responsiveness, meeting performance benchmarks with load times reduced by **40%**.\n• Executed debugging processes and conducted thorough troubleshooting for applications, successfully identifying and resolving issues, which led to a **25%** decrease in reported bugs post-release.\n• Created comprehensive **technical documentation** for the developed applications, facilitating easier onboarding for new team members and effectively maintaining knowledge transfer within the team."
    }
  ],
  "skills": "Programming Languages:\n\tJavaScript/TypeScript\n\n**Frontend Frameworks:**\n\tAngular, React, Vue, Tailwind, Responsive Design, Mobile Compatibility\n\n**Backend Frameworks:**\n\tPython: FastAPI, Flask, Django\n\n**API Technologies:**\n\t\n\n**Serverless and Cloud Functions:**\n\tAWS: Lambda, ECS, S3\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD\n\n**Cloud & Infrastructure:**\n\tAWS: RDS, Azure: App Services, Blob Storage, SQL Database\n\n**Other:**\n\tAgile, Scrum, MLflow, Airflow, Kubeflow, Performance Optimization, Debugging, Technical Documentation, Keycloak (OIDC, RBAC), OAuth2, JWT, Nginx, Let’s Encrypt, Certbot, Terraform, Ansible, Helm, Docker Compose",
  "apply_company": "Gizli"
}