{
  "name": "Rei Taro",
  "role_name": "Senior Rust Engineer",
  "email": "rei515@outlook.com",
  "phone": "+48732529451",
  "address": "Warszawa, Poland",
  "linkedin": "https://www.linkedin.com/in/rei-taro-81a410391/",
  "profile_summary": "Results-driven Senior Rust Engineer with over 10 years of experience in backend development and a strong focus on scalable systems and high-demand environments. Proficient in **Rust**, with expertise in **gRPC** for efficient communication and experience in managing **databases**. Strong background in **cryptography**, **networking**, and **cybersecurity**, incorporating these elements into secure backend solutions. Passionate about leveraging **blockchain** technologies to enhance system integrity and user trust. Proven impact through contributions to leading organizations such as VISA, Sii Poland, and Reply Polska, excelling at designing and delivering innovative solutions in financial platforms and AI/ML applications.",
  "education": [
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2010",
      "to_year": "2015",
      "location": "Japan",
      "university": "Keio University"
    }
  ],
  "experience": [
    {
      "role": "Senior Rust Engineer",
      "company": "Leobit",
      "from_date": "Aug 2022",
      "to_date": "Present",
      "location": "Poland",
      "responsibilities": "Designed and implemented secure and efficient backend systems utilizing **Rust**, incorporating **gRPC** for effective service communication and data exchange.\nDeveloped robust database solutions to facilitate efficient data storage and retrieval, ensuring high performance and reliability.\nEnhanced system security through the implementation of advanced **cryptography** techniques and adherence to **cybersecurity** best practices to safeguard user data and application integrity.\nEngaged in **networking** optimization strategies to improve service connectivity and reduce latency across applications.\nExplored and integrated **blockchain** technology to create innovative financial solutions, driving transaction transparency and security across environments.\nCollaborated with cross-functional teams to troubleshoot system integration challenges, ensuring seamless collaboration and compliance across all initiatives.\nUtilized performance metrics and benchmarks to establish strategies for system enhancement, aiming for at least **30%** improvement in processing speeds and reliability."
    },
    {
      "role": "Software Engineer",
      "company": "Innovature",
      "from_date": "Nov 2018",
      "to_date": "Jun 2022",
      "location": "Japan",
      "responsibilities": "• Developed robust backend systems leveraging **Rust** and **gRPC** for enhanced performance and scalability.\n• Engineered secure data handling processes incorporating **cryptography** practices to safeguard sensitive information and maintain data integrity.\n• Collaborated on **networking** protocols to improve system communication and enable efficient data exchange.\n• Implemented database solutions ensuring high availability and performance in line with business requirements.\n• Integrated **blockchain** technology to enhance transactional security and transparency, contributing to the development of a cutting-edge system.\n• Conducted security audits, ensuring adherence to stringent cybersecurity standards, promoting a secure operational environment.\n• Managed cross-functional collaborations to ensure system updates and new features align with project timelines and compliance requirements."
    },
    {
      "role": "Software Developer",
      "company": "Wizcorp",
      "from_date": "Apr 2015",
      "to_date": "Nov 2018",
      "location": "Japan",
      "responsibilities": "Leveraged **Rust** and **gRPC** to architect scalable backend services for trade execution and account tracking, optimizing performance for over **1,000,000** transactions per day.\nIntegrated advanced **cryptography** techniques to enhance data security and compliance with regulatory standards, delivering robust solutions for sensitive financial data.\nDesigned and implemented high-performance database solutions capable of handling **10TB** of financial data using industry-standard technologies, ensuring reliable data access and integrity.\nDeveloped custom networking solutions to facilitate secure communication between services, supporting multi-cloud architectures and enhancing system reliability.\nImplemented comprehensive **cybersecurity** protocols aligned with industry standards, reducing potential vulnerabilities by **30%**.\nExplored and integrated **blockchain** technology for secure transaction records, driving innovation in trade settlement processes and ensuring transparency.\nCollaborated effectively with cross-functional teams to ensure seamless integration of services, contributing to an optimized user experience and high system availability."
    }
  ],
  "skills": " **Programming Languages**\n\tRust, Python (3.8+), SQL, Bash, JavaScript\n\n**Backend Frameworks**\n\tFastAPI, Flask, Django, Celery\n\n**Frontend Frameworks**\n\t\n\n**API Technologies**\n\tREST/gRPC APIs, gRPC\n\n**Serverless and Cloud Functions**\n\tAWS (EC2, S3, Lambda), Azure\n\n**Databases**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps**\n\tDocker, Kubernetes, GitHub Actions, Azure DevOps, CI/CD, Git\n\n**Cloud & Infrastructure**\n\t\n\n**Other**\n\tAI/ML Tools: Pandas, NumPy, scikit-learn, TensorFlow, Airflow, MLflow, Microservices, Kafka, cryptography, networking, cybersecurity, blockchain",
  "apply_company": "IOTA"
}