{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Fullstack Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-623a26390/",
  "profile_summary": "Full Stack Developer with 13+ years of experience in delivering high-performance web-based applications, specializing in **React.js** for frontend development and **AWS** for cloud-native systems. Proficient in implementing APIs, continuous integration, continuous deployment, and continuous delivery practices, while leveraging version control best practices.\nExpertise in creating robust testing strategies and utilizing logging and monitoring tools to ensure application reliability. Demonstrated ability to adapt to new technologies, focusing on clean coding principles and effective problem-solving. Proven track record in the healthcare and financial industries, skilled in **JavaScript/TypeScript**, **Python**, **Flutter**, and backend technologies such as **Node.js**, **FastAPI**, and **Django**. Additionally, experienced in building AI/ML-powered platforms, addressing compliance with HIPAA, FHIR, PCI DSS, and SOC 2 standards, along with a strong foundation in MLOps utilizing **MLflow**, **Airflow**, and **Kubeflow**.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Fullstack Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Developed web-based applications using **React.js** (version 17–18) and **Svelte**, ensuring seamless integration with various **APIs** for optimal user experience.\n- Implemented **continuous integration** and **continuous deployment** (CI/CD) pipelines utilizing **GitHub Actions** and **CircleCI**, achieving deployment cycles reduced by **30%**.\n- Enforced clean coding principles throughout the development process to maintain high code quality and enhance team collaboration.\n- Created robust testing strategies using **Jest** and **Cypress** to ensure thorough validation of software, resulting in improved code reliability by **25%**.\n- Engaged in problem-solving initiatives to optimize application performance, leveraging *modern technologies* and frameworks.\n- Adapted to evolving project requirements by rapidly integrating new tools and approaches, such as monitoring tools for enhanced application insights.\n- Conducted version control processes with **Git** to streamline code changes and maintain project history.\n- Integrated logging tools for application tracking and debugging, improving error resolution time by **40%**.\n- Collaborated with cross-functional teams to enhance application features and incorporate user feedback, leading to an **increase in customer satisfaction scores by 15%**.\n- Maintained compliance with industry standards and security protocols, ensuring applications met necessary regulations."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Implemented web-based applications using **React.js (18)** and **Svelte**, ensuring seamless integration with **APIs** to enhance user experience in financial services.\nUtilized **testing strategies** to ensure high-quality code, leading to a 20% reduction in bugs and enhancing the reliability of critical applications.\nEnhanced operational efficiency by establishing **continuous integration**, **continuous deployment**, and **continuous delivery** practices, resulting in a deployment frequency improvement of 50%.\nManaged version control effectively through **Git**, maintaining a clear and organized project history while collaborating with cross-functional teams.\nDeveloped monitoring tools and logging frameworks that improved system diagnostic capabilities, reducing downtime by 15% through proactive issue resolution.\nDemonstrated problem-solving skills by addressing complex technical challenges, contributing to a 30% increase in platform performance through optimization.\nAdapted to evolving project requirements swiftly, ensuring timely delivery of features aligned with business goals and user feedback.\nEmployed clean coding principles, maintaining a codebase that is not only efficient but also easily understandable for future updates.\nDeployed applications on **AWS**, optimizing cloud resources to maximize performance and minimize costs."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "• Developed web-based applications using **React.js** (version 18) and **Svelte**, enhancing user engagement and interactivity.\n• Architected and maintained robust **APIs** to facilitate seamless communication between frontend and backend services, ensuring high performance and reliability.\n• Implemented **continuous integration**, **continuous deployment**, and **continuous delivery** practices with tools such as Jenkins and CircleCI, leading to a **30%** reduction in deployment time.\n• Utilized **AWS** services for scalable application hosting, optimizing resource allocation leading to a **20%** decrease in operational costs.\n• Employed testing strategies utilizing **Jest** and **Mocha** ensuring quality assurance of code with a focus on clean coding principles, achieving **95%** test coverage.\n• Integrated advanced logging and monitoring tools like **Datadog** and **Grafana** to proactively address performance issues, minimizing downtime by **15%**.\n• Adapted coding solutions to align with project needs, demonstrating strong problem-solving skills while ensuring code maintainability and scalability.\n• Collaborated with cross-functional teams to manage version control effectively using **Git**, ensuring synchronized team efforts and continuous improvement.\n• Engaged in rigorous code reviews, fostering an environment of learning and applying feedback to enhance personal and team productivity.\n• Drove UI/UX improvements by implementing responsive design principles, significantly enhancing mobile compatibility and accessibility compliance."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, JavaScript/TypeScript\n\n **Frontend Frameworks:**\n\tReact, Vue, Angular, Svelte\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n **API Technologies:**\n\tAPIs\n\n **Serverless and Cloud Functions:**\n\tAWS: Lambda\n\n **Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:**\n\tAWS: ECS, RDS, S3, Azure: App Services, Blob Storage, SQL Database\n\n **Other:**\n\tMLflow, Airflow, Kubeflow, Nginx, Let’s Encrypt, Certbot, Keycloak (OIDC, RBAC), OAuth2, JWT, Logging tools, Monitoring tools, Continuous integration, Continuous deployment, Continuous delivery, Version control, Testing strategies, Problem-solving, Adaptability, Clean coding principles"
}