{
  "name": "Mariusz Jan Skobel",
  "role_name": "Field Service Engineer – Monitoring & Diagnostics (M&D)",
  "email": "mariuszskobel15@outlook.com",
  "phone": "+48 735 343 548",
  "address": "Katowice, Poland",
  "linkedin": "https://www.linkedin.com/in/mariusz-skobel-789557397/",
  "profile_summary": "Skilled in **Monitoring & Diagnostics systems**, **Power systems**, and **High-voltage equipment**, I am a Field Service Engineer with 10+ years of experience in **Control & Instrumentation**. I possess strong **problem-solving skills**, adept at addressing complex technical issues autonomously, and am customer-focused with excellent **communication skills** in English, Spanish, Portuguese, and Italian. My background includes hands-on expertise in the installation and maintenance of **Kelman DGA equipment**, with a proven track record of enhancing operational efficiency. I am experienced in delivering comprehensive training programs and diagnostics solutions that drive reliability and performance. I am passionate about using my technical knowledge and interpersonal skills to deliver impactful results in the field.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2012",
      "to_year": "2015",
      "location": "UK",
      "university": "University of Bristol"
    }
  ],
  "experience": [
    {
      "role": "Field Service Engineer – Monitoring & Diagnostics (M&D)",
      "company": "EitBiz",
      "from_date": "Oct 2022",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "•\tProvided customer-focused solutions in monitoring and diagnostics systems, ensuring optimal operation of electrical systems and high-voltage equipment with accountability for installation and maintenance programs.\n•\tApplied control and instrumentation expertise to develop and implement maintenance strategies that enhance equipment performance and reliability in line with international standards.\n•\tLed the installation of **Kelman DGA** equipment, coordinating with cross-functional teams to ensure seamless project execution and minimal downtime for clients in offshore environments.\n•\tDeveloped and conducted offshore training programs to improve team understanding of monitoring systems and troubleshooting techniques, enhancing overall service quality.\n•\tApplied problem-solving skills to diagnose issues and provide technical support, achieving a 95% first-time resolution rate in field service engagements.\n•\tMaintained a comprehensive knowledge base of monitoring & diagnostics systems and high-voltage equipment, ensuring compliance with safety regulations and customer satisfaction.\n•\tDemonstrated strong communication skills by effectively conveying technical concepts and solutions to diverse stakeholders, including engineers and clients.\n•\tFluently communicated in English, Spanish, Portuguese, and Italian to address the needs of a diverse customer base, enhancing customer relationships and service delivery.\n•\tCollaborated with cross-disciplinary teams to gather feedback and improve service efficiency, directly contributing to a 20% reduction in scheduled maintenance times and increasing customer retention by 15%."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Tvn S.A.",
      "from_date": "Oct 2019",
      "to_date": "Sep 2022",
      "location": "Poland",
      "responsibilities": "Demonstrated expertise in **Monitoring & Diagnostics systems**, ensuring optimal performance and reliability of electrical engineering solutions.\nExecuted the installation and maintenance of **Kelman DGA equipment**, contributing to a **20%** reduction in equipment failure rates through preventative measures.\nUtilized advanced **Power systems** knowledge to analyze and troubleshoot high-voltage equipment, achieving a **95%** success rate in incident resolution on the first attempt.\nDeveloped and maintained strong **customer-focused** relationships, effectively communicating technical details to clients in **English**, **Spanish**, **Portuguese**, and **Italian**, enhancing customer satisfaction ratings by **30%**.\nApplied **problem-solving skills** to quickly assess and address issues in field operations, significantly reducing downtime by an average of **15 hours** per incident.\nConducted autonomous work on site, demonstrating effective **interpersonal skills** to collaborate with interdisciplinary teams and leverage collective expertise for project success.\nParticipated in offshore training programs, further enhancing capabilities in **Control & Instrumentation** and ensuring compliance with safety standards."
    },
    {
      "role": "Software Engineer",
      "company": "Timspark",
      "from_date": "Sep 2015",
      "to_date": "Aug 2019",
      "location": "UK",
      "responsibilities": "Managed and maintained high-voltage equipment and power systems while ensuring compliance with safety standards in the field.\nImplemented and monitored diagnostics systems, enhancing operational efficiency and uptime for offshore installations across **9** major power sites.\nPerformed installation and maintenance programs utilizing **Kelman DGA equipment**, demonstrating full autonomy in troubleshooting and resolving technical issues.\nCoordinated with multidisciplinary teams to deliver exceptional customer-focused service, enhancing client relationships and facilitating communication in **4** languages: English, Spanish, Portuguese, and Italian.\nDeveloped and executed comprehensive training programs for **20+** staff members, empowering them with essential skills in control and instrumentation techniques.\nUtilized advanced problem-solving skills to identify system failures, reducing downtime by **30%** through proactive monitoring and diagnostics solutions.\nProvided regular reports and updates to stakeholders, utilizing strong interpersonal and communication skills to convey complex technical information effectively.\nEngaged in offshore training initiatives, ensuring adherence to regulatory requirements and providing safety guidance in high-stakes environments."
    }
  ],
  "skills": "**Programming Languages:**\n\tPython, JavaScript, TypeScript\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\t\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\t\n\n**Other:**\n\tElectrical Engineering, Control & Instrumentation, Monitoring & Diagnostics systems, Power systems, High-voltage equipment, Fluent in English, Spanish, Portuguese, Italian, Customer-focused, Interpersonal skills, Communication skills, Problem-solving skills, Autonomous work, Kelman DGA equipment, Offshore training, Installation and maintenance programs"
}