{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Field Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Skilled in **project management**, **customer communication**, and **team coordination**, with 13+ years as a Full Stack Developer delivering high-performance applications in healthcare and financial industries. Proficient in **mechanical** and **electrical** systems, ensuring seamless **installation** and **maintenance**. Experienced in **continuous improvement** practices and advanced **problem-solving** techniques. Adept in utilizing cloud services such as **AWS** and **Azure**, leveraging frameworks and libraries like **React**, **Node.js**, and **Django** to enhance system capabilities. Successfully built systems following compliance standards such as HIPAA and FHIR, with hands-on experience in **IIOT** and deploying microservices architectures. Recognized for developing AI/ML-powered platforms that support predictive analytics and real-time processing.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Field Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Managed installation and maintenance of complex mechanical and electrical systems in field settings, ensuring compliance with project management standards and customer requirements. \nLed project management strategies to facilitate efficient field service operations, coordinating with multidisciplinary teams to meet project timelines and client specifications.\nExecuted continuous improvement initiatives to optimize system performance and reduce downtime, applying problem-solving techniques to troubleshoot and resolve field issues effectively.\nConducted thorough mechanical and electrical inspections, ensuring that installations adhered to safety regulations and industry best practices.\nCollaborated with clients to understand their needs, providing exceptional customer communication and support throughout the service lifecycle.\nUtilized advanced IIOT technologies for real-time monitoring and diagnostics, enhancing system reliability and performance.\nTrained and mentored junior engineers on best practices in maintenance and installation, fostering team coordination and enhancing skill development.\nEstablished and maintained detailed documentation of maintenance and installation processes, ensuring compliance and facilitating knowledge transfer within the team.\nImplemented innovative solutions to enhance system efficiency, supported by data analytics and performance metrics."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "• Led project management initiatives involving the **installation** and **maintenance** of mechanical and electrical systems, ensuring the successful deployment of **IIoT** solutions across customer sites.\n• Coordinated field service operations with a focus on **continuous improvement**, driving efficiency and reliability in service delivery for over **30** clients.\n• Implemented problem-solving methodologies to address technical issues, resulting in a **40%** reduction in downtime reported in maintenance logs.\n• Fostered effective **customer communication** with stakeholders, providing clear updates and insights on project progress and service requests, enhancing overall client satisfaction by **25%**.\n• Organized team coordination efforts that led to improved work processes and minimized resource allocation issues, achieving project milestones within **10%** of budget.\n• Conducted regular maintenance and inspections of installed systems, adhering to safety and performance standards, with over **100** successful installations completed annually.\n• Trained field engineers on best practices for mechanical and electrical maintenance, enhancing team capabilities and knowledge sharing across the organization."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Leveraged strong mechanical and electrical skills to supervise the installation and maintenance of advanced equipment in field service environments, ensuring high-quality standards and compliance with project specifications.\nMaintained effective project management by coordinating cross-functional teams and managing client communications, achieving a **95%** satisfaction rate during service completion.\nExecuted regular maintenance schedules to minimize downtime and optimize equipment performance, demonstrating continuous improvement mindset with a **30%** reduction in service callouts compared to previous quarter.\nApplied deep problem-solving abilities to troubleshoot complex technical issues in real time, effectively identifying solutions and implementing corrective actions.\nUtilized IIoT solutions for integrated monitoring and predictive maintenance, leading to a **20%** increase in operating efficiency across deployed systems.\nFostered team coordination through training sessions and knowledge sharing, enhancing team capability and performance metrics within the service division.\nEngaged in customer communication to gather feedback and drive enhancements in service delivery, cultivating long-term client relationships and repeat business.\nImplemented maintenance best practices and technical standards across installations, ensuring adherence to electrical safety codes and manufacturer guidelines."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython: FastAPI, Flask, Django\n\tJavaScript/TypeScript: React, Vue, Angular\n\n**Backend Frameworks:**\n\t\n\n**Frontend Frameworks:**\n\t\n\n**API Technologies:**\n\t\n\n**Serverless and Cloud Functions:**\n\tAWS: ECS, Lambda, RDS, S3\n\tAzure: App Services, Blob Storage, SQL Database\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare)\n\tMongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes\n\tGitHub Actions, GitLab CI/CD\n\tCI/CD & Infrastructure as Code: Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\n**Other:**\n\tmechanical\n\tmaintenance\n\tinstallation\n\telectrical\n\tproject management\n\tfield service\n\tteam coordination\n\tcustomer communication\n\tcontinuous improvement\n\tproblem solving\n\tIIOT",
  "apply_company": "Shick Esteve (Rians)"
}