{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior AI Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "Results-driven Senior AI Engineer with 8 years of experience specializing in **Python**, **Node.js**, **AWS**, **Azure**, and leveraging **GCP** for high-performance AI solutions. Proficient in developing and deploying AI/ML models using **TensorFlow** and **PyTorch**, with hands-on experience in creating robust **APIs** for seamless integration. I have a proven track record in building enterprise-grade platforms that utilize modern JavaScript/TypeScript technologies while ensuring compliance with industry standards like HIPAA and PCI DSS.\nMy expertise includes developing machine learning pipelines, implementing MLOps workflows with tools like MLflow, Airflow, and Kubeflow, and integrating intelligent automation into existing systems. I thrive in fast-paced environments and am committed to delivering high-quality, secure applications that meet business objectives.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior AI Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Developed and deployed AI-driven applications leveraging **Python**, **TensorFlow**, and **PyTorch** to create robust models for patient risk prediction and financial fraud detection, resulting in a **30%** increase in prediction accuracy.\n- Designed and maintained APIs for seamless communication between services using **Node.js** and **Python**, facilitating integration of LLM features and enhancing real-time data access.\n- Architected cloud solutions on **AWS** and **Azure** to host AI models and data services, ensuring scalability and reliability of applications processing millions of transactions daily.\n- Implemented enterprise-level DevOps practices utilizing **Azure DevOps** and CI/CD workflows, achieving a **40%** reduction in deployment time.\n- Collaborated on integrating advanced machine learning features into applications, utilizing chat functionalities powered by **WebRTC** for real-time communication, enhancing user experiences in healthcare solutions.\n- Engaged in the development of MLOps pipelines using **APIs** and automated tools for continuous deployment, validation, and monitoring of AI models across multiple environments, improving operational efficiency.\n- Conducted extensive performance testing and optimization using **GCP** services to ensure high availability and compliance with industry standards.\n- Partnered with cross-functional teams to analyze unstructured data, leveraging Natural Language Processing (NLP) libraries such as **spaCy** for enhanced data insights and anomaly detection across financial documents.\n- Enhanced data security and compliance through integration of HIPAA and GDPR guidelines in model training and deployment, assuring data integrity and privacy in healthcare applications.\n- Developed custom data visualization tools using JS libraries like **D3.js** and **Chart.js**, enabling insightful visual analytics of AI-driven predictions and operational KPIs."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Utilized **Python** and **Node.js** technologies to modernize financial platforms, implementing microservices architecture for improved scalability and maintainability, managing up to **100,000** transactions per day.\nDeveloped robust APIs with **FastAPI** and **Express**, ensuring seamless integration with various internal and external systems.\nLeveraged **Azure** services to build and deploy predictive models, enhancing financial analytics and operational efficiencies by **30%**.\nImplemented AI/ML frameworks such as **TensorFlow** and **PyTorch** for fraud detection systems, analyzing transaction data to reduce false positives by **25%**.\nCollaborated with cross-functional teams to design event-driven architectures using **Kafka** and **Azure Service Bus**, facilitating real-time data processing and ensuring compliance workflows handle over **1 million** events monthly.\nCreated interactive dashboards with **React** and **Power BI Embedded**, providing insights into financial activities to operational teams that led to an increase in informed decision-making speed by **40%**.\nLed the development of ETL pipelines with **Apache Airflow** and **Azure Data Factory**, enabling near real-time data ingestion while managing data accuracy and reducing latency to less than **5 seconds**.\nExecuted machine learning pipelines employing **MLflow**, optimizing processes for credit scoring and churn predictions integrated directly within backend services."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Utilized **Python** and **Node.js** frameworks such as **FastAPI**, **Django**, **NestJS**, and **Express** to design and optimize backend services, maintaining high availability and scalability to support over **100,000** monthly active users on a global e-commerce platform.\nEngineered real-time features leveraging event-driven architecture with **WebSockets**, **Kafka**, and **RabbitMQ**, facilitating seamless order updates and dynamic inventory tracking with latency under **200ms**.\nDeveloped AI/ML-driven applications using **TensorFlow** and **PyTorch**, implementing methods to personalize user experiences and improve conversion rates by over **15%** based on real-time behavioral analytics.\nIntegrated cloud services like **AWS**, **Azure**, and **GCP** to ensure robust and scalable application deployment, delivering uptime of **99.99%** across services.\nConfigured robust APIs to streamline communication between microservices, improving response time by **30%** across various high-traffic workflows.\nEmployed continuous integration and continuous delivery (CI/CD) practices with tools like **Kubernetes** and **LaunchDarkly** to facilitate feature flagging and controlled rollouts, enabling risk-averse deployment strategies during high-stakes updates.\nImplemented role-based access control (RBAC) and OAuth 2.0 for secure user authentication, ensuring data compliance with GDPR standards and enabling secure access for both customers and administrative staff.\nEngineered payment systems integrating with platforms like **Stripe**, **PayPal**, and **Razorpay**, ensuring PCI compliance while handling sensitive financial data seamlessly.\nOptimized frontend experiences using frameworks such as **React (18)**, **Vue 3**, and **Angular**, ensuring a responsive layout for over **1 million** monthly visitors and adhering to WCAG 2.1 accessibility standards."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, Node.js\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n **Frontend Frameworks:**\n\tJavaScript/TypeScript (React, Vue, Angular)\n\n **API Technologies:**\n\tAPIs, WebRTC, Janus\n\n **Serverless and Cloud Functions:**\n\tAWS, Azure, GCP\n\n **Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n **Other:**\n\tMLflow, Airflow, Kubeflow, LLM, TensorFlow, PyTorch, Authentication & Security, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, MCP Servers, SMS, Arabic",
  "apply_company": "Teraleads"
}