{
  "name": "Tomasz Lee",
  "role_name": "Senior DFM Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Results-driven Senior DFM Engineer with 9+ years of experience in manufacturing engineering, specializing in ***GD&T***, ***3D CAD***, and ***SolidWorks***. Proven expertise in sheet metal, ***laser cutting***, and ***waterjet cutting*** processes, alongside hands-on skills in ***EDM***, ***grinding***, and ***welding*** techniques. Strong abilities in material selection, and adept at utilizing ***3D printing*** and ***stamping*** to enhance manufacturing efficiency. Excellent problem-solving, communication, and collaboration skills, with a track record of successfully leading projects and delivering optimal engineering solutions.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Senior DFM Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Leveraged **SolidWorks** and **3D CAD** tools to design and optimize manufacturing processes, enhancing efficiency by **30%**.\nApplied **GD&T** principles to ensure precision in component specifications, driving quality improvements and reducing rework by **15%**.\nDeveloped and implemented strategic **material selection** methodologies to maximize performance and cost-effectiveness in production.\nUtilized advanced techniques in **sheet metal**, **laser cutting**, and **waterjet cutting** for innovative design approaches, increasing throughput by **20%**.\nExecuted projects involving **3D printing** technologies to prototype components, decreasing time-to-market by **25%**.\nLed cross-functional teams in **collaboration** and effective **communication**, facilitating problem-solving sessions that resolved engineering challenges promptly.\nManaged processes involving **EDM**, **grinding**, **honing**, and **lapping** to achieve high-quality finishes on critical components.\nOversaw **stamping** and **welding** operations to ensure adherence to design specifications and production timelines.\nApplied problem-solving strategies to identify and resolve manufacturing inefficiencies, resulting in an overall production cost reduction of **18%**."
    },
    {
      "role": "Software Engineer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "Utilized **3D CAD** software and **SolidWorks** to design and prototype manufacturing components, ensuring adherence to **GD&T** standards.\nImplemented **CNC** machining techniques to enhance precision in manufacturing processes, achieving a **20% reduction** in material waste.\nCollaborated with cross-functional teams to optimize production workflows, contributing to a **15% increase** in overall efficiency.\nApplied **3D printing** technologies for rapid prototyping, which enabled faster turnaround times for design iterations by **30%**.\nLed the development of manufacturing processes for **sheet metal**, including **laser cutting** and **waterjet cutting**, improving turnaround and reducing costs.\nConducted material selection analysis to ensure suitability of components for end-use application, enhancing performance reliability.\nEmployed advanced techniques in EDM, grinding, honing, and lapping for precision detailing of components, reaching tolerances within **0.01 mm**.\nFacilitated problem-solving workshops with team members to address production challenges, fostering a culture of collaboration and continuous improvement.\nMentored junior engineers in best practices for machining and manufacturing, enhancing team skills and communication.\nManaged documentation of engineering changes and design specifications, ensuring clarity and compliance across projects."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "Utilized **3D CAD** tools such as **SolidWorks** to design and develop components, ensuring manufacturability and efficiency in production processes.\nApplied **GD&T** principles to establish precise tolerances and specifications, enhancing the quality and consistency of manufacturing outputs.\nImplemented CNC strategies to optimize machining operations, leading to a **15%** reduction in production time.\nConducted material selection for various projects, ensuring appropriate choices for durability and performance, which improved product lifespan by **30%**.\nLed the sheet metal fabrication process, incorporating **laser cutting** and **waterjet cutting** techniques to achieve high precision in components.\nManaged EDM processes to enhance the production of intricate designs, ensuring adherence to project timelines and specifications.\nCollaborated with cross-functional teams to resolve manufacturing challenges, demonstrating strong **problem-solving** and **communication** skills.\nFacilitated brainstorming sessions and established workflows for effective collaboration, resulting in a **10%** improvement in project turnaround times.\nOversaw welding and stamping operations to maintain quality standards and efficiency, while adhering to safety protocols.\nProvided mentorship to junior engineers, sharing insights on manufacturing engineering practices and fostering a culture of continuous improvement."
    }
  ],
  "skills": "  **Programming Languages**\n\tPython\n\n  **Backend Frameworks**\n\tNodeJS, ExpressJS, NestJS, C#, .NET, Entity Framework, Microservices\n\n  **Frontend Frameworks**\n\tHTML, CSS, JavaScript, TypeScript, ReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n  **API Technologies**\n\tRESTful API, GraphQL\n\n  **Serverless and Cloud Functions**\n\tAWS, Azure\n\n  **Databases**\n\tMSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB\n\n  **DevOps**\n\tCI/CD pipelines\n\n  **Cloud & Infrastructure**\n\tGit, GitHub\n\n  **Other**\n\tBlockchain, Solidity, Ether.js, Web3.js, Ethereum, UX/UI Design, Testing Tools: NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest, Problem-solving, Communication, Collaboration, CNC, 3D CAD, SolidWorks, GD&T, Sheet metal, 3D printing, Manufacturing engineering, EDM, Grinding, Honing, Lapping, Material selection, Laser cutting, Waterjet cutting, Welding, Stamping",
  "apply_company": "Xometry Europe"
}