{
  "name": "Sebastian Lukasz Nowak",
  "role_name": "Senior Cybersecurity Engineer",
  "email": "sebastiannowak425@outlook.com",
  "phone": "+48 732 489 778",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/sebastian-nowak-756157396/",
  "profile_summary": "As a Senior Cybersecurity Engineer with 8 years of experience, I bring a robust skill set in **ISO 27001**, **ISO 42001**, **NIST**, **SOC 2**, **NIS2**, **CRA**, **IEC 62443**, and **OT Security**. I have a proven ability to design and implement compliance frameworks and governance policies, ensuring alignment with industry standards and regulatory requirements. My strong analytical skills allow me to develop effective risk management strategies tailored to organizational needs, while my relationship-building capabilities enhance collaboration with stakeholders across projects.\n\nAdditionally, I possess a background in full-stack development, leveraging expertise in **JavaScript/TypeScript**, **Python**, and **Flutter** technologies, and have successfully built high-performance solutions in the healthcare and financial sectors. My technical proficiency spans frameworks like **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**, coupled with cloud experience in **Azure** and **AWS**. I have also led the integration of AI/ML capabilities into enterprise-grade platforms, utilizing tools like **MLflow**, **Airflow**, and **Kubeflow** to enhance predictive analytics and intelligent automation. I am goal-driven and adaptable, able to deliver robust and secure applications while ensuring compliance with standards such as HIPAA, FHIR, and PCI DSS.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "",
      "from_year": "2001",
      "to_year": "2006",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Cybersecurity Engineer",
      "company": "DeepInspire",
      "from_date": "Oct 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Ensured compliance with regulatory standards such as **ISO 27001**, **SOC 2**, **NIST**, and **ISO 42001** while architecting scalable applications in the **healthcare** and **financial** sectors.\n- Implemented and maintained enterprise-level **OT Security** policies and strategies, focusing on risk management and **AI Governance** to protect sensitive data.\n- Developed and executed compliance frameworks aligned with **CRA** and **IEC 62443**, mitigating risks associated with cybersecurity threats and vulnerabilities.\n- Collaborated with cross-functional teams to build relationships and foster a culture of security and compliance across all digital platforms.\n- Designed and integrated policies for managing cybersecurity risks, ensuring organizational alignment with **NIS2** and other security mandates.\n- Provided analytical insights to enhance risk management processes through quantitative assessments and qualitative evaluations, contributing to ongoing compliance and security efforts.\n- Adapted to evolving security challenges in the technology landscape by regularly updating knowledge of cybersecurity best practices and regulatory changes.\n- Established goals for security implementations that align with organizational objectives, ensuring measurable outcomes and ongoing improvements in compliance and security posture."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Britenet",
      "from_date": "Sep 2015",
      "to_date": "Sep 2021",
      "location": "Poland",
      "responsibilities": "Employed strong **risk management** techniques to ensure compliance with **ISO 27001**, **ISO 42001**, **NIST**, and **SOC 2** frameworks, protecting sensitive financial data and maintaining system integrity across high-volume transaction environments.\nDeveloped robust compliance policies aligning with **NIS2**, **CRA**, and **IEC 62443** standards, enhancing the security posture of financial platforms and ensuring adherence to industry regulations.\nBuilt and maintained relationships with cross-functional teams to foster **policy design** initiatives that address cybersecurity threats effectively, promoting a culture of security awareness and compliance across departments.\nUtilized **AI Governance** practices to oversee the deployment of AI/ML systems, ensuring ethical standards and compliance were integrated during implementation, particularly in fraud detection solutions.\nAdapted to changing regulatory landscapes, demonstrating **adaptability** in the development of security protocols that meet evolving compliance requirements, thus contributing to a resilient cybersecurity framework.\nConducted in-depth **analytical skills** assessments to identify potential security vulnerabilities and risks within existing infrastructures, leading to a **50%** reduction in incident response time over **12 months**.\nSet strategic **goals driven** initiatives that align with organizational objectives, enabling a proactive approach to cybersecurity threats and compliance mandates, impacting overall security efficiency by **30%** on key metrics."
    },
    {
      "role": "Software Engineer",
      "company": "Binary Studio",
      "from_date": "Jan 2007",
      "to_date": "Aug 2015",
      "location": "UK",
      "responsibilities": "Implemented compliance frameworks and cybersecurity best practices based on **ISO 27001**, **NIST**, **SOC 2**, and **IEC 62443**, ensuring all systems adhere to industry regulations and standards, thus enhancing the overall security posture of the organization.\nConducted comprehensive risk assessments and managed risk mitigation strategies in alignment with **ISO 42001** and **NIS2**, maintaining a proactive approach to cybersecurity and compliance.\nDeveloped and enforced security policies and procedures, leveraging analytical skills to identify vulnerabilities, thus meeting compliance goals and enhancing OT security across critical infrastructure.\nEstablished frameworks for **AI Governance** relating to data privacy and security, ensuring the ethical use of AI models in line with organizational policies and regulatory requirements.\nBuilt strong relationships with stakeholders through effective communication of cybersecurity risks and strategies, driving collaboration in achieving compliance and security goals.\nLed training and awareness programs on cybersecurity best practices for teams, demonstrating adaptability to diverse audiences and promoting a culture of security within the organization.\nMaintained thorough documentation of compliance frameworks and audits, conducting regular reviews to ensure ongoing adherence to **CRA** policies and risk management procedures.\nUtilized experience in policy design to refine existing security frameworks, ensuring they evolve with emerging cybersecurity threats and compliance regulations.\nExecuted advanced monitoring and response strategies, utilizing investigative tools to evaluate security incidents in real-time and ensure compliance with organizational security objectives."
    }
  ],
  "skills": "****API Technologies:****\n\tKeycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot\n\n****Backend Frameworks:****\n\tPython(FastAPI, Flask, Django)\n\n****Cloud & Infrastructure:****\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n****Databases:****\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n****DevOps:****\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n****Frontend Frameworks:****\n\tJavaScript/TypeScript (React, Vue, Angular)\n\n****Other:****\n\tMLflow, Airflow, Kubeflow, ISO 27001, ISO 42001, NIST, SOC 2, NIS2, CRA, IEC 62443, OT Security, AI Governance, Risk Management, Compliance, Policy Design, Analytical Skills, Relationship Building, Goal Driven, Adaptability",
  "apply_company": "KairosVector"
}