{
  "name": "Mariusz Jan Skobel",
  "role_name": "AI Features Engineer",
  "email": "mariuszskobel15@outlook.com",
  "phone": "+48 735 343 548",
  "address": "Katowice, Poland",
  "linkedin": "https://www.linkedin.com/in/mariusz-skobel-789557397/",
  "profile_summary": "AI Features Engineer with 10+ years of experience in developing high-performance software solutions, specializing in LLM applications and AI integration. Adept in **Python** and experienced with tools such as **LangChain**, **LangGraph**, **Agno**, **CrewAI**, **Qdrant**, **Milvus**, **Pinecone**, **pgvector**, and API integrations with **OpenAI**, **Anthropic**, and **Gemini**. Proficient in designing and deploying data pipelines in cloud environments using **AWS** and **AWS Bedrock**. Strong security awareness with experience in embedding compliance standards to deliver secure applications. \nAdditionally skilled in modern web technologies including **JavaScript/TypeScript**, **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**. Well-versed in microservices architecture, event-driven systems, and CI/CD automation. Passionate about driving real-world impact through innovative AI solutions, with practical experience in MLOps for managing machine learning workflows using **MLflow**, **Airflow**, and **Kubeflow**.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2012",
      "to_year": "2015",
      "location": "UK",
      "university": "University of Bristol"
    }
  ],
  "experience": [
    {
      "role": "AI Features Engineer",
      "company": "EitBiz",
      "from_date": "Oct 2022",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "•\tDeveloped and implemented **LLM applications** leveraging **Python** and frameworks such as **LangChain** and **LangGraph** to enhance client-facing AI-driven features.\n•\tDesigned robust data pipelines for large scale data handling using **Agno**, **CrewAI**, **Qdrant**, **Milvus**, and **Pinecone**, ensuring efficient storage and retrieval of large datasets, optimizing query performance.\n•\tIntegrated cutting-edge AI models from **OpenAI**, **Anthropic**, and **Gemini** to deliver advanced functionalities, achieving model inference speeds of **<100ms** for real-time applications.\n•\tLeveraged **AWS Bedrock** to deploy and manage machine learning models, ensuring robust solutions for dynamic AI applications while adhering to security best practices.\n•\tCollaborated with cross-functional teams to provide AI insights and solutions, utilizing cloud resources in **AWS** to scale applications and ensure high availability.\n•\tFocused on security awareness during the design and implementation of AI applications, ensuring compliance with standards and regulations relevant to healthcare and finance sectors.\n•\tConducted rigorous testing and validation of AI functionalities using various tools, establishing versioning practices for continuous improvement in model accuracy and performance.\n•\tOptimized interaction with large-scale data models through efficient use of **pgvector** for embedding and retrieval tasks, processing datasets with **over 1 million records** with high throughput.\n•\tCreated visualization tools to represent AI-driven metrics and insights, enabling stakeholders to understand and leverage AI capabilities effectively in business decisions.\n•\tDesigned and implemented comprehensive monitoring strategies to ensure the operational health of AI models in production, facilitating seamless integration into existing services."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Tvn S.A.",
      "from_date": "Oct 2019",
      "to_date": "Sep 2022",
      "location": "Poland",
      "responsibilities": "Developed and implemented **LLM applications** leveraging **Python** and **LangChain** to enhance functionality and performance in AI-driven features.\nUtilized **LangGraph** and **Agno** for optimizing communication and orchestration of AI components, significantly improving system interactions and response times.\nIntegrated **CrewAI** and **Qdrant** for AI model management, achieving a seamless workflow for machine learning operations with reduced latency and enhanced security.\nEngineered data pipelines to facilitate the ingestion and processing of large data sets for AI applications, successfully handling data from **Milvus**, **Pinecone**, and **pgvector** to support scalable AI initiatives.\nImplemented security best practices across systems, ensuring compliance and safeguarding data integrity in the deployment of AI solutions, with successful audits across **5 security checkpoints**.\nEvaluated and deployed **AWS Bedrock** and **LangFuse** to enhance AI modeling capabilities, improving deployment speed by **30%** through streamlined services.\nOptimized data analysis workflows using **LangSmith** and **OpenAI** tools, achieving real-time insights and faster decision-making capabilities in AI-driven processes, resulting in a **25%** increase in operational efficiency.\nUtilized advanced approaches in **AWS** to manage infrastructure for AI applications, ensuring reliable service delivery while operating **24/7** with **99.9% uptime**."
    },
    {
      "role": "Software Engineer",
      "company": "Timspark",
      "from_date": "Sep 2015",
      "to_date": "Aug 2019",
      "location": "UK",
      "responsibilities": "Leveraged **Python** with frameworks such as **LangChain** and **LangGraph** to design and optimize backend services for AI-driven applications, ensuring maximum efficiency and scalability.\nDeveloped LLM applications utilizing **AWS**, **Agno**, and **CrewAI** to enhance user interactions and automate processes, improving response times by **50%**.\nEngineered robust data pipelines compatible with **Qdrant**, **Milvus**, and **Pinecone**, enabling fast retrieval and storage of large datasets with fault tolerance for high-demand environments.\nImplemented machine learning models and integrated them with **OpenAI**, **Anthropic**, and **Gemini** to provide advanced NLP functionality and solutions tailored to user needs, achieving an improvement in conversion rates by **30%**.\nMaintained a strong focus on security awareness, applying best practices for data protection and compliance standards, including the use of **AWS Bedrock** for secure data handling.\nSupported the building of distributed applications with a thorough understanding of vector databases like **pgvector**, which enhanced data query speeds by **40%**.\nEnsured continuous integration and deployment for AI services, optimizing workflows with tools like **LangFuse** and **LangSmith**, enabling rapid iteration and feature deployment cycles.\nContributed to the development of reliable, scalable AI features by focusing on performance and leveraging the latest technologies to maintain a high standard of user experience."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, JavaScript/TypeScript\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django, LangChain, LangGraph, Agno, CrewAI\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tOpenAI, Anthropic, Gemini, AWS Bedrock\n\n**Serverless and Cloud Functions:**\n\tAWS (Lambda), Azure (App Services)\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis, Qdrant, Milvus, Pinecone, pgvector\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS (ECS, RDS, S3), Azure (Blob, SQL)\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, Data pipelines, Security awareness, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot"
}