{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Software Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Senior Software Engineer with 13+ years of extensive experience in developing high-availability applications, utilizing a robust tech stack including **Kubernetes**, **OpenShift**, **Docker**, **Linux**, **Cloud-native** technologies, **Golang**, **Python**, and **Java**. Proven expertise in automation and NFV, with a solid foundation in hybrid cloud environments. Highly skilled in building and deploying cloud-native systems, effectively implementing microservices, and streamlining CI/CD pipelines.\n\nDemonstrated history of delivering AI/ML-powered platforms that drive predictive analytics and automation solutions. Possesses hands-on experience in both frontend and backend development using **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**. Well-versed in compliance-driven development practices, ensuring alignment with regulatory standards such as HIPAA, FHIR, PCI DSS, and SOC 2. Strong background in MLOps, with expertise in model training, serving, and orchestration using **MLflow**, **Airflow**, and **Kubeflow**.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Software Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Utilized **Kubernetes** and **OpenShift** for orchestrating and managing containerized applications, ensuring **High Availability** and resilience in **Hybrid Cloud** environments.\nDesigned and implemented automation solutions with **Ansible** and **Bash** to streamline deployments and configuration management, enhancing operational efficiency.\nDeveloped scalable applications using **Docker** and languages including **Python** and **Golang**, driving innovations in cloud-native architecture.\nExecuted CI/CD practices for seamless integration and delivery, focusing on robustness and agility within the software development lifecycle.\nImplemented monitoring and alerting mechanisms to ensure system stability and performance, reducing downtime incidents by **30%** through proactive responses.\nArchitected scalable microservices that achieved up to **25%** improved resource utilization, effectively serving high-demand applications.\nConducted performance tuning within Linux environments to optimize application throughput and response times by **40%**.\nCollaborated with cross-functional teams to adopt **Gen AI** methodologies for enhancing automation capabilities across projects, resulting in a **15%** reduction in manual intervention.\nPlayed a key role in driving cloud transformation initiatives, leveraging **NFV** strategies to optimize infrastructure costs while delivering robust services.\nDeveloped advanced tools and libraries in **Java** and **C/C++** to support internal automation needs, improving development cycles by **20%**."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Leveraged **Docker** and **Kubernetes** to containerize applications, enhancing deployment efficiency and scalability across **Hybrid Cloud** environments, achieving a **30%** reduction in deployment time.\nImplemented automation scripts using **Ansible** and **Bash**, streamlining system configuration management and operational tasks, resulting in a **25%** improvement in system uptime.\nOptimized backend services by migrating legacy applications to a **cloud-native** architecture, utilizing **Python**, **Golang**, and **Java** for improved performance and maintainability.\nDeveloped high-availability solutions using **OpenShift**, ensuring minimal downtime during system upgrades and maintenance, achieving **99.9%** service availability.\nCollaborated on the design and implementation of NFV architectures to support service agility and resource optimization across edge devices.\nEngineered robust financial applications leveraging **Python** and **Java** to implement core functionalities with a focus on high performance and security, aligning with **Gen AI** standards.\nEnhanced monitoring and logging mechanisms using **Linux** tools to ensure operational compliance and rapid incident response.\nSupported edge computing initiatives by developing solutions that leverage real-time data processing capabilities, enabling prompt decision-making in financial operations."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "- Developed and maintained high-availability backend services using **Python** and **Golang** in a **cloud-native** environment, ensuring scalability for over **1 million** concurrent users.\n- Utilized **Kubernetes** and **Docker** for container orchestration and deployment, facilitating automated scaling and management of services across a **hybrid cloud** infrastructure.\n- Engineered automated workflows using **Ansible** and **Bash**, enhancing operational efficiency and reducing deployment time by **30%**.\n- Designed and implemented NFV solutions for edge computing, improving response times for edge applications by **50%**.\n- Ensured a smooth continuous integration/continuous deployment (CI/CD) pipeline leveraging tools like **OpenShift**, automating deployments and reducing release cycles to every **2 weeks**.\n- Leveraged **AI/ML** techniques to enhance service capabilities, integrating generative AI solutions to automate routine tasks and support decision-making processes.\n- Developed secure applications by implementing role-based access control (RBAC), ensuring compliance with security standards, enhancing application security by **40%**.\n- Collaborated with cross-functional teams in an Agile environment, delivering innovative solutions that integrate seamlessly with existing operations and reduce downtime.\n- Participated in code reviews, mentoring junior developers, and setting coding standards, maintaining code quality and best practices in software development."
    }
  ],
  "skills": "**Programming Languages:**\n\tPython, Java, C/C++, Golang, Bash\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tOAuth2, JWT\n\n**Serverless and Cloud Functions:**\n\tAWS: Lambda, Azure: App Services\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes, OpenShift, GitHub Actions, GitLab CI/CD, Ansible\n\n**Cloud & Infrastructure:**\n\tAWS: ECS, RDS, S3, Azure: Blob Storage, SQL Database, Terraform, Helm, Docker Compose\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, Edge, High Availability, Hybrid Cloud, NFV, Cloud-native, Automation, Keycloak (OIDC, RBAC), Nginx, Let’s Encrypt, Certbot",
  "apply_company": "Red Hat"
}