{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior MLOps Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "Results-driven Senior MLOps Engineer with 8 years of experience in deploying robust MLOps solutions across diverse industries including healthcare and finance. Proficient in **MLOps** frameworks and tools such as **MLflow**, **DVC**, **Prometheus**, **Grafana**, and cloud services including **AWS**, **Azure**, and **GCP** for streamlined model deployment and monitoring. Expertise in modern programming languages like **Python**, utilizing libraries such as **TensorFlow**, **PyTorch**, and **HuggingFace** for building and optimizing machine learning models. Skilled in implementing CI/CD processes with **Docker** and **Kubernetes** for efficient development workflows. \n\nStrong background in machine learning methodologies, including **decision trees**, **clustering**, and **regression** techniques, as well as experience with large language models like **GPT** and **BERT** along with generative models like **StableDiffusion**. I have successfully led projects that integrate AI/ML capabilities for predictive analytics and intelligent automation. My collaborative spirit and excellent communication skills enable me to work effectively in team environments, driving projects to exceed compliance standards such as HIPAA and PCI DSS.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior MLOps Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Architected and developed robust **MLOps** frameworks incorporating **Python**, **TensorFlow**, **PyTorch**, **Hugging Face**, and **MLflow** for efficient model deployment and management.\n- Implemented DevOps strategies using **Docker**, **Kubernetes**, and **CI/CD** tools such as **GitHub Actions** and **Azure DevOps**, enhancing software reliability and scalability across different environments with a focus on continuous integration and delivery.\n- Designed and maintained machine learning pipelines utilizing **DVC** and **Apache Airflow** for versioning and training models on large datasets, improving the operational efficiency of data processing by up to **80%**.\n- Developed cloud-based solutions using **AWS**, **Azure**, and **GCP**, ensuring high availability and fault tolerance for deployed machine learning models and applications.\n- Led the modernization of existing systems into microservices architecture using **Kubernetes** and **Docker**, resulting in a **50%** improvement in system performance and resource utilization.\n- Engaged in collaborative projects integrating advanced machine learning techniques such as decision trees, clustering, and regression in the financial sector for predictive analytics and risk assessment.\n- Enhanced data processing capabilities by implementing tools such as **Prometheus** and **Grafana** for monitoring and visualization, leading to improved system health visibility and responsiveness.\n- Utilized **Databricks** for streamlined data engineering processes, allowing for the efficient handling of complex datasets and real-time analytics.\n- Facilitated cross-functional collaboration among data scientists, developers, and stakeholders to ensure alignment on project goals and outcomes, focusing on effective communication.\n- Developed AI-driven applications using generative models from **GPT** and **Stable Diffusion** to provide innovative solutions in finance and healthcare sectors, enhancing user engagement through personalized interactions."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "• Implemented MLOps best practices, facilitating CI/CD pipelines for machine learning models using **DVC** and **MLflow**, streamlining deployment processes and ensuring reproducibility.\n• Developed robust machine learning models with **Python** and **TensorFlow**, integrating libraries such as **scikit-learn** and **PyTorch** for enhanced performance in fraud detection and risk assessment, achieving a detection accuracy improvement of **15%**.\n• Led the deployment of Generative AI solutions leveraging **HuggingFace** and large language models (LLM) to enhance user experience and automate responses in financial applications, reducing response time by **30%**.\n• Orchestrated containerized applications using **Docker** and **Kubernetes**, ensuring seamless scalability and orchestration of ML workloads, leading to a deployment speed increase of **40%**.\n• Utilized cloud services including **AWS**, **GCP**, and **Azure** to optimize infrastructure for machine learning and data processing, allowing for efficient resource allocation and cost management.\n• Established monitoring and visualization frameworks using **Prometheus** and **Grafana**, providing real-time insights into model performance and metrics for production systems.\n• Collaborated effectively with cross-functional teams to integrate machine learning solutions into operational workflows, promoting a culture of innovation and continuous improvement within the organization.\n• Created and maintained ETL pipelines with **PySpark** and **Apache Airflow** for efficient data ingestion, supporting decision-making processes with accurate and timely data feeds from both internal and third-party sources.\n• Conducted rigorous testing and validation of machine learning models, employing techniques such as decision trees, clustering, and regression analysis to ensure robustness and reliability."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Executed MLOps practices to streamline model deployments and version control, utilizing **Docker** and **Kubernetes** for container orchestration and efficient CI/CD pipelines.\nDesigned scalable machine learning workflows with **AWS**, **GCP**, and **Azure**, leveraging tools like **MLflow** and **DVC** for model tracking and data versioning, resulting in a **30%** increase in deployment efficiency.\nDeveloped and integrated generative AI models, utilizing frameworks such as **TensorFlow**, **PyTorch**, and **HuggingFace**, to enhance product recommendations and user personalization strategies.\nImplemented monitoring solutions with **Prometheus** and **Grafana**, achieving real-time insights into model performance, reducing latency by **25%** during high traffic periods.\nCollaborated on data engineering tasks, utilizing **PySpark** for data processing and analysis, enabling seamless integration of machine learning capabilities across the e-commerce platform.\nApplied advanced machine learning techniques including decision trees, clustering, and regression models, achieving an **improvement of 15% in recommendation accuracy** based on user engagement metrics.\nFacilitated cross-functional collaboration by promoting effective communication channels within teams, enhancing project delivery timelines and boosting team productivity by **20%**.\nEnsured comprehensive documentation and versioning of machine learning models, fostering transparency and facilitating model audits to meet compliance standards such as GDPR.\nRegularly evaluated and fine-tuned large language models (LLMs) like **BERT** and **GPT**, optimizing performance and user interaction quality, while exploring cutting-edge advancements like **StableDiffusion** for innovative applications.\n"
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, JavaScript/TypeScript\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n **Frontend Frameworks:**\n\tReact, Vue, Angular\n\n **API Technologies:**\n\tNginx, Keycloak (OIDC, RBAC), JWT, OAuth2\n\n **Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL), GCP\n\n **Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:**\n\tAWS, Azure, GCP\n\n **Other:**\n\tMLflow, Airflow, Kubeflow, Prometheus, Grafana, Databricks, TensorFlow, PyTorch, HuggingFace, DVC, PySpark, MLOps, GenerativeAI, LLM, decisionTrees, clustering, regression, GPT, StableDiffusion, BERT, communication, collaborative, Let’s Encrypt, Certbot",
  "apply_company": "Edelman"
}