{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Software Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Senior Software Engineer with 13+ years of experience in .NET and C# development, specializing in building robust web applications using **ASP.NET**, **Razor**, and **MVC** frameworks. Proficient in SQL for database management and adept in designing RESTful and GraphQL APIs to enhance application performance. Strong skills in front-end technologies including **HTML**, **CSS**, and **JavaScript**, ensuring seamless user experiences through dynamic interfaces.\nDemonstrated expertise in agile methodologies, fostering teamwork and collaboration across cross-functional teams. Proven problem-solving abilities complemented by a commitment to continuous improvement and mentorship of junior developers. Experience in integrating scalable cloud solutions and maintaining high standards of code quality in compliance with industry regulations.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Software Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Utilized **.NET** and **C#** to design and build robust backend solutions, ensuring seamless integration with **SQL** databases and adherence to RESTful and **GraphQL** APIs.\nExecuted front-end development using **HTML**, **CSS**, **JavaScript**, and **ASP.NET MVC**, delivering responsive and interactive user interfaces that enhanced overall user experience.\nImplemented agile methodologies to improve project delivery timelines, adhering to best practices in **continuous improvement** and promoting **teamwork** across cross-functional teams.\nProvided mentorship to junior developers, fostering skill development and sharing expertise in **agile** practices and coding standards, contributing to a collaborative team environment.\nDeveloped and maintained comprehensive documentation in **XML** and **JSON**, aligning with project specifications and promoting clarity across teams.\nOptimized existing solutions for performance improvements, identifying bottlenecks and implementing coding best practices, achieving up to **30%** reduction in page load times.\nFacilitated regular code reviews incorporating collaborative problem-solving strategies, aiming for higher code quality and minimizing technical debt by over **25%**.\nLed initiatives to refine testing strategies by integrating automated tests using **REST**, ensuring code reliability and application stability through rigorous **problem-solving** and debugging techniques.\nDesigned RESTful services that supported over **1 million** transactions monthly, ensuring scalability and reliability for high-traffic applications.\nCollaborated with database teams to enhance querying efficiency, achieving a **40%** improvement in SQL query response times through optimized database indexing and architecture."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Utilized **.NET** and **C#** to develop scalable microservices and web applications, employing **ASP.NET** and **Razor** for improved maintainability and performance.\nImplemented REST and **GraphQL** APIs that enhanced data retrieval and manipulation in financial platforms, achieving response times under **200ms**.\nDesigned high-quality user interfaces using **HTML**, **JavaScript**, and **CSS**, ensuring seamless interactions with a focus on user experience and accessibility.\nCollaborated in an agile environment, fostering **teamwork** and **continuous improvement** through sprint retrospectives and process optimizations, reducing delivery time by **15%**.\nMentored junior developers, sharing knowledge in **MVC** design patterns and best coding practices, contributing to enhanced team capability and project outcomes.\nProblem-solved complex software challenges with data-driven decision-making, leading to effective solutions that improved system reliability and user satisfaction.\nFacilitated code reviews and implemented version control practices that upheld code quality standards and minimized bugs by **30%** across projects."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Utilized **ASP.NET** and **C#** to design and develop high-performance backend services, ensuring optimal scalability and maintainability to support growth in transactions by **50%** year-on-year.\nImplemented **SQL** for efficient data handling and storage solutions, improving query performance by **30%** through optimized database design and indexing strategies.\nAdopted **REST** and **GraphQL** APIs to facilitate seamless communication between frontend and backend systems, enhancing integration capabilities across microservices, reducing response times by **40%**.\nLeveraged **MVC** architectural patterns to construct robust web applications that promote organized code and enhance development speed through collaborative **teamwork** and **agile** practices.\nConducted regular **mentorship** sessions, unifying team efforts by fostering a culture of **problem-solving** and **continuous improvement** in development workflows, leading to a **20%** increase in project efficiency.\nCrafted dynamic user interfaces using **HTML5**, **CSS**, and JavaScript frameworks to ensure usability and accessibility compliance, enhancing user engagement metrics significantly.\nIntegrated **Razor** for view generation, streamlining frontend and backend interaction, resulting in a **30%** reduction in overall development time and improved maintainability.\nCollaborated closely with cross-functional teams to identify opportunities for enhancements, leading to successful implementation of solutions that increased system performance and customer satisfaction ratings by **25%**.\nDeveloped and executed test plans to ensure software deliverables met quality standards and adhered to project timelines, leveraging automated testing tools for increased coverage and reliability.\nParticipated in code reviews and provided actionable feedback to peers, enhancing the quality of code and promoting best practices throughout the software development lifecycle."
    }
  ],
  "skills": "**Programming Languages:**\n\tC#, .NET, SQL, Python, JavaScript/TypeScript\n\n**Backend Frameworks:**\n\tASP.NET, FastAPI, Flask, Django, MVC\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular, HTML, CSS\n\n**API Technologies:**\n\tREST, GraphQL\n\n**Serverless and Cloud Functions:**\n\tAWS: Lambda, ECS, Azure: App Services\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS: RDS, S3, Azure: Blob Storage, SQL Database\n\n**Other:**\n\tAuthentication & Security: Keycloak (OIDC, RBAC), OAuth2, JWT, Nginx, Let’s Encrypt, Certbot, agile, problem-solving, teamwork, mentorship, continuous improvement",
  "apply_company": "StarRez, Inc."
}