{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Salesforce Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "As a skilled Senior Salesforce Engineer with a strong background in project management and sales process optimization, I leverage my expertise in **Salesforce**, including **Sales Cloud**, **Flow Builder**, and **Lightning App Builder**, to design and implement high-impact solutions that streamline pipeline management. I utilize tools like **Data Loader**, **HubSpot**, **Outreach**, **Gong**, and **ZoomInfo** to enhance data accuracy and drive effective communication across teams. \nWith 8 years of full-stack development experience, I possess a comprehensive understanding of software engineering best practices, including CI/CD automation and agile methodologies. My previous roles in healthcare and finance have honed my ability to deliver high-performance applications while adhering to compliance standards, and I am adept in leveraging my technical knowledge to integrate systems seamlessly. I prioritize collaboration and strategic project execution to achieve project goals efficiently.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Salesforce Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Utilized **Salesforce** (including **Sales Cloud**) to design and implement optimized sales processes, improving pipeline management efficiency by **30%**.\nEmployed **Flow Builder** and **Lightning App Builder** to develop user-friendly interfaces and workflow automations, enhancing user experience across the platform.\nManaged data import and export operations utilizing **Data Loader** for maintaining data integrity and accuracy within the CRM, processing over **1,000** records weekly.\nCollaborated effectively with cross-functional teams to align project goals, using **project management** tools and methodologies to oversee multiple initiatives.\nLeveraged **HubSpot**, **Outreach**, and **Gong** to track engagement metrics and customer interactions, resulting in an increase in lead conversion rates by **15%**.\nConducted training sessions for sales teams on best practices for utilizing **Salesforce**, leading to enhanced team communication and workflow efficiency.\nImplemented effective strategies for managing and optimizing sales pipelines, achieving a reduction in sales cycle duration by **20%**.\nUtilized **ZoomInfo** for lead generation and market research, contributing to the identification of key industry trends and opportunities.\nDesigned and executed complex sales reporting and dashboard solutions in **Salesforce**, enhancing visibility into sales performance metrics and driving data-driven decision-making.\nFostered strong relationships with stakeholders, ensuring clear communication and alignment on project scopes and deliverables."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Implemented and optimized **Salesforce** solutions, leveraging **Sales Cloud** and **Lightning App Builder** to streamline sales processes and enhance pipeline management for improved sales efficiency.\nUtilized **Flow Builder** to develop automated workflows within Salesforce, reducing manual tasks and enhancing team productivity by **30%**.\nMigrated and managed data using **Data Loader** to ensure accurate, real-time access to customer information and pipeline data, improving reporting and insight capabilities by **40%**.\nIntegrated and managed CRM systems, including **HubSpot**, **Outreach**, and **Gong**, to enable seamless communication between sales teams and drive engagement, contributing to a **20%** increase in conversion rates.\nLed project management initiatives using effective communication strategies, ensuring collaborative efforts across departments while adhering to project timelines and goals.\nTrained and mentored junior team members on Salesforce features and best practices, enhancing overall team proficiency and knowledge retention in **Salesforce** technologies.\nCoordinated efforts with cross-functional teams to ensure system scalability and performance, focusing on user-centric solutions that meet evolving business needs."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Designed and optimized Salesforce solutions leveraging **Sales Cloud** and **Lightning App Builder** to enhance sales processes and pipeline management for a global team, improving efficiency by **30%**.\nImplemented workflow automation using **Flow Builder** to streamline project management and communication, reducing manual tasks by **40%**.\nUtilized **Data Loader** for efficient data migration and integration, ensuring accurate and timely updates of Salesforce records, handling over **10,000** records daily.\nEnhanced user experience and accessibility in Salesforce using customized Lightning components, leading to a **20%** increase in adoption rates among sales representatives.\nIntegrated third-party tools such as **HubSpot**, **Outreach**, **Gong**, and **ZoomInfo** into the Salesforce platform, improving data synchronization and reporting accuracy across sales functions.\nConducted training sessions for sales teams utilizing tools like **CPQ** for accurate quoting, which led to a **25%** increase in close rates by enabling more effective sales strategies.\nCollaborated with cross-functional teams to implement best practices that ensure compliance with CRM standards, leading to improved data integrity and security in line with GDPR regulations.\n"
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, JavaScript, TypeScript\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n **Frontend Frameworks:**\n\tReact, Vue, Angular\n\n **API Technologies:**\n\t\n\n **Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda), Azure (App Services)\n\n **Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:**\n\tAWS (RDS, S3), Azure (Blob, SQL)\n\n **Other:**\n\tAI, ML, MLflow, Airflow, Kubeflow, Keycloak, JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, Salesforce, Sales Cloud, Flow Builder, Lightning App Builder, Data Loader, HubSpot, Outreach, Gong, ZoomInfo, CPQ, sales processes, pipeline management, project management, communication",
  "apply_company": "Commit"
}