{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Sales Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Senior Sales Engineer with a robust understanding of **AWS** and **Azure** cloud infrastructures, proficient in **cloud networking** and **security tools**, and experienced in **IAM** practices and **DR** strategies. Demonstrates exceptional problem-solving and solution design capabilities, ensuring alignment with industry standards. Skilled in delivering high-performance applications with 13+ years in the field, particularly within the healthcare and financial sectors. Proficient in programming languages including **JavaScript/TypeScript**, **Python**, and frameworks such as **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**. Adept at developing AI/ML powered platforms for predictive analytics and automation, alongside hands-on expertise in deploying microservices and CI/CD pipelines. Committed to maintaining compliance with standards such as HIPAA, FHIR, PCI DSS, and SOC 2, with a strong foundation in MLOps utilizing tools like **MLflow**, **Airflow**, and **Kubeflow**.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Sales Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Utilized **AWS** and **Azure** to design and implement secure cloud infrastructure solutions, ensuring compliance with industry standards and best practices in cloud networking and security tools.\nConducted assessments of customer environments on both **Windows** and **Linux** platforms, providing tailored solutions for disaster recovery (DR) and backup strategies, enhancing overall system reliability by **30%**.\nWorked closely with sales teams to address customer concerns and showcase the advantages of cloud technologies, achieving a **15%** increase in adoption rates through effective solution design and problem-solving skills.\nDeveloped comprehensive presentations and demonstrations for **AWS** and **Azure** services, emphasizing the integration of advanced cloud solutions to meet client needs, resulting in a **25%** reduction in proof of concept (POC) cycles.\nCollaborated with cross-functional teams to identify customer requirements and deliver customized cloud-based solutions, leveraging additional certifications in cloud technologies to enhance credibility and client trust.\nProvided ongoing technical support and training to customers, enabling them to effectively utilize cloud services, which led to a **95%** satisfaction rating in post-engagement surveys.\nAnalyzed market trends and competitor offerings, using data-driven insights to refine product features and stay ahead of industry demands, contributing to a **20%** increase in market share.\nParticipated in the development of technical documentation and training materials, streamlining knowledge transfer processes and supporting internal teams in delivering exceptional customer service.\nEngaged in continuous learning and professional development to maintain cloud certifications and expertise, ensuring the delivery of the latest cloud solutions and best practices to clients."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Implemented robust cloud solutions leveraging **AWS** and **Azure** to ensure high availability and security of financial platforms while optimizing for performance and cost.\nDesigned and executed solutions for cloud networking and Infrastructure as a Service (IaaS), enhancing system reliability and scalability.\nConducted in-depth problem-solving and solution design sessions to address customer needs, resulting in a **30%** reduction in deployment times and improved customer satisfaction.\nEnsured data integrity and security using industry-standard **security tools** and identity access management (**IAM**) practices across all platforms.\nRegularly performed disaster recovery (**DR**) tests and established backup protocols to secure financial data, achieving a **99.9%** uptime across installations.\nCollaborated with cross-functional teams to develop technical documentation and presentations that aligned with customer requirements, facilitating successful sales pitches and product demonstrations.\nLeveraged both **Windows** and **Linux** environments for deploying and managing applications, enhancing flexibility and performance considerations in a hybrid cloud setup.\nAchieved **Cloud Certifications** to validate expertise in cloud architectures, enabling strategic advisory for clients on best practices and migration strategies."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Employed cloud expertise on **AWS** and **Azure** platforms to design and deliver reliable solutions for enterprise-level clients, ensuring scalability and performance in every deployment.\nUtilized thorough problem-solving skills to architect and optimize backup and disaster recovery (DR) strategies, applying best practices for cloud networking and secure data handling across **Windows** and **Linux** environments.\nDeveloped comprehensive solutions leveraging **IAM** for identity and access management, enhancing security measures with advanced security tools tailored to client requirements.\nProvided technical support and guidance on solution design, confidently addressing customer inquiries and demonstrating product value in real-world scenarios.\nConducted in-depth assessments of current storage and network setups, recommending enhancements to optimize performance and reliability.\nEstablished and maintained cloud-based environments for clients, ensuring robust security measures are in place for compliance and risk management.\nAchieved high customer satisfaction by delivering tailored solutions that align with business objectives while maintaining focus on problem-solving and solution design principles.\nFostered strong relationships with clients, facilitating effective communication and understanding of their cloud-based needs to drive future opportunities and retention.\nManaged documentation and reporting of client interactions and project status, ensuring transparency and accountability throughout the project lifecycle."
    }
  ],
  "skills": "Programming Languages:\n\tPython, JavaScript, TypeScript\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tOAuth2, JWT, Keycloak (OIDC, RBAC)\n\n**Serverless and Cloud Functions:**\n\tAWS: Lambda, Azure: App Services\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS: ECS, RDS, S3, Azure: Blob Storage, SQL Database, Windows, Linux, Cloud networking, IAM\n\n**Other:**\n\tCloud Certifications, Security tools, DR, Backup, problem-solving, solution design, Nginx, Let’s Encrypt, Certbot",
  "apply_company": "Cloud Bridge"
}