{
  "name": "Tomasz Lee",
  "role_name": "Senior Python Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Results-driven Senior Python Engineer with 9+ years of experience in designing and implementing robust applications. Proficient in **Python**, **FastAPI**, **Pydantic**, and adept in **Git** for version control and collaborative coding. Well-versed in **Agile** methodologies, enabling efficient project management and team collaboration. Skilled in developing scalable backends and managing databases, enhancing application functionality and performance. Demonstrated expertise in **CI/CD** pipelines, ensuring seamless integration and deployment. Strong communication and collaboration abilities to drive projects to successful completion while maintaining high-quality standards.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Senior Python Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Utilized **Python** and **FastAPI** to develop high-performance web applications, adhering to best coding practices.\nImplemented **Pydantic** for data validation, ensuring consistent data structure and integrity across the application.\nEmployed **Git** for version control, facilitating efficient collaboration and code management through **Pull Requests** and **Code Reviews**.\nLed the adoption of **Agile** methodologies to enhance project delivery speed and team collaboration, resulting in a **30%** increase in project efficiency.\nConducted unit and integration testing to ensure robust and reliable code, achieving a **95%** code coverage metric.\nDesigned and optimized databases to meet application needs, improving data retrieval speed by **20%**.\nManaged CI/CD pipelines to automate deployment processes, reducing deployment errors and enhancing application reliability by **40%**.\nFostered effective communication and collaboration within cross-functional teams to achieve project goals and maintain high developer morale.\nMentored junior engineers, promoting best practices in coding and testing, which contributed to the professional growth of the team."
    },
    {
      "role": "Full Stack Developer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "Leveraged **Python** and **FastAPI** to design and develop high-performance web applications, improving response times by **20%**.\nImplemented **Pydantic** for data validation and serialization, enhancing API reliability and maintainability.\nUtilized **Git** for version control to manage codebase efficiently and streamline collaboration through effective **pull requests** and code reviews.\nAdopted Agile methodologies to deliver features iteratively, resulting in a **40%** decrease in time-to-market.\nDeveloped and executed comprehensive testing strategies, achieving over **90%** code coverage and reducing bugs in production.\nDesigned and maintained relational database structures with a focus on optimization, employing **PostgreSQL** and **MySQL**, ensuring efficient data retrieval.\nIntegrated **CI/CD** pipelines to automate deployment processes, reducing deployment time by **50%**.\nFacilitated effective communication with cross-functional teams, leading to improved project outcomes and alignment on development goals.\nConducted mentorship sessions with junior developers, improving overall team coding skills and collaboration by **25%**.\nActively participated in code reviews, fostering a culture of quality and continuous improvement within the development team."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "• Developed and maintained scalable web applications using **FastAPI** and **Python**, ensuring high performance and responsiveness, leading to a **25%** increase in user satisfaction.\n• Designed and implemented robust RESTful APIs utilizing **Pydantic** for data validation, enhancing data integrity and reducing bugs by **30%**.\n• Collaborated in an **Agile** environment, participating in daily standups and sprint planning, which improved team communication and project delivery times by **15%**.\n• Utilized **Git** for version control, facilitating smooth collaboration through code reviews and pull requests, thus maintaining code quality and consistency.\n• Executed thorough testing strategies to ensure high-quality code, implementing unit tests and integration tests that achieved **90%** test coverage.\n• Managed database interactions and optimization for **PostgreSQL** to enhance query performance, resulting in **40%** faster data retrieval.\n• Leveraged **CI/CD** tools for continuous deployment processes, decreasing deployment times by **50%** and reducing errors in production.\n• Actively communicated with cross-functional teams to align on project goals and deliverables, fostering an inclusive collaborative environment.\n• Provided mentorship to junior developers, enhancing their skills and improving overall team productivity by **20%**."
    }
  ],
  "skills": " **Programming Languages** \n\t Python, JavaScript, TypeScript \n\n **Backend Frameworks** \n\t NodeJS, ExpressJS, NestJS, FastAPI \n\n **Frontend Frameworks** \n\t ReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS \n\n **API Technologies** \n\t RESTful API, GraphQL \n\n **Serverless and Cloud Functions** \n\t AWS, Azure \n\n **Databases** \n\t MSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB \n\n **DevOps** \n\t CI/CD pipelines, Agile, Git, Code Reviews, Pull Requests \n\n **Cloud & Infrastructure** \n\t Cloud \n\n **Other** \n\t Messaging & Caching: Apache Kafka, RabbitMQ, Redis, UX/UI Design, Testing: NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest, Collaboration, Communication, Blockchain: Solidity, Ether.js, Web3.js, Ethereum",
  "apply_company": "Nearform"
}