{
  "name": "Mariusz Jan Skobel",
  "role_name": "Senior JavaScript Engineer",
  "email": "mariuszskobel15@outlook.com",
  "phone": "+48 735 343 548",
  "address": "Katowice, Poland",
  "linkedin": "https://www.linkedin.com/in/mariusz-skobel-927764397/",
  "profile_summary": "Skilled Senior JavaScript Engineer with 10+ years of experience specializing in **JavaScript**, **TypeScript**, **React**, and **Vue.js**. Proficient in modern front-end technologies such as **HTML5**, **CSS3**, **LESS**, and **SASS**, utilizing **Node.js** for back-end development. Demonstrated expertise in creating and optimizing dynamic web applications, employing build tools like **Gulp** and **Webpack** for efficient workflows. Familiar with testing frameworks like **Playwright** to ensure high-quality software delivery.\n\nPossesses a strong background in full-stack development, leveraging **Python** and **Flutter** for diverse project needs. Experienced in cloud deployments on **Azure** and **AWS**, and adept at building applications that incorporate AI/ML capabilities for enhanced functionality. Knowledgeable in microservices architecture, event-driven systems, and CI/CD processes, with a commitment to developing secure, maintainable solutions compliant with standards such as HIPAA, FHIR, PCI DSS, and SOC 2.\n\nBrings comprehensive MLOps insights from developing ML pipelines to managing production workflows using tools like MLflow, Airflow, and Kubeflow. Driven to create impactful solutions that blend technical excellence with real-world applicability.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2012",
      "to_year": "2015",
      "location": "UK",
      "university": "University of Bristol"
    }
  ],
  "experience": [
    {
      "role": "Senior JavaScript Engineer",
      "company": "EitBiz",
      "from_date": "Oct 2022",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "•\tDeveloped dynamic, scalable web applications utilizing **JavaScript** frameworks, particularly **React** (17–18) and **Vue.js**, ensuring seamless user experiences through modern design practices and responsive **HTML5** and **CSS3** implementations.\n•\tApplied advanced **TypeScript** strategies to enhance code quality and maintainability, resulting in a **30%** reduction in bugs and an improved development workflow.\n•\tImplemented state management solutions and build processes using **Node.js** with tools like **Gulp** and **Webpack**, significantly improving build times by **25%**.\n•\tCreated unit and integration tests using **Playwright** and Jest, achieving over **80%** code coverage across the project, enhancing reliability in production environments.\n•\tDesigned and maintained component libraries and reusable UI modules, leveraging the capabilities of **React** and **CSS3** preprocessors (**LESS**/**SASS**) to accelerate development timelines.\n•\tCollaborated closely with cross-functional teams to gather requirements and deliver high-quality features in an Agile environment, contributing to project completions **on time** or ahead of schedule in **90%** of cases.\n•\tLed the adoption of version control practices using **Git**, ensuring efficient collaboration and code management among team members.\n•\tOptimized application performance, achieving load times under **2 seconds** for major web applications by implementing best practices in **JavaScript** and resource management.\n•\tMentored junior developers in modern **JavaScript** techniques and tools, fostering a culture of knowledge sharing and skill enhancement within the team.\n"
    },
    {
      "role": "Software Engineer",
      "company": "Tvn S.A.",
      "from_date": "Oct 2019",
      "to_date": "Sep 2022",
      "location": "Poland",
      "responsibilities": "Utilized **JavaScript** and **TypeScript** to enhance the performance of financial applications, with a focus on maintaining code quality and efficiency across **React** (18), **Vue.js**, and **Node.js** frameworks.\nDeveloped responsive and user-friendly front-end applications leveraging **HTML5**, **CSS3**, and **ECMAScript**, ensuring seamless user experiences for financial dashboards and admin portals.\nImplemented state management solutions using **Redux Toolkit** to optimize data flow and maintainability, resulting in a **30%** improvement in application speed.\nConducted rigorous testing of applications using **Playwright**, driving down bugs and enhancing reliability before deployment.\nCollaborated with cloud services and tools such as **Gulp** and **Webpack** for efficient asset management and version control, ensuring a streamlined development process.\nParticipated in code reviews and contributed to maintaining our **Git** repository, promoting collaborative development practices and improving team efficiency by **25%**.\nUtilized best practices for performance optimization in both **React** and **Vue.js**, resulting in applications handling over **100,000** simultaneous users without degradation in performance.\nEngaged in continuous learning of JavaScript ecosystem tools and frameworks, implementing new findings into legacy systems to enhance functionality and user experience."
    },
    {
      "role": "Software Engineer",
      "company": "Timspark",
      "from_date": "Sep 2015",
      "to_date": "Aug 2019",
      "location": "UK",
      "responsibilities": "Developed high-performance web applications leveraging **JavaScript**, **React (18)**, **Node.js**, **Vue 3**, and **TypeScript** to deliver engaging and responsive user experiences across platforms.\nEngineered scalable APIs and services using **Node.js** frameworks like **Express** and **NestJS**, optimizing for backend performance and efficient data handling.\nImplemented modern technologies such as **Webpack** and **Gulp** to streamline build processes, improving development efficiency by **30%**.\nEmployed **HTML5** and **CSS3** alongside preprocessors like **LESS** and **SASS** for crafting responsive, mobile-friendly interfaces that meet **WCAG 2.1** accessibility standards.\nUtilized version control with **Git** to manage code changes collaboratively, enhancing team productivity during development cycles.\nDesigned and executed automated testing and quality assurance processes using **Playwright**, reducing bug rates and increasing deployment confidence by **25%**.\nIncorporated best practices for JavaScript development by applying **ECMAScript** standards, ensuring code maintainability and readability for future enhancements.\nCreated dynamic, user-focused web experiences that increased customer engagement metrics by **20%**, utilizing responsive design principles.\nMaintained up-to-date knowledge of emerging trends in **JavaScript** technologies, continually refining application architecture to optimize performance and scalability."
    }
  ],
  "skills": "**Programming Languages:**\n\tJavaScript, TypeScript, Python\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django, Node.js\n\n**API Technologies:**\n\t\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps:**\n\tDocker, Kubernetes, Git, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS, Azure\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, Gulp, Webpack, Playwright, HTML5, CSS3, ECMAScript, LESS, SASS, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot",
  "apply_company": "Tech Pioneer"
}