{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior PHP Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "Results-oriented Senior PHP Engineer with 8 years of full-stack development experience, proficient in **PHP**, **Symfony**, and relational databases including **MySQL**, **PostgreSQL**, and **SQLite**. I excel in building scalable, high-performance solutions leveraging **ElasticSearch**, **Redis**, and **Solar** technologies in the healthcare and financial sectors. I am well-versed in agile methodologies, including **Scrum** and **Kanban**, ensuring that projects are delivered on time and meet quality standards.\n\nMy technical expertise includes leveraging domain-driven design principles and SOLID architecture for robust application development. I have substantial experience in CI/CD automation, enabling rapid deployment and improved operational efficiency. In addition to my core programming skills, I possess strong leadership abilities and a commitment to collaboration within cross-functional teams, driving initiatives that align with business objectives.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior PHP Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Developed and maintained high-performance web applications using **PHP**, **Symfony**, and **MySQL** to ensure seamless integration with existing healthcare and financial systems.\n- Implemented **SOLID** principles and **Domain-Driven Design** methodology to create scalable software architectures that enhance maintainability and facilitate future expansion, supporting applications serving over **100,000** users.\n- Led Agile development practices by employing **Scrum** and **Kanban** methodologies, resulting in a **30%** increase in team productivity and improved delivery timelines.\n- Designed and optimized data storage solutions using **PostgreSQL** and **SQLite**, ensuring efficient handling of concurrent transactions and real-time data access for the healthcare sector.\n- Integrated **Redis** caching mechanisms to enhance application performance, achieving page load times reduced by over **50%**.\n- Employed **ElasticSearch** for advanced search functionalities across large datasets, enhancing user experience and enabling complex querying of health records and financial documents.\n- Collaborated with cross-functional teams to develop and deploy robust RESTful APIs, facilitating seamless data exchange between frontend and backend services.\n- Ensured adherence to best practices in code quality and version control using **Git**, conducting regular code reviews and performance assessments.\n- Actively participated in daily stand-ups and sprint planning sessions to drive continuous project enhancements and ensure alignment with strategic goals."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Developed robust and scalable web applications using **PHP** and **Symfony**, ensuring high-performance and maintainability for complex financial solutions.\nDesigned and optimized databases leveraging **MySQL**, **PostgreSQL**, and **SQLite** to ensure efficient data retrieval and storage across financial platforms.\nImplemented agile methodologies including **Scrum** and **Kanban**, leading teams to successfully deliver features on time, resulting in a **30%** increase in project turnaround time.\nCollaborated in cross-functional teams to design architecture following **Domain-Driven Design** principles, aiding in the clarity of system interactions.\nUtilized **ElasticSearch** and **Redis** for data indexing and caching to enhance application responsiveness, reducing query times by over **50%**.\nAdopted principles of **SOLID** design to ensure the scalability and maintainability of applications, resulting in code that is easier to debug and adapt as business needs change.\nVersion-controlled and managed codebases using **Git**, facilitating seamless collaboration and code reviews among team members, leading to higher code quality.\nLeveraged **Solar** for performance optimization and maintaining search capabilities, enabling efficient financial data inquiry for users, which improved user satisfaction by **40%**."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Designed and optimized backend services using **PHP** (**Symfony**) and **MySQL**/**PostgreSQL**, ensuring high availability, low latency, and scalability across key modules like checkout and order fulfillment, contributing to a **30%** reduction in page load times.\nImplemented Agile methodologies like **Scrum** and **Kanban** to streamline project management and enhance team collaboration, boosting productivity by **25%**.\nEngineered database solutions with **MySQL**, **PostgreSQL**, and **SQLite** to manage and retrieve data effectively in high-traffic e-commerce workflows, achieving **99.9%** uptime in critical services.\nIntegrated caching solutions using **Redis** to improve data access speed, significantly decreasing server response times by **40%** for frequently accessed resources.\nUtilized **ElasticSearch** for optimized search functionality, enhancing user experiences with faster search results and increasing conversion rates by **15%**.\nApplied **SOLID** principles and **Domain-Driven Design** methodologies to ensure maintainable code structures, facilitating easier updates and feature additions.\nCollaborated in cross-functional teams through Agile practices to deliver features efficiently on schedule while adhering to project timelines.\nManaged source control effectively using **Git**, enabling a smooth workflow with version control best practices, and ensuring code integrity during the development process."
    }
  ],
  "skills": "**Programming Languages:**\n\tPython, JavaScript/TypeScript, PHP\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django, Symfony\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\t\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Databases:**\n\tPostgreSQL, MySQL, SQLite, MongoDB, Redis\n\n**DevOps:**\n\tDocker, Kubernetes, Git, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS, Azure\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, SOLID, Domain-Driven Design, Scrum, Kanban, Agile",
  "apply_company": "HR Contact"
}