{
  "name": "Rei Taro",
  "role_name": "Senior AI Engineer",
  "email": "rei515@outlook.com",
  "phone": "+48732529451",
  "address": "Warszawa, Poland",
  "linkedin": "https://www.linkedin.com/in/rei-taro-81a410391/",
  "profile_summary": "Results-driven Senior AI Engineer with over 10 years of experience in designing sophisticated backend systems tailored for **AI** and **ML** applications, particularly in financial and healthcare sectors. Proficient in **MLOps**, **NLP**, **LLMs**, and informed by a deep understanding of tools such as **PyTorch**, **scikit-learn**, **Hugging Face**, and **Azure ML**. Expertise includes managing the entire **model lifecycle management** process, developing robust data pipelines, and implementing effective **CI/CD** strategies. Demonstrated ability to design and evaluate models for clinical decision support, ensuring adherence to healthcare standards while focusing on **risk management** and **explainability**. Adept at developing high-quality, scalable APIs with technologies like **Python** (**FastAPI**, **Django**, **Flask**) and leveraging cloud services like **AWS** and **Azure**. Known for strong communication, team collaboration, and adaptability, with a proven record of delivering impactful projects at leading organizations such as VISA, Sii Poland, and Reply Polska.",
  "education": [
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2010",
      "to_year": "2015",
      "location": "Japan",
      "university": "Keio University"
    }
  ],
  "experience": [
    {
      "role": "Senior AI Engineer",
      "company": "Leobit",
      "from_date": "Aug 2022",
      "to_date": "Present",
      "location": "Poland",
      "responsibilities": "Engineered and deployed AI-driven solutions utilizing **PyTorch**, **scikit-learn**, and **Hugging Face** for Natural Language Processing (NLP) tasks, impacting **200+** users with intelligent automation.\nDeveloped MLOps practices for model lifecycle management, ensuring efficient CI/CD for AI models within a **Azure** environment, achieving a **30%** reduction in deployment time.\nLed the creation and maintenance of data pipelines with **Azure ML** and **Apache Airflow**, facilitating the onboarding of **5+** data sources to support ongoing AI initiatives.\nImplemented rule engines and clinical decision support systems in compliance with healthcare standards, optimizing decision processes for patient management and treatment by **15%**.\nCollaborated with cross-functional teams to enhance NLP models, focusing on model evaluation and explainability to meet business needs while maintaining flexible and adaptable solutions.\nEstablished risk management protocols to ensure the integrity and security of AI systems, utilizing techniques to mitigate potential vulnerabilities in production environments."
    },
    {
      "role": "Software Engineer",
      "company": "Innovature",
      "from_date": "Nov 2018",
      "to_date": "Jun 2022",
      "location": "Japan",
      "responsibilities": "• Developed and managed data pipelines using **Azure ML** and **Apache Airflow** for efficient processing and exchange of regulatory data, enhancing the data flow by **50%**.\n• Implemented MLOps practices to support the model lifecycle management, ensuring robust performance monitoring and deployment of AI models, achieving **99%** uptime.\n• Built large language models (LLMs) and used **PyTorch** for NLP tasks in healthcare, improving accuracy of clinical decision support systems by **30%**.\n• Leveraged **Hugging Face** transformers for model evaluation and explainability, enhancing transparency and user trust in AI-driven solutions.\n• Collaborated with cross-functional teams to integrate AI solutions, ensuring regulatory compliance with healthcare standards, while maintaining flexibility and adaptability to changing requirements.\n• Conducted risk management assessments and security audits, employing **CI/CD** practices to streamline the deployment process while integrating authentication solutions like OAuth2 and **Azure AD B2C**.\n• Ensured continuous learning and communication within the team, fostering a culture of innovation and collaboration to drive successful project outcomes."
    },
    {
      "role": "Software Developer",
      "company": "Wizcorp",
      "from_date": "Apr 2015",
      "to_date": "Nov 2018",
      "location": "Japan",
      "responsibilities": "Utilized **Azure ML** and **PyTorch** to develop and deploy MLOps solutions, ensuring seamless integration into existing systems for enhanced trading operations.\nEngineered NLP capabilities leveraging **scikit-learn** and **Hugging Face** to analyze and process financial data, improving model responses and trading strategies.\nImplemented CI/CD pipelines to streamline model lifecycle management, enhancing deployment efficiency by up to **40%**.\nConducted model evaluation and explainability assessments to meet healthcare standards, ensuring compliance with industry regulations and increasing stakeholder trust by **30%**.\nDeveloped robust data pipelines using **Redis** and **Celery**, optimizing task execution for real-time trading data processing.\nFacilitated effective team collaboration and communication across cross-functional teams to enhance adaptability and speed in delivering new features.\nIntroduced rule engines and clinical decision support mechanisms to improve risk management protocols, resulting in a **25%** reduction in compliance issues.\nEncouraged a culture of continuous learning and flexibility to stay ahead in AI and ML advancements, enhancing the team's skill set and overall productivity."
    }
  ],
  "skills": " **Programming Languages**\n\tPython (3.8+), SQL, Bash, JavaScript\n\n **Backend Frameworks**\n\tFastAPI, Flask, Django, Celery\n\n **Frontend Frameworks**\n\t\n\n **API Technologies**\n\tREST/gRPC APIs, Microservices, Kafka\n\n **Serverless and Cloud Functions**\n\tAWS (EC2, S3, Lambda), Azure, Azure ML, Azure OpenAI\n\n **Databases**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n **DevOps**\n\tDocker, Kubernetes, GitHub Actions, Azure DevOps, CI/CD\n\n **Cloud & Infrastructure**\n\t\n\n **Other**\n\tAI, ML, MLOps, NLP, LLMs, PyTorch, TensorFlow, Pandas, NumPy, scikit-learn, Hugging Face, Airflow, MLflow, model lifecycle management, healthcare standards, rule engines, clinical decision support, data pipelines, data labeling, model evaluation, explainability, risk management, communication, team collaboration, flexibility, adaptability, learning",
  "apply_company": "COPE Health Solutions"
}