{
  "name": "Rei Taro",
  "role_name": "Solutions Engineer",
  "email": "rei515@outlook.com",
  "phone": "+48732529451",
  "address": "Warszawa, Poland",
  "linkedin": "https://www.linkedin.com/in/rei-taro-81a410391/",
  "profile_summary": "Solutions Engineer with over 10 years of experience in cloud-native architectures and backend system design, proficient in **AWS**, **Azure**, and **GCP**. Skilled in developing high-performing APIs and implementing effective API workflows. Experienced with **GitHub**, **BitBucket**, and **GitLab** for version control and collaboration. Demonstrated ability to analyze client needs and craft sales strategies to deliver tailored solutions for organizations, including VISA, Sii Poland, and Reply Polska. Strong presentation skills and collaborative mindset, paired with a curiosity to explore emerging technologies and enhance project outcomes.",
  "education": [
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2010",
      "to_year": "2015",
      "location": "Japan",
      "university": "Keio University"
    }
  ],
  "experience": [
    {
      "role": "Solutions Engineer",
      "company": "Leobit",
      "from_date": "Aug 2022",
      "to_date": "Present",
      "location": "Poland",
      "responsibilities": "Utilized **Azure** and **Terraform** to deploy microservices and manage infrastructure as code, ensuring 99.9% uptime and streamlined cloud operations.\nEngineered backend services in **Python** with **FastAPI** to enhance document automation, user onboarding, and reporting workflows, reducing processing time by 30%.\nCreated and maintained API workflows, integrating **Celery** and **Redis** for effective asynchronous processing of financial transactions, improving response times by 25%.\nDeveloped data pipelines using **Apache Airflow** and **Azure Functions** for timely regulatory data exchange, ensuring 100% compliance and accuracy in data flow.\nLed security assessments and integrated **OAuth2** and **Azure AD B2C** for robust authentication systems, increasing security compliance by 40%.\nCollaborated with cross-functional teams utilizing **GitHub**, **BitBucket**, and **GitLab** to address system integration challenges, improving team efficiency by 20%.\nDemonstrated strong analytical thinking and presentation skills while addressing client needs and aligning solutions with **AWS** and **GCP** capabilities."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Innovature",
      "from_date": "Nov 2018",
      "to_date": "Jun 2022",
      "location": "Japan",
      "responsibilities": "Leveraged **Azure** for deployment of microservices, ensuring reliable infrastructure through Terraform automation in **version 1.0**.\nDesigned and managed **API workflows** that facilitated seamless document automation, enhancing the user onboarding process by **45%**.\nImplemented event-driven microservices utilizing **Celery** and **Redis**, resulting in a **30%** increase in the efficiency of processing financial data and transaction requests.\nCreated secure data pipelines for regulatory compliance with **Apache Airflow** and **Azure Functions**, decreasing data flow interruptions by **25%**.\nConducted comprehensive security audits in line with industry standards, effectively integrating **OAuth2** and **Azure AD B2C** for enhanced authentication protocols.\nCollaborated with cross-functional teams to foster collaborative efforts that improved system integration and ensured compliance, enhancing release management outcomes by **20%**."
    },
    {
      "role": "Software Developer",
      "company": "Wizcorp",
      "from_date": "Apr 2015",
      "to_date": "Nov 2018",
      "location": "Japan",
      "responsibilities": "Utilized **AWS**, **GCP**, and **Azure** to architect scalable solutions that enhance backend functionalities and ensure optimal performance for trade execution and portfolio management.\nLeveraged **API workflows** to integrate with third-party services, facilitating seamless communication between frontend and backend systems.\nApplied **GitHub**, **BitBucket**, and **GitLab** for version control, ensuring a cohesive collaboration and continuous integration within a **9-member** development team.\nImplemented security protocols using **Okta** and **Entra ID** to maintain data security and compliance with regulatory standards including MiFID II and GDPR.\nEngineered backend services for trade execution and account tracking utilizing **Python**, **Flask**, and **PostgreSQL**, reducing latency by **30%** in trading operations.\nCollaborated effectively with cross-functional teams to ensure product alignment, utilizing analytical thinking and teamwork skills to meet technical requirements.\nIntroduced performance monitoring using **Google Workspace** tools, leading to a **25%** improvement in system reliability and user experience.\nConducted presentations to stakeholders, showcasing project updates and driving strategic discussions around platform improvements and future roadmaps.\nImplemented comprehensive test suites with **PyTest**, **tox**, and mock servers, contributing to a **40%** reduction in bugs identified during production stages."
    }
  ],
  "skills": "**Programming Languages**\n\tPython (3.8+), SQL, Bash, JavaScript\n\n**Backend Frameworks**\n\tFastAPI, Flask, Django, Celery\n\n**Frontend Frameworks**\n\t\n\n**API Technologies**\n\tREST/gRPC APIs, API workflows\n\n**Serverless and Cloud Functions**\n\tAWS (EC2, S3, Lambda), Azure, GCP\n\n**Databases**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps**\n\tDocker, Kubernetes, GitHub Actions, Azure DevOps, Git, GitHub, BitBucket, GitLab\n\n**Cloud & Infrastructure**\n\t\n\n**Other**\n\tAI/ML Tools: Pandas, NumPy, scikit-learn, TensorFlow, Airflow, MLflow, Microservices, Kafka, CI/CD, PyTest, Sales strategy, Presentation skills, Analytical thinking, Collaboration, Curiosity, Okta, Google Workspace, Entra ID"
}