{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Delivery Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "Results-driven Senior Delivery Engineer with 8 years of comprehensive experience in software development and project delivery, specializing in **Python**, **SQL**, and **Azure DevOps**. Proficient in data modeling, analysis, and ETL/ELT processes, ensuring optimal data flow and integration across various platforms. Skilled in managing database systems with **PostgreSQL** and **MS SQL**, and utilizing version control with **GIT**. Demonstrated expertise in facilitating teamwork using **Jira** for project tracking, **Miro** for visual collaboration, and proficient in **MS Office Suite** for effective communication and presentation.\n\nAs a full-stack developer, I have utilized technologies such as **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django** to create efficient, high-performance solutions. My experience with **Azure** and **AWS** cloud services has played a critical role in developing scalable and compliant applications that adhere to standards like HIPAA and PCI DSS. Additionally, I have led projects that incorporate AI/ML technologies for predictive analytics and automation, showcasing my ability to integrate advanced solutions into enterprise-grade platforms.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Delivery Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Developed and managed complex SQL queries for data analysis and reporting, optimizing performance for large datasets across **PostgreSQL** and **MS SQL** databases.\n- Utilized **Python** for automating ETL processes, ensuring efficient data extraction, transformation, and loading in line with business requirements.\n- Collaborated with cross-functional teams using **Jira** for project management, ensuring efficient communication and timely delivery of software solutions.\n- Developed deployment pipelines and infrastructure management scripts using **Azure DevOps**, enhancing continuous integration and delivery for multiple projects.\n- Conducted data modeling and analysis for better decision-making through comprehensive reports created in **MS Office Suite** and visualized with **Miro** for project planning.\n- Managed Windows and iOS environments, implementing necessary configurations and troubleshooting to maintain operational efficiency.\n- Led the design and implementation of data architectures meeting business intelligence needs while employing best practices in data governance and security.\n- Streamlined project workflows and improved team collaboration by facilitating clear communication and feedback mechanisms among stakeholders.\n- Established robust version control using **GIT**, ensuring all code changes were tracked and auditable across development environments."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Utilized **SQL** and **PostgreSQL** to analyze financial data, ensuring integrity and performance of data queries for high-volume transaction systems.\nLeveraged **Python** alongside ETL strategies to build and orchestrate pipelines using Apache Airflow and **Azure Data Factory**, facilitating batch and real-time ingestion from both internal and third-party sources, resulting in a **30%** increase in data processing efficiency.\nCollaborated with cross-functional teams, using **Azure DevOps**, **Jira**, and **Miro** to enhance project communication and streamline workflows, achieving a **25%** reduction in project delivery timelines.\nImplemented data modeling techniques to support accurate analysis and reporting in financial platforms, enhancing data-driven decision-making processes.\nDeveloped and maintained documentation within **MS Office Suite**, ensuring clear communication of technical processes to non-technical stakeholders.\nAdopted **GIT** for version control and collaborative coding, ensuring a robust development workflow and reducing conflicts by **40%**.\nExecuted data analysis projects that incorporated **data analysis** and business insights driven by effective communication methodologies with stakeholders.\nUtilized **Powershell** on Windows and **iOS** platforms for automation of repetitive tasks, improving overall operational efficiency by **20%**."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Utilized **SQL** to perform data analysis and modeling, ensuring efficient data flow and structured data integration for various high-stakes projects.\nDeveloped and optimized backend services with **Python**, addressing client needs and improving overall system performance through effective communication and agile methodologies in collaboration tools like **Jira**.\nImplemented CI/CD pipelines using **Azure DevOps** to automate deployment processes, achieving continuous integration, and reducing deployment time by **30%**.\nConducted data gathering and analysis through **MS SQL** and **PostgreSQL**, ensuring high data quality and consistency while supporting business intelligence initiatives with actionable insights.\nManaged project workflows and documentation using tools such as **MS Office Suite** and **Miro**, enhancing team collaboration and project tracking.\nUtilized **Powershell** for automated tasks and streamlined operations, improving efficiency in delivery processes across different environments, including **Windows** and **iOS**.\nParticipated in the ETL and ELT processes to transform raw data into meaningful insights for strategic decision-making, ensuring data integrity and reliability.\nEngaged with cross-functional teams to improve communication channels, fostering a collaborative environment that leads to enhanced project delivery and customer satisfaction.\nLeveraged version control systems like **GIT** to manage and track changes effectively, ensuring version consistency across development and production environments."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, JavaScript/TypeScript\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n **Frontend Frameworks:**\n\tReact, Vue, Angular\n\n **API Technologies:**\n\tJWT, OAuth2, Keycloak (OIDC, RBAC)\n\n **Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n **Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis, MS SQL\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose, Azure DevOps, GIT\n\n **Cloud & Infrastructure:**\n\tWindows, iOS\n\n **Other:**\n\tMLflow, Airflow, Kubeflow, ETL, ELT, data modeling, data analysis, communication, Miro, MS Office Suite, Jira, Let’s Encrypt, Nginx, Certbot",
  "apply_company": "MasterBorn"
}