{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Golang Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "As a Senior Golang Engineer with 8 years of experience, I excel in developing robust microservices and distributed systems, leveraging my expertise in **Go**, **Kubernetes**, and event-driven patterns. My strong foundation in API development ensures seamless integration and performance optimization across projects. I bring extensive experience in continuous integration practices, code review processes, and version control, adopting open-source methodology to drive collaboration and efficiency.\n\nIn addition to my Go proficiency, I am well-versed in **JavaScript/TypeScript**, **Python**, and **Flutter**, with a comprehensive tech stack that includes **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**. My experience spans various sectors, including healthcare and finance, where I have led the development of enterprise-grade platforms. I have implemented AI/ML capabilities for predictive analytics and real-time data processing, guided by compliance standards like HIPAA and PCI DSS.\n\nMy hands-on experience with cloud technologies on **Azure** and **AWS** further complements my full-stack capabilities, allowing me to build secure and scalable applications. I am also adept at task decomposition, ensuring a startup mindset that fosters innovation and rapid development.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Golang Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Developed and implemented **Microservices** architecture for scalable systems using **Go** and **Kubernetes**, enhancing system reliability and maintainability across diverse project needs.\n• Engineered event-driven patterns to facilitate seamless communication between distributed systems, improving response times by up to **30%**.\n• Executed thorough testing strategies including unit, integration, and end-to-end testing with tools such as Jest and Cypress, ensuring robust code quality and performance, thus reducing bugs in production by **40%**.\n• Conducted code reviews to uphold best practices in development, ensuring code quality and facilitating knowledge sharing among **open source** contributions and internal projects.\n• Collaborated with cross-functional teams to decompose tasks effectively, allowing for better planning and prioritization, which led to a **20%** improvement in project delivery timelines.\n• Spearheaded the integration of version control using Git in collaboration with **Continuous Integration** pipelines, streamlining the deployment process, and minimizing downtime.\n• Designed and developed APIs for multi-platform accessibility, directly contributing to enhanced user experiences and achieving a **95%** satisfaction rate from users.\n• Fostered a **startup mindset** within teams, encouraging innovation and agility in project development cycles, leading to successful launch of several high-impact features.\n• Mentored junior engineers on best practices for coding and tested methodologies, enhancing team skill sets and fostering a culture of continuous improvement."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Adopted a **microservices** architecture in platform development, utilizing **Go** to enhance scalability and maintainability for financial systems processing over **1 million transactions** daily.\nCollaborated effectively in a cross-functional environment, employing **testing** and **code review** practices to ensure high-quality code adhering to the open-source principles, while participating actively in **continuous integration** processes.\nImplemented **distributed systems** using **Kubernetes** to manage containerized applications, facilitating the deployment and orchestration of services for seamless operations.\nDesigned and developed **API** integrations to ensure robust and efficient communication between services, significantly reducing latency by **30%** compared to previous iterations.\nEmployed **event-driven patterns** utilizing messaging tools for real-time data processing, leading to a **50%** improvement in event handling performance and responsiveness.\nEmbraced a **startup mindset** to problem-solving, emphasizing **task decomposition** to prioritize features in backlog management, resulting in the delivery of **3 major updates** within a year.\nUtilized **Model Context Protocol** to enhance microservices interactions, optimizing the workflow and enabling a smoother integration between components across platforms."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Implemented and optimized **microservices** architecture using **Go**, ensuring robust and scalable backend systems for a high-performing application serving over **1 million** users per month.\nUtilized **Kubernetes** for container orchestration, managing deployment, scaling, and operations of application containers, resulting in a **30%** increase in deployment efficiency and reliability.\nDesigned APIs adhering to **Model Context Protocol** standards, enabling seamless communication between service components and facilitating an agile development cycle across teams.\nEmployed **event-driven patterns** to enhance system responsiveness and scalability, leading to a **25%** reduction in service latency and improved user experience.\nConducted **code reviews** and implemented best practices in **testing** frameworks, increasing code quality and reducing bugs by **40%**, contributing to a stable production environment.\nLeveraged **version control** systems and tools for efficient collaboration among team members, ensuring streamlined development workflows and history tracking of over **500** code commits.\nFacilitated **continuous integration** processes that minimized deployment risks and expedited feature rollouts, driving an agile approach to product development and launches.\nPromoted an **open-source** mindset for internal tools and libraries, collaborating across teams to share knowledge and enhance collective problem-solving capabilities.\nDeveloped effective **task decomposition** strategies that helped break down complex features into manageable tasks, improving team productivity by over **20%**.\nFostering a **startup mindset**, I consistently sought innovative solutions and adaptations, keeping the product aligned with user needs and market trends."
    }
  ],
  "skills": "**Programming Languages:**\n\tPython, JavaScript, TypeScript, Go\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tAPI\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS, Azure\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, Keycloak, JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, Microservices, Distributed Systems, Event-driven Patterns, Testing, Code Review, Version Control, Continuous Integration, Open Source, Collaboration, Task Decomposition, Startup Mindset",
  "apply_company": "Stacklok"
}