{
  "name": "Tomasz Lee",
  "role_name": "Senior/Lead Frontend Developer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Skilled in **JavaScript**, **React.js**, **Redux.js**, **Node.js**, **HTML5**, **CSS3**, **TypeScript**, and **Selenium**, with 9+ years as a Senior/Lead Frontend Developer. Proven track record of designing and building **Micro Frontend Applications** with a focus on **Responsive Design** and **Unit Testing**. Experienced in utilizing tools like **ESLint** and **Prettier** to maintain code quality. Strong collaborator with excellent communication skills, capable of leading projects and enhancing team performance. Background in optimizing application performance and streamlining development processes in both frontend and backend ecosystems.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Senior/Lead Frontend Developer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "• Designed and developed responsive web applications leveraging **React.js**, **JavaScript**, and **TypeScript**, enhancing user engagement and satisfaction by **25%**.\n• Applied **Redux.js** for state management, ensuring seamless data flow and improved application performance.\n• Collaborated effectively with UX/UI designers to implement user-centered designs that significantly improved user experience.\n• Conducted unit testing and quality assurance using **Selenium** and best practices with **ESLint** and **Prettier**, ensuring code robustness and maintainability.\n• Developed and maintained **Micro Frontend Applications** to enhance modularity and scalability, catering to multiple development teams.\n• Engaged in cross-functional collaboration, showcasing effective communication skills to align project goals and deadlines.\n• Ensured code quality and adherence to standards through continuous integration and delivery, utilizing tools in the **CI/CD pipeline** such as Azure DevOps, which resulted in a **40%** reduction in deployment time.\n• Implemented responsive design principles, optimizing applications for various devices and screen sizes, contributing to a more versatile user experience.\n• Participated in architectural discussions and decisions, providing insights on modern frontend technologies and development workflows. \n• Demonstrated strong problem-solving skills by tackling complex challenges in frontend development and providing innovative solutions."
    },
    {
      "role": "Full Stack Developer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "• Developed and maintained high-quality user interfaces using **React.js** and **Redux.js**, enhancing application functionality and user experience.\n• Ensured responsive design principles were applied across all platforms, leading to a **25% improvement** in user engagement.\n• Implemented unit testing for React components using **Jest**, ensuring code reliability and maintainability while achieving a **30% reduction** in bugs.\n• Collaborated with cross-functional teams to define system requirements and development timelines, ensuring timely project delivery and **25% increase** in team collaboration efficiency.\n• Employed **Selenium** for end-to-end testing of applications, achieving comprehensive test coverage.\n• Conducted code reviews and provided mentorship sessions, fostering a collaborative environment and improving team productivity by **20%**.\n• Integrated **ESLint** and **Prettier** for maintaining code quality and consistency across the codebase.\n• Contributed to the development of micro frontend applications, ensuring scalability and maintainability of complex applications.\n• Actively participated in the Agile development process, improving the team's efficiency and streamlining communication across projects."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "Utilized **JavaScript** and **React.js** to enhance user interfaces, resulting in a 30% increase in user engagement on web applications.\nDeveloped and managed **Micro Frontend Applications** with **Redux.js** for optimized state management, ensuring a consistent user experience.\nImplemented **HTML5** and **CSS3** to create responsive layouts, improving usability across various devices by 25%.\nConducted unit testing using frameworks such as **Selenium**, ensuring 95% code coverage and maintaining software quality.\nEmployed **TypeScript** to enforce type safety, reducing runtime errors by 15% and facilitating easier maintenance.\nAdhered to coding standards with tools like **ESLint** and **Prettier**, improving overall code quality and reducing technical debt by 10%.\nCollaborated with cross-functional teams to drive efficient communication and alignment on project goals, participating in daily standups.\nDelivered training sessions on best practices for responsive design and coding techniques, improving team capabilities and productivity.\nCreated comprehensive technical documentation for onboarding new developers, streamlining the process and reducing ramp-up time by as much as 40%.\nFostered a culture of collaboration and innovation by promoting open communication and knowledge sharing within the team."
    }
  ],
  "skills": " **Programming Languages**\n\tJavaScript, TypeScript, Python\n\n**Backend Frameworks**\n\tNodeJS, ExpressJS, NestJS, C#, .NET, Entity Framework, Microservices\n\n**Frontend Frameworks**\n\tHTML, CSS, CSS3, HTML5, ReactJS, React.js, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS, Redux.js, Responsive Design, Object-Oriented JavaScript Frameworks, Micro Frontend Applications\n\n**API Technologies**\n\tRESTful API, GraphQL\n\n**Serverless and Cloud Functions**\n\tAWS, Azure\n\n**Databases**\n\tMSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB\n\n**DevOps**\n\tCI/CD pipelines\n\n**Cloud & Infrastructure**\n\tCloud Technologies\n\n**Other**\n\tUX/UI Design, Git, GitHub, Selenium, JMeter, Postman, Cypress, NUnit, xUnit, Moq, ESLint, Prettier, Unit Testing, Collaboration, Communication, Blockchain, Solidity, Ether.js, Web3.js, Ethereum"
}