{
  "name": "Tomasz Lee",
  "role_name": "Senior Design Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Creative and results-driven Senior Design Engineer with 9+ years of experience specializing in modern UI/UX design and development. Proficient in **Figma**, **JavaScript**, **TypeScript**, and **React** for crafting user-centric applications with intuitive design. Skilled in utilizing **MobX** for state management and leveraging **AWS** services for robust deployments. Highly effective in continuous deployment practices, promoting agile methodologies, and fostering strong communication and collaboration across multi-disciplinary teams. Demonstrated ability to lead projects from concept to completion while ensuring user experience and technical excellence.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Senior Design Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "• Collaborated with UX/UI designers to enhance user interface designs using **Figma**, ensuring an improved user experience in line with user feedback, leading to a 25% increase in user satisfaction.\n• Developed web applications utilizing **JavaScript**, **TypeScript**, and **React**, ensuring high-performance, maintainable, and scalable code.\n• Spearheaded continuous deployment strategies via Azure DevOps, resulting in a **40%** reduction in deployment times and improved release cycles.\n• Created and maintained modularized microservices architecture on **.NET Core** to support growth, scalability, and maintainability of the product.\n• Developed interactive data visualizations using **D3.js** and **Three.js**, enhancing reporting capabilities and user engagement.\n• Integrated **AWS** cloud services for hosting and scaling applications, successfully improving system resilience and performance.\n• Employed communication and collaboration practices within cross-functional teams for successful project delivery and user-focused outcomes.\n• Implemented JWT-based authentication and authorization protocols for security compliance and user data protection.\n• Utilized **MobX** for state management, improving data flow and management within applications.\n• Streamlined data management processes by integrating **MongoDB** and optimizing **MSSQL** database queries, achieving a **20%** reduction in query execution times."
    },
    {
      "role": "Software Engineer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "Utilized **Figma** for UX design, leading to an enhanced user experience and visual appeal for web applications.\nDeveloped interactive user interfaces using **React**, **JavaScript**, and **TypeScript**, improving user engagement by **25%**.\nImplemented state management with **MobX** to streamline application performance and maintainability.\nDesigned, built, and maintained **cloud-based** applications on **AWS**, achieving a **15%** increase in deployment efficiency.\nEstablished continuous deployment pipelines to automate workflows and reduce production deployment errors by **30%**.\nCollaborated with cross-functional teams to gather requirements, ensuring alignment and effective communication throughout the project lifecycle.\nConducted mentorship sessions for junior developers, fostering a collaborative team environment and increasing overall productivity.\nParticipated in code reviews to uphold best practices and enhance collaboration within the development team.\nCreated prototypes and wireframes using **Figma**, translating business requirements into effective design solutions.\nEnhanced project workflows through clear communication and collaboration with stakeholders, ensuring successful project outcomes."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "Utilized **Figma** for creating user-focused designs to enhance **UX**, ensuring a smooth user experience.\nEmployed **JavaScript** and **React** to develop interactive components, improving overall application responsiveness.\nImplemented **TypeScript** in projects, enhancing code quality and reducing runtime errors by **30%**.\nCollaborated with cross-functional teams to facilitate effective **communication** and **collaboration**, contributing to a cohesive project environment.\nApplied **MobX** for state management in React applications, achieving smoother data flow and updating UI elements efficiently.\nLeveraged **AWS** services for scalable deployment, resulting in a **40%** decrease in downtime and enhanced system reliability.\nExecuted continuous deployment strategies, shortening release cycles to **bi-weekly** intervals, and improved team productivity.\nParticipated in code reviews and daily standups to uphold coding standards and maintain project alignment.\nContributed to technical documentation efforts, promoting knowledge sharing and effective onboarding processes for new team members."
    }
  ],
  "skills": " **Programming Languages**\n\t JavaScript, TypeScript, Python\n\n**Frontend Frameworks**\n\t ReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n**Backend Frameworks**\n\t NodeJS, ExpressJS, NestJS, C#, .NET, Entity Framework, Microservices\n\n**API Technologies**\n\t RESTful API, GraphQL\n\n**Messaging & Caching**\n\t Apache Kafka, RabbitMQ, Redis\n\n**Databases**\n\t MSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB\n\n**DevOps**\n\t AWS, Azure, CI/CD pipelines, continuous deployment\n\n**Cloud & Infrastructure**\n\t AWS\n\n**Other**\n\t UX/UI Design, Git, GitHub, Blockchain, Solidity, Ether.js, Web3.js, Ethereum, UX, Figma, MobX, communication, collaboration, Testing Tools: NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest",
  "apply_company": "Restream"
}