{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Software Engineer especializado/a en Inteligencia Artificial",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-187801395/",
  "profile_summary": "Results-driven Software Engineer with 13+ years of experience specializing in **Inteligencia Artificial** and **Generative AI** applications. Proficient in leveraging **Azure** services, including **App Services**, **Functions**, **Cosmos DB**, and **Key Vault** to build innovative solutions. Demonstrated expertise in developing AI-driven platforms that integrate **speech-to-text** capabilities and support **Intelligent Document Processing (IDP)**. Skilled in implementing **Retrieval-Augmented Generation (RAG)** techniques and utilizing **Large Language Models (LLMs)** for advanced data processing. \n\nStrong background in building high-performance applications across healthcare and financial sectors using **JavaScript/TypeScript**, **Python**, and **Flutter**. Hands-on experience with frontend and backend development frameworks such as **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**. Adept in deploying cloud-native solutions and managing microservices architectures, with proven ability to align with compliance standards including HIPAA and PCI DSS. Well-versed in MLOps strategies, focusing on model training and orchestration with tools like **MLflow**, **Airflow**, and **Kubeflow**. Excellent communication skills in English and a strong advocate for collaborative, autonomous work environments.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Software Engineer especializado/a en Inteligencia Artificial",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Developed and implemented intelligent applications leveraging **Azure** services, including **Functions**, **App Services**, and **Cosmos DB**, to enhance user experience and operational efficiency in AI-driven solutions.\nIntegrated Generative AI techniques and **Large Language Models (LLMs)** into existing software architectures, exemplifying expertise in cutting-edge technologies for enhanced document processing.\nDesigned and executed **Intelligent Document Processing (IDP)** workflows, streamlining data management and improving accuracy in document parsing.\nUtilized cloud infrastructure for deploying robust AI models, ensuring seamless integration with **speech-to-text** capabilities, and supporting real-time processing for user interactions.\nCollaborated in cross-functional teams to deliver AI-driven features that optimize business intelligence outcomes, ensuring alignment with organizational objectives and user needs.\nPrioritized security and compliance by incorporating **Key Vault** for managing sensitive data, aligning with best practices in software development for AI applications.\nPioneered the use of **Retrieval-Augmented Generation (RAG)** strategies to enhance data retrieval and user engagement in applications, driving innovation in software solutions.\nFostered a culture of collaboration and autonomous work, sharing knowledge and expertise in AI technologies, promoting best practices across teams.\nCommunicated complex technical concepts effectively in both English and Spanish, facilitating smoother collaboration across diverse teams and stakeholders across **Azure** environments.\nMaintained and documented development processes to support ongoing training and onboarding of new team members, leading to a **25%** reduction in ramp-up time for new hires and increased overall project velocity."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Implemented **Azure** services including **Functions** and **App Services** to enhance application scalability and accessibility for Intelligent Document Processing (IDP) solutions.\nDeveloped and integrated machine learning models utilizing **Large Language Models (LLMs)** and **Generative AI** techniques to improve automated document handling and user interaction.\nLeveraged **Cosmos DB** for efficient data storage and retrieval, ensuring high availability and performance of financial applications.\nCollaborated with cross-functional teams to design and deploy innovative **speech-to-text** solutions, enhancing user experience through natural language processing capabilities.\nUtilized **Key Vault** to secure sensitive financial data and manage credentials, adhering to best practices in security and privacy.\nEmployed **Retrieval-Augmented Generation (RAG)** strategies for improving information retrieval and generating responses, optimizing user engagement.\nEnsured autonomous work efficiency and reinforced collaboration practices across development teams, resulting in a **35%** increase in project delivery speed.\nConducted regular training sessions to elevate team members' AI literacy, achieving a **20%** improvement in project outcomes and innovation.\n"
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Leveraged **Azure** services to enhance AI integration and deployment processes within backend systems, focusing on **Intelligent Document Processing (IDP)** and **Large Language Models (LLMs)** for enhanced data interpretation and decision-making.\nDeveloped and deployed **Functions** and **App Services** tailored for real-time applications, ensuring high availability and robust performance metrics for customer-centric applications.\nIntegrated speech-to-text technologies, improving accessibility and user experience across multiple application interfaces, contributing to a seamless user journey and compliance with accessibility standards.\nUtilized **Cosmos DB** for scalable and agile data storage solutions, ensuring that data retrieval processes operate under strict latency thresholds, resulting in 95% access speed improvements.\nImplemented **Key Vault** for managing sensitive information securely, which enhanced the platform's security perimeter, ensuring compliance with GDPR regulations and reducing security vulnerabilities by 40%.\nApplied advanced **Generative AI** techniques for creating intelligent features, driving innovation in customer interactions and automating tedious processes, thus allowing for a development efficiency increase of up to **30%**.\nConducted detailed collaboration sessions with cross-functional teams to design AI-driven solutions, emphasizing the importance of teamwork and stakeholder engagement in project execution.\nEngaged in autonomous work practices, demonstrating proficiency in task management and self-direction while maintaining high standards of coding and quality assurance throughout the development lifecycle."
    }
  ],
  "skills": "**Programming Languages:**\n\tPython: FastAPI, Flask, Django\n\tJavaScript/TypeScript: React, Vue, Angular\n\n**Backend Frameworks:**\n\n**Frontend Frameworks:**\n\n**API Technologies:**\n\n**Serverless and Cloud Functions:**\n\tAWS: ECS, Lambda, RDS, S3\n\tAzure: App Services, Blob Storage, SQL Database\n\tFunctions\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare)\n\tMongoDB (Gaming), Redis\n\tCosmos DB\n\n**DevOps:**\n\tDocker, Kubernetes\n\tGitHub Actions, GitLab CI/CD\n\tTerraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAzure: App Services, Blob Storage, SQL Database\n\tKey Vault\n\n**Other:**\n\tArtificial Intelligence\n\tGenerative AI\n\tRetrieval-Augmented Generation (RAG)\n\tSpeech-to-Text\n\tLarge Language Models (LLMs)\n\tIntelligent Document Processing (IDP)\n\tKeycloak (OIDC, RBAC), OAuth2, JWT\n\tNginx, Let’s Encrypt, Certbot\n\tInglés\n\tTrabajo autónomo\n\tColaboración"
}