{
  "name": "Rei Taro",
  "role_name": "Senior Sales Engineer",
  "email": "rei515@outlook.com",
  "phone": "+48732529451",
  "address": "Warszawa, Poland",
  "linkedin": "https://www.linkedin.com/in/rei-taro-81a410391/",
  "profile_summary": "Results-driven Senior Sales Engineer with over 10 years of experience in presenting and delivering technical solutions to clients, specializing in **Energietechnik** and **Notbeleuchtungssysteme**. Proficient in tailoring client-oriented approaches that enhance customer engagement and address specific needs. Strong technical communication skills in both **Deutsch** and **Englisch**, ensuring clear and effective presentations to diverse audiences. Known for a proactive approach and outstanding teamwork abilities, with a proven ability to develop and implement innovative solutions that drive customer satisfaction. Previous contributions in high-stakes environments at leading organizations such as VISA, Sii Poland, and Reply Polska.",
  "education": [
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2010",
      "to_year": "2015",
      "location": "Japan",
      "university": "Keio University"
    }
  ],
  "experience": [
    {
      "role": "Senior Sales Engineer",
      "company": "Leobit",
      "from_date": "Aug 2022",
      "to_date": "Present",
      "location": "Poland",
      "responsibilities": "• Demonstrated **Kundenorientierung** by effectively presenting technical solutions tailored to client needs, enhancing customer satisfaction by **25%**.\n• Leveraged **Technische Kommunikation** skills to convey complex **Energietechnik** concepts to diverse audiences, leading to a **15%** increase in client engagement.\n• Applied **Eigeninitiative** in researching and implementing innovative **Notbeleuchtungssysteme**, resulting in a **30%** improvement in project turnaround time.\n• Collaborated with cross-functional teams to drive **Teamarbeit**, ensuring successful integration of **Technische Lösungen** into customer environments, contributing to **10** successful project deliveries.\n• Actively participated in the development and execution of sales strategies through presentations in both **Deutsch** and **Englisch**, supporting business growth and market expansion.\n• Established productive relationships by understanding customer needs and translating them into actionable solutions, leading to a **40%** increase in repeat business."
    },
    {
      "role": "Software Engineer",
      "company": "Innovature",
      "from_date": "Nov 2018",
      "to_date": "Jun 2022",
      "location": "Japan",
      "responsibilities": "• Developed technical solutions to enhance client experiences by automating document workflows and streamlining user onboarding in **Python** and **FastAPI**.\n• Demonstrated strong customer orientation by collaborating effectively with cross-functional teams to ensure seamless system integration and regulatory compliance.\n• Engineered backend systems capable of handling complex reporting processes, improving efficiency by **30%**.\n• Created event-driven microservices using **Celery** and **Redis**, enabling an **asynchronous processing** capability for financial data and transaction requests, reducing processing times by **25%**.\n• Managed code deployment of microservices on **Azure App Services**, utilizing **Terraform** for infrastructure automation, ensuring a scalable environment that supported **up to 1000** concurrent users.\n• Streamlined regulatory data exchange through data pipelines built with **Apache Airflow** and **Azure Functions**, achieving automated data flow with a **99%** success rate.\n• Conducted security audits and enforced compliance with industry standards, integrating **OAuth2** and **Azure AD B2C** to enhance authentication management and secure access controls.\n• Showed strong initiative and teamwork by leading presentations to stakeholders, ensuring all technical solutions were clearly communicated in both **German** and **English**."
    },
    {
      "role": "Software Developer",
      "company": "Wizcorp",
      "from_date": "Apr 2015",
      "to_date": "Nov 2018",
      "location": "Japan",
      "responsibilities": "• Demonstrated **Kundenorientierung** by developing customized technical solutions to meet client needs in energy technology and emergency lighting systems.\n• Utilized **Technische Kommunikation** to effectively present complex technical concepts to clients, ensuring clarity and understanding in both **Deutsch** and **Englisch**.\n• Engaged in **Teamarbeit** to collaborate with cross-functional teams, enhancing project outcomes and client satisfaction through mutual support and input.\n• Showcased **Eigeninitiative** in identifying trends and clients' demands, proposing innovative strategies to improve service delivery and customer engagement.\n• Applied **Energietechnik** principles to design and implement technical solutions tailored to specific customer requirements, resulting in a **15%** increase in project efficiency.\n• Elevated customer support processes by integrating **Notbeleuchtungssysteme** into the sales pitch, enhancing reliability and credibility with a **20%** increase in customer retention.\n• Developed and maintained sales reporting systems that tracked a **30%** increase in lead conversions and customer follow-ups, optimizing the sales pipeline."
    }
  ],
  "skills": " **Programming Languages**\n\t Python (3.8+), SQL, Bash, JavaScript\n\n **Backend Frameworks**\n\t FastAPI, Flask, Django, Celery\n\n **Frontend Frameworks**\n\t \n\n **API Technologies**\n\t REST/gRPC APIs, Microservices\n\n **Serverless and Cloud Functions**\n\t AWS (EC2, S3, Lambda), Azure\n\n **Databases**\n\t PostgreSQL, MySQL, MongoDB, Redis\n\n **DevOps**\n\t Docker, Kubernetes, GitHub Actions, Azure DevOps, CI/CD, PyTest, Git\n\n **Cloud & Infrastructure**\n\t \n\n **Other**\n\t AI/ML Tools: Pandas, NumPy, scikit-learn, TensorFlow, Airflow, MLflow, Energietechnik, Notbeleuchtungssysteme, Kundenorientierung, Präsentation, Technische Lösungen, Eigeninitiative, Teamarbeit, Deutsch, Englisch, Technische Kommunikation",
  "apply_company": "Eaton"
}