{
  "name": "Rei Taro",
  "role_name": "Backend Developer",
  "email": "rei515@outlook.com",
  "phone": "+48732529451",
  "address": "Warszawa, Poland",
  "linkedin": "https://www.linkedin.com/in/rei-taro-81a410391/",
  "profile_summary": "Results-driven Senior Backend Developer with over 10 years of experience in delivering high-performance backend systems and API design. Proficient in **.NET**, **Spring Boot**, **AWS**, and Agile methodology, with a strong focus on data validation and creating scalable services. Specialized in developing automated solutions for financial platforms and efficient AI/ML pipelines. Demonstrated ability to contribute to major projects at leading firms such as VISA, Sii Poland, and Reply Polska, consistently achieving impactful results.",
  "education": [
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2010",
      "to_year": "2015",
      "location": "Japan",
      "university": "Keio University"
    }
  ],
  "experience": [
    {
      "role": "Backend Developer",
      "company": "Leobit",
      "from_date": "Aug 2022",
      "to_date": "Present",
      "location": "Poland",
      "responsibilities": "Engineered backend services using **.NET** and **Spring Boot** to enhance API design for seamless integration and data validation in various applications.\nDeveloped comprehensive solutions within an Agile methodology framework to improve project delivery timelines by **20%**.\nIntegrated **Angular** for front-end requirements, ensuring effective communication between back-end and front-end services, leading to a **15%** increase in user satisfaction ratings.\nDeployed applications on **AWS**, ensuring integration with cloud-native services to facilitate scalability and reliability of backend systems with **99.9%** uptime.\nCreated and maintained data validation mechanisms, ensuring compliance and accuracy across **100%** of data exchanges.\nCollaborated with cross-functional teams to troubleshoot and optimize performance, reducing latency by **30%** while overseeing release strategies."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Innovature",
      "from_date": "Nov 2018",
      "to_date": "Jun 2022",
      "location": "Japan",
      "responsibilities": "• Developed and maintained robust backend systems, emphasizing **API Design** and integration using **.NET** and **Spring Boot** for enhanced performance and reliability.\n• Implemented data validation protocols to ensure data integrity and compliance, utilizing **Angular** for effective user interface interactions.\n• Employed Agile methodology in project management, increasing team efficiency by **20%** and ensuring timely delivery of project milestones.\n• Streamlined workflow processes by automating documentation using technologies such as **AWS Lambda** and **Azure Functions**, achieving a reduction in processing time by **30%**.\n• Engaged in the creation and management of event-driven architectures, utilizing technologies such as **RabbitMQ** and **AWS SQS** for reliable messaging systems.\n• Conducted rigorous testing and integration processes, employing version control systems like **Git** to track changes and collaborate with team members effectively.\n• Enabled the scalability of applications through strategic deployment solutions, maintaining a **99.9%** uptime using cloud services like **AWS** and **Azure**.\n• Assisted in setting performance metrics and monitoring solutions to ensure application efficiency, achieving a load time reduction by **40%** through optimized query handling."
    },
    {
      "role": "Software Developer",
      "company": "Wizcorp",
      "from_date": "Apr 2015",
      "to_date": "Nov 2018",
      "location": "Japan",
      "responsibilities": "• Designed and developed backend services leveraging **.NET** for trade execution, portfolio management, and account tracking, boosting trading operations by **30%**.\n• Engineered robust API designs to facilitate data delivery through REST APIs for streamlined user interactions, achieving **99.9%** uptime.\n• Implemented data validation processes adhering to regulatory standards such as MiFID II and GDPR, ensuring data integrity and security.\n• Collaborated with cross-functional teams in an **Agile methodology** environment to enhance and deploy features effectively.\n• Created efficient task scheduling solutions using **AWS** with job queuing approaches to optimize backend process management, reducing execution time by **25%**.\n• Conducted comprehensive testing using tools such as **PyTest**, ensuring high-code quality and adhering to best practices in software development cycles.\n• Actively participated in code reviews and contributed to continuous integration practices, resulting in a **15%** increase in team productivity."
    }
  ],
  "skills": "**Programming Languages**\n\t.NET, Python (3.8+), SQL, Bash, JavaScript\n\n**Backend Frameworks**\n\tSpring Boot, FastAPI, Flask, Django, Celery\n\n**Frontend Frameworks**\n\tAngular\n\n**API Technologies**\n\tREST/gRPC APIs, API Design, Microservices\n\n**Serverless and Cloud Functions**\n\tAWS (EC2, S3, Lambda)\n\n**Databases**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps**\n\tDocker, Kubernetes, GitHub Actions, Azure DevOps, CI/CD\n\n**Cloud & Infrastructure**\n\tAWS, Azure\n\n**Other**\n\tData Validation, Agile methodology, Pandas, NumPy, scikit-learn, TensorFlow, Airflow, MLflow, PyTest, Git, Kafka"
}