{
  "name": "Tomasz Lee",
  "role_name": "Rust Developer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Innovative Rust Developer with 9+ years of software development experience, specializing in secure application development and identity and access management protocols including OAuth and OIDC. Proficient in modern programming languages such as **Rust**, **Golang**, and **TypeScript**, with a solid understanding of security fundamentals and access management principles. Passionate about continuous learning and adapting to new technologies. Demonstrated strengths in collaboration and communication, successfully leading cross-functional teams and ensuring the timely delivery of high-quality projects.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Rust Developer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "- Developed and maintained software solutions using **Rust** and **Golang**, ensuring high performance and security fundamentals.\n- Collaborated effectively with cross-functional teams to enhance project outcomes, demonstrating strong communication skills and adaptability.\n- Implemented identity and access management protocols, including **OAuth** and **OIDC**, to safeguard user data and maintain application security.\n- Spearheaded the development of scalable applications, leveraging **WASM** for performance optimization, resulting in a 30% increase in execution speed.\n- Engaged in continuous learning to stay abreast of industry trends, integrating best practices into software development processes.\n- Enhanced system security by designing robust access management strategies, contributing to a 15% decrease in security incidents.\n- Participated in code reviews and mentoring sessions, fostering a collaborative and knowledge-sharing environment among peers.\n- Managed projects following Agile methodologies, leading to a 20% improvement in development turnaround times.\n- Contributed to open-source projects, increasing professional visibility and expanding the community network."
    },
    {
      "role": "Full Stack Developer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "Utilized **Rust** for developing efficient, reliable software applications, resulting in a **20%** reduction in execution time compared to previous projects.\nImplemented **Golang** for backend services, achieving a **30%** increase in response time for API requests through effective concurrency management.\nDeveloped frontend components using **TypeScript** for enhanced type safety and maintainability, leading to a **15%** decrease in runtime errors.\nEmployed **OAuth** and **OIDC** for secure access management, improving system security compliance and reducing unauthorized access incidents by **40%**.\nAdopted best practices in **identity and access management protocols**, ensuring secure user authentication and authorization processes across the application.\nDemonstrated strong **communication** skills by collaborating with cross-functional teams to align software solutions with business goals, enhancing project delivery timelines by **25%**.\nEmbraced **continuous learning** to stay abreast of emerging technologies, integrating **WASM** for optimized performance in web applications.\nExercised **adaptability** in methodologies, contributing to an agile environment that enabled swift responses to changing project requirements.\nFostered a **collaboration** culture within the team, encouraging knowledge sharing that resulted in improved overall productivity.\nConducted code reviews and shared insights on **security fundamentals**, enhancing code quality and reducing vulnerabilities in released software."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "Utilized **Rust** and **Golang** to develop secure software solutions, implementing robust **security fundamentals** to protect sensitive data.\nLeveraged **TypeScript** and **WASM** for high-performance web applications, resulting in a 30% increase in processing speed.\nImplemented **OAuth** and **OIDC** for efficient access management, enhancing user security across platforms by 25%.\nCollaborated with cross-functional teams to ensure effective **communication** and **adaptability** in project execution, leading to the successful delivery of 5 major features in under 6 months.\nEngaged in continuous learning to stay updated with industry trends, incorporating new technologies to improve software development processes.\nParticipated in code reviews and pair programming sessions, fostering a culture of experiential **collaboration** and shared knowledge within the team.\nStreamlined workflow processes, reducing bottlenecks and boosting overall productivity by 20% through proactive problem-solving and adjustments in project direction.\nDocumented technical designs and best practices, contributing to a comprehensive knowledge base that improved onboarding time for new team members by 40%.\n"
    }
  ],
  "skills": "**Programming Languages**\n\t Rust, Golang, TypeScript, Python\n\n**Backend Frameworks**\n\t NodeJS, ExpressJS, NestJS, C#, .NET, Entity Framework, Microservices\n\n**Frontend Frameworks**\n\t HTML, CSS, JavaScript, ReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n**API Technologies**\n\t RESTful API, GraphQL, OAuth, OIDC\n\n**Serverless and Cloud Functions**\n\t AWS, Azure\n\n**Databases**\n\t MSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB\n\n**DevOps**\n\t CI/CD pipelines\n\n**Cloud & Infrastructure**\n\t (none)\n\n**Other**\n\t UX/UI Design, Git, GitHub, Messaging & Caching: Apache Kafka, RabbitMQ, Redis, Security Fundamentals, Access Management, Identity and Access Management Protocols, Software Development, Continuous Learning, Collaboration, Adaptability, Communication, Testing Tools: NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest, Blockchain: Solidity, Ether.js, Web3.js, Ethereum"
}