{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Backend Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Senior Backend Engineer with 13+ years of experience in delivering high-performance applications, specializing in backend development using **Kotlin**, **Ktor**, and **PostgreSQL**. Proficient in implementing **event-driven architectures** and designing robust **API** solutions while leveraging technologies such as **Kafka** and **Docker** for efficient deployment and scalability. Experienced in cloud-native deployments on **Google Cloud Platform** and skilled in utilizing **AI-Coding-Tools** for enhancing productivity and automating processes.\n\nAdept at problem-solving and fostering teamwork, with a proven track record in driving initiatives that streamline development workflows. Well-versed in compliance-driven development across healthcare and financial sectors, ensuring adherence to regulations such as HIPAA and PCI DSS. Additionally, holds strong credentials in MLOps, focusing on model training and orchestration using tools like MLflow and Airflow.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Backend Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Utilized **Kotlin** and **Ktor** to design and implement robust backend services for scalable applications, ensuring high performance and maintainability.\nDeveloped and maintained **PostgreSQL** databases to effectively handle data storage, delivering optimized query performance for large datasets.\nImplemented **Kafka** for an event-driven architecture, enhancing the reliability and real-time capabilities of the system, accommodating up to **1,000** events per second.\nLeveraged **Docker** for containerization of microservices, facilitating seamless deployment and scaling processes across multiple environments.\nDeployed solutions on **Google Cloud Platform**, optimizing resources and ensuring high availability and disaster recovery using proven cloud strategies.\nApplied problem-solving techniques to troubleshoot and resolve critical backend issues, improving system uptime by **30%** through effective debugging and code optimization.\nCollaborated with cross-functional teams to refine **API-Design** best practices, leading to a **50%** reduction in API response times.\nExercised initiative in improving code quality and implementing best practices, resulting in fewer bugs and more maintainable codebase.\nFostered teamwork by mentoring junior developers, contributing to a collaborative culture that encouraged knowledge sharing and innovation.\nDefined and implemented robust testing strategies for the backend infrastructure, ensuring that all new releases maintained high standards of quality and performance."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Utilized **Kotlin** and **Ktor** to develop high-performance backend services, implementing scalable RESTful APIs that improved response times by **30%**.\nDesigned and managed a **PostgreSQL** database, optimizing queries and structure to handle increased workloads, leading to a **40%** reduction in data retrieval times.\nImplemented **Kafka** for real-time event-driven integrations, facilitating seamless communication between microservices and enhancing transaction processing capabilities.\nUtilized **Docker** for containerization of applications, ensuring consistent development, testing, and deployment environments across teams.\nIntegrated solutions on **Google Cloud Platform** to ensure high availability and reliability of critical backend systems while reducing operational costs by **25%**.\nCollaborated with cross-functional teams to identify and resolve complex technical problems, demonstrating strong **problem-solving** skills and effective **teamwork** in high-pressure situations.\nProactively initiated new features and improvements based on user feedback, showcasing innovation and commitment to enhancing product quality and user experience.\n"
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Implemented event-driven architecture using **Kafka** for seamless data integration and real-time processing to enhance the efficiency of backend services.\nDesigned and optimized backend services utilizing **Kotlin** and **Ktor** to ensure high performance and scalability in a cloud-based environment on **Google Cloud Platform**.\nLeveraged **PostgreSQL** for robust data storage solutions, enabling efficient transactions and data retrieval while supporting high concurrency environments.\nEngineered containerization processes using **Docker** to ensure consistent application performance, rapid deployment, and streamlined development cycles.\nApplied strong problem-solving skills to identify and resolve backend issues, improving application reliability and efficiency.\nContributed to team-oriented projects, fostering collaboration and innovation in backend service strategies.\nUtilized AI-Coding-Tools to enhance developer productivity and code quality, ensuring the implementation of best practices.\nCreated comprehensive API designs that facilitate seamless integrations across various services, enhancing overall application architecture.\nDemonstrated initiative in researching and adopting new backend technologies, keeping the team at the forefront of industry trends.\nAchieved a **30%** improvement in API response times by optimizing database queries and implementing effective caching strategies."
    }
  ],
  "skills": " **Programming Languages:**\n\tKotlin, Python, JavaScript/TypeScript\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django, Ktor\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tAPI-Design\n\n**Serverless and Cloud Functions:**\n\tAWS: ECS, Lambda, Google Cloud Platform\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, CI/CD & Infrastructure as Code, Terraform, Ansible, Helm\n\n**Cloud & Infrastructure:**\n\tAWS: S3, RDS, Azure: App Services, Blob Storage, SQL Database\n\n**Other:**\n\tAI-Coding-Tools, MLflow, Airflow, Kubeflow, Kafka, problem-solving, teamwork, initiative, Authentication & Security (Keycloak (OIDC, RBAC), OAuth2, JWT, Nginx, Let’s Encrypt, Certbot)",
  "apply_company": "bex technologies"
}