{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Frontend Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "Results-driven Senior Frontend Engineer with 8 years of experience delivering high-performance web solutions using **JavaScript**, **TypeScript**, **React**, **Node.js**, and **REST APIs**. Proficient in state management with **MobX** and adept in styling with **CSS**, **LESS**, and **SASS**, I have successfully contributed to dynamic web applications meeting scalability and performance objectives.\n\nMy background includes extensive experience in working with **AWS** and implementing containerization solutions using **Docker** and **Kubernetes**. I excel in deploying robust applications in cloud environments, ensuring reliability and compliance with industry standards.\n\nI have a strong commitment to code quality and continuous improvement, applying best practices in CI/CD automation and utilizing testing methodologies to drive project success. My experience is further enhanced with a solid understanding of NoSQL databases, enabling the efficient storage and retrieval of data in fast-paced environments.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Frontend Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Utilized **JavaScript**, **TypeScript**, and **React (17-18)** to architect and develop scalable, front-end applications for healthcare and financial platforms, ensuring seamless user experiences.\nImplemented REST APIs using **Node.js** to facilitate robust communication between front-end and back-end services, improving data handling efficiency by **30%**.\nDesigned responsive user interfaces using **CSS**, **LESS**, and **SASS**, achieving a **25%** increase in user engagement metrics through enhanced UI features.\nIntegrated state management using **MobX**, resulting in optimized application performance and reduced loading times by **40%**.\nCollaborated with cross-functional teams to ensure compliance with regulatory standards, enhancing application security and user trust.\nDeployed applications using **Docker** and **Kubernetes (AKS/EKS)**, achieving high availability and scaling capabilities, reducing downtime by **20%**.\nWorked on cloud solutions utilizing **AWS**, optimizing deployment strategies and resource management to accommodate app scaling demands.\nAutomated workflows and CI/CD pipelines using GitHub Actions, ensuring consistent code quality through various testing frameworks including Jest and Cypress.\nConducted thorough code reviews and facilitated knowledge sharing sessions to uplift the front-end team's skills regarding best practices and new technologies.\nEngaged in agile development practices, actively participating in sprint planning and retrospectives, leading to improved team productivity and project delivery timelines."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Created dynamic and interactive front-end applications utilizing **React (18)**, **TypeScript**, and CSS frameworks like **SASS** and **LESS**, ensuring responsive designs and enhanced user experiences for complex financial dashboards.\nLeveraged skill in **JavaScript** to optimize application performance and maintainability, contributing to **40%** reduction in load times across platforms.\nCollaborated closely with back-end teams to develop and integrate scalable **REST APIs** in environments using **Node.js**, enhancing data retrieval efficiency by **30%**.\nUtilized modern state management libraries, including **MobX**, to implement robust application architecture that supports scalable and maintainable code.\nParticipated in containerization of applications using **Docker** and orchestrated services with **Kubernetes** to streamline deployment processes and reduce downtime during updates by **25%**.\nEngaged in regular code reviews and implemented best practices that elevated overall code quality, resulting in a **50%** decrease in reported bugs post-deployment.\nMentored junior developers in best practices for **JavaScript**, **React**, and modular CSS, fostering a collaborative environment focused on continuous improvement and learning."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Developed dynamic and interactive user interfaces leveraging **JavaScript**, **TypeScript**, **React** (18), and **Node.js**, focusing on component architecture and state management to enhance user experience.\nEngineered responsive web applications using **CSS**, **LESS**, and **SASS**, ensuring adherence to modern web standards and mobile-first design principles.\nCreated and optimized REST APIs for seamless integration between frontend and backend services, improving data retrieval and user interactivity.\nCollaborated in a cross-functional team environment, utilizing **Docker** and **Kubernetes** for containerization and orchestration to streamline development workflows and deployment processes, reducing time to market by **30%**.\nImplemented state management solutions using **MobX**, optimizing application performance through efficient data flow and minimized re-rendering.\nEmployed **AWS** cloud services for deploying scalable applications, leveraging services like EC2 and S3 to enhance operational reliability and performance.\nConducted code reviews and mentorship sessions to maintain high code quality and foster team collaboration, contributing to a **25%** increase in team productivity.\nOptimized application performance by setting up build pipelines with CI/CD practices, which resulted in faster release cycles and improved software stability.\nMonitored and improved application performance metrics to ensure a load time of less than **2 seconds**, enhancing user satisfaction and retention.\nEnforced best practices in web accessibility, ensuring compliance with WCAG 2.1 guidelines and enhancing usability for all users."
    }
  ],
  "skills": "****Programming Languages:****\n\tJavaScript, TypeScript, Python\n\n****Frontend Frameworks:****\n\tReact, Vue, Angular, MobX, CSS, LESS, SASS\n\n****Backend Frameworks:****\n\tFastAPI, Flask, Django, Node.JS\n\n****API Technologies:****\n\tREST APIs\n\n****Serverless and Cloud Functions:****\n\tAWS (ECS, Lambda, RDS, S3)\n\n****Databases:****\n\tPostgreSQL, MySQL, MongoDB, Redis, NoSQL\n\n****DevOps:****\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n****Cloud & Infrastructure:****\n\tAWS, Azure (App Services, Blob, SQL), Linux\n\n****Other:****\n\tMLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot",
  "apply_company": "Restream"
}