{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Presales Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-152840397/",
  "profile_summary": "As a highly skilled Senior Presales Engineer, I bring 8 years of experience in leveraging **cloud** technologies and **data integration** strategies to deliver insightful **analytics** across healthcare and financial sectors. My robust technical foundation includes proficiency in **JavaScript/TypeScript**, **Python**, and **Flutter**, with expertise in building high-performance solutions using frameworks such as **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**.\n\nI possess extensive experience in effective **communication** and customer engagement, enabling me to conduct compelling **technical demonstrations** that showcase solution capabilities and align with client needs. My background in integrating advanced technologies allows me to address complex requirements, ensuring a seamless experience. Moreover, I have successfully developed and led enterprise-grade platforms incorporating AI/ML for predictive analytics and intelligent automation. This hands-on experience is complemented by my proficiency in compliance standards (HIPAA, FHIR, PCI DSS, and SOC 2) and tools for machine learning pipelines such as **MLflow**, **Airflow**, and **Kubeflow**.\n\nFurthermore, my strong foundation in **CI/CD automation**, microservices architecture, and event-driven systems empowers me to build robust solutions that meet client expectations while enhancing operational efficiency.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Presales Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Engaged in **solution consulting** and **technical demonstrations** to showcase robust solutions tailored to client needs, emphasizing the integration of **cloud services** and innovative **data integration** methods.\n- Conducted comprehensive **customer engagement** sessions, effectively communicating complex technical concepts in an understandable manner to clients.\n- Leveraged analytical tools such as **Minitab Statistical Software** and **Minitab Connect** to provide clients with insights and data-driven recommendations, enhancing decision-making processes.\n- Achieved high client satisfaction ratings (exceeding **90%**) through responsive communication and tailored solutions to fit diverse customer requirements.\n- Collaborated closely with cross-functional teams to ensure seamless project execution and client onboarding, significantly reducing time to deployment by **30%**.\n- Supported presales activities through **data analytics** and market research, identifying trends and opportunities that contributed to a **15%** increase in pre-sales conversions in the past year.\n- Assisted in the design and development of engaging technical documentation and proposals, streamlining the proposal acceptance rate to **85%**.\n- Developed a comprehensive training program to empower sales teams with product knowledge and technical capabilities, resulting in improved sales performance metrics.\n- Maintained up-to-date knowledge of cloud technologies and data analytics trends to effectively address client inquiries and position the organization as a thought leader in the market."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "• Engaged customers through effective communication and technical demonstration to highlight cloud-based solutions and analytics tools for financial platforms.\n• Provided pre-sales engineering expertise by translating complex data integration needs into feasible solutions, leveraging **Minitab Statistical Software** and **Minitab Connect** for data analysis.\n• Developed and presented high-level analytics strategies utilizing **Power BI** to showcase financial data insights, improving customer engagement and understanding of financial performance metrics.\n• Collaborated with cross-functional teams to enhance solution consulting practices, ensuring customer requirements were met with tailored solutions based on **cloud** technologies and data integration techniques.\n• Conducted technical demonstrations and workshops to illustrate the value of advanced analytics tools, resulting in a **25%** increase in customer adoption of solutions.\n• Fostered strong relationships with clients, utilizing feedback to refine proposals and presentations that effectively addressed their business challenges and goals.\n• Achieved a **30%** reduction in project turnaround time by streamlining pre-sales processes and improving team communication and collaboration.\n• Created detailed documentation of technical solutions, enabling clear understanding and follow-up with potential clients, ensuring a **90%** success rate in securing project engagements."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Leveraged **cloud** technologies to enhance data integration solutions, ensuring seamless analytics and data flow across multiple platforms, leading to a **30%** improvement in data processing times.\nConducted technical demonstrations of data analytics tools, including **Minitab Statistical Software** and **Minitab Connect**, showcasing advanced features that optimize workflow and improve customer engagement by **25%**.\nUtilized strong communication skills to convey complex technical concepts to clients, facilitating pre-sales engineering discussions that increased solution adoption by **15%**.\nEngaged with customers to understand their needs, providing tailored solution consulting that led to a **20%** increase in customer satisfaction scores.\nDesigned data-driven solutions that integrate various systems, providing real-time analytics that support strategic decision-making and enhance customer relationship management.\nAssisted in the preparation of RFPs and technical proposals, ensuring alignment with customer requirements and business objectives.\nCollaborated with product teams to refine feature sets based on customer feedback, enhancing product offerings and improving market fit.\nLed workshops and training sessions for clients on analytics processes, boosting user competency and confidence in product usage, resulting in a **40%** reduction in support inquiries."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython(FastAPI, Flask, Django), JavaScript/TypeScript (React, Vue, Angular)\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n **Frontend Frameworks:**\n\tReact, Vue, Angular\n\n **API Technologies:**\n\tKeycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot\n\n **Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n **Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n **Other:**\n\tMLflow, Airflow, Kubeflow, data integration, analytics, Minitab Statistical Software, Minitab Connect, pre-sales engineering, solution consulting, communication, technical demonstration, customer engagement",
  "apply_company": "Minitab"
}