{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior QA Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "Experienced Senior QA Engineer with 8 years in ensuring high-quality software solutions, applying strong expertise in **Python**, **JavaScript**, **REST API**, and modern testing frameworks like **PyTest** and **Playwright**. Proficient in leveraging **Azure Pipelines**, **Jira**, **Azure DevOps**, and **Git** for efficient CI/CD processes and collaboration. Extensive knowledge of both **SQL** and **NoSQL** databases, including **Cosmos DB** and **MongoDB**, enhances my ability to validate data integrity across applications.\n\nDemonstrated success in performance and load testing to ensure system reliability and user satisfaction. An advocate for team collaboration and effective communication, I bring skills in **Identity and Access Management** and **Datadog** for monitoring and optimizing application health. My strong background in software development, bolstered by a full-stack proficiency in **React**, **Node.js**, and **Django**, allows me to contribute to the overall software lifecycle and integrate quality at every stage.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior QA Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Conducted rigorous **performance testing** and **load testing** of healthcare and financial applications using **PyTest** and **Playwright**, ensuring optimal responsiveness and scalability under heavy user loads.\n- Collaborated with development teams to create and validate **REST API** specifications, ensuring seamless integration and reliability across services.\n- Developed and maintained automated testing frameworks using **Azure Pipelines**, **TestRail**, and **Jira** to enhance overall testing efficiency and coverage.\n- Spearheaded communication within cross-functional teams, promoting effective **team collaboration** to align testing strategies with project timelines and deliverables.\n- Implemented test strategies covering unit, integration, E2E, and contract testing for both front-end and backend services using tools such as **Jest** and **Cypress**.\n- Designed and executed comprehensive test plans for applications built with **Python** and **JavaScript**, identifying defects and communicating findings effectively.\n- Utilized **SQL** and **NoSQL** databases, including **MongoDB** and **Cosmos DB**, to validate data consistency and integrity across application layers.\n- Ensured adherence to security and compliance standards by integrating **Identity and Access Management** measures during the testing process.\n- Conducted manual and automated tests on cloud-based platforms utilizing **Azure DevOps** and **Git** to support continuous integration practices.\n- Monitored application performance and reliability using tools like **Datadog**, enabling proactive identification and resolution of potential issues.\n- Fostered a quality-first mentality throughout the development life cycle, integrating feedback loops for continuous improvement in application performance and user experience."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "- Executed performance testing and load testing strategies utilizing **PyTest**, ensuring high-quality financial platforms with a throughput improvement of **30%**.\n- Developed and maintained REST APIs integrating **Python** and **JavaScript** frameworks, promoting seamless communication between front-end and back-end services while reducing latency by **25%**.\n- Employed **Azure DevOps** and **Azure Pipelines** for continuous integration and deployment, reducing release cycles from **2 weeks** to **3 days**.\n- Led team collaboration initiatives through **Jira** and **TestRail**, enhancing project visibility and communication efficiency across departments by **40%**.\n- Leveraged **Git** for version control, facilitating streamlined code collaboration and contributing to a **99%** code merge success rate across multiple projects.\n- Engaged in active collaboration with cross-functional teams to implement **Identity and Access Management** solutions, ensuring compliance within financial applications and enhancing security posture.\n- Conducted exploratory and automation testing using **Playwright** for web applications, increasing test coverage by **50%** and accelerating the release of critical updates.\n- Analyzed SQL and NoSQL databases including **Cosmos DB** and **MongoDB** to perform data validation and ensure integrity of financial data.\n- Utilized **Datadog** for monitoring application performance and error tracking, leading to an improved mean time to resolution (MTTR) of **60%** for production issues."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Conducted performance testing and load testing on backend services for a global e-commerce platform built with **Python** (FastAPI, Django) and **JavaScript** (Node.js with NestJS, Express), ensuring system stability and scalability across critical areas including checkout and order fulfillment.\nCollaborated with development teams using **Git** and **Azure DevOps** to implement and maintain CI/CD pipelines via **Azure Pipelines**, improving build efficiency and deployment accuracy by **30%**.\nCreated and executed automated test scripts utilizing **PyTest** and **Playwright** to ensure the functionality of REST APIs and front-end frameworks including **React** (v18), **Vue 3**, and **Angular**, leading to a reduction in reported bugs by **25%**.\nEnhanced communication and team collaboration through consistent updates in **Jira** and active participation in sprint planning, facilitating a smooth workflow and successful project deliveries.\nAnalyzed and optimized database interactions using **MongoDB**, **SQL**, and **NoSQL** solutions such as **Cassandra**, ensuring efficient and reliable data access with performance improvements documented at **40%**.\nIntegrated **Azure DevOps** monitoring tools like **Datadog** to track application performance metrics and proactively identify bottlenecks and potential issues.\nImplemented role-based access control (RBAC) and **Active Directory** protocols, guaranteeing user data protection and system security compliance aligned with GDPR requirements.\nConducted thorough testing of e-commerce features including secure payment workflows integrated with **Stripe**, **PayPal**, and **Razorpay**, validating successful PCI-compliant transactions based on secure handling of sensitive data.\nDeveloped and maintained comprehensive test documentation in **TestRail**, ensuring clarity and reducing onboarding time for new QA team members by **20%**."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, JavaScript\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tREST API\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis, SQL, NoSQL, Cosmos DB\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Azure Pipelines, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAzure DevOps, Active Directory, Datadog\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, Playwright, PyTest, TestRail, Jira, performance testing, load testing, communication, team collaboration, Identity and Access Management, Git",
  "apply_company": "One Identity"
}