{
  "name": "Tomasz Lee",
  "role_name": "Senior BackEnd Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Results-driven Senior BackEnd Engineer with 9+ years of experience in designing and implementing scalable applications, with a strong focus on **Node.js**, **TypeScript**, and cloud services, including **AWS**, **ECS**, **Lambda**, **S3**, and **CloudWatch**. Proven expertise in API design and development with an emphasis on ensuring high test coverage and robust monitoring solutions. Adept in leveraging AI-assisted coding tools like **Claude Code workflows** to enhance productivity and streamline development processes. Strong communication and collaboration skills that drive cross-team initiatives and successful project delivery, coupled with a solid background in distributed systems and microservices architecture.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Senior BackEnd Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "- Designed and implemented high-quality **API design** for backend services using **Node.js** and TypeScript, ensuring robust and scalable solutions.\n- Developed, deployed, and managed applications on **AWS ECS** and **Lambda**, leading to cost-effective and serverless management of resources that improved operational efficiency.\n- Utilized **AWS S3** for data storage and retrieval, optimizing storage costs and ensuring data durability across **9** applications.\n- Employed **AWS CloudWatch** to monitor application performance and logging, resulting in a proactive approach to system health and a **30%** reduction in downtime.\n- Integrated AI-assisted coding tools for enhanced productivity and **test coverage**, ensuring high-quality and maintainable code with minimum defects.\n- Collaborated and communicated effectively with cross-functional teams to ensure alignment and shared objectives, enhancing team performance by **25%**.\n- Conducted thorough documentation of processes and system architecture, improving accessibility for team members and stakeholders, resulting in a **15%** faster onboarding process for new developers.\n- Spearheaded the adoption of **Claude Code workflows** to streamline development processes, fostering a culture of continuous integration and deployment.\n- Leveraged advanced monitoring techniques to keep track of performance metrics and logs, enhancing troubleshooting efficiency and reducing response times by **20%**.\n- Participated in regular code reviews and knowledge-sharing sessions, improving collaboration and overall code quality."
    },
    {
      "role": "Full Stack Developer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "Utilized **Node.js** and **TypeScript** to architect and develop scalable backend services, improving response times by **20%**.\nImplemented **API design** best practices for robust data handling, enhancing client interactions and reducing error rates by **15%**.\nDeveloped and deployed applications on **AWS**, leveraging **Lambda** for compute power, **S3** for storage solutions, and **CloudWatch** for monitoring and logging, ensuring optimal performance and uptime.\nIntegrated **ECS** for container orchestration, achieving a deployment time reduction of **40%**.\nDesigned and executed **AI-assisted coding** features, employing tools like **Claude Code workflows** to streamline development processes and enhance productivity.\nEstablished comprehensive **test coverage** strategies, resulting in a **30%** decrease in post-deployment bugs.\nCreated detailed **documentation** and maintained open lines of **communication** with cross-functional teams to ensure alignment on project goals and timelines.\nDrove **collaboration** efforts among developers, contributing to a **25%** improvement in overall team productivity.\nConducted regular code reviews, providing mentorship to junior developers and advancing their skillsets for enhanced team performance.\n"
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "• Developed APIs using **TypeScript** and **Node.js**, ensuring robust and efficient API design for internal services, contributing to a **30%** reduction in response times.\n• Leveraged **AWS Lambda** and **ECS** for serverless architectures, optimizing resource allocation and reducing costs by **15%** on cloud services.\n• Implemented **S3** for secure data storage and retrieval, improving data access speed for cloud-based applications.\n• Utilized **CloudWatch** for monitoring system performance and troubleshooting, enhancing uptime and reliability by maintaining **99.9%** service availability.\n• Collaborated with cross-functional teams to integrate AI-assisted coding solutions, enhancing code quality and accelerating development cycles.\n• Established **test coverage** strategies to ensure code reliability and maintainability, achieving a **90%** pass rate in automated test suites.\n• Maintained comprehensive documentation for development processes and workflows, facilitating knowledge sharing and communication across teams.\n• Participated in Agile ceremonies such as daily standups to promote collaboration and alignment with project goals.\n• Engaged in code reviews and offered constructive feedback, fostering a culture of continuous improvement and excellence in coding standards.\n• Delivered technical support for integration with third-party APIs, enhancing system interoperability and functionality."
    }
  ],
  "skills": "****Programming Languages****\n\tTypeScript, Node.js, Python\n\n****Backend Frameworks****\n\tNodeJS, ExpressJS, NestJS, C#, .NET, Entity Framework, Microservices\n\n****Frontend Frameworks****\n\tHTML, CSS, JavaScript, ReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n****API Technologies****\n\tRESTful API, GraphQL, API design\n\n****Serverless and Cloud Functions****\n\tAWS, Lambda, ECS, S3, CloudWatch\n\n****Databases****\n\tMSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB\n\n****DevOps****\n\tCI/CD pipelines\n\n****Cloud & Infrastructure****\n\tAWS, Azure\n\n****Other****\n\tUX/UI Design, Git, GitHub, Messaging & Caching: Apache Kafka, RabbitMQ, Redis, Testing Tools: NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest, Blockchain: Solidity, Ether.js, Web3.js, Ethereum, AI-assisted coding, Claude Code workflows, test coverage, monitoring, documentation, communication, collaboration",
  "apply_company": "team.blue"
}