{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Fullstack Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-152840397/",
  "profile_summary": "As a Senior Full Stack Engineer with 8 years of experience, I excel in building high-performance solutions using **Node.js**, **TypeScript**, and **Angular**, along with robust database management using **PostgreSQL**. My experience includes leveraging **NestJS** for scalable application architecture and implementing rigorous testing with **Jest**. I have deep expertise in cloud platforms, particularly **GCP**, to deploy and manage applications efficiently.\nI am committed to writing **Clean Code** and applying Domain-Driven Design (DDD) principles to ensure maintainable software. My collaborative approach and expertise in **Pair Programming** foster team synergy and drive project success, while my strong sense of autonomy and curiosity propels innovation and continuous learning.\nAdditionally, I have a background in full-stack development across **React**, **Next.js**, and **Vue**, and I bring extensive experience in healthcare and financial sectors, ensuring adherence to compliance standards like HIPAA and PCI DSS. I am well-versed in microservices, CI/CD automation, and integrating AI/ML capabilities for advanced analytics.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Fullstack Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Developed and maintained scalable applications using **Node.js** and **TypeScript**, ensuring clean code practices and adherence to **DDD** principles.\n• Designed and implemented RESTful APIs and web services, integrating with **PostgreSQL** for robust data management and optimized querying for high-demand applications.\n• Established comprehensive testing strategies utilizing **Jest** for unit testing, ensuring high code quality and maintaining a 95% test coverage across the project.\n• Collaborated with cross-functional teams, promoting pair programming and enhancing team autonomy and productivity through effective communication and collaboration.\n• Demonstrated strong curiosity and commitment to continuous learning in emerging technologies, evaluating and integrating **GCP** services to enhance application functionality.\n• Delivered end-to-end solutions with a focus on performance and scalability by utilizing best practices in clean coding and maintaining a streamlined development process.\n• Conducted regular code reviews and mentoring sessions to foster a culture of quality and knowledge sharing within the development team.\n• Actively engaged in agile development methodologies, participating in sprint planning and retrospective sessions to continuously improve team dynamics and project outcomes."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "• Developed robust and scalable applications using **Node.js** (NestJS) and **TypeScript**, enhancing code quality and productivity through **Clean Code** principles and **DDD**.\n• Utilized **PostgreSQL** for database management, ensuring optimal performance and integrity of data storage solutions for high-traffic platforms.\n• Championed front-end development by creating dynamic applications with **Angular**, focusing on user experience and interface design.\n• Employed **Jest** for testing, ensuring code reliability and reducing bugs prior to deployment, thereby increasing test coverage to at least **85%**.\n• Participated in **Pair Programming** sessions to foster collaboration and knowledge sharing among team members, leading to improved team dynamics and project outcomes.\n• Demonstrated **Autonomy** and **Curiosity** in tackling challenges and implementing innovative solutions, contributing to team success metrics and project milestones.\n• Spearheaded code reviews, promoting best practices and fostering a culture of continuous improvement within the engineering team.\n• Actively engaged in agile methodologies, participating in sprint planning and retrospectives, resulting in a **30%** improvement in delivery timelines."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "• Developed high-quality, maintainable code for backend services in **Node.js** (specifically **NestJS**) and frontend applications leveraging **Angular** and **TypeScript**, ensuring adherence to **Clean Code** principles.\n• Collaborated effectively with cross-functional teams, driving project success through pair programming and agile methodologies, while exhibiting strong autonomy and curiosity.\n• Designed and optimized databases using **PostgreSQL**, ensuring efficient data modeling and access patterns to support scalability and performance in high-traffic environments.\n• Implemented robust testing strategies using **Jest**, promoting reliable code and reducing the cost of defects by **30%**.\n• Leveraged **Google Cloud Platform (GCP)** for deploying applications, ensuring high availability and scalability in production environments, while managing **3** major releases with minimal downtime.\n• Fostered effective team collaboration, sharing knowledge and conducting code reviews, lifting team productivity by **25%**, while maintaining high coding standards and best practices.\n• Engaged in continual learning to stay updated with industry trends and technologies, applying this knowledge to enhance project outcomes and innovate on existing solutions."
    }
  ],
  "skills": "Programming Languages:\n\tPython, JavaScript, TypeScript\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django, NestJS\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tJWT, OAuth2, Keycloak (OIDC, RBAC)\n\n**Serverless and Cloud Functions:**\n\tAWS (Lambda), GCP\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS (ECS, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, Jest, Clean Code, DDD, Pair Programming, Collaboration, Autonomy, Curiosity, Let’s Encrypt, Nginx, Certbot",
  "apply_company": "Dougs Compta"
}