{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Core Engine/C++ Optimization Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-karol-kotlinski-bb2520397/",
  "profile_summary": "As a specialized Core Engine/C++ Optimization Engineer with 8 years of experience, I excel in developing AAA titles on console platforms, utilizing **C++**, **Unreal Engine**, and strong multithreading techniques. My expertise in optimization and profiling ensures high-performance solutions, leveraging tools like **VTune** and console profiling tools to enhance system efficiency and resource management.\nI possess a solid foundation in analyzing CPU/GPU crash dumps, which aids in diagnosing performance bottlenecks. My comprehensive background encompasses not only development but also rigorous project management, ensuring that all platforms meet superior quality standards. I am adept at employing advanced optimization strategies, fostering seamless gameplay experiences while adhering to industry specifications.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Core Engine/C++ Optimization Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Developed and optimized scalable game engine features using **C++**, prioritizing performance improvements and resource management for **AAA titles** on **console platforms**.\n- Leveraged multithreading techniques to enhance CPU/GPU performance, implementing strategies for reduced latency and increased frame rates in gaming applications.\n- Employed profiling tools such as **VTune** and console profiling tools to identify bottlenecks and refine engine performance, achieving optimizations that enhanced runtime efficiency by up to **30%**.\n- Analyzed and resolved CPU/GPU crash dumps, ensuring stability and reliability across diverse gaming environments, thus reducing crash rates by **25%**.\n- Collaborated on cross-functional teams to integrate novel engine features and optimizations for improved user experiences, maintaining seamless performance across all **AAA titles**.\n- Instituted comprehensive performance testing frameworks to monitor the impact of engine modifications, leading to a more robust and efficient development pipeline.\n- Documented optimization processes and best practices, contributing to knowledge sharing and team skill enhancement in game engine development.\n- Provided technical support and mentorship to junior developers, fostering a culture of continuous improvement focused on optimization strategies in game development."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Utilized **C++** to optimize and enhance core engine performance for AAA titles, ensuring top-tier execution on console platforms.\nConducted in-depth **profiling** using tools like **VTune** and console profiling tools, identifying bottlenecks and implementing multithreading solutions to improve frame rates by **25%**.\nLed the integration of optimization strategies that boosted CPU/GPU efficiency, resulting in a decrease in memory usage by **30%** across various engine modules.\nCollaborated with cross-functional teams to conduct thorough **CPU/GPU crash dump analysis**, ensuring robust debugging and reliability of the engine in high-pressure scenarios.\nEngaged in rigorous testing and benchmarking processes to validate optimizations, achieving consistent performance improvements across multiple versions of the engine.\nShared expertise in **multithreading** techniques to enhance responsiveness and resource management in high-performance applications, specifically in gaming environments."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Applied advanced C++ techniques and performance optimization strategies to enhance game engine performance for AAA titles across console platforms.\nUtilized **Unreal Engine** for developing and optimizing core gameplay systems, contributing to improved frame rates and smoother user experiences.\nImplemented multithreading solutions to maximize CPU/GPU utilization, effectively balancing workload to ensure real-time responsiveness during high-intensity gaming sequences.\nConducted detailed profiling sessions using **VTune** and various console profiling tools, quantifying performance bottlenecks and implementing targeted optimizations that resulted in performance enhancements of up to **30%**.\nExecuted effective crash dump analysis for CPU/GPU to identify and resolve issues quickly, improving game stability and reducing crash rates by **25%**.\nCollaborated with cross-functional teams to establish best practices in optimization, resulting in a **15%** increase in development efficiency.\nEngaged in the iteration and testing of game systems, applying data analysis to further refine performance, contributing to a seamless gaming experience.\nDeveloped comprehensive documentation of optimization techniques and tools, facilitating knowledge transfer within the engineering team and ensuring adherence to project timelines."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, C++, JavaScript, TypeScript\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n **Frontend Frameworks:**\n\tReact, Vue, Angular\n\n **API Technologies:**\n\tKeycloak (OIDC, RBAC), JWT, OAuth2\n\n **Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n **Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:**\n\tLet’s Encrypt, Nginx, Certbot\n\n **Other:**\n\tMLflow, Airflow, Kubeflow, multithreading, optimization, profiling, VTune, console profiling tools, AAA titles, console platforms, CPU/GPU crash dump analysis"
}