{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Solutions Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "As a Senior Solutions Engineer with 8 years of experience, I excel in **Python** development for data analysis, **AI** analytics, and integration of **digital twin** technologies. My technical expertise includes hands-on experience with **GIS** for geographic data processing, ensuring high-quality client engagement through effective project management and communication. I have successfully translated complex requirements into high-performance solutions across healthcare and financial sectors, demonstrating strong problem-solving skills.\nIn addition to my core capabilities, I leverage my full-stack development skills using **React**, **Node.js**, and **Django**, along with deep cloud experience on **Azure** and **AWS**. I have led the development of enterprise-level platforms that encompass predictive analytics and intelligent automation, applying a strong foundation in microservices architecture and CI/CD processes. My experience extends to implementing machine learning pipelines and MLOps workflows, utilizing tools such as **MLflow**, **Airflow**, and **Kubeflow**.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Solutions Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Utilized **Python** to conduct in-depth **data analysis** and enhance **AI**-driven solutions, ensuring alignment with client needs and project management best practices.\nEnhanced client engagement by architecting scalable solutions that incorporated **GIS** technologies, enabling insightful analytics and improved decision-making processes.\nManaged dissemination of complex data insights through dynamic visualization tools, contributing to effective communication of project statuses and outcomes.\nLed problem-solving initiatives by developing innovative strategies that utilized **AI** algorithms, enhancing digital twin capabilities and optimizing client project implementations.\nFostered collaborative project environments, ensuring effective communication across stakeholders during the full project lifecycle, from initial engagement to final delivery.\nEnsured the successful integration of **AI** technologies into workflows, driving efficiencies and elevating the overall client experience.\nImproved operational metrics by implementing robust data analysis protocols, facilitating enhanced project management strategies and outcomes while achieving 90% client satisfaction.\nConducted regular performance reviews of digital twin applications, achieving a 30% reduction in response time through strategic enhancements and iterative improvements.\nExecuted seamless project transitions by utilizing agile methodologies, allowing for rapid adjustments to project scope based on client feedback, resulting in a 25% improvement in delivery timelines.\nApplied advanced problem-solving techniques to address client-specific challenges, leading to a 15% increase in project success rates and fostering long-term client relationships."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Leveraged **Python** to develop state-of-the-art analytics solutions, enhancing data analysis capabilities to drive informed decision-making processes.\nEngaged in **client engagement** by understanding requirements and customizing solutions to meet diverse needs, which led to a 30% increase in client satisfaction scores.\nDemonstrated effective **communication** skills, facilitating cross-functional collaboration across teams to ensure the successful execution of engineering projects, maintaining a project delivery rate of 95% on time.\nConducted thorough **problem-solving** exercises, identifying key issues in existing financial systems, resulting in a 25% reduction in operational bottlenecks.\nApplied principles of **AI** and **analytics** to create predictive models and solutions, further enhancing system intelligence and operational efficiency.\nUtilized **GIS** technology where applicable to improve spatial data integration and analysis for financial modeling.\nManaged complex projects, applying rigorous **project management** methodologies to maintain alignment with project goals and timelines, achieving an average of 20% faster project completion compared to previous years.\nDesigned innovative **digital twin** frameworks to simulate and optimize financial processes, leading to a 15% improvement in operational performance."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Utilized **Python** for data analysis and integration with **GIS** technologies, enhancing data-driven decision-making for client engagement strategies.\nImplemented AI-driven solutions to improve analytics processes, leveraging machine learning frameworks to generate insights and drive project management efficiency.\nEngaged with clients to understand requirements and provide tailored solutions, ensuring effective communication throughout project lifecycles.\nLed problem-solving initiatives within technical projects, adapting to challenges and driving innovative solutions that increased stakeholder satisfaction by **25%**.\nCollaborated closely with cross-functional teams, employing project management best practices to ensure timely project delivery and successful implementation of digital twin technologies.\nEstablished data pipelines to analyze large datasets, maintaining high standards of integrity and accuracy in data processing.\nConducted workshops and training sessions to educate teams on effective data analytics techniques, promoting a culture of continuous improvement and knowledge sharing.\nDeveloped comprehensive reports and presentations, applying storytelling techniques to convey complex data insights clearly to clients and stakeholders.\nMonitored project progress, utilizing analytical tools to track milestones and ensure alignment with strategic goals, resulting in a **30%** reduction in project overruns."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, JavaScript, TypeScript\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tOAuth2, JWT, Keycloak (OIDC, RBAC), Nginx, Certbot\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS, Azure\n\n**Other:**\n\tGIS, AI, data analysis, analytics, digital twin, client engagement, project management, communication, problem-solving",
  "apply_company": "Gradyent"
}