{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Network Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "As a skilled Senior Network Engineer with a strong focus on **Cisco**, **Juniper**, **PaloAlto**, **CheckPoint**, **Python**, **Docker**, **Kubernetes**, **Ansible**, and **Terraform**, I bring 8 years of comprehensive experience in network infrastructure and operations. My expertise encompasses developing and optimizing CI/CD processes, ensuring robust IT service management with adherence to **ITIL** principles, and implementing DevOps practices for enhanced collaboration and efficiency.\nI possess a deep understanding of routing protocols, **VLAN** configurations, and network security measures, which enables me to design and maintain secure and efficient network systems. Additionally, my foundational experience in **Python** contributes to automation efforts, enhancing operational capabilities and reducing deployment times. With a proven history of driving projects that enhance network reliability and performance, I am committed to aligning technological solutions with organizational goals.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Network Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Implemented **DevOps** practices and CI/CD pipelines using **Docker**, **Kubernetes**, **Ansible**, and **Terraform**, enhancing deployment efficiency and reducing time to market by **30%**.\nConfigured and optimized networking devices from **Cisco**, **Juniper**, **PaloAlto**, and **CheckPoint**, ensuring robust security and reliable connectivity across enterprise-level infrastructures while adhering to ITIL standards.\nMonitored and maintained high availability and performance of network environments, successfully achieving **99.9%** uptime through proactive routing and VLAN configurations.\nArchitected and integrated secure network solutions involving firewalls and intrusion prevention systems to protect sensitive data and comply with regulatory standards.\nCollaborated with cross-functional teams to troubleshoot and resolve complex network issues, improving incident resolution time by **25%**.\nConducted training sessions on network best practices and configuration management for teams, enhancing the overall skills and response times of technical staff.\nDeveloped network diagrams and documentation for easy reference and maintenance, significantly improving onboarding processes for new engineers.\nLed initiatives to optimize network efficiency, resulting in reduced operational costs by **15%** while maintaining high standards of service.\n\n"
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Utilized **Python** to automate network configuration and management tasks, enhancing efficiency in system deployment and maintenance by **30%**.\nImplemented **Docker** and **Kubernetes** to containerize applications, resulting in improved scalability and consistent environments across development and production, reducing downtime by **25%**.\nLeveraged **Ansible** for configuration management and orchestration, streamlining deployment processes and ensuring adherence to ITIL best practices.\nDesigned and deployed secure network architectures utilizing **Cisco**, **Juniper**, **PaloAlto**, and **CheckPoint** technologies, ensuring high availability and disaster recovery capabilities for critical systems.\nDeveloped CI/CD pipelines to automate testing and deployment processes, leading to a **40%** reduction in time-to-deployment across multiple projects.\nAdministered routing protocols and managed VLAN configurations to enhance network performance and segmentation, meeting internal service level agreements.\nExecuted infrastructure as code using **Terraform**, enabling version control and consistency in network provisioning across multiple environments.\nConducted training sessions on industry best practices for **CCNA**, **CCNP**, and **CCIE** certifications, improving team competency by **20%**."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Implemented and managed **Cisco**, **Juniper**, and **PaloAlto** network infrastructures, ensuring optimal configuration and performance throughout the system.\nDesigned and optimized CI/CD pipelines using **Docker** and **Kubernetes**, leading to an **85%** reduction in deployment time across services.\nApplied **Ansible** and **Terraform** for automation, configuration management, and infrastructure as code, achieving consistency in environments and reducing manual intervention by **70%**.\nDeveloped and documented network architecture strategies, demonstrating proficiency in **ITIL** and best practices, leading to improved service reliability and enhanced communication with stakeholders.\nConducted thorough network performance analysis and troubleshooting using advanced **Routing**, **VLAN**, and security protocols, resulting in a **30%** improvement in network speed and security compliance.\nLed training sessions on best practices for **CCNA**, **CCNP**, and **CCIE** certifications to enhance team skills, contributing to team success with a **90%** pass rate in exams.\nImplemented secure remote access solutions using industry-standard protocols and provided comprehensive support for network configurations and user permissions, ensuring GDPR compliance across all systems.\nCollaborated closely with DevOps teams to integrate networking operations into the software development lifecycle, enhancing cross-functional collaboration and deployment efficiency."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tJavaScript, TypeScript, React, Vue, Angular\n\n**API Technologies:**\n\tJWT, OAuth2\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Ansible, Terraform, CI/CD\n\n**Cloud & Infrastructure:**\n\tHelm, Docker Compose\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), Let’s Encrypt, Nginx, Certbot, ITIL, Cisco, Juniper, PaloAlto, CheckPoint, CCNA, CCNP, CCIE, Routing, VLAN",
  "apply_company": "nscon network, security & consulting gmbh"
}