{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior JavaScript Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "As a dedicated Senior JavaScript Engineer with 8 years of expertise, I excel in leveraging **JavaScript**, **TypeScript**, **React**, **Vue.js**, and **Node.js** to develop scalable, high-performance web applications. My proficiency extends to modern web standards, including **HTML5**, **CSS3**, and ECMAScript versions 5 and 6, ensuring the creation of seamless user experiences.\n\nI also have considerable experience with **Git** for version control, and I am well-versed in build tools such as **Gulp** and **Webpack** for streamlined development processes. My solid understanding of **microservices architecture** supports my capability to design robust, secure applications tailored to complex business needs.\n\nIn previous roles, I have successfully integrated behavior-driven development practices, enhancing collaboration within teams and improving code quality with frameworks like **Playwright** for testing. Throughout my career, I've demonstrated a commitment to continuous learning and adapting to new technologies while delivering enterprise-level solutions that meet industry standards.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior JavaScript Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Utilized **JavaScript**, **TypeScript**, and frameworks such as **React (17-18)** and **Vue.js (3.x)** to architect and develop scalable healthcare and financial platforms, ensuring adherence to industry standards including HIPAA and PCI DSS.\nImplemented **microservice architecture** to promote system modularity and efficient scaling, with hands-on experience in **Node.js** for backend development and documentation.\nDeveloped modern web applications leveraging **HTML5**, **CSS3**, **LESS**, **SASS**, and ECMAScript features to deliver high-performance user interfaces with a focus on clean code and responsive design standards.\nConducted **Behavior-Driven Development** (BDD) alongside test strategies using **Jest**, **Cypress**, and **Playwright** to assure quality across both front-end and backend services.\nCollaborated with cross-functional teams and used **Git** for version control to streamline workflows and ensure effective code management, employing tools like **Gulp** and **Webpack** for efficient asset bundling.\nLed initiatives to enhance and refactor existing codebases using modern libraries and practices, thereby improving maintainability and developer experience.\nContributed to team success by sharing knowledge on best practices, coding standards, and optimizing performance through a deep understanding of **ECMAScript 5** and **ECMAScript 6** features.\nExecuted major projects using powerful JavaScript frameworks that achieve measurable improvements like an increase in user engagement by **25%** and reduced load times by **40%** through code optimizations.\nParticipated in the entire software development lifecycle from concept to deployment, ensuring timely delivery of features with a keen focus on user needs and business goals."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "- Developed dynamic, user-focused applications utilizing **JavaScript**, **React (18)**, **TypeScript**, and **HTML5/CSS3**, ensuring adherence to high coding standards and performance metrics.\n- Leveraged **Node.js (NestJS/Express)** to lead the modernization of financial platforms through a microservices architecture, increasing system scalability by **30%**.\n- Employing **Git** for version control to manage codebases and participation in collaborative projects effectively.\n- Created responsive designs and styles through **SASS/LESS**, enhancing user experience across financial dashboards and admin portals.\n- Integrated **Vue.js** for interactive UI components, contributing to an overall reduction in load times by **15%**.\n- Enhanced front-end performance using **Webpack** and **Gulp**, resulting in improved application efficiency and reduced build times.\n- Applied Behavior-Driven Development practices to establish clear, testable requirements for new features, ensuring high-quality deliverables.\n- Collaborated with cross-functional teams to build APIs powered by **Node.js**, facilitating seamless integration between backend services and frontend applications.\n- Employed **Playwright** for end-to-end testing to guarantee application reliability, decreasing identified bugs by **25%** during the development cycle."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Utilized **JavaScript** and **TypeScript** to develop responsive, high-performance web applications, leveraging frameworks such as **React** (18) and **Vue.js** (3) along with **HTML5** and **CSS3**, ensuring seamless user experiences across multiple platforms.\nImplemented microservice architecture principles, utilizing **Node.js** (NestJS, Express) to optimize backend services and enabling scalable integrations and streamlined workflows.\nEmployed **Git** for version control, ensuring a robust collaborative environment through effective Branching strategies and continuous integration practices.\nApplied Behavior-Driven Development (BDD) methodologies using **Playwright** to enhance test accuracy and reliability for critical application features, significantly reducing bugs in production.\nOptimized application performance and build processes through task runners like **Gulp** and module bundlers such as **Webpack**, improving load times by **30%**.\nIntegrated styling techniques using **LESS** and **SASS** to maintain a clean and manageable codebase, resulting in a **20%** decrease in development time for UI components.\nContributed to application security by implementing role-based access control (RBAC) and OAuth 2.0 protocols, ensuring compliance with GDPR and protecting user data effectively.\nCollaborated in a dynamic team environment, utilizing agile methodologies to enhance project scalability and adaptability, achieving delivery of high-impact features in **sprints of 2 weeks**."
    }
  ],
  "skills": " **Programming Languages:**\n\tJavaScript, TypeScript, Python\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n **Frontend Frameworks:**\n\tReact, Vue, Angular, HTML5, CSS3, ECMAScript 5, ECMAScript 6, jQuery, LESS, SASS\n\n **API Technologies:**\n\tNode.js, microservice architecture\n\n **Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n **Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, CI/CD & Infrastructure as Code: Terraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:**\n\tGit\n\n **Other:**\n\tAuthentication & Security: Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, MLflow, Airflow, Kubeflow, Gulp, Webpack, Behavior-Driven Development, Playwright",
  "apply_company": "Aylo"
}