{
  "name": "Tomasz Lee",
  "role_name": "Software Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Results-driven Software Engineer with 9+ years of experience in developing and implementing robust multithreaded applications. Proficient in **C#.NET Core**, **VoIP**, **RTP Realtime Transport Protocol**, and **SIP signalling**, with a strong background in integrating **PBX systems** and messaging frameworks. Skilled in cloud and container technologies, including **Docker**, and leveraging **SQL** for efficient data management. Experienced in **Test Driven Development (TDD)** and **Behavior Driven Development (BDD)** practices to enhance software quality. Strong expertise in **Linux** environments, including working with **Asterisk** and **Kamailio** for distributed services, along with proficiency in **Git** for version control and **Team City** for CI/CD pipelines. Recognized for strong communication skills and ability to excel in Agile methodologies through effective cross-functional collaboration, ensuring successful delivery of complex projects.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Software Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "• Developed and optimized multithreaded applications using **C#.NET Core**, enhancing concurrent processing capabilities.\n• Implemented SIP signalling protocols and RTP Realtime Transport Protocol in VoIP systems, contributing to seamless communication for PBX systems.\n• Employed messaging frameworks and integrated **Docker** for containerization, streamlining deployment processes and maintaining consistency across environments.\n• Conducted Test Driven Development (TDD) practices, ensuring high-quality code through thorough testing and **BDD** methodologies.\n• Utilized **Git** for version control, collaborating effectively in an Agile environment to manage code changes.\n• Designed and administered SQL databases, enhancing performance through query optimization and indexing, resulting in reduced average execution time by **20%**.\n• Analyzed network traffic using **Wireshark**, diagnosing and resolving issues to improve application reliability.\n• Contributed to distributed services architecture, enhancing system scalability and reliability.\n• Engaged in cross-functional collaboration with team members to align project goals and deliver high-quality software solutions.\n• Worked with CI/CD tools such as **Team City** to automate builds and deployments, reducing manual errors and improving efficiency.\n• Collaborated with the UX/UI team to enhance application usability and user engagement through effective communication and feedback loops."
    },
    {
      "role": "Full Stack Developer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "Utilized **C#.NET Core** to design and develop multithreaded applications, ensuring high performance in real-time processing for VoIP systems.\nImplemented **SIP signalling** and **RTP Realtime Transport Protocol** in project architecture, facilitating seamless communication in PBX systems.\nDeveloped and managed **Docker** containers to deploy distributed services, optimizing scalability and resource utilization.\nEmployed **Git** for version control and conducted **Test Driven Development (TDD)** practices, increasing code reliability and decreasing deployment errors by **30%**.\nIntegrated messaging frameworks with **Asterisk** and **Kamailio** to enhance functionality and performance of communication tools.\nCreated orchestrated microservices utilizing **GitHub Actions** for CI/CD, successfully leading to a **15%** increase in deployment efficiency.\nManaged SQL databases for task orchestration and real-time data retrieval, optimizing performance through improved query designs, resulting in a **25%** boost in system performance.\nConducted thorough analysis with **Wireshark** for network monitoring and debugging, enhancing system reliability.\nParticipated in Agile methodology and cross-functional collaboration with stakeholders to define system requirements and ensure timely project deliverables aligned with user needs.\nMentored junior developers through code reviews and knowledge-sharing sessions, fostering a culture of continuous improvement and strong communication within the team."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "Utilized **C#.NET Core** to develop multithreaded applications, ensuring high performance and responsiveness in system operations.\nImplemented SIP signalling and **RTP Realtime Transport Protocol** for VoIP functionality in PBX systems, enhancing communication capabilities.\nDesigned and developed messaging frameworks utilizing **RabbitMQ**, improving system efficiency and reliability in message handling.\nAdopted **Test Driven Development** practices to ensure quality and robustness of code, achieving a 30% reduction in bugs during testing phases.\nCollaborated effectively using **Git** for version control in a team of 9 developers, maintaining code integrity and enhanced workflow.\nDeveloped SQL queries and optimized database interactions, leveraging **SQL Server** to manage customer information with up to **50%** improved query performance.\nUtilized **Docker** for containerization of applications, facilitating consistent environments across development, testing, and production.\nParticipated in Agile ceremonies and maintained strong communication skills to bridge cross-functional collaboration between teams, improving project delivery timelines by 15%.\nConfigured CI/CD pipelines using **Team City**, enabling automated builds and deployments, reducing time to market for new features by 40%.\nAnalyzed VoIP networks with **Wireshark** to troubleshoot connectivity issues and ensure optimal operation of distributed services.\nEngaged in daily standups and participated in code reviews to uphold coding standards and improve team collaboration, fostering a supportive development environment.\nAuthored technical documentation and user guides that enhanced knowledge transfer within the organization and streamlined onboarding processes."
    }
  ],
  "skills": "Frontend Technologies: HTML, CSS, JavaScript, TypeScript, ReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n\t**Backend Frameworks:** NodeJS, ExpressJS, NestJS, C#, .NET, C#.NET Core, Entity Framework, Microservices\n\n\t**API Technologies:** RESTful API, GraphQL\n\n\t**Databases:** MSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB, SQL\n\n\t**DevOps:** AWS, Azure, CI/CD pipelines, Docker\n\n\t**Cloud & Infrastructure:** PBX systems, Asterisk, Kamailio, VoIP, SIP signalling, RTP Realtime Transport Protocol\n\n\t**Messaging & Caching:** Apache Kafka, RabbitMQ, Redis, messaging frameworks\n\n\t**Testing Tools:** NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest, Test driven development\n\n\t**Other:** Blockchain: Solidity, Ether.js, Web3.js, Ethereum, UX/UI Design, Git, GitHub, Python, Redux, strong communication skills, Agile, Team City, multithreaded applications, Distributed services, Linux, cross-functional collaboration, Wireshark, BDD"
}