{
  "name": "Tomasz Lee",
  "role_name": "Senior Workday Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Results-driven Senior Workday Engineer with extensive experience in system integration and data transformation utilizing **REST**, **SOAP**, **XML**, and **JSON** protocols. Proficient in **Python** and **Java** for effective scripting and automation within the Workday ecosystem. With 9+ years in software development, I have a strong foundation in **.NET**, **C#**, and the implementation of modern architectures including microservices. Demonstrated success in leading cross-functional teams to deliver robust solutions while meticulously documenting processes and fostering communication. Adept at optimizing performance and streamlining development workflows to ensure project success.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Senior Workday Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Utilized **Python** for data transformation processes, ensuring seamless integration with **Workday** to enhance operational efficiency.\nDeveloped and maintained **REST** APIs for data retrieval and manipulation, facilitating communication across systems and applications.\nImplemented **SOAP** web services for legacy integrations, focusing on modifying XML and JSON data formats for compatibility.\nDesigned and executed **EIB** (Enterprise Interface Builder) solutions for robust data exchanges between **Workday** and external systems, improving data accuracy and consistency by **30%**.\nLeveraged **RAAS** (Reports as a Service) for streamlined reporting and analytics, enhancing data visibility and reporting capabilities.\nOrchestrated workflows to automate business processes, significantly reducing manual intervention by **50%**.\nProduced comprehensive documentation for integration processes, ensuring clear communication and training for future deployments.\nEngaged in cross-functional collaboration, enhancing project delivery times by **20%** through effective communication and teamwork.\nMaintained high standards of coding practices, delivering high-quality work within established deadlines.\nConducted regular reviews and optimizations of existing processes to strengthen overall performance and efficiency."
    },
    {
      "role": "Full Stack Developer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "Orchestrated data transformation and integration processes utilizing **Workday** RAAS and EIB, enhancing the efficiency of data flows by 30%.\nDeveloped and maintained RESTful and SOAP APIs in **Python** and **Java**, ensuring seamless communication between systems and optimizing data exchange.\nDesigned and implemented solutions for XML and JSON data formats, resulting in a 25% reduction in data processing time during integrations.\nCollaborated with cross-functional teams to gather requirements and align on system enhancements, improving overall project delivery timelines by 20%.\nConducted thorough documentation and communication of integration processes, streamlining knowledge transfer within the team.\nLeveraged project management methodologies to oversee multiple initiatives concurrently, achieving 100% on-time project delivery.\nExecuted code reviews and mentorship programs for junior engineers, contributing to a 15% increase in team productivity and skill development.\nDeveloped custom data transformation scripts in **Python**, enabling automated data processing that improved operational efficiency by 25%.\n"
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "Utilized **REST** and **SOAP** protocols for data transformation in integration projects, ensuring seamless communication with external systems.\nDesigned and implemented **EIB** (Enterprise Interface Builder) integrations within the **Workday** platform, achieving a **15%** increase in data processing efficiency.\nOrchestrated complex data workflows, enhancing integration reliability and reducing manual intervention by **30%**.\nDeveloped and maintained clear technical documentation for all interfaces and workflows, improving knowledge transfer and team collaboration.\nApplied **Python** for automated data manipulation tasks, streamlining the integration process and decreasing execution time.\nParticipated in code review sessions, ensuring adherence to best practices in communication and documentation standards.\nEngaged in daily scrums to align team efforts with project objectives and optimize workflows.\nSupported the integration of **RAAS** (Report as a Service) for improved reporting functionalities, facilitating better decision-making.\nCollaborated with cross-functional teams to enhance integration capabilities, utilizing **XML** and **JSON** for data interchange formats.\n"
    }
  ],
  "skills": " **Programming Languages** \n\t Python, Java, JavaScript, TypeScript\n\n **Backend Frameworks** \n\t NodeJS, ExpressJS, NestJS, C#, .NET, Entity Framework, Microservices\n\n **Frontend Frameworks** \n\t HTML, CSS, ReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n **API Technologies** \n\t REST, SOAP, GraphQL, JSON, XML, RESTful API\n\n **Serverless and Cloud Functions** \n\t AWS, Azure\n\n **Databases** \n\t MSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB\n\n **DevOps** \n\t CI/CD pipelines\n\n **Cloud & Infrastructure** \n\t Workday, RAAS, EIB, Orchestrate\n\n **Other** \n\t UX/UI Design, Git, GitHub, data transformation, communication, documentation, Testing Tools: NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest, Blockchain: Solidity, Ether.js, Web3.js, Ethereum, Messaging & Caching: Apache Kafka, RabbitMQ, Redis",
  "apply_company": "Veeam Software"
}