{
  "name": "Mariusz Jan Skobel",
  "role_name": "Full Stack Developer",
  "email": "mariuszskobel15@outlook.com",
  "phone": "+48 735 343 548",
  "address": "Katowice, Poland",
  "linkedin": "https://www.linkedin.com/in/mariusz-skobel-789557397/",
  "profile_summary": "Full Stack Developer with over 10 years of experience, specializing in **JavaScript**, **TypeScript**, **React**, and **Python**. Proficient in agile development methodologies, using **Git** for version control, and skilled in front-end testing frameworks including **Jest**, **React Testing Library**, and **Cypress**. Demonstrated ability to develop high-performance software solutions in healthcare and finance, leveraging expertise in **Django** for backend development. Committed to building robust applications while ensuring observability and implementing synthetic monitoring solutions. Holds a strong foundation in developing cloud-native applications and leading enterprise platforms, integrating AI/ML capabilities for enhanced analytics and automation. Known for delivering maintainable, secure solutions compliant with industry standards including HIPAA and PCI DSS, while continuously driving real-world impact through innovative software development.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2012",
      "to_year": "2015",
      "location": "UK",
      "university": "University of Bristol"
    }
  ],
  "experience": [
    {
      "role": "Full Stack Developer",
      "company": "EitBiz",
      "from_date": "Oct 2022",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Designed and developed responsive front-end applications utilizing **React** in alignment with **JavaScript** and **TypeScript** best practices, enhancing user experience and application performance.\n• Employed agile development methodologies to ensure timely delivery and feature adjustments based on stakeholder feedback, significantly reducing release cycles by **30%**.\n• Implemented front-end testing frameworks including **Jest** and **Cypress** for automated testing, improving software reliability and reducing bugs by **25%** in production.\n• Collaborated seamlessly with back-end developers to integrate RESTful APIs, leveraging **Django** and **Python** to ensure robust data transactions and services.\n• Contributed to code quality and maintainability through regular code reviews, fostering an environment of continuous improvement and knowledge sharing.\n• Participated in cross-functional teams to design applications that follow best practices in security and performance optimization, adhering to industry standards.\n• Managed version control and project workflows using **Git**, enhancing team collaboration and reducing merge conflicts by **20%**.\n• Developed complex components that support business requirements, ensuring adherence to UX/UI design principles and client specifications.\n• Utilized observability tools to monitor application performance and user interactions in real time, minimizing downtime and enhancing user satisfaction.\n• Strengthened team capabilities by mentoring junior developers in **React** and testing frameworks, fostering skill development and enhancing overall team productivity."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Tvn S.A.",
      "from_date": "Oct 2019",
      "to_date": "Sep 2022",
      "location": "Poland",
      "responsibilities": "• Developed dynamic, user-focused front-end applications using **React (18)** and **TypeScript**, incorporating **Git** for version control and **agile development** methodologies to enhance collaboration and project delivery.\n• Implemented front-end testing frameworks, such as **Jest** and **React Testing Library**, ensuring quality and reliability through test-driven development.\n• Led the construction of back-end services with **Python (Django)** for seamless API integration, ensuring efficient communication between the client and server.\n• Adopted **observability** practices to monitor application performance, leveraging **Synthetic Monitoring** tools to proactively identify and resolve issues before they impact the user experience.\n• Collaborated in cross-functional teams to deliver fully integrated software solutions, resulting in a 30% improvement in deployment times across projects.\n• Maintained clean code standards and documentation, facilitating easier onboarding for a team of **9+ developers**, ultimately contributing to a cohesive agile development environment.\n• Actively participated in code reviews and provided constructive feedback to peers, promoting continuous learning and adherence to best practices within the team."
    },
    {
      "role": "Software Engineer",
      "company": "Timspark",
      "from_date": "Sep 2015",
      "to_date": "Aug 2019",
      "location": "UK",
      "responsibilities": "Developed and maintained full stack applications using **JavaScript**, **TypeScript**, and **React (18)**, leveraging **agile development** methodologies to deliver features efficiently within a fast-paced environment.\nImplemented front-end testing frameworks including **Jest**, **React Testing Library**, and **Cypress**, ensuring high-quality, bug-free code, resulting in a **30% reduction** in post-deployment issues.\nDesigned and optimized backend services using **Python (Django)**, ensuring robust performance and reliability by achieving **99.9% uptime** for critical services.\nCollaborated with cross-functional teams utilizing **Git** for version control, enhancing team productivity and ensuring seamless integration of new features across the development stack.\nUtilized **front-end testing** techniques to enhance the application’s reliability by maintaining automated test coverage of over **85%**, improving overall user satisfaction and confidence.\nCreated user interfaces with responsiveness in mind, ensuring compatibility across all devices while optimizing for mobile-first engagement and **accessibility compliance (WCAG 2.1)**.\nMaintained high-quality code standards through code reviews, contributing to a culture of continuous improvement and knowledge sharing within the development team.\nApplied synthetic monitoring and observability strategies to enhance application performance tracking and incident response times, reducing average downtime by **20%**."
    }
  ],
  "skills": "Programming Languages:\n\tPython, JavaScript, TypeScript, Go\n\n**Backend Frameworks:**\n\tDjango, FastAPI, Flask\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\t\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda), Azure (App Services)\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, CI/CD & Infrastructure as Code (Terraform, Ansible, Helm, Docker Compose)\n\n**Cloud & Infrastructure:**\n\tAWS (RDS, S3), Azure (Blob, SQL)\n\n**Other:**\n\tagile development, Git, front-end testing frameworks, Jest, React Testing Library, Cypress, MLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, Synthetic Monitoring, Observability"
}