{
  "name": "Tomasz Lee",
  "role_name": "AI Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Results-driven AI Engineer with 9+ years of experience in delivering innovative AI solutions utilizing **Python** and proficient in **ML frameworks** like **PyTorch** and **TensorFlow**. Expertise in designing and deploying **cloud environments** on **Azure**, **AWS**, and **GCP**, as well as implementing **CI/CD pipelines** for enhanced automation and efficiency. Strong background in **API design**, development of generative models, and leveraging **relational databases** for data management. Demonstrated leadership in Agile environments, practicing **Scrum** methodologies, and excelling in cross-team collaboration. Exceptional communication skills with the capability to achieve SC Clearance, ensuring compliance while leading projects to successful completion.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "AI Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Leveraged **Python** and **ML frameworks** to develop machine learning models, enhancing predictive accuracy with a **30%** improvement.\nImplemented **PyTorch** and **TensorFlow** for training **generative models**, significantly accelerating the model development process.\nApplied expertise in **API design** to create robust interfaces that integrated AI functionalities across platforms, facilitating easy access for developers and users alike.\nUtilized **Azure**, **AWS**, and **GCP** cloud environments for deploying AI solutions, ensuring high availability and scalability, thus reducing operational costs by **20%**.\nImplemented **CI/CD pipelines** for automated testing and deployment, resulting in a **25%** reduction in release cycles.\nConducted collaborative sessions in an **Agile/Scrum** environment, improving team communication and project delivery timelines by **15%**.\nManaged **relational databases** for storing model training data efficiently, optimizing query performance and retrieval times.\nParticipated in ongoing professional development to maintain SC Clearance and eligibility, ensuring compliance with security protocols.\nEffectively documented development processes and project updates, enhancing team transparency and communication skills."
    },
    {
      "role": "Full Stack Developer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "Utilized **Python** and **ML frameworks** such as **PyTorch** and **TensorFlow** to develop and deploy advanced AI models, enhancing system capabilities.\nImplemented **CI/CD pipelines** using **GitHub Actions** to streamline AI model deployments, achieving a **30% reduction** in production errors.\nDesigned and architected AI solutions within **cloud environments** including **Azure**, **AWS**, and **GCP**, ensuring scalability and flexibility.\nDeveloped and maintained RESTful APIs for seamless integration of AI models with existing systems, enhancing data accessibility and processing speed.\nManaged and optimized **relational databases** to support data-intensive applications, improving query performance by **25%**.\nEmployed **automated testing** frameworks to ensure the reliability and quality of AI applications, significantly reducing time spent on manual testing.\nCollaborated with cross-functional teams utilizing **Scrum** and **Agile** methodologies to define project requirements and development timelines, leading to timely delivery of AI solutions.\nConducted mentorship sessions with junior developers, focusing on best practices in AI development and programming, improving overall team productivity.\nPresented findings and updates to stakeholders to ensure alignment on project goals and deliverables, leveraging strong **communication skills**.\nAchieved **SC Clearance** and maintained eligibility for further clearances, ensuring compliance with security standards in AI development."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "Utilized **Python** and **ML frameworks** such as **PyTorch** and **TensorFlow** to develop and implement generative models, enhancing AI capabilities by **30%**.\nDesigned and optimized algorithms for AI development, focusing on the use of **relational databases** for efficient data management and retrieval, improving performance by **25%**.\nCollaborated in cloud environments including **Azure**, **AWS**, and **GCP** to deploy machine learning models, achieving a faster deployment cycle of **15%**.\nDeveloped robust API designs to facilitate communication between AI systems and other platforms, ensuring seamless integration and coherence of data across systems.\nImplemented CI/CD pipelines utilizing **Git** for version control, significantly automating testing processes and reducing manual errors by **40%**.\nParticipated in Agile and Scrum methodologies, contributing to the development process through regular standups and sprint planning.\nMaintained SC Clearance and ensured all developments complied with security protocols while providing professional communication skills across teams.\nDelivered technical documentation and user manuals for AI-related systems, improving knowledge transfer and user understanding by **20%**."
    }
  ],
  "skills": " **Programming Languages**  \n\tPython, TypeScript, JavaScript  \n\n **Backend Frameworks**  \n\tNodeJS, ExpressJS, NestJS, C#, .NET, Entity Framework, Microservices, ML frameworks  \n\n **Frontend Frameworks**  \n\tReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS  \n\n **API Technologies**  \n\tRESTful API, GraphQL, API design  \n\n **Serverless and Cloud Functions**  \n\tAWS, Azure, GCP  \n\n **Databases**  \n\tMSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB, relational databases  \n\n **DevOps**  \n\tCI/CD pipelines, automated testing  \n\n **Cloud & Infrastructure**  \n\tcloud environments  \n\n **Other**  \n\tUX/UI Design, Git, GitHub, Testing Tools: NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest, Apache Kafka, RabbitMQ, Redis, Blockchain: Solidity, Ether.js, Web3.js, Ethereum, communication skills, Scrum, Agile, SC Clearance, SC Eligible, generative models, LLMs, AI development  "
}