{
  "name": "Tomasz Lee",
  "role_name": "Senior Backend Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Senior Backend Engineer with 9+ years of experience specializing in **Node.js**, **GraphQL**, and **PostgreSQL**. Proven expertise in **AWS** cloud services and implementing **Test-Driven Development** methodologies, ensuring high-quality software solutions. Strong background in system design and architectural patterns, enabling the creation of scalable and efficient backend systems. Known for analytical abilities and problem-solving skills that streamline development processes and enhance application performance. Previous experience as a .NET Full Stack Developer provides a unique perspective on full application lifecycle, with hands-on skills in **microservices architecture**, **Apache Kafka**, **RabbitMQ**, and **Redis**, enhancing cross-functional collaboration and project delivery.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Senior Backend Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Utilized **Node.js** and **GraphQL** to develop and optimize backend services, enhancing data retrieval efficiency by 30%.\nDesigned and implemented system architecture patterns to ensure scalability, maintainability, and performance across applications.\nApplied **PostgreSQL** for data management, leading to improved transaction speeds and data integrity with a **10%** reduction in errors.\nEmployed **AWS** services for cloud deployment and storage solutions, resulting in a **15%** decrease in costs associated with on-premises infrastructure.\nLed the adoption of **Test-Driven Development** (TDD) practices, improving code reliability and reducing bug rates during deployment by **25%**.\nCollaborated with cross-functional teams for comprehensive architectural reviews and systems design, ensuring alignment with business goals.\nEngaged in analytical problem-solving to troubleshoot and resolve technical issues, enhancing system performance.\nImplemented CI/CD pipelines that cut down deployment time by **40%**, while maintaining quality assurance protocols.\nConducted thorough performance reviews and code optimization sessions to maintain standards across microservices.\nDeveloped and maintained documentation for systems architecture and design principles, fostering knowledge sharing within the team."
    },
    {
      "role": "Software Engineer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "Utilized **Node.js** and **GraphQL** to develop robust backend services, enhancing data retrieval speed by **35%**.\nDesigned and managed **PostgreSQL** databases, leading to a **20%** reduction in query times through effective indexing and optimization.\nImplemented Test-Driven Development (TDD) practices, ensuring code quality and reducing bug rates by **25%**.\nArchitected scalable systems using AWS services, achieving a **40%** increase in application availability.\nApplied various **Architectural Patterns** to build maintainable and efficient backend systems, which improved system performance metrics by **15%**.\nConducted comprehensive system design sessions, fostering a collaborative environment for technical problem-solving and innovation.\nAnalyzed system performance data to identify bottlenecks and recommend solutions, improving overall application efficiency.\nLed initiatives to integrate RESTful services with front-end libraries, enhancing seamless user interactions and experiences.\nCollaborated with cross-functional teams to define technical strategies, ensuring project alignment with business goals and timely delivery.\nMentored junior developers on best practices in backend development, significantly increasing team productivity and knowledge transfer."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "Utilized **Node.js** to develop scalable backend services that enhance system design and responsiveness, achieving a **30% reduction** in response time.\nImplemented **GraphQL** API to streamline data fetching processes, improving client application performance by **25%**.\nManaged databases using **PostgreSQL** to optimize data storage and retrieval, resulting in a **15% increase** in query performance.\nApplied Test-Driven Development (TDD) principles to ensure the reliability of backend services, leading to a **40% reduction** in production bugs.\nDesigned system architecture following best practices and **Architectural Patterns** to facilitate maintainability and scalability of applications.\nEngaged in problem-solving sessions to tackle complex project challenges, showcasing strong analytical skills.\nCollaborated with cross-functional teams to integrate cloud services using **AWS**, improving application deployment and performance.\nParticipated in code reviews and technical discussions to uphold coding standards and project goals.\nDocumented technical specifications and system design for future reference, fostering clear communication between teams."
    }
  ],
  "skills": " **Programming Languages** \n\tJavaScript, TypeScript, C#, Python\n\n **Frontend Frameworks** \n\tReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n **Backend Frameworks** \n\tNodeJS, ExpressJS, NestJS\n\n **API Technologies** \n\tRESTful API, GraphQL\n\n **Databases** \n\tMSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB\n\n **Cloud & Infrastructure** \n\tAWS, Azure\n\n **DevOps** \n\tCI/CD pipelines\n\n **Other** \n\tUX/UI Design, Git, GitHub, Test-Driven Development, Architectural Patterns, System Design, Analytical, Problem-Solving, Microservices, Messaging & Caching: Apache Kafka, RabbitMQ, Redis, Testing Tools: NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest, Blockchain: Solidity, Ether.js, Web3.js, Ethereum",
  "apply_company": "Nivoda"
}