{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Angular Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "Experienced Senior Angular Engineer with 8 years of expertise in **Angular**, **JavaScript**, and **TypeScript**. Proficient in delivering high-performance web applications within Agile environments, maintaining clean code standards, and implementing robust testing methodologies. My background includes developing enterprise solutions in the healthcare and financial sectors, leveraging a diverse tech stack including **Node.js**, **React**, **Next.js**, **Python**, **FastAPI**, and **Django**. I possess strong communication skills in Conversational English, allowing effective collaboration with cross-functional teams. Additionally, my experience with **Azure** and **AWS** cloud services, alongside a solid foundation in microservices architecture, CI/CD automation, and compliance standards, positions me to deliver secure and scalable applications.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Angular Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Utilized **Angular**, **TypeScript**, and **JavaScript** to design and develop robust applications, enhancing user interface and user experience across multiple platforms.\n- Implemented **Agile** methodologies in project management, facilitating effective communication and collaboration within the team, resulting in improvements in project delivery times by **25%**.\n- Employed Clean Code principles to maintain high-quality code standards, reducing technical debt and ensuring long-term maintainability of the applications.\n- Established comprehensive testing strategies using Jest and Cypress, increasing testing coverage from **60%** to **85%**, ensuring reliable application performance.\n- Collaborated effectively in English with cross-functional teams to gather requirements and implement features that meet stakeholder expectations and project timelines.\n- Delivered training sessions on **Angular** best practices, benefitting team members and improving overall coding standards and effectiveness.\n- Provided mentorship to junior developers, fostering a collaborative learning environment and encouraging adherence to **Agile** practices and clean coding techniques.\n- Assisted in transitioning legacy systems to modern frameworks, achieving a **30%** reduction in load times and improving user engagement metrics significantly.\n- Contributed to the development of CI/CD pipelines, facilitating smoother deployments and faster release cycles, which reduced downtime by **15%**."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Utilized **Angular** and **TypeScript** to develop robust, high-performance front-end applications, adhering to **Agile** methodologies and **Clean Code** principles for maintainability and scalability.\nCollaborated with cross-functional teams to implement automated testing frameworks ensuring code quality and a seamless user experience, significantly reducing bug rates by **30%**.\nDesigned and developed reusable components for the UI library, enhancing the efficiency of development processes and cutting down development time by **20%**.\nParticipated in code reviews and mentoring junior developers to foster a culture of writing **clean, efficient code**, elevating team performance and knowledge sharing.\nCommunicated effectively in **Conversational English**, presenting technical concepts and project updates to stakeholders, ensuring alignment on project goals and outcomes.\nImplemented continuous integration and deployment (CI/CD) workflows to streamline releases and maintenance of Angular applications, achieving a deployment frequency of **bi-weekly**.\nContributed to the optimization of application performance, resulting in a **15%** increase in load speed and improved user satisfaction scores."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "• Developed high-quality, maintainable code using **Angular** and **TypeScript** to build dynamic web applications, ensuring robust functionality and an exceptional user experience.\n• Collaborated in Agile teams to deliver projects on time, participating in sprint planning, daily stand-ups, and retrospectives to drive continuous improvements.\n• Conducted thorough testing and implemented best practices in **Clean Code** principles, enhancing code quality, readability, and maintenance efficiency.\n• Enhanced application performance and responsiveness by optimizing JavaScript and leveraging **TypeScript** features for better type safety and error reduction.\n• Implemented responsive design principles and cross-browser compatibility to ensure seamless user experiences across **web** and **mobile** platforms.\n• Mentored junior developers in best practices for using **Angular**, **JavaScript**, and **TypeScript**, fostering a culture of learning and improvement within the team.\n• Communicated effectively in **Conversational English**, facilitating collaboration among team members and stakeholders to address technical requirements and project expectations.\n• Utilized version control tools, specifically **Git**, to manage code revisions and collaborate effectively within the development team, ensuring smooth integration and deployment of features."
    }
  ],
  "skills": "Programming Languages:\n\tJavaScript, TypeScript\n\n**Frontend Frameworks:**\n\tAngular\n\n**Backend Frameworks:**\n\tPython (FastAPI, Flask, Django)\n\n**API Technologies:**\n\t\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\t\n\n**Other:**\n\tAgile, Testing, Clean Code, Conversational English, MLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot",
  "apply_company": "INNOCV Solutions"
}