{
  "name": "Patryk Zaslawski",
  "role_name": "Full-Stack Engineer",
  "email": "patrykzas0428@outlook.com",
  "phone": "+48669862402",
  "address": "Gdanski, Poland",
  "linkedin": "https://www.linkedin.com/in/patryk-z-107978395/",
  "profile_summary": "Dynamic Full-Stack Engineer with 8+ years of extensive software engineering experience, specializing in **Full-Stack Development** and **Microservices Development**. Proficient in **Relational Database Management** (particularly with **SQLServer** and **Oracle**) and skilled in **Software Engineering Principles**, algorithms, and advanced data structures for optimized solution delivery. Expert in **AI-assisted Development** and **Advanced AI Prompt Engineering** techniques, enhancing development efficiency. Comprehensive knowledge in **AWS** and **Kubernetes** for scalable cloud solutions. Experienced in crafting robust applications using modern frameworks including Python (**FastAPI**, **Django**, **Flask**) for backend and **Angular**, **Vue**, **React**, and **Next.js** for frontend. Committed to delivering secure and efficient applications that robustly meet business needs, complemented by excellent English communication skills.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2014",
      "to_year": "2017",
      "location": "United Kingdom",
      "university": "The University of Manchester"
    }
  ],
  "experience": [
    {
      "role": "Full-Stack Engineer",
      "company": "Binary Studio",
      "from_date": "Aug 2023",
      "to_date": "Present",
      "location": "United Kingdom (Remote)",
      "responsibilities": "Developed and maintained full-stack applications leveraging **Python** (FastAPI, Django, Flask) with a focus on scalable microservices architecture, enhancing application performance by **30%**.\nDesigned efficient relational database solutions using **PostgreSQL, SQLServer**, and **Oracle**, optimizing query performance through advanced indexing and data partitioning techniques, reducing query times by **25%**.\nImplemented software engineering principles, applying object-oriented design and algorithms to foster robust application development and reduce code complexity.\nEngineered AI-assisted development strategies to streamline operations, integrating advanced AI prompt engineering techniques for smarter software solutions.\nLeveraged **AWS** cloud services for deploying applications, utilizing **Kubernetes** for container orchestration, ensuring high availability and robust scaling capabilities.\nDeveloped and optimized RESTful and gRPC APIs with JWT-based security, ensuring seamless integration across full-stack applications for better data management workflows.\nLed the implementation of microservices architecture that improved deployment frequency by **40%**, facilitating continuous integration and continuous delivery (CI/CD) practices.\nMentored a team of junior developers to adhere to software engineering best practices, enhancing the overall skill set and communication skills within the team.\nUtilized advanced data structures and algorithms to enhance application back-end efficiencies, supporting complex business logic and interactions.\nCollaborated on agile development projects, improving project turnaround time by **20%** and ensuring the delivery of high-quality software products using modern engineering techniques."
    },
    {
      "role": "Software Engineer",
      "company": "Ardigen",
      "from_date": "Mar 2020",
      "to_date": "Aug 2023",
      "location": "Poland",
      "responsibilities": "• Demonstrated **Full-Stack Development** expertise by leading the development and migration to a **Python** (FastAPI, Django, Flask) microservices-based backend architecture, enhancing scalability and performance, and integrating with **SQL Server**, **PostgreSQL**, and **MongoDB** for optimized data management.\n• Designed and implemented secure **RESTful** and **gRPC APIs** in **Python**, ensuring seamless communication between mobile applications and backend components with real-time transaction updates.\n• Applied **Software Engineering Principles** to maintain and refactor legacy systems into **Python** microservices, ensuring functionality and compatibility with modern platforms.\n• Utilized frameworks like **Angular**, **Vue**, **React**, and **Next.js** to build user-centric frontends integrated with **Python** backends, enhancing the responsiveness and usability of the applications.\n• Developed a real-time transaction monitoring dashboard using **Python APIs** with **Angular UI**, integrated with **Power BI** for advanced analytics and reporting.\n• Implemented system integrations with **MuleSoft** and **Python** services for enhancing transaction efficiency in processes such as ACH transfers and credit card payments.\n• Ensured robust data protection using encryption, RBAC, **OAuth 2.0**, and **JWT** in **Python** services to comply with financial regulations while processing over **1M transactions** securely.\n• Optimized queries with **SQL Server**, **DynamoDB**, and **Redis** accessed via **Python** services, ensuring high reliability for transactional data management.\n• Leveraged event-driven architecture with **Kafka** and **RabbitMQ** in **Python** microservices, capable of handling large-scale financial transactions with over **500K messages** per day.\n• Configured and managed **Azure Service Bus** with **Python services** for reliable message brokering, improving microservices modularity.\n• Designed secure authentication and authorization in **Python APIs** using **OAuth 2.0**, **OpenID Connect**, and **JWT** to protect user data.\n• Built fraud detection services in **Python**, integrating **Azure Machine Learning** models and behavioral data to proactively identify suspicious activities.\n• Developed secure payment gateway integrations in **Python** supporting various payment methods, ensuring compliance with PCI standards, thereby increasing transaction reliability.\n• Created **serverless components** using **AWS Lambda** and **Azure Functions** for ETL pipelines, reducing overhead and enhancing responsiveness for data processing.\n• Implemented the **ELK stack** (**Elasticsearch**, **Logstash**, **Kibana**) for centralized logging and performance monitoring of **Python** services.\n• Managed Kubernetes clusters for deploying **Python** microservices, enabling rolling updates and improving availability metrics by **30%**.\n• Applied best practices in **Python development**, including automated testing with **PyTest** and **Selenium**, ensuring continuous delivery of reliable backend services.\n• Developed integration solutions with **MuleSoft** for external partners, facilitating secure and compliant financial data transfers.\n• Contributed to event-driven architectures using **Kafka**, **RabbitMQ**, and **Azure Service Bus**, yielding performance improvements and system decoupling.\n• Integrated unit tests, static analysis, and implemented CI/CD pipelines through **Azure DevOps** and **GitHub Actions** to ensure quality and reliable deployment cycles."
    },
    {
      "role": "Software Engineer",
      "company": "Altum Software",
      "from_date": "Oct 2017",
      "to_date": "Feb 2020",
      "location": "United Kingdom",
      "responsibilities": "• Delivered full-stack development solutions by designing and optimizing backend services with **Python** frameworks (FastAPI, Django, Flask) and managing relational databases (**SQL Server**, **PostgreSQL**, **MySQL**) to improve scalability and performance for e-commerce applications.\n• Implemented robust API architecture with **RESTful** principles in **Python**, enabling high-volume transaction processing and seamless communication between various systems for real-time customer engagement.\n• Managed SQL databases using ORMs like **SQLAlchemy** and **Django ORM** to enhance query efficiency, achieving a **30%** reduction in latency through strategic optimizations.\n• Engineered dynamic frontends employing **React**, **Next.js**, **Angular**, and **Vue**, integrating advanced state management with **Redux**/NgRx to facilitate improved user experiences across devices.\n• Automated CI/CD workflows using **GitHub Actions**, **Azure DevOps**, and **Jenkins** to ensure streamlined deployments and consistent feature delivery with substantial reliability.\n• Adopted containerization with **Docker** to enhance scalability and portability across diverse environments, minimizing deployment duration by **40%**.\n• Enhanced data management by incorporating **NoSQL** solutions like **MongoDB**, **Cassandra**, and **Redis**, ensuring high system availability and optimized data retrieval.\n• Conducted rigorous testing with unit and integration frameworks in **Python** (PyTest, unittest) alongside frontend automation tests using **Selenium**, improving code quality and reducing manual verification effort by **50%**.\n• Designed and executed comprehensive performance and E2E tests, ensuring system robustness aligned with business requirements and user satisfaction metrics.\n• Integrated observability tools like **Prometheus**, **Grafana**, and **Sentry** to monitor the performance and health of **Python** applications, facilitating swift error detection and system analytics.\n• Led the migration of legacy ASP.NET systems to a microservices-based architecture with **Python**, preserving functionality while modernizing the backend ecosystem.\n• Constructed responsive web applications with **HTML5**, **CSS3**, **JavaScript**, and **TypeScript** while ensuring compatibility with **Python APIs** for enhanced accessibility.\n• Developed a live chat support feature using **WebSocket** in **Python**, significantly improving real-time communication capabilities for customer service.\n• Implemented secure authentication solutions including **RBAC** and **OAuth 2.0** within **Python** services, maintaining stringent security for user data.\n• Transformed legacy **WCF** services to modern **Python REST/gRPC** frameworks, reinforcing communication reliability between microservices.\n• Carried out performance testing with tools like **Apache JMeter** and **Locust**, effectively identifying bottlenecks under peak loads and enhancing services to accommodate traffic spikes of **up to 10,000** concurrent users.\n• Strategized caching mechanisms with **Redis** to significantly reduce database strain, achieving response time improvements of **20%** for frequently accessed data.\n• Optimized critical e-commerce processes (cart, checkout, payments) within **Python** backends to ensure low latency and swift transaction handling.\n• Developed secure payment processing integrations with providers such as **Stripe**, **PayPal**, and **Razorpay**, ensuring compliance with **PCI** standards for financial transactions.\n• Utilized messaging queues like **RabbitMQ** and **Kafka** within **Python** microservices for effective event-driven communications pertaining to orders and inventory updates.\n• Designed SEO-optimized, mobile-first web interfaces with front-end frameworks (**Next.js**, **Angular**, **Vue**, **React**) while integrating them with **Python APIs** to maximize cross-device compatibility.\n• Executed load and stress testing scenarios using **JMeter** and **k6**, optimizing system resilience to handle real-world traffic patterns."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython (FastAPI, Django, Flask)\n\n **Backend Frameworks:**\n\tSpring Boot\n\n **Frontend Frameworks:**\n\tAngular (1–16), React (15–18), Next.js, Vue.js (2/3), Blazor\n\n **API Technologies:**\n\tREST & gRPC APIs\n\n **Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3)\n\n **Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis, SQLServer, Oracle\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Azure (App Services, Blob, SQL)\n\n **Cloud & Infrastructure:**\n\tAWS, Azure\n\n **Other:**\n\tFrameworks & Technologies: SQLAlchemy, Pydantic, Celery, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot\n\tSoftware Engineering Principles, Algorithms, Data Structures, Object-Oriented Design, AI-assisted Development, Advanced AI Prompt Engineering, RAG for LLMs, Full-Stack Development, Microservices Development, English Communication Skills"
}