{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Customer Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Senior Customer Engineer with 13+ years of experience in delivering high-performance applications, with a strong focus on SQL, API development, and SaaS solutions. Proficient in integrating with CRM systems and leveraging communication tools such as **Intercom** and **Slack** to enhance collaboration. Demonstrates exceptional problem-solving abilities and adaptability in fast-paced environments, consistently delivering impactful results. Skilled in **JavaScript/TypeScript**, **Python**, and **Flutter**, with extensive hands-on experience in both frontend and backend development using **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**. Proven track record in deploying cloud-native systems on **AWS** and **Azure**, implementing microservices, and developing CI/CD pipelines. Experienced in building AI/ML-powered platforms for predictive analytics and automation, and well-versed in compliance-driven development with HIPAA, FHIR, PCI DSS, and SOC 2 standards.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Customer Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Ensured seamless integration of **API** services and **SQL** databases within customer solutions, enhancing user experience and data management.\n• Assisted in the deployment of **SaaS** applications tailored for customer needs, driving higher engagement through tools like **CRM** and **ESP**.\n• Collaborated with cross-functional teams using **Intercom** and **Slack** to facilitate open communication and drive project success, demonstrating strong **collaboration** and **communication** skills.\n• Applied **problem-solving** techniques to resolve customer issues, adapt solutions quickly, and enhance customer satisfaction.\n• Delivered technical support and product training sessions, showcasing **adaptability** to varied customer queries and embracing curiosity to learn new features.\n• Championed the development of innovative solutions within customer environments, harnessing **CRM** and **ERP** systems to optimize workflow and productivity.\n• Provided insights and feedback to product teams, leveraging ambition and humility to advocate for customer needs effectively.\n• Engaged in regular follow-ups to ensure customer success and satisfaction, exhibiting strong **communication** and **adaptability** in approach.\n• Designed tailored demos and presentations that showcase the functionalities of customer solutions while addressing specific needs and feedback from customers.\n• Contributed to customer success initiatives by gathering feedback and data, utilizing findings to refine processes and enhance the customer experience."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Utilized **SQL** to optimize database queries, ensuring efficient data access and retrieval for high-volume transaction processing systems.\nCollaborated with cross-functional teams utilizing **API** integrations to enhance customer interactions within **SaaS** applications, improving client satisfaction by over **20%**.\nEngaged with clients and stakeholders through tools like **Intercom** and **Slack**, ensuring clear communication and swift resolution of queries, which boosted team collaboration by **30%**.\nAnalyzed and solved complex problems related to financial data processing, demonstrating strong **Problem-Solving** skills in various project scenarios.\nAdapted quickly to changes in project requirements, showcasing **Adaptability** by implementing solutions within tight deadlines, achieving project delivery **1 month** early.\nMaintained a strong customer focus by gathering feedback and iterating product features, driving customer engagement and satisfaction consistently.\nFostered a culture of continuous learning and improvement, exhibiting **Curiosity**, **Ambition**, and **Humility** in mentoring peers and leading by example.\nDemonstrated effective **Collaboration** skills by working closely with engineering and product teams on initiatives that required cross-departmental input and execution."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Utilized **SQL** for efficient data query and management, ensuring data integrity and optimization in customer-related workflows.\nDeveloped and maintained **API** integrations with various third-party services, ensuring seamless communication and data flow between internal systems and customer platforms.\nCollaborated with cross-functional teams to enhance the **SaaS** application, improving user engagement and customer satisfaction through innovative solutions and feedback incorporation.\nManaged **CRM** systems for tracking customer interactions and optimizing service delivery, resulting in a **20%** increase in customer retention.\nImplemented effective communication strategies using **Intercom** and **Slack**, fostering collaboration and breaking down silos across departments for efficient problem-solving.\nDemonstrated adaptability by leading initiatives to analyze system performance and propose enhancements that improved overall service delivery by **15%** in catering to customer needs.\nExhibited curiosity and ambition through continuous learning, staying updated with emerging technologies to enhance engineering processes and solutions.\nApplied humility by actively seeking feedback from team members and stakeholders, ensuring a collaborative approach to problem-solving and project management."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython: FastAPI, Flask, Django\n\tJavaScript/TypeScript: React, Vue, Angular\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n **Frontend Frameworks:**\n\tReact, Vue, Angular\n\n **API Technologies:**\n\tAPI\n\n **Serverless and Cloud Functions:**\n\tAWS: Lambda, ECS\n\tAzure: App Services\n\n **Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare)\n\tMongoDB (Gaming), Redis\n\tSQL\n\n **DevOps:**\n\tDocker, Kubernetes\n\tGitHub Actions, GitLab CI/CD\n\tTerraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:**\n\tAWS: RDS, S3\n\tAzure: Blob Storage, SQL Database\n\n **Other:**\n\tSaaS, CRM, ESP, ERP, Intercom, Slack, Communication, Problem-Solving, Collaboration, Adaptability, Curiosity, Ambition, Humility, Keycloak (OIDC, RBAC), OAuth2, JWT, Nginx, Let’s Encrypt, Certbot",
  "apply_company": "Hightouch"
}