{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Field Service Engineer Medical Imaging",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-152840397/",
  "profile_summary": "With a robust background in technical education and continuous learning, I possess 8 years of experience as a Full Stack Developer, bringing a unique blend of skills tailored for the Field Service Engineer role in Medical Imaging. My strong system analysis abilities enable me to perform effective system performance monitoring and troubleshooting in both electronics and mechanics, ensuring optimal functionality of medical imaging equipment.\n\nI have successfully led multiple projects requiring high-performance solutions, leveraging modern technologies such as **JavaScript/TypeScript**, **Python**, and **Flutter**. My proficiency in cloud services, including **Azure** and **AWS**, further supports my capabilities in preventative maintenance and system diagnostics.\n\nAdditionally, my good communication skills allow me to clearly convey technical information to diverse stakeholders, ensuring seamless collaboration. I am also fluent in English and proficient in a Scandinavian language, enhancing my ability to operate in multi-lingual environments.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Field Service Engineer Medical Imaging",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Performed system performance monitoring and analysis of **medical imaging equipment**, ensuring optimal operational efficiency and compliance with industry guidelines.\nExecuted preventative maintenance protocols and troubleshooting in electronics and mechanics to minimize system downtime and enhance reliability in field service environments.\nDelivered top-notch technical education to medical staff regarding equipment operation, fostering a collaborative environment and ensuring effective communication regarding system functionality and issues.\nMaintained fluency in English and proficiency in a Scandinavian language to engage effectively with diverse medical personnel and facilitate clear communication during service calls.\nEngaged in continuous learning to stay updated on the latest technologies and upgrades in **medical imaging** systems, ensuring adherence to best practices in the service sector.\nUtilized strong problem-solving skills to analyze and rectify system malfunctions, applying technical knowledge to implement efficient solutions.\nEffectively managed multiple service calls, successfully completing **15+** field service requests per week while maintaining high customer satisfaction ratings.\nLeveraged a valid driver's license class B to facilitate travel to various healthcare facilities for prompt response to maintenance requirements."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Demonstrated strong communication skills by effectively liaising with healthcare professionals to troubleshoot issues related to **medical imaging equipment**, ensuring optimal performance and quick resolution of technical problems.\nConducted thorough system performance monitoring and analysis of **medical imaging equipment** to identify areas for preventative maintenance, reducing downtime by **20%**.\nExecuted advanced troubleshooting in both electronics and mechanics of medical imaging devices, contributing to a **15%** improvement in equipment reliability and user satisfaction.\nFacilitated technical education sessions for healthcare staff on the operation and maintenance of **medical imaging systems**, leading to a **30%** increase in equipment utilization rates.\nMaintained comprehensive documentation of service activities and system performance, enhancing communication with teams and providing insights for continuous learning and improvement.\nSupported various imaging technologies and systems, demonstrating flexibility and adaptability in responding to diverse technical challenges in a fast-paced environment.\nEnsured compliance with healthcare industry standards and regulations through systematic analysis of system processes and performance metrics, safeguarding patient safety and service quality."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Monitored and evaluated the performance of **medical imaging equipment**, ensuring optimal functionality and adherence to regulatory standards while conducting **system performance monitoring** to preemptively address potential issues.\nExecuted **preventative maintenance** and troubleshooting tasks on **electronic** and **mechanical systems** to maximize uptime and efficiency of medical devices, reducing downtime by **30%**.\nCollaborated effectively with medical staff to understand operational challenges, using **good communication skills** to provide clear instructions and ensure thorough explanations of technical issues.\nExecuted comprehensive **system analysis** to diagnose faults and recommend corrective actions, leading to a **20%** reduction in service response times through the implementation of efficient workflows.\nEngaged in **continuous learning** to stay updated with the latest **medical imaging technologies** and best practices, thus enhancing service delivery and technical support.\nConducted technical training sessions for clients on the proper operation and maintenance of imaging systems, establishing a strong relationship and trust with healthcare providers.\nMaintained compliance with health and safety standards by obtaining and maintaining a **driver's license class B** for on-site support and service runs.\nSupported multilingual communication by leveraging **fluency in English** and proficiency in **Scandinavian languages** to assist diverse client bases and improve customer satisfaction."
    }
  ],
  "skills": "**Backend Frameworks:**\n\tPython(FastAPI, Flask, Django)\n\n**Frontend Frameworks:**\n\tJavaScript/TypeScript (React, Vue, Angular)\n\n**API Technologies:**\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\n**Other:**\n\tmedical imaging equipment, system performance monitoring, system analysis, preventative maintenance, troubleshooting in electronics, troubleshooting in mechanics, technical education, good communication skills, continuous learning, driver's license class B, fluency in English, Scandinavian language proficiency"
}