{
  "name": "Damian Franciszek Pospiech",
  "role_name": "FullStack Developer .NET Core/ Angular",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-623a26390/",
  "profile_summary": "Dynamic Full Stack Developer with 13+ years of experience crafting robust applications, particularly in compliance-driven environments. Proficient in **.NET Core**, **C#**, and **Angular**, with additional expertise in **JavaScript**, **TypeScript**, and **jQuery**. Demonstrated ability in applying **Clean Architecture** and implementing **Microservices** and **RESTful APIs** for scalable solutions.\nSkilled in frontend technologies, including **TailwindCSS**, ensuring responsive and efficient user interfaces. Committed to rigorous **Unit Testing** practices to enhance software reliability and maintainability.\nExperienced in building high-performance applications across healthcare and finance sectors, leveraging AI/ML to enhance predictive analytics and real-time operations. Demonstrated success in deploying cloud-native solutions on **AWS** and **Azure**, alongside foundational knowledge in CI/CD pipelines.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "FullStack Developer .NET Core/ Angular",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Developed and maintained full-stack applications utilizing **.NET Core** and **C#**, ensuring robust application architecture based on **Clean Architecture** principles.\n- Implemented responsive user interfaces using **Angular**, incorporating **TailwindCSS** for a modern and mobile-friendly design.\n- Designed and created RESTful APIs for seamless integration with frontend components, ensuring efficient communication and data handling.\n- Leveraged **TypeScript** and **JavaScript** alongside **RabbitMQ** for managing asynchronous tasks and improving application performance.\n- Conducted unit testing across all layers of the application using **Unit Testing** frameworks, ensuring high-quality code and adherence to best practices.\n- Developed microservices-based architectures, enhancing system scalability and maintainability through effective **Dependency Injection** techniques.\n- Collaborated with cross-functional teams to integrate third-party APIs, fostering a rich ecosystem of services and enhancing overall product capabilities.\n- Optimized application performance through code reviews and iterative improvements, achieving a **20%** increase in response time.\n- Contributed to team knowledge by mentoring juniors on best practices in **API Rest** development and Angular architecture.\n- Documented technical specifications and user guides for applications, improving onboarding and usability for end-users."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Developed and maintained scalable web applications using **.NET Core** and **Angular**, ensuring high performance and responsiveness of applications to meet user demands.\nImplemented **API Rest** services for seamless communication between the client-side and server-side components, enhancing user experience and data interchange.\nUtilized **TypeScript** and **JavaScript** to build robust front-end features with **Angular**, improving code maintainability and reducing bugs by **30%** through enhanced type safety.\nEmployed **RabbitMQ** for reliable message brokering in microservices architectures, facilitating real-time data processing for financial transactions.\nDesigned interfaces with **TailwindCSS** to create visually appealing and responsive layouts, leading to a **25%** increase in user engagement on web platforms.\nApplied **Clean Architecture** principles to ensure high maintainability and scalability of application code, enhancing collaboration across development teams.\nConducted rigorous **Unit Testing** to validate application performance, achieving a **90%** code coverage and significantly reducing regression errors.\nUtilized **Dependency Injection** patterns to improve testability and flexibility of both front and back-end components, leading to faster development cycles and reduced technical debt."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Developed and maintained robust full-stack applications leveraging **.NET Core** as the backend framework, ensuring efficient API integrations and optimal performance.\nDesigned and implemented user interfaces using **Angular** and **TypeScript**, delivering responsive and engaging web experiences that adhere to modern design principles.\nUtilized **JavaScript** along with **jQuery** for dynamic content updates and interactivity, aiming for seamless user engagement across the platform.\nIntegrated message queuing solutions with **RabbitMQ** for efficient communication between microservices, optimizing application responsiveness and reliability.\nApplied **Clean Architecture** principles to ensure modularity and maintainability in code with a focus on unit testing methodologies to uphold software quality.\nArchitected RESTful APIs adhering to best practices, enabling smooth data exchange between frontend and backend components, enhancing overall user satisfaction.\nImplemented microservices architecture for scaling individual application components, facilitating easier deployment and maintenance.\nUtilized **TailwindCSS** for creating intuitive and attractive UI components, ensuring a consistent look and feel across all pages with a focus on mobile-first design.\nConducted unit testing to validate component functionalities using advanced testing frameworks, achieving over **90%** test coverage for critical application modules.\nFacilitated dependency injection to boost testability and flexibility, adhering to the principles of SOLID design to enhance application structure.\n"
    }
  ],
  "skills": "**Programming Languages:**\n\tC#, JavaScript, TypeScript, Python\n\n**Backend Frameworks:**\n\t.NET Core, FastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tAngular, React, Vue, TailwindCSS, jQuery\n\n**API Technologies:**\n\tAPI Rest, RabbitMQ\n\n**Serverless and Cloud Functions:**\n\tAWS: Lambda, Azure: App Services\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD\n\n**Cloud & Infrastructure:**\n\tAWS: ECS, RDS, S3, Azure: Blob Storage, SQL Database, Terraform, Ansible, Helm, Docker Compose\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), OAuth2, JWT, Nginx, Let’s Encrypt, Certbot, Microservicios, Inyección de dependencias, Clean Architecture, Unit Testing"
}