{
  "name": "Rei Taro",
  "role_name": "Senior Data Engineer",
  "email": "rei515@outlook.com",
  "phone": "+48732529451",
  "address": "Warszawa, Poland",
  "linkedin": "https://www.linkedin.com/in/rei-taro-81a410391/",
  "profile_summary": "Results-driven Senior Data Engineer with 10+ years of experience in backend systems development and data engineering. Proficient in **Python**, **SQL**, and cloud services such as **AWS** (including **Redshift**, **S3**, **FSx**, **Glue**, and **Lambda**), ensuring efficient ETL and ELT processes. Expertise in **Data Modeling**, **Database Design**, and utilizing **NoSQL** solutions to create robust, scalable data architectures. Skilled in containerization with **Docker** and orchestration using **Kubernetes**. Demonstrated capacity to implement MLOps strategies in complex environments while adhering to Agile methodologies. Committed to enhancing collaboration, communication, and problem-solving capabilities within cross-functional teams. Successfully contributed to significant projects with organizations like VISA, Sii Poland, and Reply Polska.",
  "education": [
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2010",
      "to_year": "2015",
      "location": "Japan",
      "university": "Keio University"
    }
  ],
  "experience": [
    {
      "role": "Senior Data Engineer",
      "company": "Leobit",
      "from_date": "Aug 2022",
      "to_date": "Present",
      "location": "Poland",
      "responsibilities": "Designed and implemented ETL and ELT processes using **Python**, ensuring effective data modeling and database design across various platforms.\nUtilized **SQL** for data querying and manipulation, enhancing data accuracy for analytics.\nEngineered robust data pipelines leveraging **AWS services** such as **Lambda**, **Glue**, and **Redshift** to handle data processing and storage with a throughput of **up to 100TB** per week.\nDeployed containerized applications using **Docker** and **Kubernetes** to streamline development and ensure scalability in data workflows.\nCreated a successful data exchange framework using **S3** and **FSx**, ensuring compliance with regulatory standards for over **50 data sources**.\nImplemented data governance and quality checks as part of the **MLOps** strategy to manage machine learning models efficiently.\nFostered collaboration within cross-functional teams, promoting an agile work environment that improved project delivery timelines by **30%**.\nApplied strong analytical and problem-solving skills to troubleshoot and enhance existing systems, optimizing performance by **20%**."
    },
    {
      "role": "Software Engineer",
      "company": "Innovature",
      "from_date": "Nov 2018",
      "to_date": "Jun 2022",
      "location": "Japan",
      "responsibilities": "Utilized **Python** for developing robust backend systems to enhance document workflows and optimize user onboarding processes, achieving a **20% reduction** in onboarding time.\nEngineered data pipelines utilizing **AWS Glue** and **Lambda**, facilitating efficient ETL processes, and increasing data processing speed by **30%**.\nDesigned and implemented data architectures by leveraging **Amazon Redshift** and **S3** for storage and analytics, which improved data retrieval times by **15%**.\nCreated event-driven microservices using **Docker** and **Kubernetes**, allowing robust asynchronous processing for large data sets and enhancing system scalability.\nPerformed database design and data modeling for relational and NoSQL databases, ensuring data integrity and optimally structured data for analytical purposes.\nCollaborated effectively with cross-functional teams adopting **Agile** methodologies, driving a more streamlined development process and reducing sprint times by **10%**.\nConducted thorough security audits, ensuring compliance with industry standards, and embedded security protocols using **OAuth2** for authentication and access control management."
    },
    {
      "role": "Software Developer",
      "company": "Wizcorp",
      "from_date": "Apr 2015",
      "to_date": "Nov 2018",
      "location": "Japan",
      "responsibilities": "• Developed data pipeline solutions utilizing **AWS** services such as **Lambda**, **Glue**, and **S3** to efficiently manage ETL processes, improving data retrieval times by **30%**.\n• Engineered backend services using **Python** and **PostgreSQL** to support data storage and management for analytics tasks, reinforcing database design and data modeling principles.\n• Collaborated with data analytics and frontend teams to expose data through REST APIs, ensuring seamless integration and fluid performance.\n• Designed and implemented a robust data architecture with **Redshift**, boosting query performance by **25%** due to optimized warehousing strategies.\n• Facilitated real-time data processing frameworks with **Docker** and **Kubernetes**, enabling a scalable infrastructure that reduced downtime during updates by **50%**.\n• Executed thorough testing methodologies by utilizing tools such as PyTest and incorporating CI/CD practices, resulting in a **40%** reduction in bugs during the deployment phase.\n• Managed job queuing and scheduling with **Celery** and **RabbitMQ**, enhancing task management efficiency and delivering critical insights in a timely manner.\n• Ensured compliance with regulatory requirements, including MiFID II and GDPR, while reinforcing data security on the platform."
    }
  ],
  "skills": " **Programming Languages**\n\tPython, SQL\n\n **Backend Frameworks**\n\tFastAPI, Flask, Django, Celery\n\n **Frontend Frameworks**\n\t\n\n **API Technologies**\n\tREST/gRPC APIs\n\n **Serverless and Cloud Functions**\n\tAWS (Lambda, S3), Azure, Glue\n\n **Databases**\n\tPostgreSQL, MySQL, MongoDB, Redis, Redshift, NoSQL, Database Design, Data Modeling\n\n **DevOps**\n\tDocker, Kubernetes, GitHub Actions, Azure DevOps, CI/CD\n\n **Cloud & Infrastructure**\n\tAWS (EC2, S3, Lambda), Azure, FSx\n\n **Other**\n\tAI/ML Tools: Pandas, NumPy, scikit-learn, TensorFlow, Airflow, MLflow, ETL, ELT, MLOps, Agile, Communication, Collaboration, Problem-solving, Analytical",
  "apply_company": "Atorus"
}