{
  "name": "Tomasz Lee",
  "role_name": "Rust Developer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Results-driven Rust Developer with robust experience in security fundamentals, including authentication and authorization, bolstering identity and access management skills. Proficient in **Rust** and **Golang**, with a solid understanding of **TypeScript** and **WASM** for enhanced web application performance. Demonstrated ability to implement asynchronous workflows to optimize application responsiveness. Adept at mentoring junior developers and fostering collaboration across teams. With over 9 years of experience as a .NET Full Stack Developer, I have honed my strengths in designing and delivering complex applications, utilizing technologies such as **ReactJS**, **NextJS**, **.NET**, and **C#**, while continuously streamlining development processes and achieving project goals.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Rust Developer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Leveraged **Rust** to design and develop a high-performance application, enhancing system efficiency by 30% while ensuring security fundamentals are met.\nImplemented robust authentication and authorization mechanisms using **OAuth** and **OIDC** to protect user data and applications.\nUtilized **Golang** for developing asynchronous workflows, increasing processing speed by 50% and improving system responsiveness.\nMentored junior developers on best practices for secure coding and application design, fostering a collaborative team environment.\nCollaborated with cross-functional teams to ensure seamless integration of identity and access management solutions, enhancing application security.\nOptimized the application architecture for scalability and performance by using **TypeScript** in conjunction with **WASM** for efficient code execution.\nConducted reviews and provided feedback on code submissions to uphold coding standards and enhance code quality.\nEngaged in regular collaboration sessions with UX/UI designers to ensure a user-friendly interface, contributing to a 25% increase in user satisfaction.\nParticipated in knowledge-sharing workshops and presented new technology trends, encouraging team innovation and continuous improvement."
    },
    {
      "role": "Full Stack Developer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "Implemented secure authentication and authorization protocols using **OAuth** and **OIDC**, ensuring robust identity and access management.\nUtilized **Rust** and **Golang** to develop efficient asynchronous workflows, improving system responsiveness by 20%.\nMentored junior developers in **TypeScript** and best practices, fostering a collaborative team environment that increased overall productivity by 15%.\nCollaborated with cross-functional teams to define project requirements and secure implementation strategies, meeting deadlines for **10+** projects in a year.\nDesigned and integrated systems with security fundamentals, ensuring compliance with industry standards for **9+** applications.\nConducted thorough code reviews and provided feedback, resulting in a **30%** reduction in bugs and enhancing code quality.\nUtilized **WASM** to optimize performance of web applications, achieving a **25%** speed improvement on interactive features.\nFacilitated regular knowledge-sharing sessions to encourage collaboration and skill enhancement, improving team's capability to handle complex challenges."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "• Developed secure applications utilizing **Rust**, focusing on **security fundamentals** to ensure robust authentication and authorization mechanisms.  \n• Implemented **identity and access management** protocols adhering to **OAuth 2.0** and **OIDC** standards to enhance system security.  \n• Designed asynchronous workflows for optimized application performance, achieving a **15%** reduction in processing times.  \n• Mentored junior developers on best practices in **TypeScript** and **Golang**, fostering a collaborative and growth-oriented environment.  \n• Collaborated with cross-functional teams to align project objectives, enhancing team efficiency by **25%** through effective communication.  \n• Improved system integrity by applying industry-standard security practices and familiarity with **WASM** for web assembly deployments.  \n• Engaged in code reviews, ensuring adherence to security protocols and design patterns, ultimately increasing code quality by **30%**.  \n• Created technical documentation outlining authentication flows and security measures, facilitating knowledge-sharing within the team.  \n• Actively participated in agile methodologies, including daily standups and sprint planning, to drive project success."
    }
  ],
  "skills": " **Programming Languages**\n\tRust, Golang, TypeScript, Python\n\n**Backend Frameworks**\n\tNodeJS, ExpressJS, NestJS, C#, .NET, Entity Framework, Microservices\n\n**Frontend Frameworks**\n\tHTML, CSS, JavaScript, ReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n**API Technologies**\n\tRESTful API, GraphQL, OAuth, OIDC\n\n**Serverless and Cloud Functions**\n\tAWS, Azure\n\n**Databases**\n\tMSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB\n\n**DevOps**\n\tCI/CD pipelines\n\n**Cloud & Infrastructure**\n\tMessaging & Caching: Apache Kafka, RabbitMQ, Redis\n\n**Other**\n\tUX/UI Design, Git, GitHub, Blockchain: Solidity, Ether.js, Web3.js, Ethereum, security fundamentals, authentication, authorization, identity and access management, asynchronous workflows, mentoring, collaboration, Testing Tools: NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest"
}