{
  "name": "Mariusz Jan Skobel",
  "role_name": "Senior UI Engineer",
  "email": "mariuszskobel15@outlook.com",
  "phone": "+48 735 343 548",
  "address": "Katowice, Poland",
  "linkedin": "https://www.linkedin.com/in/mariusz-skobel-927764397/",
  "profile_summary": "Senior UI Engineer with 10+ years of experience in delivering exceptional user interfaces and experiences. Proficient in modern front-end technologies such as **Angular**, **HTML5**, **CSS**, along with expertise in **Node.js** for back-end integration. Demonstrated ability in **UX/UI design**, including skills in **Figma**, **Sketch**, and **Adobe**, ensuring intuitive and aesthetically pleasing interfaces. Strong expertise in **prototyping**, **wireframing**, and **responsive design** that enhance usability and accessibility. Proven track record in **data visualization** and B2B design to support complex user interaction. Excellent verbal and written communication skills with experience in stakeholder management, ensuring alignment between technical teams and business goals. Additionally, brings robust full-stack skills with a tech stack including **JavaScript/TypeScript**, **React**, and **Flutter**, allowing for seamless collaboration across development and design teams.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2012",
      "to_year": "2015",
      "location": "UK",
      "university": "University of Bristol"
    }
  ],
  "experience": [
    {
      "role": "Senior UI Engineer",
      "company": "EitBiz",
      "from_date": "Oct 2022",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "•\tCollaborated with cross-functional teams to create user-centric designs and interfaces for web and mobile applications using **Figma**, **Sketch**, and **Adobe**, ensuring usability and responsiveness across devices.\n•\tDeveloped interactive, responsive web applications utilizing **Angular**, **Node.js**, and **HTML5/CSS**, enhancing user experience and functionality in alignment with stakeholder requirements and feedback.\n•\tLed the design and prototyping process, employing usability principles and prototyping tools to refine concepts and facilitate stakeholder buy-in, resulting in a **30%** reduction in design iteration time.\n•\tCreated detailed wireframes and user flows to support the visual communication and development of B2B applications, ensuring seamless transitions and intuitive user journeys for critical applications.\n•\tImplemented data visualization techniques using **D3.js** and **Chart.js** to present complex data in an accessible format, achieving a **25%** increase in user engagement with analytics features.\n•\tConducted usability testing and user research to gather feedback, iterating designs based on findings to improve overall user satisfaction, achieving an **85%** approval rating from end-users.\n•\tManaged stakeholder communication effectively, ensuring alignment between user experience objectives and project goals through clear, concise verbal and written communication.\n•\tEngaged in responsive design practices, optimizing applications for diverse screen sizes, which led to enhanced performance on mobile devices by **40%**.\n•\tFacilitated workshops and design reviews, fostering a collaborative environment that encouraged creative idea generation and stakeholder contributions throughout the design lifecycle."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Tvn S.A.",
      "from_date": "Oct 2019",
      "to_date": "Sep 2022",
      "location": "Poland",
      "responsibilities": "Utilized **Figma** and **Adobe** to design and prototype user interfaces, focusing on **UI** and **UX** principles to create visually compelling and user-friendly layouts for financial platforms.\nLed iterative design processes, employing **wireframing** and **prototyping** techniques to enhance user engagement and drive B2B design initiatives, resulting in a **30%** increase in user satisfaction metrics.\nDeveloped responsive designs adhering to **HTML5**, **CSS**, and **Angular** standards, ensuring optimal performance across various devices and browsers.\nEngaged with stakeholders to gather requirements and feedback, facilitating collaborative design sessions that enhanced usability and streamlined communication, reducing project turnaround times by **25%**.\nImplemented comprehensive **data visualization** strategies using tools such as **D3.js** and **Power BI**, allowing for effective representation of complex financial data and real-time analytics through intuitive dashboards.\nCollaborated closely with development teams to ensure seamless integration of front-end designs with back-end functionalities, leveraging frameworks like **Node.js** (NestJS) for efficient performance.\nConducted usability testing and user research, applying findings to refine designs and improve the overall user experience, contributing to a **15%** improvement in task completion rates.\nMaintained clear and concise project documentation, including design specifications and user interface guidelines to aid in ongoing development and future enhancements."
    },
    {
      "role": "Software Engineer",
      "company": "Timspark",
      "from_date": "Sep 2015",
      "to_date": "Aug 2019",
      "location": "UK",
      "responsibilities": "Utilized **Figma** and **Sketch** to create interactive prototypes and wireframes, ensuring optimal user experience (UX) and user interface (UI) design for e-commerce applications across platforms.\nEmployed **HTML5**, **CSS**, and **Angular (latest version)** to build responsive and accessible web components, adhering to WCAG 2.1 standards and enhancing usability for a diverse user base.\nCollaborated with cross-functional teams to integrate user feedback into design iterations, strengthening stakeholder management through continuous communication and collaboration.\nConducted usability testing and data visualization enhancements to refine user interactions and provide actionable insights for improving platform engagement.\nLed the design and development of a seamless user journey for checkout processes, improving conversion rates by **15%** through meticulous design and optimization strategies.\nExecuted responsive design strategies using **Adobe** tools, ensuring cross-device compatibility and enhancing user satisfaction metrics across the platform.\nCreated high-quality, engaging visual assets and interfaces, employing advanced prototyping techniques to establish B2B design solutions that meet diverse client needs.\nFacilitated verbal and written communication with stakeholders to align design objectives with business goals, ensuring project timelines and deliverables are met efficiently."
    }
  ],
  "skills": " **Frontend Frameworks:**\n\tAngular, React, Vue, HTML5, CSS, Figma, Sketch, Adobe\n\n**Backend Frameworks:**\n\tPython(FastAPI, Flask, Django), Node, Nest\n\n**API Technologies:**\n\t\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Artificial Intelligence & Machine Learning:**\n\tMLflow, Airflow, Kubeflow\n\n**Other:**\n\tAuthentication & Security: Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot\n\tUsability, Prototyping, Wireframing, Responsive Design, Data Visualization, B2B Design, Verbal Communication, Written Communication, Stakeholder Management",
  "apply_company": "GlobalLogic"
}