{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Frontend Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "As a Senior Frontend Engineer with 8 years of experience, I specialize in building high-performance applications primarily using **React**, **TypeScript**, **Next.js**, and **Tailwind** technology. My expertise extends to utilizing modern development tools such as **shadcn/ui**, **Storybook**, and **Vitest**, coupled with backend proficiency in **Node.js** and **PostgreSQL**. I have a solid foundation in cloud solutions, particularly with **Azure Kubernetes Service** and infrastructure management utilizing **Pulumi**. \nI am adept in working within collaborative environments utilizing tools like **GitHub**, **Linear**, **Notion**, and **Slack** to streamline workflows. My previous roles involved developing enterprise-grade platforms with a focus on compliance and security standards. I am committed to leveraging my comprehensive knowledge in frontend technologies and software engineering best practices to deliver user-focused solutions.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Frontend Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Developed high-quality user interfaces using **React**, **Next.js**, and **TypeScript**, implementing design systems with **Tailwind** and component libraries like **shadcn/ui** and **Storybook**.\nDesigned and implemented responsive web applications, ensuring performance and usability on multiple devices, while adhering to best practices in **Vitest** for testing and quality assurance.\nCollaborated with cross-functional teams using tools like **GitHub**, **Linear**, and **Notion** for project management and issue tracking, enhancing development efficiency by 30%.\nLed the integration of microservices with **Node.js** backend services, optimizing RESTful API interactions and improving response time by 25%.\nUtilized **PostgreSQL** for efficient data handling, focusing on data integrity and scalability for web applications serving over **10,000** concurrent users.\nImplemented infrastructure as code using **Pulumi** to ensure consistent and repeatable deployment processes on cloud environments like **Azure Kubernetes Service**.\nParticipated in CI/CD workflows using **GitHub Actions** for automated deployments, enhancing release frequency and reducing downtime by **15%**.\nEnhanced developer collaboration through integration of tools like **Slack** for communication and real-time feedback during feature development.\nMaintained and optimized existing codebases, proactively identifying performance bottlenecks and reducing load times by an average of **40%**.\nContributed to the architecture and design of new features, applying knowledge of modern front-end technologies and UX best practices to improve user satisfaction scores by **20%**."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Developed dynamic user-focused front-end applications using **React (18)**, **TypeScript**, **Next.js**, and **Tailwind CSS**, ensuring high performance and responsiveness for financial dashboards and admin portals.\nImplemented design and documentation standards utilizing **Storybook** and **Vitest**, achieving a streamlined development process and improved UI consistency across applications.\nCollaborated with cross-functional teams using **GitHub**, **Linear**, **Notion**, and **Slack** to enhance project management and communication, leading to a reduction of development time by **25%**.\nLed the transition to a microservices architecture with a focus on maintainability and scalability using **Node.js (NestJS/Express)**, contributing to a **40%** increase in system throughput for high-volume transactions.\nManaged and optimized PostgreSQL databases for efficient data storage and retrieval, resulting in a **30%** improvement in query performance.\nChampioned best practices in development and testing workflows, implementing CI/CD pipelines with **Azure Kubernetes Service** and **Pulumi**, reducing deployment time from several hours to under **15 minutes**.\nUtilized **Flux** for state management, ensuring seamless data flow and application state synchronization across the React applications, enhancing user experience for users handling financial transactions."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "• Developed and optimized intuitive frontend applications utilizing **React** (18), **TypeScript**, **Next.js**, and **Tailwind CSS** to deliver superior user experiences across web platforms with a focus on mobile-first design.\n• Implemented robust UI components using **shadcn/ui** and **Storybook** to ensure consistent and reusable design systems, enhancing collaboration with design teams.\n• Conducted unit and integration testing using **Vitest** to guarantee code reliability and maintainability, improving deployment success rates to **99%**.\n• Collaborated with backend engineers utilizing **Node.js** and PostgreSQL to design seamless data integration pathways and ensure application performance under high load, serving up to **10,000** concurrent users without degradation.\n• Managed deployment processes through **Azure Kubernetes Service**, incorporating **Pulumi** for infrastructure as code initiatives, leading to faster and more consistent deployment cycles with an average decrease in deployment time by **30%**.\n• Engaged cross-functional teams daily using **Slack**, **GitHub**, and project management tools like **Linear** and **Notion** to foster effective communication and agile practices while managing project timelines.\n• Participated in code reviews and pair programming sessions, promoting team standards that enhanced code quality and adherence to best practices in frontend development.\n• Conducted regular performance audits of frontend applications, leveraging tools and frameworks to identify bottlenecks, achieving loading times reduced to under **1 second** for **90%** of site pages.\n• Ensured compliance with accessibility standards (WCAG 2.1) while developing responsive e-commerce UIs, broadening market reach and enhancing user satisfaction."
    }
  ],
  "skills": " **Frontend Frameworks:**\n\tReact, TypeScript, Next.js, Tailwind, shadcn/ui, Storybook, Vitest\n\n**Programming Languages:**\n\tPython, JavaScript\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django, Node.js\n\n**API Technologies:**\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Cloud & Infrastructure:**\n\tAzure Kubernetes Service, Pulumi, Terraform, Ansible, Helm, Docker Compose\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Flux\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, Linear, Notion, Slack",
  "apply_company": "Avido"
}