{
  "name": "Mariusz Jan Skobel",
  "role_name": "Senior Java Engineer",
  "email": "mariuszskobel15@outlook.com",
  "phone": "+48 735 343 548",
  "address": "Katowice, Poland",
  "linkedin": "https://www.linkedin.com/in/mariusz-skobel-927764397/",
  "profile_summary": "Senior Java Engineer with 10+ years of experience delivering high-performance software solutions. Proficient in **Java**, with hands-on expertise in **AWS** and cloud services to build and deploy scalable applications. Demonstrated ability to design and implement robust **APIs** and ensure security across applications. Proven analytical thinking skills coupled with a strong commitment to maintaining high code quality standards. Experienced in collaborating within diverse teams to achieve project goals effectively.\nSkilled in modern technologies including **JavaScript/TypeScript**, **Python**, and **Flutter**, with extensive experience across the full stack using **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**. Background in developing cloud-native applications and leading enterprise platforms that incorporate AI/ML capabilities for enhanced decision-making. Strong understanding of compliance standards, ensuring solutions meet requirements such as HIPAA, FHIR, PCI DSS, and SOC 2. Passionate about driving real-world impact through innovative technology solutions.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2012",
      "to_year": "2015",
      "location": "UK",
      "university": "University of Bristol"
    }
  ],
  "experience": [
    {
      "role": "Senior Java Engineer",
      "company": "EitBiz",
      "from_date": "Oct 2022",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Designed and implemented enterprise-scale solutions using **Java** and **AWS** services to ensure high performance and resilience in both backend and cloud environments.\n• Developed and deployed RESTful **APIs** for seamless integration with third-party services and internal applications, focusing on security and code quality to meet industry standards.\n• Collaborated with cross-functional teams to enhance project delivery through effective **team collaboration**, ensuring alignment on project goals and innovative approaches to problem-solving.\n• Conducted comprehensive security assessments and maintained high **security** standards throughout the software development lifecycle to protect sensitive healthcare and financial data.\n• Utilized advanced analytical skills to leverage data analytics tools for improving business decision-making processes, tracking performance metrics, and optimizing applications.\n• Implemented coding best practices with code reviews and automated testing, enhancing overall **code quality** and reducing the occurrence of bugs in production.\n• Utilized cloud services like **AWS** to implement scalable, distributed systems, achieving a **99.9% uptime** and enhancing system reliability.\n• Delivered high-level project documentation and code specifications in **English**, promoting clear communication with stakeholders and facilitating knowledge transfer among team members."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Tvn S.A.",
      "from_date": "Oct 2019",
      "to_date": "Sep 2022",
      "location": "Poland",
      "responsibilities": "Utilized **Java** for developing secure and scalable back-end services, ensuring high code quality and following best practices for maintainability and performance.\nCollaborated with cross-functional teams to design and implement RESTful **APIs**, facilitating seamless integration with front-end applications and third-party services.\nEngaged in cloud-based solutions using **AWS**, optimizing application deployment and enhancing infrastructure security across environments.\nApplied analytical thinking to troubleshoot and resolve complex system issues, improving application performance metrics by over **20%**.\nLed team collaboration efforts in daily stand-ups and bi-weekly sprints using Agile methodologies, contributing to a **15%** increase in team productivity.\nDeveloped technical documentation and code reviews, fostering knowledge sharing and enhancing team capabilities while maintaining compliance with security best practices.\nParticipated in DevOps practices, leveraging **Cloud Services** to automate deployment processes and monitoring, reducing downtime by **30%**.\n\n"
    },
    {
      "role": "Software Engineer",
      "company": "Timspark",
      "from_date": "Sep 2015",
      "to_date": "Aug 2019",
      "location": "UK",
      "responsibilities": "Leveraged **Java** for designing and optimizing backend services within a cloud environment, focusing on high availability, low latency, and scalability across key modules, achieving a performance improvement of **30%**.\nImplemented robust **APIs** to facilitate seamless integration with various **Cloud Services** and third-party tools, resulting in a **25%** decrease in development time for new features.\nCollaborated with cross-functional teams to enhance team collaboration and ensure code quality, leading to a **50%** reduction in post-deployment issues through improved analytical thinking and peer reviews.\nDesigned and maintained secure user authentication protocols utilizing **AWS** IAM, ensuring compliance with security standards and regulations, reinforcing user data protection throughout the application layer.\nParticipated in code reviews and contributed to maintaining high code quality standards while introducing new security measures to protect application integrity, directly reducing vulnerabilities identified by security audits by **40%**.\nConducted performance evaluations of the existing codebase and implemented key optimizations that resulted in a **20%** increase in application efficiency.\nCommunicated effectively in English during team meetings and documentation, facilitating clarity and understanding among local and international team members.\n\n"
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, JavaScript/TypeScript, Java\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n **Frontend Frameworks:**\n\tReact, Vue, Angular\n\n **API Technologies:**\n\tAPIs\n\n **Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3)\n\n **Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:**\n\tAzure (App Services, Blob, SQL)\n\n **Other:**\n\tMLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, CCM, Security, Team Collaboration, Analytical Thinking, Code Quality, English",
  "apply_company": "Babel"
}