{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Graphics Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "As a Senior Graphics Engineer with extensive expertise in performance optimization, real-time rendering, and cross-platform rendering, I leverage technologies such as **Unity**, **Vulkan**, and **Metal** to enhance graphics performance and quality. My strong skill set includes advanced shader development with **HLSL**, **GLSL**, and **MSL**, as well as utilizing **Scriptable Render Pipeline** for custom rendering solutions. \nWith 8 years of experience in full-stack development, I possess a solid foundation in building scalable applications. I excel in performance profiling using tools like **RenderDoc** and **Perfetto**, and I have comprehensive experience in GPU-driven pipelines, including techniques such as global illumination and temporal anti-aliasing. My innovative contributions have improved rendering efficiency and graphical fidelity across various platforms, demonstrating my ability to develop robust solutions for both mobile and enterprise-level applications.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Graphics Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Developed and optimized high-performance graphics rendering techniques using **C++** for real-time rendering applications, ensuring optimal performance on mobile platforms while utilizing GPU capabilities effectively.\nImplemented performance profiling tools including **RenderDoc** and **Perfetto** to analyze and enhance rendering efficiency, significantly reducing frame time by **30%**.\nDesigned and created advanced shaders using **HLSL**, **GLSL**, and **MSL**, incorporating features like temporal anti-aliasing and super-resolution to achieve visually stunning graphics with minimal performance overhead.\nArchitected and developed cross-platform rendering solutions using **Unity** and the **Scriptable Render Pipeline**, enabling dynamic and scalable content across various devices including **iOS** and **Android**.\nLeveraged **Vulkan** and **Metal** for low-level graphics programming, contributing to improved rendering performance and resource management in complex graphics applications.\nConducted extensive performance optimization techniques, achieving a reduction in rendering lag by **40%** while enhancing fidelity with **global illumination** and **clustered lighting**.\nIntegrated compute-based rendering strategies to improve graphical computations and resource allocation, optimizing rendering processes for high-demand environments.\nCollaborated closely with team members to iterate on graphics engine development, exploring innovations in **GPU-driven pipelines**, culling strategies, and cross-platform compatibility across **12+** devices.\nManaged and guided the implementation of graphics solutions that utilized **Nanite** and **Lumen**, ensuring high-quality visuals while maintaining real-time performance.\nProduced comprehensive documentation and test strategies for graphics features using performance profiling tools to validate quality and performance standards across all graphics applications."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Utilized **C++** and **Vulkan** to develop and optimize high-performance real-time rendering systems, enhancing rendering throughput by **30%** and ensuring compatibility across mobile platforms.\nImplemented advanced graphics techniques such as **global illumination**, **temporal anti-aliasing**, and **real-time rendering** using **HLSL** and **GLSL**, improving visual quality and user experience in gaming applications.\nDesigned and developed shader programs using **Metal** and **Scriptable Render Pipeline**, resulting in a **25%** increase in rendering efficiency and a more dynamic lighting system through **clustered lighting** and **tiled lighting**.\nConducted performance profiling of rendering systems using tools like **RenderDoc** and **Perfetto**, identifying bottlenecks and improving frame rates by **20%**.\nLed the creation of GPU-driven pipelines that utilized compute-based rendering techniques, significantly reducing rendering times for complex scenes.\nCollaborated with cross-functional teams to integrate graphics engine features into game environments, enhancing gameplay experience while maintaining a **60 FPS** target across platforms.\nOptimized graphical assets and created performance benchmarks to ensure robust operation on various mobile platforms, achieving compatibility across **75%** of devices tested.\nImplemented **Nanite** and **Lumen** technologies to leverage next-gen rendering capabilities, resulting in more detailed graphics and better resource management."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Engineered high-performance graphics solutions for mobile platforms using **C++** alongside **Unity** to optimize real-time rendering pipelines focused on performance profiling and global illumination techniques.\nDesigned and implemented custom shaders using **HLSL** and **GLSL** to enhance visual fidelity and achieve low latency rendering, ensuring outstanding graphical output across varied consumer devices.\nUtilized **Vulkan** and **Metal** APIs for modern GPU-driven pipelines, ensuring efficient resource handling and maximized performance for graphics applications.\nConducted performance optimization and profiling using tools such as **RenderDoc** and **Perfetto**, improving frame rates by up to **35%** through targeted adjustments on compute-based rendering workflows.\nDeveloped immersive visual effects and maintained clustered and tiled lighting frameworks, enhancing multi-platform support and achieving cross-platform rendering efficiency.\nUtilized temporal anti-aliasing and super-resolution techniques to elevate image quality, significantly reducing artifacts and enhancing user experience in dynamic graphics environments.\nIntegrated features for shader complexity management and optimized GPU utilization, ensuring seamless integration in virtualization using **Scriptable Render Pipeline**.\nLed architectural discussions on GPU optimization strategies, improving rendering times by **40%** through innovative techniques and methodologies within the game engine development lifecycle.\nCreated a real-time rendering framework that leveraged **Nanite** and **Lumen** to support dynamic lighting and high-resolution textures for next-gen graphics on clustered systems.\nCollaborated with cross-functional teams to ensure performance profiling aligns with game design, contributing to a **30%** increase in overall game satisfaction scores based on user feedback."
    }
  ],
  "skills": "Programming Languages:\n\tC++, Python, JavaScript, TypeScript\n\nBackend Frameworks:\n\tFastAPI, Flask, Django\n\nFrontend Frameworks:\n\tReact, Vue, Angular\n\nAPI Technologies:\n\t\n\nServerless and Cloud Functions:\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\nDatabases:\n\tPostgreSQL, MySQL, MongoDB, Redis\n\nDevOps:\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\nCloud & Infrastructure:\n\t\n\nOther:\n\tMLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, Vulkan, Metal, Unity, Scriptable Render Pipeline, GPU, performance profiling, real-time rendering, shaders, HLSL, GLSL, MSL, performance optimization, global illumination, profilers, RenderDoc, Perfetto, Xcode, compute-based rendering, GPU-driven pipelines, culling, mobile platforms, clustered lighting, tiled lighting, temporal anti-aliasing, super-resolution, cross-platform rendering, engine development, Nanite, Lumen",
  "apply_company": "Scopely"
}