{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Lead/Staff Backend Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-623a26390/",
  "profile_summary": "Driven Lead/Staff Backend Engineer with 13+ years of experience specializing in **Python**, **AWS**, **Relational Databases**, and **DevOps Pipelines**. Proven expertise in **Distributed Systems Design** and **SaaS** solutions, ensuring high-performance applications tailored for healthcare and financial sectors. Demonstrated ability in building scalable architectures, leveraging **Infrastructure-as-Code** techniques, and implementing **Container Orchestration** for enhanced system reliability.\n\nSkilled in **Software Design Patterns** and **Performance Optimization**, with a strong focus on **Observability** and maintaining high **Platform Reliability**. Adept in communicating complex technical concepts in a clear manner while fostering a collaborative mindset among team members. Committed to proactive problem-solving and pragmatic approaches to software development. Additionally, experienced in compliance-driven development aligned with industry standards such as HIPAA and PCI DSS.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Lead/Staff Backend Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Demonstrated technical leadership in designing and building full-stack platforms for healthcare and fintech utilizing **Python** (FastAPI) and **Node.js**, while ensuring platform reliability and compliance with regulations including HIPAA and GDPR.\n• Leveraged **Relational Databases** like **PostgreSQL** and **MongoDB** for robust data modeling, and maintained data infrastructure capable of handling high transaction volumes, achieving data ingestion rates of **up to 1000 records/sec**.\n• Designed distributed systems architectures, transforming legacy systems into microservices utilizing **Docker** and **Kubernetes** (AKS/EKS), creating highly available solutions that improved system uptime to **99.9%**.\n• Developed and managed **DevOps Pipelines** with tools such as **GitHub Actions** and **CircleCI**, implementing Infrastructure-as-Code practices resulting in deployment speeds improved by **40%**.\n• Created and maintained observability metrics and logs across infrastructure using advanced monitoring tools ensuring proactive performance optimization to meet SLAs.\n• Implemented robust testing practices across the stack using **Jest**, **Cypress**, and **PyTest**, achieving **95% test coverage** and increasing overall software quality.\n• Collaborated within cross-functional teams applying a collaborative mindset to integrate features like personalized dashboards, enhancing user experience based on business feedback.\n• Guided the design and deployment of MLOps workflows using **MLflow** and **DVC**, improving model training efficiency and reducing deployment times by **30%**.\n• Architected solutions applying sound software design patterns that scaled effectively, ensuring tech stack remains agile with tools like **Terraform** for infrastructure management.\n• Fostered a proactive culture of continuous learning and optimization by mentoring junior engineers on best practices in backend engineering and modern **SaaS** architectures."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "• Leveraged **Python** for developing scalable microservices and ETL pipelines, enhancing system performance across high-volume financial transactions.\n• Engineered distributed systems design using **Relational Databases** to efficiently manage and query large datasets for analytics and reporting.\n• Spearheaded infrastructure improvement and deployment strategies utilizing **Infrastructure-as-Code** principles, ensuring seamless integration on **AWS**.\n• Implemented **DevOps Pipelines** to automate the software development lifecycle, leading to a **30%** reduction in deployment times.\n• Championed performance optimization techniques, achieving **25%** faster transaction processing and improved platform reliability.\n• Fostered a collaborative mindset through effective communication, ensuring alignment across cross-functional teams and promoting a proactive approach to problem-solving.\n• Designed and executed observability strategies to monitor system health and reliability, enhancing responsiveness to potential outages by **40%**.\n• Provided technical leadership in building container orchestration systems with **Kubernetes** and **Docker**, improving the scalability of microservices.\n• Advocated for software design patterns and best testing practices to elevate code quality and maintainability, resulting in a **20%** decrease in post-deployment issues."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "• Engineered and optimized high-performance backend services utilizing **Python** (FastAPI, Django) and advanced **relational databases**, ensuring platform reliability and scalability for a global e-commerce platform, managing over **1 million** users.\n• Designed and implemented **distributed systems** to support critical workflows like checkout and order fulfillment, achieving **99.9%** uptime through automation and efficient data modeling strategies.\n• Pioneered **SaaS** solutions leveraging AWS cloud services, enabling rapid deployment and scaling of applications while adhering to **infrastructure-as-code** best practices.\n• Led the creation and management of DevOps pipelines, enhancing application reliability through **observability** tools and implementing proactive performance optimization strategies that improved latency by **30%**.\n• Collaborated with cross-functional teams to introduce innovative software design patterns, driving a **pragmatic** approach to development while facilitating communication across departments.\n• Advocated for robust **testing practices**, implementing CI/CD workflows that increased deployment frequency by **40%**, minimizing downtime during updates.\n• Fostered a **collaborative mindset** among team members, mentoring junior developers and leading technical discussions to enhance code quality and knowledge sharing.\n• Ensured the integrity and reliability of the platform through the application of **role-based access control (RBAC)** and **OAuth 2.0**, maintaining GDPR compliance for user data protection.\n• Integrated advanced **infrastructure-as-code** frameworks with **container orchestration** using Kubernetes, streamlining deployment processes and improving system scalability across services.\n• Engaged in proactive risk mitigation by implementing feature flags and controlled rollouts, enabling A/B testing that increased feature adoption rates by **25%**."
    }
  ],
  "skills": "**Programming Languages:**\n\tPython\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tJavaScript/TypeScript: React, Vue, Angular\n\n**API Technologies:**\n\tOAuth2, JWT\n\n**Serverless and Cloud Functions:**\n\tAWS: Lambda\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis, Relational Databases\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, DevOps Pipelines, Container Orchestration\n\n**Cloud & Infrastructure:**\n\tAWS: ECS, RDS, S3, Azure: App Services, Blob Storage, SQL Database, Infrastructure-as-Code, Terraform, Ansible, Helm, Docker Compose\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, Distributed Systems Design, SaaS, Observability, Platform Reliability, Software Design Patterns, Data Modeling, Testing Practices, Performance Optimization, Technical Leadership, Communication Skills, Collaborative Mindset, Proactive, Pragmatic"
}