{
  "name": "Andrzej Ito",
  "role_name": "Solutions Engineer",
  "email": "andrzej.ito@outlook.com",
  "phone": "+48 732 126 371",
  "address": "Rzeszów, Poland",
  "linkedin": "https://www.linkedin.com/in/andrzej-ito-2872a4391/",
  "profile_summary": "As a Solutions Engineer, I leverage over 9 years of expertise in **cloud security**, **AWS**, **Azure**, **GCP**, **network engineering**, and **operating systems** to deliver secure and innovative cloud solutions. I have a proven record of conducting risk-based security assessments and implementing security frameworks, while managing **cloud identity** and **access management**. Proficient in developing **Infrastructure as Code** solutions and optimizing **CI/CD processes**, I effectively facilitate technical sales through engaging demonstrations and presentations. My background in **containers** and **virtual machines** enhances my ability to architect scalable systems that exceed client expectations, while my commitment to mentoring and leading cross-functional teams drives collaborative success in every project. I am dedicated to fostering technical excellence and enhancing user experience through innovative software solutions.",
  "education": [
    {
      "degree": "Bachelor of Science",
      "category": "Computer Science",
      "from_year": "2010",
      "to_year": "2014",
      "location": "Osaka, Japan",
      "university": "Osaka University"
    }
  ],
  "experience": [
    {
      "role": "Solutions Engineer",
      "company": "Allegro.pl",
      "from_date": "08/2023",
      "to_date": "",
      "location": "Poznan, Poland",
      "responsibilities": "• Conduct risk-based security assessments focusing on **cloud security** protocols and frameworks to ensure compliance with industry standards.\n• Develop and present technical demonstrations regarding **AWS**, **Azure**, and **GCP** cloud solutions to prospective clients, enhancing sales efforts by **30%**.\n• Design and implement **Infrastructure as Code** strategies using tools like Terraform for efficient cloud resource management.\n• Collaborate with network engineering teams to ensure robust security measures are in place for virtual machines and **containers**.\n• Manage **cloud identity** and access management to safeguard data integrity across all applications, resulting in a **40%** reduction in security incidents.\n• Utilize **CSPM tools** to monitor cloud environments for vulnerabilities, contributing to a month-over-month improvement in risk mitigation.\n• Spearheaded the CI/CD process using **Jenkins** and **Docker**, achieving a streamlined deployment pipeline that reduced time-to-deployment by **50%**.\n• Create and maintain comprehensive documentation regarding security certificates and keys management for cloud applications, ensuring clarity for technical teams. \n• Leverage strong presentation skills to educate clients about the benefits of SaaS solutions, consistently receiving positive feedback and a **95%** satisfaction rate."
    },
    {
      "role": "Full Stack Developer",
      "company": "Paypay Corporation",
      "from_date": "05/2017",
      "to_date": "07/2023",
      "location": "Tokyo, Japan",
      "responsibilities": "• Conducted **risk-based security assessments** to identify vulnerabilities in cloud environments such as **AWS**, **Azure**, and **GCP** with a focus on **cloud security** best practices.\n• Worked with **Infrastructure as Code** methodologies to automate the deployment of security configurations across multiple cloud platforms, reducing provisioning time by **40%**.\n• Collaborated with network engineering teams to design secure network architectures that incorporate **containers** and **virtual machines**, ensuring scalability and security.\n• Provided technical demonstrations and presentations to clients, showcasing the implementation of **cloud identity** and **access management** solutions to enhance their security posture.\n• Implemented best practices using **CSPM tools** to maintain compliance with security frameworks and manage certificates and keys across **SaaS** applications.\n• Designed and built robust CI/CD processes that integrate security checks at each stage of the pipeline, improving the security of software deployments.\n• Engaged with stakeholders to communicate insights on security risks, leveraging technical sales skills to drive the adoption of innovative solutions."
    },
    {
      "role": "Full Stack Developer",
      "company": "Fujitsu Ltd",
      "from_date": "06/2014",
      "to_date": "04/2017",
      "location": "Tokyo, Japan",
      "responsibilities": "• Developed and implemented cloud security measures utilizing **AWS**, **Azure**, and **GCP**, enhancing data protection and compliance for various projects.\n• Conducted risk-based security assessments to identify vulnerabilities in cloud infrastructure, ensuring adherence to security frameworks and best practices.\n• Designed and managed **virtual machines** and **containers**, streamlining deployments through **Infrastructure as Code** methodologies, utilizing tools such as Terraform and CloudFormation.\n• Provided technical sales support by delivering impactful demonstrations and presentations on cloud solutions, enhancing customer understanding and engagement.\n• Collaborated with cross-functional teams to optimize **CI/CD processes**, integrating security into the development lifecycle.\n• Utilized **SaaS** solutions to improve operational efficiency and client service delivery.\n• Implemented cloud identity and access management practices to secure sensitive data, including management of certificates and keys.\n• Gained experience with **CSPM tools** to monitor cloud security posture and compliance, enabling proactive risk management.\n• Developed web applications using **Spring MVC**, **jQuery**, **HTML**, **JavaScript**, **CSS**, **Web Forms**, **Material UI**, and **Tailwind CSS**.\n• Converted Photoshop and Figma designs to table-less semantic XHTML, enhancing web accessibility and performance.\n• Involved in designing **SSIS** packages to export data from flat file sources to **MS SQL Server**, optimizing data integration processes.\n• Leveraged various web technologies including Bower, NPM, Git, and AJAX controls to enhance application functionality and user experience."
    }
  ],
  "skills": " **Programming Languages**\n\tJava, C++, C#, Python, Kotlin, SQL, PLSQL\n\n **Backend Frameworks**\n\tSpring, Spring Boot, Hibernate, Struts, JPA, Node.js\n\n **Frontend Frameworks**\n\tReact, Vue, Angular\n\n **API Technologies**\n\tREST APIs, SOAP, Microservices\n\n **Serverless and Cloud Functions**\n\t\n\n **Databases**\n\tMS SQL Server, Oracle, MongoDB, PostgreSQL, Redis\n\n **DevOps**\n\tCI/CD process, Infrastructure as Code\n\n **Cloud & Infrastructure**\n\tAWS, Azure, GCP, virtual machines, containers, cloud security, risk-based security assessments, security frameworks, cloud identity, access management, certificates, keys, CSPM tools, SaaS\n\n **Other**\n\tnetwork engineering, operating systems, technical sales, demonstrations, presentation skills, SOLID, DRY, LINQ, Rabbit MQ"
}