{
  "name": "Mariusz Jan Skobel",
  "role_name": "DevOps Engineer",
  "email": "mariuszskobel15@outlook.com",
  "phone": "+48 735 343 548",
  "address": "Katowice, Poland",
  "linkedin": "https://www.linkedin.com/in/mariusz-skobel-789557397/",
  "profile_summary": "DevOps Engineer with 10+ years of experience specializing in **Azure**, **CI/CD**, **Infrastructure as Code** using **Bicep**, **Terraform**, and **ARM Templates**. Proficient in employing **Azure DevOps**, **Azure Monitor**, and **Application Insights** for comprehensive monitoring and management of cloud-native applications. Skilled in utilizing **Docker** and **Kubernetes** for container orchestration and on-premises management. Strong background in **Python** for automation and scripting, with a keen emphasis on security best practices to ensure compliance and integrity of solutions.\n\nExperienced in collaborating with cross-functional teams to deliver high-performance software solutions, leveraging technologies such as **JavaScript/TypeScript**, **FastAPI**, and **Django**. Adept in problem-solving and communication, bringing a pragmatic approach to software development and deployment. Passionate about enhancing operational efficiency and driving impactful results through intelligent automation and real-time analytics.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2012",
      "to_year": "2015",
      "location": "UK",
      "university": "University of Bristol"
    }
  ],
  "experience": [
    {
      "role": "DevOps Engineer",
      "company": "EitBiz",
      "from_date": "Oct 2022",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "•\tImplemented CI/CD pipelines leveraging **Azure DevOps**, **GitHub Actions**, and **CircleCI** for robust deployment strategies, ensuring high availability and streamlined updates for applications.\n•\tUtilized **Infrastructure as Code** principles with tools such as **Terraform**, **Bicep**, and **ARM templates** to automate and manage cloud resources efficiently in Azure environments.\n•\tLed the adoption of **Docker** and **Kubernetes** for container orchestration, enhancing application scalability and resilience across various services.\n•\tEstablished comprehensive monitoring and alerting solutions using **Azure Monitor** and **Application Insights**, guaranteeing optimal operation and prompt issue resolution for all infrastructure activities.\n•\tSuccessfully managed on-premises resources through automated scripts in **PowerShell**, allowing for consistency and compliance with internal security best practices.\n•\tEmployed **Python** for scripting and task automation, significantly reducing manual effort and enhancing productivity across development and operational teams.\n•\tActively collaborated with cross-functional teams to enforce security best practices and maintain robust communication flows, addressing issues and enhancing processes.\n•\tDesigned and maintained infrastructure monitoring solutions to anticipate potential system failures, ensuring operational excellence and consistent uptime of **99.9%**.\n•\tFacilitated problem-solving initiatives through workshops and collaborative sessions, leading to a **30%** increase in team efficiency and issue resolution times.\n•\tMentored junior team members and participated in continuous training to uphold modern technological standards and trends relevant to the **DevOps** field."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Tvn S.A.",
      "from_date": "Oct 2019",
      "to_date": "Sep 2022",
      "location": "Poland",
      "responsibilities": "Leveraged **Azure DevOps** and **CI/CD** pipelines to automate software deployment and infrastructure provisioning, improving deployment frequency by **30%** and reducing lead time to change by **25%**.\nImplemented Infrastructure as Code (IaC) using **Bicep**, **Terraform**, and **ARM templates** to manage and provision cloud resources, ensuring consistency and reducing configuration drift by **40%**.\nUtilized **Azure Monitor** and **Application Insights** for monitoring application performance and implementing security best practices, enabling faster detection and resolution of issues by **50%**.\nCollaborated across teams to design and develop solutions in **Docker** and **Kubernetes** environments, streamlining deployment processes and enhancing scalability.\nAutomated application and infrastructure management tasks with **PowerShell** scripting, resulting in time savings of approximately **20 hours** per project.\nDeveloped user-focused applications with **Python** for backend services, ensuring seamless integration with DevOps workflows and increasing overall system efficiency.\nEngaged in regular communication and collaboration with cross-functional teams to resolve issues and improve the software development lifecycle through effective problem-solving strategies."
    },
    {
      "role": "Software Engineer",
      "company": "Timspark",
      "from_date": "Sep 2015",
      "to_date": "Aug 2019",
      "location": "UK",
      "responsibilities": "Implemented **infrastructure as code** using **Terraform** and **Bicep** to automate deployments and manage cloud resources in **Azure**, resulting in a **30% reduction in deployment times** across environments.\nUtilized **CI/CD pipelines** in **Azure DevOps** to streamline the software delivery process, achieving faster release cycles and improving collaboration between development and operations teams by **40%**.\nManaged container orchestration using **Kubernetes**, deploying applications with **Docker** to enhance scalability and maintainability of code, which led to a **25% increase in system reliability**.\nMonitored application performance and infrastructure health with **Azure Monitor** and **Application Insights**, enabling proactive problem-solving and reducing downtime by **15%**.\nDeveloped and implemented security best practices in compliance with industry standards, utilizing **PowerShell** for automation and system management to enhance system security and mitigate risks.\nCollaborated across cross-functional teams to address project hurdles and deliver timely solutions, demonstrating strong communication and problem-solving skills.\nDesigned and maintained on-premises systems management processes ensuring operational continuity and high availability in hybrid environments.\nConducted trainings on monitoring tools and practices to improve team capabilities in identifying and resolving performance issues effectively.\nLeveraged effective communication skills to liaise with stakeholders, ensuring that project goals align with business objectives and that development teams understand operational requirements."
    }
  ],
  "skills": " **Backend Frameworks:**\n\tPython (FastAPI, Flask, Django)\n\n **Frontend Frameworks:**\n\tJavaScript/TypeScript (React, Vue, Angular)\n\n **API Technologies:**\n\n **Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n **Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Azure DevOps, CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:**\n\tInfrastructure as Code, Bicep, ARM Templates, Azure Monitor, Application Insights, Powershell, On-Premises Management\n\n **Other:**\n\tMLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, Security Best Practices, Monitoring, Communication, Collaboration, Problem-Solving"
}