{
  "name": "Mariusz Jan Skobel",
  "role_name": "Senior Fullstack Engineer",
  "email": "mariuszskobel15@outlook.com",
  "phone": "+48 735 343 548",
  "address": "Katowice, Poland",
  "linkedin": "https://www.linkedin.com/in/mariusz-skobel-789557397/",
  "profile_summary": "Senior Fullstack Engineer with over 10 years of experience in software development, specializing in **C#**, **.NET**, and **APIs**. Demonstrated expertise in building robust applications utilizing **Angular** and adopting Domain-Driven Design principles to enhance software architecture. Proven track record in developing MVPs and POCs that expedite project timelines and facilitate effective stakeholder collaboration through proactive development strategies.\nExperienced in delivering high-performance software solutions across various sectors, including healthcare and finance, leveraging a comprehensive tech stack that includes **JavaScript/TypeScript**, **Python**, **Flutter**, **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**.\nSkilled in orchestrating cloud-native applications on **Azure** and **AWS**, with a strong background in microservices architecture and event-driven systems. In addition, I possess hands-on experience in CI/CD automation, ensuring the delivery of secure and maintainable solutions that adhere to compliance standards such as HIPAA, FHIR, PCI DSS, and SOC 2. Committed to reducing complexity in software solutions while maximizing impact.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2012",
      "to_year": "2015",
      "location": "UK",
      "university": "University of Bristol"
    }
  ],
  "experience": [
    {
      "role": "Senior Fullstack Engineer",
      "company": "EitBiz",
      "from_date": "Oct 2022",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Developed robust **C#** APIs to facilitate seamless communication between front-end and back-end systems, ensuring high performance and responsiveness across applications.\n• Led the creation of scalable applications using **.NET**, incorporating principles of **Domain-Driven Design** to align software solutions with business objectives and reduce complexity in development.\n• Collaborated with cross-functional teams to initiate **POC (Proof of Concept)** projects, demonstrating the feasibility of new technologies and approaches in **Angular** and **API** integrations.\n• Implemented **MVP (Minimum Viable Product)** strategies for rapid development cycles, focusing on critical features that deliver maximum value while adhering to project deadlines.\n• Proactively identified and addressed potential roadblocks, enhancing team efficiency and driving successful project outcomes.\n• Streamlined application architecture to reduce complexity, making the maintenance and updating of full-stack solutions more efficient.\n• Delivered projects with measurable impacts, achieving a **30%** reduction in time-to-market by employing agile methodologies and effective collaboration.\n• Ensured high-quality software delivery with a focus on best practices in coding and documentation, facilitating a **20%** increase in team productivity through shared knowledge and mentorship."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Tvn S.A.",
      "from_date": "Oct 2019",
      "to_date": "Sep 2022",
      "location": "Poland",
      "responsibilities": "• Developed and integrated robust APIs using **C#** within a **.NET** framework, ensuring seamless communication between microservices and enhancing overall system functionality.\n• Championed the adoption of Domain-Driven Design principles to create scalable and maintainable architectures, significantly reducing system complexity by **30%**.\n• Collaborated with cross-functional teams to deliver MVPs (Minimum Viable Products) and POCs (Proof of Concepts) on time, improving project delivery timelines by **25%**.\n• Implemented user interfaces using **Angular** to provide a dynamic and engaging frontend experience, aligned with stakeholder requirements and user feedback.\n• Proactively identified and resolved bottlenecks in both frontend and backend processes, increasing the throughput of transaction systems by an impressive **40%**.\n• Enforced best practices in collaboration and communication, fostering a cohesive working environment across teams to ensure project success."
    },
    {
      "role": "Software Engineer",
      "company": "Timspark",
      "from_date": "Sep 2015",
      "to_date": "Aug 2019",
      "location": "UK",
      "responsibilities": "Utilized **C#** and **.NET** frameworks to design and implement robust APIs that facilitate seamless communication between frontend and backend systems, enhancing application performance and reliability.\nEmployed **Domain-Driven Design** principles to create scalable software architectures, reducing complexity and allowing for efficient management of business logic across various modules.\nCollaborated with cross-functional teams to develop **MVP (Minimum Viable Product)** and **POC (Proof of Concept)** projects, delivering measurable outcomes and rapid iterations for effective product development.\nApplied **Angular** for building engaging user interfaces that adhere to best practices in frontend development, significantly improving user experience and product usability.\nDemonstrated proactivity by initiating project improvements and identifying potential areas of risk, leading to a **30%** reduction in deployment issues and enhancing overall project timelines.\nConducted regular code reviews and collaborated on **APIs** design to ensure high-quality standards and alignment with the team's technical vision, fostering a culture of collaboration.\nParticipated in Agile development processes, maintaining a flexible and adaptive approach to project requirements, leading to more efficient sprints and project deliveries.\nImplemented strategies for complexity reduction in legacy systems, leading to a **25%** improvement in code maintainability and performance.\nLeveraged best practices in software development, including automated testing and continuous integration, to enhance deployment processes and ensure the delivery of high-quality software."
    }
  ],
  "skills": "**Programming Languages**:\n\tC#, Python, JavaScript, TypeScript\n\n**Backend Frameworks**:\n\tFastAPI, Flask, Django, .NET\n\n**Frontend Frameworks**:\n\tReact, Vue, Angular\n\n**API Technologies**:\n\tAPIs, JWT, OAuth2\n\n**Serverless and Cloud Functions**:\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Databases**:\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**DevOps**:\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure**:\n\tAWS, Azure\n\n**Other**:\n\tMLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), Nginx, Certbot, POC (Proof of Concept), MVP (Minimum Viable Product), Collaboration, Proactivity, Complexity Reduction",
  "apply_company": "Agicap"
}