{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Frontend Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "As a highly skilled Senior Frontend Engineer with 8 years of experience, I excel in leveraging **JavaScript**, **TypeScript**, **Vue.js**, and **React** to build high-performance, user-centric solutions. My extensive background in developing **RESTful APIs**, coupled with a strong focus on **frontend testing** and **component-based architecture**, ensures the creation of scalable and accessible applications. I prioritize performance optimization and usability, ensuring seamless user experiences in every project. Additionally, I have a solid foundation in **CI/CD** practices, enabling rapid deployment and integration.\n\nWith a proven track record in team leadership and communication, I am adept at guiding cross-functional teams towards achieving project goals. My expertise also extends to problem-solving in complex environments, ensuring that I can effectively address challenges as they arise.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Frontend Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Designed and developed responsive, user-centric applications utilizing **JavaScript**, **TypeScript**, **React (17-18)**, and **Vue.js (3.x)**, ensuring accessibility and usability across platforms.\nImplemented robust **RESTful APIs** for seamless data integration and enhanced application performance, adhering to best practices for component-based architecture and scalability.\nLed the establishment of CI/CD practices using **GitHub Actions** and **CircleCI**, ensuring efficient deployment workflows and incorporating automated frontend testing strategies for high-quality code delivery.\nCollaborated with cross-functional teams to enhance performance optimization strategies, resulting in a **30%** improvement in application load times and user experience.\nConducted thorough frontend testing using **Jest** and **Cypress**, establishing a comprehensive test strategy covering unit, integration, and end-to-end testing for web services.\nApplied advanced styling techniques to ensure a cohesive visual identity across applications, achieving a **95%** accessibility compliance rate.\nExercised strong problem-solving skills while addressing legacy code challenges, initiating a task force that led to the successful refactoring of **3** major components into a modular architecture for improved maintainability.\nFostered open communication and team leadership, guiding a group of **5** junior developers through the adoption of best practices in frontend development and fostering a collaborative team environment."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "• Developed user-focused front-end applications utilizing **React (18)**, **Vue.js**, and **TypeScript**, ensuring adherence to accessibility and usability standards for enhanced user experience.\n• Implemented performance optimization strategies in **React** and **Vue.js** applications to achieve a responsive and interactive feel in financial dashboards, resulting in a **30%** improvement in application load times.\n• Collaborated with backend teams to design and consume **RESTful APIs**, ensuring seamless data integration and efficient communication between services.\n• Led team initiatives to implement CI/CD practices, contributing to a **25%** decrease in deployment times and enhanced code quality through regular frontend testing.\n• Mentored junior developers in component-based architecture principles, problem-solving techniques, and best practices for building scalable and maintainable code.\n• Enhanced team communication and collaboration by establishing a clear workflow for frontend development, facilitating faster reviews, and fostering a culture of continuous improvement.\n• Streamlined the development process by adopting best practices in javascript coding and component-based architecture, resulting in robust, maintainable code for high-volume financial platforms."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "• Developed and optimized frontend applications using **JavaScript** frameworks including **React 18**, **Vue 3**, and **Angular**, ensuring performance optimization and responsiveness across both web and mobile platforms.\n• Implemented component-based architecture, enhancing maintainability and scalability of the UI by integrating **TypeScript**, Redux Toolkit, and **Tailwind CSS**.\n• Applied best practices in frontend testing and CI/CD methodologies, successfully reducing deployment time by **30%** and increasing overall code quality.\n• Created responsive, SEO-friendly e-commerce interfaces utilizing **Next.js**, Vue 3 + Nuxt, and **HTML5/CSS3**, adhering to accessibility compliance standards (WCAG 2.1) to enhance usability for diverse users.\n• Collaborated with cross-functional teams ensuring effective communication and streamlined problem-solving for complex frontend challenges, demonstrating strong team leadership.\n• Oversaw performance optimization initiatives leading to a **25%** decrease in load times and improved user engagement metrics.\n• Engaged in creating RESTful APIs to ensure smooth data interactions between frontend and backend services, thereby enhancing application efficiency.\n• Managed Unix-based environments to support frontend deployments, ensuring high availability and low latency during peak traffic periods.\n• Instigated feature flags and CI/CD pipelines for continuous integration, significantly improving the rollout speed of new frontend features while minimizing risks.\n"
    }
  ],
  "skills": " **Programming Languages:**\n\tJavaScript, TypeScript, Python\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n **Frontend Frameworks:**\n\tReact, Vue.js, Angular\n\n **API Technologies:**\n\tRESTful APIs\n\n **Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n **Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:**\n\tAWS, Azure\n\n **Other:**\n\tMLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, Unix, Component-based Architecture, Performance Optimization, Scalable Styling, Accessibility, Usability, Problem-solving, Team Leadership, Communication",
  "apply_company": "Storyblok"
}