{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Customer Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "As a dedicated Senior Customer Engineer, my expertise encompasses technical support and customer relationship management, ensuring seamless interactions with clients and addressing their technical needs effectively. With 8 years of experience in high-performance solutions, I possess strong diagnostic techniques and electrical engineering principles to troubleshoot and resolve complex issues swiftly. My background in mobile applications development, particularly using **JavaScript/TypeScript**, **Python**, and **Flutter**, enables me to communicate effectively with development teams while providing insights into customer requirements.\n\nI am skilled in sales and lead generation, utilizing advanced communication skills to foster teamwork and drive customer-centric solutions. My self-driven approach complements my ability to implement conflict resolution strategies while maintaining a focus on service excellence. Additionally, I have a solid foundation in using **Microsoft Office** for documentation and reporting purposes.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Customer Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Provided **technical support** for ATM systems and electrical engineering components, ensuring uptime and reliability of **mobile applications**.\n- Utilized **Diagnostic Techniques** to troubleshoot customer issues effectively and deliver timely resolutions, enhancing **Customer Relationship Management**.\n- Collaborated with cross-functional teams to improve **sales and lead generation** strategies, leveraging strong **communication skills** to articulate technical concepts to non-technical stakeholders.\n- Fostered a culture of teamwork by leading conflict resolution efforts and promoting a self-driven environment, resulting in improved team performance by **20%**.\n- Conducted training sessions on **Microsoft Office** products, enhancing team productivity by providing valuable resources and ongoing support.\n- Successfully managed a portfolio of clients, achieving a **95%** customer satisfaction score through proactive support and engagement.\n- Developed an effective feedback loop, gathering insights from customers and translating them into actionable improvements for products and services, increasing NPS by **15%**.\n- Prepared and delivered presentations on technical topics, successfully simplifying complex concepts for diverse audiences, thereby improving knowledge retention by **30%**."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Demonstrated exceptional **Customer Relationship Management** by effectively resolving client issues and providing ongoing **Technical Support** across various financial platforms.\nUtilized **Diagnostic Techniques** to troubleshoot and optimize financial applications, ensuring high availability and performance in customer-facing systems.\nEffectively communicated complex technical concepts to clients and stakeholders, leveraging strong **Communication Skills** to manage expectations and foster a collaborative environment.\nFacilitated **Teamwork** among cross-functional groups to enhance problem-solving efficiency and improve customer service outcomes.\nExceeded sales targets by utilizing **Sales and Lead Generation** strategies, contributing to team success and promoting financial products tailored to client needs.\nEngaged in **Self-Driven** projects aimed at enhancing mobile applications for better customer accessibility and user experience.\nSupported clients with **Microsoft Office** tools to deliver polished presentations and reports that showcased product capabilities and customer benefits.\nLeveraged expertise in **Mobile Applications** to develop mobile-friendly interfaces, enhancing customer interaction with financial services.\nUtilized conflict resolution skills to address and de-escalate customer concerns, leading to improved satisfaction ratings by over **25%**."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Provided **technical support** for complex backend services in the e-commerce sector, utilizing skills in **Electrical Engineering** to diagnose and resolve issues effectively.\nFacilitated seamless **customer relationship management** through clear communication and conflict resolution, ensuring high customer satisfaction in service delivery.\nConducted technical and diagnostic techniques to streamline operations, leading to improved service delivery metrics by **25%**.\nEngaged in **teamwork** and collaborative problem-solving on projects, demonstrating strong communication skills while working cross-functionally with frontend and backend teams.\nLeveraged expertise in **sales and lead generation** by gathering customer feedback and translating it into actionable improvements, contributing to a **15%** increase in user engagement.\nCrafted and delivered presentations to stakeholders using **Microsoft Office**, highlighting project progress and gathering input on future developments, ensuring alignment with business objectives.\nAssisted in mobile applications development to enhance user experience across various platforms, implementing effective solutions that improved application performance by **30%**.\nDesigned comprehensive training sessions to ensure team members were equipped with necessary knowledge to assist customers, promoting a culture of **self-driven** learning and development."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, JavaScript/TypeScript\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n **Frontend Frameworks:**\n\tReact, Vue, Angular\n\n **API Technologies:**\n\t\n\n **Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n **Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:**\n\tAWS, Azure\n\n **Other:**\n\tMLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, CompTIA A+, Conflict Resolution, Customer Relationship Management, Sales and Lead Generation, Technical Support, Mobile Applications, Microsoft Office, Communication Skills, Teamwork, Self-Driven",
  "apply_company": "NCR Atleos"
}