{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior DevOps Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Driven Senior DevOps Engineer with 13+ years of experience in building robust and scalable applications across healthcare and financial sectors. Expertise in deploying cloud-native systems using **AWS** and **Azure**, with proficient skills in **Docker**, **Kubernetes**, and **Terraform** to streamline CI/CD pipelines and ensure high-performance application delivery. Demonstrated ability in performance profiling, software architecture, designing with design patterns, and leveraging data structures for optimal system performance.\n\nSkilled in microservices and event-driven architectures, with hands-on experience in **Linux** environments and working knowledge of AI technologies, including **Large Language Models**, **Computer Vision**, and **Vision-Language Models**. Strong background in compliance-driven development, aligning solutions with HIPAA, FHIR, PCI DSS, and SOC 2 standards. Effective communicator and collaborator, committed to enhancing team productivity with **AI productivity tools** and MLOps practices.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior DevOps Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Developed and maintained **CI/CD** pipelines leveraging **GitHub Actions**, **CircleCI**, and **Azure DevOps**, incorporating automated testing, security checks, and efficient multi-environment deployment workflows.\n- Engineered scalable deployments of microservices architectures using **Docker** and **Kubernetes** (AKS/EKS), enhancing fault tolerance and operational efficiency.\n- Implemented infrastructure as code with **Terraform** to automate provisioning and management of cloud resources, optimizing deployment speed and resource utilization.\n- Administered and orchestrated applications in **AWS**, ensuring seamless integration and performance monitoring across the deployment lifecycle.\n- Conducted **performance profiling** to identify bottlenecks and improve the stability and speed of applications across the stack.\n- Collaborated closely with cross-functional teams to adopt **design patterns** and enhance **software architecture**, ensuring scalable and maintainable solutions.\n- Utilized **communication** and **collaboration** skills for seamless partnerships with ML teams, achieving successful deployments of **Large Language Models** and **Computer Vision** applications.\n- Deployed real-time data processing and analytics systems for healthcare and fintech platforms, using databases like **PostgreSQL**, **MongoDB**, and technologies such as **GraphQL** for efficient data retrieval.\n- Led teams in training and versioning Machine Learning models with **MLflow** and **DVC**, ensuring robust **MLOps** practices in both development and production environments.\n- Integrated intelligent feature sets into applications, including **Vision-Language Models**, to enhance user experiences through predictive analytics and personalized interactions. \n- Provided expertise in **software architecture** and **data structures** to design and optimize services, aligning with industry best practices and enhancing performance.\n- Managed deployment of intelligent applications on **AWS** and utilized **AI productivity tools** to automate workflows and increase operational efficiency.\n- Developed and maintained **Linux** environments for application hosting, ensuring system security, reliability, and performance.\n- Collaborated with agile teams to define robust testing strategies using tools like **Jest**, **Cypress**, and **Postman**, ensuring comprehensive test coverage across applications."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Utilized **Docker** and **Kubernetes** to deploy and manage containerized applications, ensuring high availability and scalability across multiple environments.\nImplemented **CI/CD** pipelines for efficient software delivery and integration using **Terraform** and orchestrated resources in **AWS**, facilitating streamlined deployment processes.\nConducted performance profiling for applications and system architectures, leading to a **30%** improvement in response times and user experience across financial platforms.\nCollaborated with cross-functional teams to design robust software architectures and effective design patterns, enabling a seamless integration of **Large Language Models** and **Computer Vision** technologies.\nLeveraged **Linux** skills for server management, providing optimized configurations to support financial applications and ensuring security compliance.\nEngaged in continuous communication with stakeholders to align project scopes and requirements, demonstrating strong collaboration skills, which improved project delivery timelines by **25%**.\nEmployed **AI productivity tools** to streamline workflows, enhancing team efficiencies in project execution and reporting.\nMaintained and documented infrastructure as code for reproducibility and compliance using **Yocto**, ensuring smooth infrastructure management for ongoing projects.\nAchieved **AWS certification**, validating expertise in cloud services and best practices for deployment and management of scalable applications."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Implemented **CI/CD** pipelines using **Docker** and **Kubernetes**, ensuring streamlined deployment processes and maintaining high availability across multiple environments.\nDesigned and maintained infrastructure as code using **Terraform** on **AWS**, improving deployment speed by **30%** and facilitating seamless scaling of resources in response to traffic demands.\nUtilized **Linux** environments for system configuration and performance profiling, optimizing application performance metrics and reducing downtime by **15%**.\nCollaborated with cross-functional teams to enhance software architecture and design patterns, leading to improved system stability and responsiveness in production systems.\nIntegrated and automated cloud-native tools and services, leveraging reconciliation strategies to support microservices architectures and streamlined communication between teams.\nMonitored and analyzed application and server performance through logging tools, achieving a **20%** increase in resource utilization efficiency through targeted data structure optimizations.\nDeveloped scalable solutions involving **Large Language Models** and **Computer Vision** for future AI productivity enhancements within the operational stack, pushing innovative boundaries in product offerings.\nParticipated in code reviews and knowledge-sharing sessions, fostering communication and collaboration practices that enhanced team cohesion and project success.\nMaintained compliance with security standards and best practices, including implementating role-based access control (RBAC) and secure data handling protocols in alignment with **GDPR** requirements."
    }
  ],
  "skills": "Programming Languages:\n\tPython, JavaScript/TypeScript\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\t\n\n**Serverless and Cloud Functions:**\n\tAWS Lambda\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform\n\n**Cloud & Infrastructure:**\n\tAWS (ECS, RDS, S3), Azure (App Services, Blob Storage, SQL Database)\n\n**Other:**\n\tLinux, performance profiling, design patterns, data structures, software architecture, communication, collaboration, Large Language Models, Computer Vision, Vision-Language Model, AWS certification, AI productivity tools, Yocto, Keycloak (OIDC, RBAC), OAuth2, JWT, Nginx, Let’s Encrypt, Certbot, Helm, Docker Compose, MLflow, Airflow, Kubeflow",
  "apply_company": "SQUAD"
}