{
  "name": "Tomasz Lee",
  "role_name": "Senior Software Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Results-driven Senior Software Engineer with 9+ years of comprehensive experience in designing, developing, and implementing scalable applications. Proficient in **Python**, **FastAPI**, **PostgreSQL**, **Docker**, **Kubernetes**, and **AWS**, showcasing a strong commitment to deliver high-quality software solutions with a focus on reliability and reproducibility. Experienced in utilizing **CI/CD** practices, unit testing, integration testing, and automated quality assurance to streamline development processes. Skilled in microservices architecture and distributed systems with hands-on experience in **Redis**, alongside a solid foundation in full stack technologies including **ReactJS**, **NextJS**, **.NET**, and **C#**. Proven track record of leading cross-functional teams to success while optimizing performance and enhancing user experience.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Senior Software Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Utilized **Python** and **FastAPI** to develop scalable and high-performance web services, enhancing application responsiveness.\nDesigned and maintained **PostgreSQL** databases, ensuring data integrity and optimizing performance for over 50,000 transactions per day.\nImplemented **Docker** and **Kubernetes** for containerization and orchestration, resulting in a 30% reduction in deployment times and improved environment consistency.\nIntegrated **Redis** for caching, leading to a 35% improvement in data retrieval speeds and reduced load on the database.\nEstablished CI/CD pipelines for automated deployments and streamlined processes, reducing release time by 40%.\nConducted unit testing and integration testing, improving software reliability and reducing bugs by 25%.\nImplemented automated quality assurance practices to enhance code quality and ensure reproducibility across environments.\nCollaborated closely with cross-functional teams to drive features from concept to completion, ensuring alignment with business objectives.\nMonitored application reliability using AWS cloud services, achieving 99.9% uptime.\nDeveloped and deployed RESTful APIs, enabling seamless integration with front-end applications and third-party services."
    },
    {
      "role": "Software Engineer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "- Developed high-performance applications using **Python** and **FastAPI**, resulting in a **30%** reduction in last-minute bug fixes through enhanced **automated quality assurance** practices.\n- Designed and implemented **Docker** containers to streamline application deployments, facilitating a **40%** faster delivery of features in a **Kubernetes** orchestration environment.\n- Established and maintained **PostgreSQL** databases with a focus on query optimization, achieving a **20%** improvement in data retrieval times.\n- Integrated **Redis** for caching to improve application speed and reduce latency in data access, leading to a **25%** boost in system performance.\n- Led the development of CI/CD pipelines using AWS services, enhancing deployment reliability through rigorous **unit testing** and **integration testing** protocols, thus decreasing errors by **30%**.\n- Collaborated effectively with cross-functional teams to gather requirements and ensure projects met on-time deadlines, increasing stakeholder satisfaction.\n- Conducted comprehensive code reviews and mentoring sessions aimed at improving the code quality and productivity of junior developers by **15%**.\n- Leveraged advanced algorithms for ensuring application reproducibility and reliability across deployments, promoting standards in project management.\n- Created interactive visualizations and reporting tools using cutting-edge libraries for enhanced data interpretation and user engagement."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "Utilized **Python** and **FastAPI** to develop scalable APIs, enhancing system response time by **30%**.\nImplemented **PostgreSQL** for effective data management, improving data retrieval speed by **25%**.\nLeveraged **Docker** to create containerized applications, achieving a **15%** reduction in deployment times and increasing reliability.\nDesigned scalable architecture using **Kubernetes** to orchestrate microservices, improving system availability by **99.9%**.\nIntroduced **Redis** for caching strategies, resulting in a **40%** reduction in database load and improved user experience during high traffic.\nDeployed applications on **AWS**, utilizing various services to enhance performance and scalability.\nImplemented CI/CD pipelines, automating the deployment process and increasing deployment frequency by **50%**.\nConducted unit testing and integration testing to ensure software reliability and adherence to quality standards, with a test coverage goal of **85%**.\nExecuted automated quality assurance processes, reducing bug counts by **20%** before production release.\nChampioned best practices for reliability and reproducibility throughout the development lifecycle, facilitating easier troubleshooting and support."
    }
  ],
  "skills": "**Programming Languages**\n\tPython\n\n**Backend Frameworks**\n\tFastAPI, NodeJS, ExpressJS, NestJS, C#, .NET, Entity Framework, Microservices\n\n**Frontend Frameworks**\n\tHTML, CSS, JavaScript, TypeScript, ReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n**API Technologies**\n\tRESTful API, GraphQL\n\n**Serverless and Cloud Functions**\n\tAWS, Azure\n\n**Databases**\n\tPostgreSQL, MSSQL Server, MySQL, MongoDB, DynamoDB, CosmosDB\n\n**DevOps**\n\tDocker, Kubernetes, CI/CD pipelines\n\n**Cloud & Infrastructure**\n\tAWS, Azure\n\n**Other**\n\tUX/UI Design, Git, GitHub, Redis, Apache Kafka, RabbitMQ, NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest, automated quality assurance, reliability, reproducibility",
  "apply_company": "blackshark.ai"
}