{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Customer Engineer, SAP",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "As a seasoned Full Stack Developer with 8 years of experience, I possess a strong foundation in **SAP**, **S/4HANA**, **BW**, and **BTP** integration, enhancing data governance and quality through scalable solutions. My technical expertise extends to **PaaS**, **Data Lakes**, and robust **database** management, driving improvements in data privacy and facilitating effective data cataloging.\nI thrive in collaborative environments, leveraging my project management skills to implement value-based selling strategies and conducting ROI analysis for clients. My background in machine learning and cloud experience across **Azure** and **AWS** enables me to deliver high-performance solutions that align with enterprise requirements.\nAdditionally, I have led the development of platforms using **JavaScript**, **TypeScript**, **Python**, **Flutter**, **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django** while ensuring compliance with standards like HIPAA and PCI DSS. I have a proven record in CI/CD automation, microservices architecture, and utilizing tools like **MLflow**, **Airflow**, and **Kubeflow** to support machine learning pipelines and MLOps workflows.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Customer Engineer, SAP",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Implemented **SAP** implementations and integrations using **S/4HANA**, **BTP**, and **BW** to enhance enterprise data governance and management.\nDesigned and managed integration solutions that align with **Data Lakes**, ensuring data quality, privacy, and compliance with regulatory standards.\nConducted ROI analysis and value-based selling strategies to drive customer engagement and demonstrate project value in real-time.\nCollaborated with cross-functional teams, leveraging strong communication and project management skills to ensure seamless integration and deployment across platforms.\nDeveloped comprehensive data catalogs to improve data accessibility and foster better decision-making processes within organizations.\nOversaw governance boards to enforce data privacy and quality standards, ensuring the integrity of information systems.\nUtilized **PaaS** solutions to build scalable applications that support office and field staff in real-time data retrieval and usage.\nEngineered innovative solutions for effective data management across various databases, improving data lifecycle management and accessibility.\nProvided technical sales engineering support, communicating effectively with stakeholders to align customer needs with SAP solutions.\nLed project management initiatives that enhanced collaboration between departments, driving successful implementation of enterprise-level solutions."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Led integration of **SAP S/4HANA** and **BW** into financial platforms, enhancing data governance, quality, and privacy across the organization.\nExecuted **data management** strategies to ensure seamless flow and integrity of financial data, aligning with company standards and regulations.\nManaged cross-functional collaboration and communication with stakeholders, ensuring all project goals were met within **project timelines** and contributed to **ROI analysis** of projects.\nDeveloped and implemented **data catalogs** to streamline data accessibility and facilitate the governance of data lakes, improving overall data quality and usability.\nEmploying **BTP** and **PaaS**, drove initiatives to modernize data integration processes, significantly reducing batch processing times by **30%**.\nSupervised governance boards to ensure compliance with data privacy regulations, effectively mitigating risks and enhancing data security protocols.\nCollaborated with sales engineering teams to create value-based selling strategies around new SAP integrations, resulting in a **15%** increase in product adoption rates.\nFacilitated training sessions on **SAP** ecosystems, enhancing team skills in communication and collaboration regarding ongoing projects and technologies."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Leveraged **SAP S/4HANA** and **SAP BW** to integrate data governance practices, enhancing data quality and compliance, and ensuring smooth project delivery for a global e-commerce platform.\nImplemented **BTP** solutions to streamline data cataloging and improve data privacy across multiple systems while applying robust value-based selling strategies to drive business outcomes.\nConducted ROI analysis for project management initiatives, enabling data-driven decision making and validating investment allocations of over **$5M** in technology enhancements.\nCollaborated with cross-functional teams on data management projects, facilitating effective communication and teamwork to ensure alignment with governance boards and stakeholder expectations.\nDesigned and implemented data lakes using **PostgreSQL** and **Cassandra**, ensuring high availability and efficient data retrieval processes for reporting and analytics.\nApplied principles of data privacy to manage sensitive customer information in compliance with regulations, utilizing role-based access control (RBAC) and **OAuth 2.0** for secure application access.\nManaged databases, including **MongoDB** and **Redis**, to support scalability and performance requirements, significantly enhancing application responsiveness by **30%**.\nEmployed project management methodologies to lead integration initiatives, ensuring timely and efficient delivery of solutions across diverse teams.\nActively contributed to communication and collaboration efforts, facilitating stakeholder meetings and driving consensus on project objectives and outcomes."
    }
  ],
  "skills": "**Programming Languages:**\n\tPython, JavaScript, TypeScript\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**API Technologies:**\n\tNginx, Keycloak (OIDC, RBAC), JWT, OAuth2\n\n**Serverless and Cloud Functions:**\n\tAWS (Lambda), Azure (App Services)\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis, Databases\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS (ECS, RDS, S3), Azure (Blob, SQL), PaaS\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, SAP, S/4HANA, BW, BTP, Integration, Data governance, Data catalog, Data quality, Data privacy, Value-based selling, ROI analysis, Project management, Data Management, Governance boards, Sales engineering, Communication, Collaboration",
  "apply_company": "Collibra"
}