{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Sales Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "Results-driven Senior Sales Engineer with 8 years of experience in developing and integrating high-performance solutions, specializing in API development, RESTful services, and data formats like JSON and XML. Skilled in authentication protocols such as OAuth and adept in integrating SaaS applications within healthcare and financial sectors. My technical expertise encompasses a broad **tech stack** including **JavaScript**, **TypeScript**, **Python**, **React**, **Next.js**, **Node.js**, and **Flutter**, coupled with substantial experience in **AWS** and **Azure** cloud environments.\n\nI possess strong communication and collaboration skills, ensuring seamless integration of complex systems and thorough technical documentation. My problem-solving abilities are reinforced by a robust understanding of microservices architecture and event-driven systems, enabling me to deliver effective CRM solutions for diverse clients. Proven track record in leveraging AI/ML capabilities for enhanced analytics and intelligent automation, aligned with compliance standards like HIPAA and PCI DSS.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Sales Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Expertly integrated complex **API** solutions into healthcare and financial platforms utilizing **RESTful** services, ensuring seamless data flow and interaction.\n- Collaborated closely with cross-functional teams to enhance **CRM** systems, utilizing advanced integration techniques and optimizing client communications.\n- Developed and maintained high-quality **Technical Documentation** for system features and enhancements, ensuring clarity and ease of understanding for stakeholders.\n- Demonstrated exceptional **Communication** and **Collaboration** skills, working with sales teams to understand client needs and effectively present technical solutions.\n- Employed strategic **Problem Solving** to address customer challenges, leveraging technical expertise to develop tailored solutions.\n- Developed scalable, full-stack applications using **TypeScript**, **Python (FastAPI)**, **Node.js**, and modern front-end frameworks including **React (17-18)**, **Next.js**, and **Vue (3.x)**, ensuring compliance with industry standards like HIPAA and GDPR.\n- Delivered cross-platform mobile applications utilizing **Flutter** and **React Native**, enhancing user experiences across **iOS** and **Android** with state management frameworks like **Provider** and **Redux**.\n- Implemented efficient CI/CD pipelines with **Fastlane** and **App Center**, leveraging automated testing and release management to maintain high application quality.\n- Spearheaded the transition from monolithic applications to microservices with **Docker**, **Kubernetes (AKS/EKS)**, and **AWS Lambda**, promoting scalability and resilience.\n- Designed cloud-native data architecture using **PostgreSQL**, **MongoDB**, **Redis**, and **GraphQL**, efficiently managing large-scale data for healthcare and financial applications.\n- Deployed machine learning models for predictive analytics in healthcare using **Python** frameworks such as **scikit-learn**, **PyTorch**, and **TensorFlow**, integrating real-time services into backends.\n- Established MLOps pipelines using **MLflow**, **DVC**, and **Apache Airflow** to ensure continuous training and deployment of ML models across environments.\n- Integrated AI-powered features into front-end applications using APIs from **Azure ML** and **AWS Sagemaker**, enhancing user engagement with intelligent capabilities.\n- Implemented enterprise DevOps pipelines with **GitHub Actions**, **Azure DevOps**, and **CircleCI**, ensuring streamlined multi-environment deployments for robust API services.\n- Developed advanced data visualization tools using **D3.js**, **Chart.js**, and **Power BI Embedded**, providing dynamic insights into complex datasets.\n- Worked with data science teams to integrate NLP models leveraging **spaCy** and **Hugging Face Transformers** for document processing and anomaly detection.\n- Established comprehensive testing strategies utilizing **Jest**, **Cypress**, **PyTest**, and **Postman**, ensuring high standards of quality across all development stages.\n- Integrated **Azure Cognitive Search** and **ElasticSearch** to enhance search capabilities across extensive unstructured and structured data sets."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Ensured seamless **API** integration and functionality within financial platforms by utilizing **RESTful** principles, enhancing system interoperability and data sharing across services.\nCollaborated with cross-functional teams to deliver comprehensive technical documentation, enabling clear communication regarding system architecture and integration points for partners and stakeholders.\nImproved client satisfaction through effective collaboration and problem-solving on complex integrations, aligning technical solutions with client needs in a **SaaS** environment.\nLeveraged **JSON** and **XML** for efficient data interchange between systems, optimizing the performance of integration workflows and enhancing user experiences.\nExecuted robust integration strategies for CRM systems, streamlining client data management and enhancing lead tracking through innovative communication solutions.\nFostered collaboration across departments to ensure the successful implementation of solutions, leading to a **15%** increase in customer retention through targeted **AdTech** initiatives.\nUtilized **OAuth** protocols for secure user authentication and authorization in various applications, enhancing security measures and compliance with industry standards.\nConducted training sessions, boosting knowledge sharing and technical understanding within teams, resulting in a **20%** decrease in integration-related support tickets.\nProvided ongoing support and consultation to clients, ensuring smooth onboarding and integration with financial systems, thus driving adoption by over **30%** in the first quarter post-implementation."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Implemented and integrated **RESTful APIs** for seamless communication between multiple systems, enhancing **CRM** functionalities and ensuring smooth **SaaS** integrations.\nDeveloped **technical documentation** for API usage and integration processes, facilitating collaboration between sales and engineering teams and improving internal communication.\nUtilized **OAuth 2.0** for secure authentication in customer-facing applications, ensuring data protection and compliance with industry standards.\nDemonstrated exceptional **problem-solving** skills by rapidly addressing client issues and providing effective solutions that improved user satisfaction by **30%**.\nEngaged in cross-functional **collaboration** with sales, marketing, and product teams to tailor solutions that met client needs, resulting in a **15%** increase in sales during a quarterly campaign.\nConducted in-depth **communication** with clients to gather requirements and provide tailored product demonstrations, enhancing client trust and boosting retention rates by **20%**.\nParticipated in the development of integration modules for various **AdTech** platforms, utilizing **JSON** and **XML** data formats for data interchange, which improved data processing speed by **25%**.\nLead training sessions for clients on utilizing the platform features and integration processes, resulting in improved customer on-boarding and satisfaction levels.\nMonitored and analyzed system performance post-integration, making adjustments that decreased downtime by **40%** and improved user experience significantly."
    }
  ],
  "skills": "Programming Languages:\n\tPython, JavaScript, TypeScript\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tAPI, RESTful, JSON, XML, OAuth\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAuthentication & Security, Keycloak, JWT, OAuth2, Let’s Encrypt, Nginx, Certbot\n\n**Other:**\n\tCRM, Integration, SaaS, AdTech, Technical Documentation, Communication, Collaboration, Problem Solving",
  "apply_company": "Topsort"
}