{
  "name": "Tomasz Lee",
  "role_name": "Fullstack Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-477994390/",
  "profile_summary": "Results-driven Fullstack Engineer with 9+ years of experience in API development and creating web-based applications. Proficient in **React.js** and adept at implementing **Svelte** for responsive and dynamic user interfaces. Proven expertise in **AWS** for deploying cloud applications and leveraging cloud environments to optimize performance. Skilled in continuous integration and continuous deployment (CI/CD) practices, employing effective version control using Git. Experienced in using **logging tools** and **monitoring tools** to enhance application stability. Strong focus on clean code practices and testing strategies to ensure quality and maintainability. Excel at team collaboration, mentoring junior developers, and employing problem-solving skills to drive development projects to completion.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Fullstack Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Apr 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "• Developed and maintained web-based applications using **React.js** and **Svelte** to enhance user engagement and streamline operations.\n• Designed and executed robust API development strategies to facilitate seamless communication between frontend and backend services.\n• Implemented continuous integration and continuous deployment (CI/CD) practices with **Azure DevOps**, achieving a **40%** reduction in deployment time.\n• Engaged in version control using Git to manage code effectively and collaborate efficiently with the team.\n• Utilized logging and monitoring tools to proactively identify and resolve issues, improving system reliability and performance.\n• Applied clean code practices to ensure the maintainability and clarity of code across the codebase.\n• Demonstrated problem-solving and adaptability in fast-paced environments by addressing critical challenges during software development.\n• Collaborated with cross-functional teams to enhance workflows and optimize project outcomes, fostering a strong team collaboration culture.\n• Mentored junior developers to share knowledge and elevate team competencies, ensuring quality coding standards.\n• Created thorough testing strategies to guarantee application performance and user satisfaction, leading to a **25%** improvement in user experience.\n• Integrated **AWS** cloud services for scalability and flexibility in application deployment and management.\n"
    },
    {
      "role": "Full Stack Developer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "Utilized **React.js** and **Svelte** to develop responsive web-based applications, enhancing user experience and engagement by **25%**.\nImplemented robust API development practices with **.NET Core**, ensuring seamless integration with PostgreSQL for real-time data access.\nDesigned and executed CI/CD pipelines using **GitHub Actions**, achieving a **30%** reduction in production deployment errors and streamlining deployment processes.\nEmployed **cloud environments** such as **AWS** for hosting applications, which improved scalability and reliability.\nAdopted testing strategies to ensure code quality, leading to a significant increase in system performance by **25%** through reduced latency via integrated caching solutions with **Redis**.\nMaintained version control using advanced techniques to preserve code integrity and support collaborative development efforts.\nLed initiatives for problem-solving and adaptability in meeting system requirements, ensuring timely project delivery.\nMentored junior developers, fostering team collaboration and enhancing overall operational productivity.\nAnalyzed logging and monitoring tools for system optimization, further driving performance improvements across applications.\nConducted code reviews adhering to clean code practices, effectively enhancing code quality and team learning outcomes."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "- Developed web-based applications using **Svelte** and **React.js**, enhancing user interfaces and functionality to meet client requirements.\n- Implemented API development strategies that improved communication between front-end and back-end services, leading to a **20%** increase in overall system efficiency.\n- Executed continuous integration and continuous deployment (CI/CD) practices in cloud environments like **AWS**, which reduced deployment times by **30%**.\n- Utilized version control systems to streamline collaboration and maintain code integrity across multiple team members, ensuring clean code practices were upheld.\n- Employed logging tools and monitoring tools to proactively identify and resolve issues, enhancing system performance and reliability.\n- Mentored junior developers in testing strategies and problem-solving advancements, fostering a culture of continuous learning and adaptability within the team.\n- Contributed to team collaboration through regular participation in standups and code reviews, ensuring alignment with project goals and coding standards.\n- Improved legacy system performance by successfully migrating components to modern frameworks, thereby optimizing server resources.\n- Created and maintained technical documentation for web applications, facilitating improved knowledge transfer among teams and stakeholders."
    }
  ],
  "skills": " **Programming Languages**\n\t JavaScript, TypeScript, Python, C#, Solidity\n\n **Frontend Frameworks**\n\t ReactJS, NextJS, VueJS, NuxtJS, Angular, Svelte, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n **Backend Frameworks**\n\t NodeJS, ExpressJS, NestJS, .NET, Entity Framework, Microservices\n\n **API Technologies**\n\t RESTful API, GraphQL, API development\n\n **Serverless and Cloud Functions**\n\t AWS, Azure, Cloud environments\n\n **Databases**\n\t MSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB\n\n **DevOps**\n\t CI/CD pipelines, Continuous integration, Continuous deployment, Version control, Git, GitHub\n\n **Cloud & Infrastructure**\n\t AWS\n\n **Other**\n\t Problem-solving, Adaptability, Team collaboration, Mentoring, UX/UI Design, Testing Tools: NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest, Logging tools, Monitoring tools, Clean code practices"
}