{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Full Stack Software Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-187801395/",
  "profile_summary": "Senior Full Stack Software Engineer with 13+ years of experience in delivering high-performance applications in the healthcare and financial sectors. Proficient in **TypeScript**, **ReactJS**, **NodeJS**, and **NestJS**, with demonstrated expertise in developing **RESTful APIs** and managing **PostgreSQL** databases. Adept in **Agile methodologies**, utilizing **Git**, and implementing **CI/CD** processes and **DevOps practices** to streamline development workflows.\nSkilled in both frontend and backend technologies, including **Koa.js**, delivering robust solutions with a focus on scalability and performance. Experienced in deploying cloud-native applications using **AWS**, **Azure**, and **Google Cloud**, ensuring high availability and reliability.\nPossesses strong problem-solving and communication skills, enhanced by a commitment to compliance-driven development aligned with industry standards. Additionally, brings hands-on experience in integrating **AI/ML** solutions to support advanced predictive analytics and real-time processing.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Full Stack Software Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Developed high-performing full-stack applications leveraging **TypeScript**, **ReactJS**, **Node.js**, and **RESTful API** to deliver scalable solutions that meet business requirements.\n• Successfully implemented CI/CD pipelines utilizing **Git**, **DevOps practices**, and cloud services such as **AWS** and **Azure** for automated builds and deployments, achieving a deployment frequency of over **10** times per week.\n• Spearheaded the use of modern frameworks, enhancing productivity by **30%** through Agile methodologies and continuous integration strategies.\n• Engineered data solutions with **PostgreSQL** and other database technologies, ensuring data integrity and high availability for applications supporting a user base of over **50,000**.\n• Employed **Koa.js** for building APIs that improved response times by **20%**, streamlining interactions between front-end and back-end services.\n• Championed cross-functional team collaboration, enhancing communication and problem-solving capabilities that led to the successful delivery of multiple features within tight deadlines.\n• Utilized advanced data visualization tools like **AG Grid** and **Apache Echarts**, driving insights and enabling real-time analytics for user activities and performance metrics.\n• Identified and resolved complex software issues, mitigating risks and ensuring seamless user experiences for applications deployed in production.\n• Drove enhancements in application architecture by applying design patterns that supported scalability and maintainability across various projects.\n• Mentored junior engineers, fostering an environment of continuous improvement and knowledge sharing that increased team productivity."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Utilized **TypeScript** and **ReactJS (18)** to build interactive front-end applications, integrating **Redux Toolkit** and **Tailwind CSS** for responsive financial tools and admin panels.\nDeveloped microservices architecture for core financial platforms using **Node.js (NestJS/Express)** and **Python (FastAPI, Django)**, improving scalability and performance for high-volume transactional systems.\nImplemented RESTful APIs to facilitate seamless communication between front-end and back-end services, ensuring robust data handling and user experience.\nDesigned and delivered real-time analytics dashboards utilizing **React**, **D3.js**, and **Power BI Embedded**, enabling operations teams to access insights into transactions with reduced latency.\nEstablished an event-driven architecture with **Kafka**, **RabbitMQ**, and **Azure Service Bus** to enhance asynchronous communication across workflows, streamlining payments and compliance processes.\nCreated ETL pipelines for ingesting financial data using **Python**, **Apache Airflow**, and **Azure Data Factory**, facilitating both batch and real-time processing, managing **9 TB** of data monthly.\nBuilt and deployed machine learning models for fraud detection with **scikit-learn**, **XGBoost**, and **Azure ML**, improving suspicious activity detection based on user behavior with a **95% accuracy** rate.\nEngineered ML pipelines for real-time credit scoring, churn prediction, and transaction classification using **MLflow** and **Airflow**, integrating model inference into backend services, enhancing operational efficiency.\nAdhered to **Agile methodologies**, ensuring effective communication and collaboration within the development team to deliver projects on time and within scope.\nManaged source control and CI/CD processes using **Git** and **DevOps practices** to maintain high deployment frequency and software quality."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Utilized **TypeScript** to develop robust and maintainable codebases for full stack applications, ensuring adherence to Agile methodologies and fostering collaboration within teams.\nDesigned and implemented scalable **RESTful APIs** using **Node.js** (specifically **NestJS** and **Koa.js**) for seamless integration with various services and a high-quality user experience.\nEngineered frontend solutions using **ReactJS** to create dynamic and responsive interfaces, enhancing user engagement and satisfaction.\nManaged database systems utilizing **PostgreSQL**, ensuring efficient data retrieval processes and maintaining data integrity across applications.\nApplied **Git** for version control, fostering a collaborative environment and maintaining a streamlined workflow in the development process.\nImplemented CI/CD pipelines to automate deployment processes, leveraging **DevOps practices** to ensure smooth integration and delivery.\nCollaborated within **Agile** frameworks, enhancing team dynamics and achieving project milestones effectively.\nMigrated legacy systems to cloud environments using **AWS**, **Azure**, and **Google Cloud** to improve scalability and maintainability, optimizing application performance.\nExecuted data visualization tasks utilizing **AG Grid** and **Apache Echarts** to create interactive dashboards that enhanced data analysis abilities for stakeholders.\nExecuted efficient problem-solving strategies to troubleshoot complex issues, resulting in a 30% reduction in downtime and improved application reliability.\nEnhanced product delivery speed by implementing Agile workflows, achieving a 25% faster release cycle within the development team.\nMaintained clear communication channels with stakeholders to gather requirements, providing regular updates on project progress and ensuring alignment with business goals."
    }
  ],
  "skills": "**Programming Languages:**\n\tPython\n\tTypeScript\n\tJavaScript\n\n**Frontend Frameworks:**\n\tReact\n\tReactJS\n\tVue\n\tAngular\n\tAG Grid\n\tApache Echarts\n\n**Backend Frameworks:**\n\tFastAPI\n\tFlask\n\tDjango\n\tNodeJS\n\tNestJS\n\tKoa.js\n\n**API Technologies:**\n\tRESTful API\n\n**Databases:**\n\tPostgreSQL\n\tMySQL\n\tMongoDB\n\tRedis\n\n**DevOps:**\n\tDocker\n\tKubernetes\n\tGit\n\tGitHub Actions\n\tGitLab CI/CD\n\tCI/CD\n\tDevOps practices\n\n**Cloud & Infrastructure:**\n\tAWS\n\tAzure\n\tGoogle Cloud\n\n**Serverless and Cloud Functions:**\n\tECS\n\tLambda\n\n**Other:**\n\tAgile methodologies\n\tMLflow\n\tAirflow\n\tKubeflow\n\tProblem-solving\n\tCommunication\n\tTerraform\n\tAnsible\n\tHelm\n\tDocker Compose\n\tKeycloak (OIDC, RBAC)\n\tOAuth2\n\tJWT\n\tNginx\n\tLet’s Encrypt\n\tCertbot\n\tS3\n\tApp Services\n\tBlob Storage\n\tSQL Database"
}