{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Frontend Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Senior Frontend Engineer with over 13 years of experience delivering high-performance applications in fintech and healthcare. Proficient in **TypeScript**, with extensive expertise in **React** and **React Native** for cross-platform development, demonstrating strong skills in secure authentication, including **WebAuthn** and clean architecture. Skilled in applying UX principles to create intuitive user interfaces and enhance user experiences. Adept in mobile development, utilizing SDKs and implementing collaborative strategies for effective communication within teams.\n\nAdditionally, I have hands-on experience in backend technologies such as **Node.js**, **FastAPI**, and **Django**, with a strong foundation in building AI/ML-powered platforms that leverage predictive analytics. I have deployed cloud-native systems on **AWS** and **Azure**, successfully implementing microservices, event-driven architectures, and CI/CD pipelines. I ensure compliance with industry standards, including HIPAA and PCI DSS, while also having a robust background in MLOps, focusing on model training and orchestration using **MLflow** and **Airflow**.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Frontend Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Leveraged **TypeScript** and **ReactNative** to design and implement secure, cross-platform mobile applications for fintech, ensuring compliance with secure authentication practices.\n- Focused on user experience (UX) by integrating seamless **clean architecture** into the application design, resulting in a 25% improvement in user satisfaction metrics.\n- Developed collaborative front-end components using React and cross-platform development techniques, resulting in a 30% reduction in development time.\n- Engaged in mobile development best practices, utilizing SDKs for integration with third-party services while maintaining a consistent user interface across platforms.\n- Championed the adoption of **WebAuthn** and other secure authentication methods, enhancing application security and contributing to a 40% decrease in security incidents.\n- Utilized effective communication skills to collaborate with cross-functional teams, ensuring alignment on project goals and timely delivery of features, achieving an on-time project delivery rate of 95%.\n- Spearheaded the creation of robust testing strategies to ensure quality assurance, leveraging tools such as Jest and Cypress for unit and integration testing.\n- Engaged actively in code reviews, contributing to improved code quality and team knowledge sharing across the engineering team.\n- Delivered multiple iterations of high-quality, user-centric designs, incorporating feedback from stakeholders and end-users to improve functionality and enhance user engagement.\n- Drove innovation by exploring and integrating new technologies and frameworks to optimize application performance and user experience."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Utilized **TypeScript** and **React (18)** to build engaging, user-friendly front-end applications for fintech platforms, ensuring a seamless user experience (UX) across devices.\nEmployed **clean architecture** principles to create maintainable and scalable code, enhancing development efficiency for high-performance finance applications.\nImplemented **responsive design** techniques and **cross-platform development** strategies, ensuring optimal performance and functionality on both web and mobile platforms.\nCollaborated with cross-functional teams to establish secure authentication practices, including **WebAuthn** integration, enhancing application security and user trust.\nCommunicated effectively with stakeholders to gather requirements and provide updates, fostering a collaborative environment for enhanced project outcomes.\nDeveloped and maintained SDKs for external integrations, streamlining connectivity with third-party fintech services, which helped accelerate development times by **30%**.\nLed a team of junior developers, providing mentorship and guidance to foster skill development and improve team productivity by **25%**.\nConducted user testing and iterations to refine UI components based on feedback, resulting in a **15%** increase in user satisfaction metrics.\n"
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Developed responsive frontend applications using **TypeScript**, **ReactNative**, and clean architectural principles to deliver optimal user experiences while ensuring seamless integrations with backend services.\nCollaborated in a cross-functional team environment to align on UI/UX design principles that enhance user engagement and streamline interactions within the fintech domain.\nEngineered secure authentication mechanisms leveraging **WebAuthn** and best practices in secure authentication, ensuring safe access across mobile and web platforms.\nUtilized SDKs to facilitate rapid mobile development, enhancing the efficiency and effectiveness of app features while adhering to a mobile-first strategy.\nImplemented collaborative tools and techniques to improve team communication, resulting in a **25%** increase in project delivery speed through effective task management and regular standup meetings.\nOptimized application performance by applying clean architecture patterns, which improved code maintainability and reduced bug count by **15%** in production.\nDesigned and executed cross-platform development solutions that decreased deployment time by **30%** through streamlined code sharing practices.\nConducted regular UX testing sessions to gather feedback on mobile and web experiences, applying results to refine functionality and interface design, leading to a **20%** improvement in user satisfaction ratings.\nActively participated in code reviews, fostering an environment of continuous learning and knowledge sharing among team members to enhance collaborative efforts."
    }
  ],
  "skills": "  **Programming Languages:**\n\tPython, TypeScript, JavaScript\n\n  **Frontend Frameworks:**\n\tReact, Angular, Vue, ReactNative\n\n  **Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n  **API Technologies:**\n\tWebAuthn, secureAuthentication\n\n  **Serverless and Cloud Functions:**\n\tAWS: Lambda, Azure: App Services\n\n  **Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n  **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD\n\n  **Cloud & Infrastructure:**\n\tAWS: ECS, RDS, S3, Azure: Blob Storage, SQL Database, Terraform, Ansible, Helm, Docker Compose\n\n  **Other:**\n\tMLflow, Airflow, Kubeflow, UX, cleanArchitecture, crossPlatformDevelopment, SDKs, mobileDevelopment, collaborative, communication, Keycloak (OIDC, RBAC), OAuth2, JWT, Nginx, Let’s Encrypt, Certbot, fintech",
  "apply_company": "Career Renew"
}