{
  "name": "Mariusz Jan Skobel",
  "role_name": "Quality Assurance Engineer",
  "email": "mariuszskobel15@outlook.com",
  "phone": "+48 735 343 548",
  "address": "Katowice, Poland",
  "linkedin": "https://www.linkedin.com/in/mariusz-skobel-789557397/",
  "profile_summary": "Quality Assurance Engineer with over 10 years of experience in delivering high-quality software solutions, specifically in mobile and web applications using **C#**, **Java**, and **Unity**. Proficient in **Automated Testing**, including expertise in tools such as **Unity Test Runner**, **Kobiton**, and **AWS Device Farm**. Strong focus on CI/CD processes with hands-on experience in **Jenkins** and **Azure DevOps** for maintaining seamless integration and deployment workflows. Demonstrated ability to troubleshoot complex issues and collaborate effectively within cross-functional teams, fostering a culture of communication and problem-solving.\nBrings deep knowledge in **QA methodologies** and a practical understanding of **Visual Testing** to ensure system reliability. Proven track record in developing effective testing strategies for both **iOS** and **Android** platforms. Passionate about enhancing product quality and driving continuous improvement to meet compliance and performance standards.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2012",
      "to_year": "2015",
      "location": "UK",
      "university": "University of Bristol"
    }
  ],
  "experience": [
    {
      "role": "Quality Assurance Engineer",
      "company": "EitBiz",
      "from_date": "Oct 2022",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "•\tImplemented automated testing strategies for cross-platform mobile applications in **iOS** and **Android** environments, using tools such as **Unity Test Runner**, **Kobiton**, and **AWS Device Farm** to ensure high-quality user experiences.\n•\tEnhanced CI/CD pipelines through **Jenkins** and **Azure DevOps**, facilitating continuous integration and delivery, resulting in a **30%** increase in deployment efficiency across multiple projects.\n•\tCollaborated with development teams to troubleshoot and resolve complex issues in real-time, ensuring smooth application performance across all devices and platforms.\n•\tDeveloped comprehensive visual testing frameworks using **Automated Testing** methodologies, effectively reducing the error rate by **25%** in production releases.\n•\tDesigned and executed test strategies covering functional, integration, and end-to-end tests, using tools like **Cypress** and **Postman**, to maintain robust application reliability.\n•\tFostered clear communication and collaboration among cross-functional teams to address and resolve service disruptions and implement resolutions efficiently.\n•\tUtilized **Azure DevOps** for effective tracking of test coverage and bug reporting, leading to improved visibility and accountability in the testing process.\n•\tEngaged in problem-solving initiatives by developing troubleshooting guides and training materials, enhancing team capability to address issues quickly.\n•\tRegularly contributed feedback to enhance product features and usability through thorough testing and requirement analysis, driving user satisfaction and product value."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Tvn S.A.",
      "from_date": "Oct 2019",
      "to_date": "Sep 2022",
      "location": "Poland",
      "responsibilities": "Executed comprehensive automated testing strategies utilizing **C#**, **Jenkins**, and **Azure DevOps** to ensure the highest quality and reliability of applications across different platforms, including iOS and Android.\nCollaborated with cross-functional teams to enhance communication and streamline the **CI/CD** pipeline process, reducing deployment times by **30%**.\nDeveloped and maintained testing frameworks with **Unity Test Runner** and **Kobiton** for mobile applications, improving test coverage by **50%**.\nImplemented visual testing techniques to identify UI inconsistencies and defects across diverse browsers and devices, ensuring an optimal user experience.\nUtilized troubleshooting skills to diagnose and resolve complex issues in applications, improving overall system performance by analyzing logs and user feedback.\nParticipated in team meetings to foster collaboration, sharing insights and practices to adopt best testing procedures across projects.\nDesigned and executed test cases, ensuring robust testing processes that comply with established quality standards and requirements.\n"
    },
    {
      "role": "Software Engineer",
      "company": "Timspark",
      "from_date": "Sep 2015",
      "to_date": "Aug 2019",
      "location": "UK",
      "responsibilities": "Executed automated testing strategies to enhance quality assurance processes in mobile applications developed for **iOS** and **Android** platforms, increasing test coverage by **30%** and reducing bug report turnaround time by **25%**.\nFacilitated continuous integration/continuous deployment (CI/CD) pipelines leveraging **Jenkins** and **Azure DevOps**, improving deployment efficiency and achieving a **15%** reduction in release time.\nUtilized **Unity** and **C#** for automated testing scenarios within game development, achieving consistent pass rates over **90%** in regression tests.\nEmployed **AWS Device Farm** and **Kobiton** for testing applications across multiple devices, ensuring compatibility and high performance across **20+** device configurations.\nImplemented visual testing practices to identify UI discrepancies quickly using various automation tools, increasing visual defect detection by **40%**.\nCollaborated cross-functionally with development teams to troubleshoot and communicate issues effectively, resulting in a **50%** improvement in issue resolution time.\nConducted thorough problem-solving sessions to address test failures and enhance testing strategies, contributing to a more robust product release cycle.\nEngaged in ongoing training sessions to advance expertise in **Unity Test Runner** and best practices in test automation, fostering a culture of continuous improvement within the QA team.\nSupported release management by developing and executing comprehensive test cases, ensuring each software iteration is free from critical defects before deployment."
    }
  ],
  "skills": "Programming Languages:\n\tC#, Java, Python, JavaScript, TypeScript\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tKeycloak, JWT, OAuth2\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Jenkins, CI/CD, Azure DevOps\n\n**Cloud & Infrastructure:**\n\tTerraform, Ansible, Helm, Docker Compose\n\n**Other:**\n\tArtificial Intelligence, Machine Learning, MLflow, Airflow, Kubeflow, iOS, Android, Device Farms, AWS Device Farm, Kobiton, Unity, Unity Test Runner, Automated Testing, Visual Testing, Troubleshooting, Communication, Collaboration, Problem Solving, Nginx, Certbot"
}