{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Solutions Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-623a26390/",
  "profile_summary": "Results-driven Solutions Engineer with over 13 years of expertise in delivering high-performance SaaS applications, specializing in cloud platforms such as **AWS**, **Azure**, and **GCP**. Proficient in building dynamic API workflows and conducting technical proof of concepts. Adept at using **GitHub**, **BitBucket**, and **GitLab** for version control and collaboration on software development projects. \n\nSkilled in JavaScript/TypeScript, Python, and Flutter, with hands-on experience in both frontend and backend development utilizing **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**. Experienced in refining AI/ML-powered platforms that enhance predictive analytics and real-time processing. \n\nExpert in compliance-driven development, ensuring adherence to standards such as HIPAA, FHIR, PCI DSS, and SOC 2. Possesses a strong foundation in MLOps with tools like **MLflow**, **Airflow**, and **Kubeflow**. Recognized for impactful communication, collaboration, a solutions-oriented mindset, and a relentless curiosity to drive innovative solutions.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Solutions Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Implemented **SaaS** solutions leveraging **AWS**, **GCP**, and **Azure** to optimize cloud architecture and scalability for healthcare and fintech platforms.\nDeveloped **API workflows** that integrated seamlessly with existing applications, ensuring high performance and reliability across both back-end and front-end technologies like **FastAPI**, **React (17-18)**, and **Node.js**.\nProduced technical proof of concepts to validate new features and enhance user experience while adhering to compliance regulations such as HIPAA and GDPR.\nConducted competitive research to identify market trends and customer needs, utilizing findings to inform product strategy and feature development.\nPrepared thorough technical documentation to guide internal teams and facilitate effective communication of project objectives and progress.\nFostered impactful communication and collaboration among cross-functional teams, ensuring alignment and transparency throughout the project lifecycle.\nDemonstrated a solutions-oriented mindset by addressing challenges in real-time mobile application development for iOS and Android using **Flutter** and **React Native**, including the integration of native modules.\nManaged and optimized CI/CD pipelines using **GitHub**, **BitBucket**, and **GitLab**, implementing effective release strategies and automation practices to enhance deployment efficiency.\nDesigned and built advanced data visualization tools using **D3.js**, **Chart.js**, and **Power BI Embedded**, achieving real-time analytics capabilities for financial and healthcare data, with insights presented in **GraphQL** queries.\nCultivated a culture of curiosity within the team, encouraging continuous learning and skill enhancement through engagement with modern technologies and best practices.\n"
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Leveraged cloud services such as **AWS**, **Azure**, and **GCP** to design and implement scalable SaaS solutions that meet customer needs and expectations.\nCollaborated with cross-functional teams to develop API workflows and technical proof of concepts, ensuring seamless integration of various tools and services.\nConducted competitive research to identify industry trends and best practices, providing insights that drive innovation and efficiency in solution development.\nCreated and maintained comprehensive technical documentation to facilitate knowledge sharing and enhance team collaboration and communication skills.\nUtilized **GitHub**, **BitBucket**, and **GitLab** for version control and collaboration on software projects, boosting team productivity by **30%** through effective workflow management.\nEngaged with clients to understand their requirements, demonstrating impactful communication and solutions-oriented mindset to design tailored solutions that solve real business challenges.\nExecuted the migration of core financial platforms utilizing **Node.js**, **Python**, and HTML5, leading to a **40%** improvement in system performance and reliability.\nDesigned interactive dashboards using **React** and **Power BI Embedded**, resulting in a **20%** reduction in data retrieval time and improved user engagement.\nDeveloped ETL pipelines using **Apache Airflow** and **Azure Data Factory** for financial data ingestion, achieving a throughput of over **1 million** records per day with real-time processing capabilities.\nImplemented machine learning models with **scikit-learn** and **XGBoost** for fraud detection, resulting in a **15%** decrease in false positives compared to traditional methods."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Developed and integrated **API workflows** for cloud applications in a **SaaS** environment, optimizing performance and ensuring seamless connectivity with third-party services, alongside utilizing **AWS**, **GCP**, and **Azure** for robust infrastructure management.\nConducted **technical proof of concepts** to assess and demonstrate the efficacy of new technologies and solutions, leveraging **GitHub**, **BitBucket**, and **GitLab** for version control and collaboration.\nEngaged in **competitive research** to identify emerging trends and opportunities within the market, enabling informed decision-making and strategic planning for product enhancements.\nCreated and maintained comprehensive **technical documentation**, ensuring clarity and consistency in communication across teams, and facilitating smooth transitions during project handovers.\nEmphasized **impactful communication** skills, collaborating effectively with diverse teams to drive project success and foster an inclusive work environment.\nExhibited a **solutions-oriented mindset** by tackling complex challenges with innovative approaches, utilizing **Okta** and **Entra ID** for enhanced security and user management solutions.\nMaintained a strong sense of **curiosity**, continuously exploring new technologies and methodologies to improve processes and deliver exceptional results.\nEngineered backend services for a global e-commerce platform focusing on **high availability**, low latency, and scalability using **Python** (**FastAPI**, **Django**) and **Node.js** (**NestJS**, **Express**).\nImplemented real-time features using **WebSockets** and an event-driven architecture powered by **Kafka** and **RabbitMQ**, optimizing customer interaction and responsiveness.\nDeveloped frontend applications using **React** (**18**), **Vue 3**, and **Angular**, enhanced with **TypeScript**, delivering robust user experiences.\nLeveraged **MongoDB**, **PostgreSQL**, **Redis**, and **Cassandra** for efficient data handling and performance optimization, particularly in high-traffic scenarios."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython: FastAPI, Flask, Django\n\tJavaScript/TypeScript: React, Vue, Angular\n\n**Backend Frameworks:**\n\t\n\n**Frontend Frameworks:**\n\t\n\n**API Technologies:**\n\tAPI workflows\n\n**Serverless and Cloud Functions:**\n\tAWS: ECS, Lambda, RDS, S3\n\tGCP\n\tAzure: App Services, Blob Storage, SQL Database\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare)\n\tMongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes\n\tGitHub Actions, GitLab CI/CD\n\tGitHub, BitBucket, GitLab\n\tCI/CD & Infrastructure as Code:\n\tTerraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS\n\tAzure\n\n**Other:**\n\tSaaS\n\tOkta\n\tGoogle Workspace\n\tEntra ID\n\tTechnical proof of concepts\n\tCompetitive research\n\tTechnical documentation\n\tImpactful Communication\n\tCollaboration\n\tCuriosity\n\tSolutions-Oriented Mindset"
}