{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Results-driven Senior Engineer with 13+ years of experience in delivering innovative engineering solutions. Proven expertise in AutoCAD and 3D modeling, complemented by solid competencies in FEA software for advanced structural analysis. Highly skilled in conducting load calculations and creating comprehensive load charts essential for the rigorous demands of projects. Proficient in utilizing MS Office for project documentation and reporting, ensuring streamlined communication and organization.\nDemonstrated capability in rigging equipment and crane requirements, ensuring compliance with industry safety standards. A collaborative team player with a strong foundation in high-performance application development across various industries, including healthcare and finance, leveraging technologies such as **JavaScript**, **TypeScript**, **Python**, **Flutter**, **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django** for seamless project execution.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Applied **AutoCAD** and advanced **3D modeling** techniques to design innovative engineering solutions that meet complex project requirements.\n- Conducted thorough **load calculations** and developed detailed **load charts** to ensure compliance with safety and engineering standards, enhancing project accuracy by up to **30%**.\n- Utilized **FEA software** to perform finite element analysis, improving structural integrity assessments and reducing design errors by **25%**.\n- Managed and implemented rigorous equipment specifications for **rigging equipment** and **crane requirements**, ensuring alignment with engineering best practices and safety regulations across **100+** projects.\n- Collaborated with cross-functional teams to integrate engineering designs with project plans, leading to on-time project delivery for **95%** of assignments.\n- Developed comprehensive documentation and training materials using **MS Office**, boosting team efficiency and knowledge transfer within the organization.\n- Streamlined design processes, resulting in a reduction of project completion times by an average of **15%**, enhancing overall client satisfaction.\n- Mentored junior engineers in advanced engineering concepts and applications, fostering skill development and supporting a high-performance work culture."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Leveraged **AutoCAD** to create detailed 3D models for complex engineering designs, ensuring precision and compliance with industry standards.\nPerformed finite element analysis (FEA) using advanced **FEA software**, validating structural integrity and optimizing designs for performance under load conditions.\nUtilized **MS Office** suite for project documentation, reporting, and effective communication among cross-functional teams, enhancing workflow and project transparency.\nConducted load calculations and developed comprehensive load charts to assess crane requirements, ensuring safety and efficiency in equipment operation across various projects.\nImplemented innovative rigging equipment strategies to manage heavy loads effectively, minimizing risk and maximizing operational capabilities on-site.\nCollaborated with multidisciplinary teams to refine designs, leading to a **30%** reduction in overall project costs and a **20%** improvement in delivery timelines.\nMentored junior engineers and interns, fostering skill development in 3D modeling and structural analysis, thereby enhancing the team's expertise and productivity."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "• Utilized **AutoCAD** for precise 3D modeling and design of engineering prototypes, ensuring compliance with **crane requirements** and optimizing space utilization in projects.\n• Conducted comprehensive load calculations and created detailed load charts using advanced **FEA software** to validate structural integrity and safety of design proposals.\n• Developed and executed strategies around rigging equipment, focusing on achieving optimal load distribution and safety protocols during lifting operations.\n• Collaborated with cross-functional teams to leverage **MS Office** tools for effective project documentation, reporting, and data analysis, improving project visibility by **30%**.\n• Performed rigorous assessments of rigging systems to guarantee adherence to industry standards, enhancing efficiency during heavy lifts and streamlining operations by **15%**.\n• Spearheaded the integration of innovative design solutions that improved workflow efficiency, resulting in a **20%** reduction in project turnaround time.\n• Mentored junior engineers in the use of **AutoCAD** and **3D modeling**, fostering skills development and ensuring high-quality deliverables across teams."
    }
  ],
  "skills": "**Other**\n\tAutoCAD, 3D modeling, FEA software, MS Office, rigging equipment, crane requirements, load calculations, load charts\n\n**Programming Languages**\n\tPython: FastAPI, Flask, Django\n\tJavaScript/TypeScript: React, Vue, Angular\n\n**Backend Frameworks**\n\t\n\n**Frontend Frameworks**\n\t\n\n**API Technologies**\n\t\n\n**Serverless and Cloud Functions**\n\tAWS: ECS, Lambda, RDS, S3\n\tAzure: App Services, Blob Storage, SQL Database\n\n**Databases**\n\tPostgreSQL (Fintech), MySQL (Healthcare)\n\tMongoDB (Gaming), Redis\n\n**DevOps**\n\tDocker, Kubernetes\n\tGitHub Actions, GitLab CI/CD\n\tCI/CD & Infrastructure as Code: Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure**\n\t\n\n**Authentication & Security**\n\tKeycloak (OIDC, RBAC), OAuth2, JWT\n\tNginx, Let’s Encrypt, Certbot",
  "apply_company": "Omega Morgan, Inc."
}