{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Intune Engineer / Intune & Autopilot Lead",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-karol-kotlinski-bb2520397/",
  "profile_summary": "As a highly skilled Senior Intune Engineer with 8 years of experience, I excel in Microsoft Intune and Autopilot solutions for iOS and Windows device management. My expertise encompasses device provisioning, lifecycle management, and imaging processes, ensuring efficient deployment and reinstallation procedures. I am proficient in MDM frameworks and have extensive knowledge of patching strategies, enabling me to maintain compliance and optimize performance.\n\nI possess strong documentation skills and a solid understanding of change management practices, contributing to effective service ownership and streamlined operations. My technical background also includes a unique blend of full-stack development, leveraging technologies such as **JavaScript/TypeScript**, **Python**, **React**, **Next.js**, **Node.js**, **FastAPI**, and **Django**. Additionally, I have hands-on experience with cloud services, specifically **Azure** and **AWS**. My ability to lead initiatives combines technical expertise with strategic insight, positioning me as a valuable asset in modern enterprise environments.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Intune Engineer / Intune & Autopilot Lead",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Managed the **device provisioning** process using **Microsoft Intune** and **Autopilot**, ensuring streamlined **imaging** and **device reinstallation** for over **500** devices per month.\n- Oversaw the **Windows device lifecycle** management, including timely **patching** and updates, contributing to a **30%** reduction in device-related incidents.\n- Implemented and optimized **MDM** solutions for **iOS device management**, resulting in improved compliance and security for **200+** mobile devices.\n- Developed comprehensive **documentation skills** for all **change management** processes, ensuring clarity and adherence to organizational policies.\n- Led the integration of **JAMF** into existing systems for enhanced management of Apple devices, achieving a seamless deployment in a timeframe of **6 weeks**.\n- Acted as a point of contact for **service ownership**, coordinating with cross-functional teams to enhance **device provisioning** workflows and improve user satisfaction ratings by **15%**.\n- Conducted training sessions on **Microsoft Intune** features and best practices, successfully increasing team proficiency and reducing onboarding time by **20%**.\n- Collaborated with stakeholders to refine device management strategies that align with corporate objectives while maintaining stable service delivery for all **iOS** and **Windows** devices."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Ensured effective **device provisioning** and management through **Microsoft Intune** and **Autopilot**, optimizing the setup and lifecycle of over **500 devices** across the organization.\nOversaw **iOS device management** utilizing **MDM** solutions to streamline workflows, achieving a **20%** reduction in setup time and enhancing user satisfaction.\nExpertly handled **Windows device lifecycle** processes, including **imaging** and **device reinstallation**, ensuring minimal downtime and efficient resource utilization during changes.\nImplemented comprehensive **patching** strategies to maintain compliance and security across all managed devices, resulting in a **15%** decrease in vulnerabilities.\nDeveloped and maintained detailed **documentation skills** for device management processes, aligning with best practices for **change management** while ensuring consistency and clarity for team members.\nActively contributed to **service ownership**, enhancing responsiveness to incidents and requests while improving overall service delivery metrics by **30%**.\nFostered effective communication in **English** across all technical documentation and stakeholder interactions, ensuring clarity and understanding in implementations and updates."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Demonstrated service ownership and change management capabilities by leading the deployment and management of iOS devices using **Microsoft Intune** and **Autopilot**, ensuring smooth device provisioning and lifecycle management across more than **500** devices.\nExecuted imaging and reinstallation processes, optimizing device setup times by **30%**, and enhancing overall user satisfaction within the organization.\nManaged patching for Windows devices, maintaining an up-to-date environment and improving security across the lifecycle by reducing vulnerabilities by **25%** through effective practices and timely updates.\nDeveloped comprehensive documentation for MDM processes, ensuring clear communication and adherence to best practices, which improved team onboarding times by **40%**.\nUtilized **JAMF** for advanced iOS device management, creating tailored workflows for app deployment and system updates to enhance device performance and operational efficiency.\nImplemented effective device management strategies that improved the overall efficiency of Windows device lifecycle processes, reducing downtime incidents by **15%** through rigorous monitoring and proactive support.\nCoordinated with cross-functional teams to ensure all device-related changes were smoothly communicated and executed, significantly improving the user experience and minimizing disruptions.\nMaintained a high level of English communication, ensuring all stakeholders were informed of status changes, updates, and incident reports in a timely manner."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, JavaScript, TypeScript\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n **Frontend Frameworks:**\n\tReact, Vue, Angular\n\n **API Technologies:**\n\t\n\n **Serverless and Cloud Functions:**\n\tAWS (Lambda), Azure (App Services)\n\n **Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:**\n\tAWS (ECS, RDS, S3), Azure (Blob, SQL)\n\n **Other:**\n\tKeycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, CI/CD, Microsoft Intune, Autopilot, iOS device management, MDM, JAMF, Windows device lifecycle, device provisioning, imaging, device reinstallation, patching, documentation skills, change management, service ownership, English"
}