{
  "name": "Sebastian Lukasz Nowak",
  "role_name": "Senior Solutions Engineer",
  "email": "sebastiannowak425@outlook.com",
  "phone": "+48 732 489 778",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/sebastian-nowak-756157396/",
  "profile_summary": "Results-driven Senior Solutions Engineer with 8 years of full-stack development experience, adept in building high-performance applications leveraging **JavaScript**, **TypeScript**, and **REST API** integration. Proficient in cloud technologies with a strong background in **Azure** and **AWS**, I excel at developing scalable solutions that incorporate advanced AI functionalities. My technical acumen includes utilizing **Git** for version control, delivering innovative solutions using tools like **N8N**, **ChatGPT**, **Claude**, and **Cursor** to enhance system capabilities.\n\nIn the healthcare and financial sectors, I have successfully led the development of enterprise-grade platforms with a focus on AI/ML integration for enhanced real-time analytics and intelligent automation. My experience with **microservices architecture**, event-driven systems, and CI/CD automation ensures robust, secure applications that comply with standards including HIPAA and PCI DSS. I am committed to ongoing problem-solving and creativity, driving project goals with empathy and proactivity.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "",
      "from_year": "2001",
      "to_year": "2006",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Solutions Engineer",
      "company": "DeepInspire",
      "from_date": "Oct 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Developed and implemented robust **REST API** solutions using **TypeScript** and **JavaScript**, ensuring high performance and scalability for enterprise applications.\n• Designed and executed complex machine learning solutions, leveraging **AI** technologies and tools to drive innovative outcomes in user experiences and problem-solving strategies.\n• Utilized version control with **Git** for source code management, enhancing collaboration within project teams and ensuring clear documentation of changes.\n• Deployed and integrated various third-party tools to streamline workflows, enhancing productivity in alignment with project goals, including **N8N** for automation and integrations.\n• Implemented rigorous testing methodologies using frameworks such as Jest and Cypress to ensure code quality and application reliability across all platforms.\n• Collaborated with cross-functional teams to incorporate **AI** capabilities such as **ChatGPT** and **Claude**, enriching client-facing features and enhancing user engagement through personalized solutions.\n• Spearheaded creative solutions using **Problem Solving** and **Creativity** to address complex technical challenges and meet business objectives in a timely manner.\n• Emphasized **Proactivity** by identifying potential issues before they escalated, leading to smoother project executions and adherence to deadlines.\n• Fostered a **Goal-centered** approach within the team, driving efforts toward achieving project milestones and enhancing overall team performance.\n• Delivered clear communication and demonstrated **Empathy** when working with clients and stakeholders, ensuring their needs were met effectively while establishing trust and collaboration."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Britenet",
      "from_date": "Sep 2015",
      "to_date": "Sep 2021",
      "location": "Poland",
      "responsibilities": "• Designed and developed scalable microservices using **Node.js** (NestJS/Express) and **Python** (FastAPI, Django) to enhance platform performance and support high-volume transactions, resulting in a **40%** increase in throughput.\n• Built engaging front-end applications with **React** (18), **Vue 3**, **Next.js**, and **TypeScript**, leveraging **Redux Toolkit** and **Tailwind CSS** to achieve a **30%** improvement in user interface responsiveness and performance.\n• Developed real-time dashboards for transaction monitoring using **React**, **D3.js**, and **Power BI Embedded**, providing operational teams with insights that reduced anomaly detection time by **25%**.\n• Integrated **Kafka**, **RabbitMQ**, and **Azure Service Bus** to create a resilient event-driven architecture for efficient handling of transactions and alerts, ensuring a seamless compliance workflow with minimized latency.\n• Built and orchestrated ETL pipelines employing **Python**, **Apache Airflow**, and **Azure Data Factory**, facilitating real-time ingestion and processing of financial data from both internal and third-party systems.\n• Implemented AI/ML-driven fraud detection solutions using **scikit-learn**, **XGBoost**, and **Azure Machine Learning**, achieving a **90%** accuracy rate in identifying suspicious activities based on transaction patterns.\n• Created comprehensive ML pipelines for credit scoring and churn prediction with **MLflow** and **Airflow**, integrating model predictions into backend services for **real-time decision-making** and enhancing customer experience."
    },
    {
      "role": "Software Engineer",
      "company": "Binary Studio",
      "from_date": "Jan 2007",
      "to_date": "Aug 2015",
      "location": "UK",
      "responsibilities": "Implemented AI-driven solutions leveraging **ChatGPT**, **Claude**, and **Cursor** to enhance user interactions and automate customer support scenarios, driving increased user satisfaction and engagement.\nEngineered robust solutions utilizing **JavaScript**, **TypeScript**, and REST API protocols to develop scalable services that cater to millions of users, ensuring efficient backend functionality on high-demand applications.\nUtilized **Git** for effective version control and collaboration across cross-functional teams, maintaining an organized and efficient codebase that supports a fast-paced development cycle.\nDesigned and optimized backend services for a global e-commerce platform using **Python (FastAPI, Django)** and **Node.js (NestJS, Express)**, ensuring high availability, low latency, and scalability across key modules like checkout and order fulfillment.\nDeveloped and deployed frontend applications using **React (18)**, **Vue 3**, and **Angular**, enhanced with **TypeScript**, **Redux Toolkit**, and **Tailwind CSS**, delivering fast, responsive user experiences on both web and mobile platforms.\nLeveraged **MongoDB**, **PostgreSQL**, **Redis**, and **Cassandra** for distributed data storage, ensuring fast, fault-tolerant data access for high-traffic e-commerce workflows with a focus on performance improvement.\nIntegrated AI/ML-based recommendation engines using **scikit-learn**, **LightGBM**, and **TensorFlow** to personalize product listings and optimize search relevance, increasing conversion rates by over **15%** based on real-time behavioral data.\nImplemented caching strategies utilizing **Redis** for product metadata and shopping cart sessions, significantly improving application responsiveness and reducing database read pressure by **40%**.\nFacilitated controlled rollouts and A/B testing implementing feature flags and blue-green deployments using **LaunchDarkly** and **Kubernetes**, ensuring a risk-free upgrade path during major platform updates.\nCreated responsive, SEO-friendly retail interfaces utilizing **Next.js**, **Vue 3 + Nuxt**, and HTML5/CSS3, optimized for mobile-first engagement and ensuring compliance with accessibility standards (WCAG **2.1**).\nBuilt secure payment processing workflows integrated with **Stripe**, **PayPal**, and **Razorpay**, ensuring PCI-compliance and the safe handling of sensitive user data.\nApplied role-based access control (RBAC) and **OAuth 2.0** for secure customer and admin access, ensuring GDPR compliance and robust user data protection throughout the platform."
    }
  ],
  "skills": "**Programming Languages:**\n\tPython, JavaScript, TypeScript\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tREST API\n\n**Serverless and Cloud Functions:**\n\tAWS (Lambda), Azure\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD\n\n**Cloud & Infrastructure:**\n\tAWS (ECS, RDS, S3), Azure (App Services, Blob, SQL), Terraform, Ansible, Helm, Docker Compose\n\n**Other:**\n\tAI, MLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, Git, MCP, N8N, ChatGPT, Claude, Cursor, Problem Solving, Creativity, Empathy, Proactivity, Goal-centered",
  "apply_company": "Keplero AI"
}