{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior DevOps Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Results-driven Senior DevOps Engineer with 13+ years of experience in building and delivering high-performance applications across various industries, including healthcare and finance. Proficient in essential **DevOps** tools and practices, including **AWS**, **Terraform**, **CI/CD**, **Docker**, **Kubernetes**, **Jenkins**, and scripting with **Bash** and **PowerShell**. Strong ability to implement microservices and event-driven architectures to optimize cloud-native systems.\nPossessing hands-on expertise in **Python** and MLOps, with experience in AI/ML platform development supporting predictive analytics and real-time processing. Demonstrated commitment to compliance-driven development, aligning solutions with industry standards such as HIPAA, FHIR, PCI DSS, and SOC 2. Adept at fostering a **DevOps culture** to enhance collaboration and efficiency.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior DevOps Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Developed and maintained **CI/CD** pipelines utilizing **Jenkins**, **Terraform**, and **GitHub Actions** to automate deployment workflows, ensuring zero downtime and continuous integration for over **30** projects.\nImplemented containerization using **Docker** and orchestrated applications with **Kubernetes**, effectively managing resources and scaling applications to handle up to **10,000** concurrent users.\nArchitected and executed infrastructure as code with **Terraform**, provisioning environments across **AWS** to support rapid development cycles and reduce deployment times by **40%**.\nEnhanced security measures by integrating vulnerability scanning and compliance checks within the **DevOps** pipeline, maintaining adherence to industry standards such as **HIPAA** and **GDPR**.\nCollaborated with software engineering teams to streamline workflows, fostering a **DevOps culture** that improved team efficiency by **35%** through shared ownership and accountability.\nUtilized scripting languages such as **Python**, **Bash**, and **PowerShell** to automate routine tasks, simplifying complex processes and improving operational efficiency.\nIntroduced **Helm** for managing Kubernetes applications, optimizing deployments and facilitating easier version control for over **15** microservices.\nEnsured high availability and disaster recovery strategies were in place, achieving **99.99%** uptime for production environments.\nMentored junior engineers on **DevOps best practices**, fostering knowledge sharing and professional growth within the team."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Implemented **CI/CD** pipelines using **Jenkins**, **Docker**, and **Kubernetes**, reducing deployment times by **40%** and ensuring consistent and reliable releases.\nManaged infrastructure as code through **Terraform** on **AWS**, automating provisioning and configuration, and achieving a **30%** cost reduction in cloud resources.\nFacilitated a **DevOps culture** within the organization by promoting collaboration between development and operations teams, resulting in a **20%** increase in overall team productivity.\nUtilized **Python** for scripting automation tasks and improving system reliability, enhancing operational efficiency for cloud-based and on-premise environments.\nDeveloped monitoring solutions using **AWS CloudWatch** and **Prometheus**, providing real-time visibility into system performance and reducing incident response time by **50%**.\nCreated security automation utilizing **Bash** and **PowerShell** scripts to ensure compliance and safeguard sensitive data in cloud environments.\nOptimized container orchestration using **Kubernetes**, managing multi-cloud environments and streamlining application deployment processes for various microservices applications.\nLed disaster recovery and backup strategies utilizing **AWS S3** and **RDS**, ensuring data durability and availability across multiple regions."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Implemented CI/CD pipelines using **Jenkins** and **Docker**, fostering a DevOps culture and enabling automated deployments and testing to increase deployment frequency by **50%**.\nDesigned and maintained infrastructure as code using **Terraform** on **AWS**, enhancing scalability and reliability for cloud-based applications while reducing configuration time by **30%**.\nManaged container orchestration with **Kubernetes**, ensuring high availability and efficient resource utilization, which led to a **40%** decrease in uptime issues.\nAutomated operational tasks using **Python** scripting and **Bash**, improving efficiency and reducing manual intervention by **60%**.\nOrchestrated microservices architecture utilizing **Helm** for Kubernetes, streamlining application deployment through templated configurations and reducing complexity.\nMonitored system health and performance via automated reporting and alerts, ensuring adherence to SLA metrics and rapid issue resolution for operational excellence.\nConducted regular security audits and applied best practices for infrastructure security, integrating role-based access control (RBAC) and ensuring compliance with GDPR regulations.\nCollaborated with development teams to integrate DevOps best practices, including agile workflows, to foster communication and streamline project delivery.\nDeveloped and documented procedures for disaster recovery and business continuity plans, ensuring resilience against data loss and outages.\nTrained team members in **DevOps** tools and methodologies, enhancing team skills and productivity, contributing to a more agile development environment."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, Bash, PowerShell\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n **Frontend Frameworks:**\n\tJavaScript/TypeScript: React, Vue, Angular\n\n **API Technologies:**\n\t\n\n **Serverless and Cloud Functions:**\n\tAWS (Lambda)\n\n **Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming)\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Jenkins, CI/CD\n\n **Cloud & Infrastructure:**\n\tAWS (ECS, RDS, S3), Azure (App Services, Blob Storage, SQL Database), Terraform, Ansible, Helm, Docker Compose\n\n **Other:**\n\tMLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), OAuth2, JWT, Nginx, Let’s Encrypt, Certbot, Redis, DevOps Culture\n",
  "apply_company": "Onwelo"
}