{
  "name": "Tomasz Lee",
  "role_name": "Senior Software Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Results-oriented Senior Software Engineer with 9+ years of experience in developing robust applications and services. Proficient in **microservices**, **distributed systems**, and **APIs**, leveraging technologies like **PostgreSQL** and **messaging systems**. Experienced in **DevOps** practices and collaborating effectively across teams. Strong understanding of **Scala**, **Go**, and blockchain technologies including **cryptography**. Demonstrated ability to streamline development processes and optimize performance in B2B SaaS environments. A strong communicator adept at leading projects to successful completion while delivering innovative solutions.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Senior Software Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "• Designed and developed microservices architecture, enhancing system scalability and maintainability, leveraging **Scala** and **Go**.\n• Developed and integrated RESTful APIs for seamless data interactions, utilizing **PostgreSQL** for robust data management.\n• Implemented messaging systems using **Apache Kafka** for real-time data streaming, and **RabbitMQ** for reliable task queuing, resulting in a throughput increase of 30%.\n• Spearheaded DevOps initiatives, establishing CI/CD pipelines that cut deployment time by **40%** through efficient use of cloud services, including **Azure DevOps**.\n• Optimized distributed systems, ensuring robust performance and fault tolerance, which improved service uptime by **15%**.\n• Contributed to blockchain integration strategies, applying principles of **cryptography** for enhanced security and data integrity.\n• Engaged in communication with B2B SaaS partners to align features and requirements with market demands, increasing collaboration efficiency by **25%**.\n• Collaborated with cross-functional teams to enhance user experiences, implementing user feedback and interface improvements that yielded a **20%** increase in customer satisfaction.\n• Developed a reporting engine using **D3.js** for interactive data visualizations, bringing efficiency to data analysis processes.\n• Applied modern software development practices such as SRE principles to monitor and optimize system performance continuously."
    },
    {
      "role": "Software Engineer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "Designed and developed microservices architecture, utilizing **Scala** for back-end services, which facilitated improved scalability and performance in distributed systems.\nDeveloped and integrated RESTful APIs for seamless interaction with **PostgreSQL** databases, ensuring real-time data access and management for B2B SaaS applications.\nImplemented DevOps practices by creating CI/CD pipelines, streamlining deployment processes and reducing errors by **30%** through efficient use of **GitHub Actions**.\nLed the design of task orchestration using **messaging systems** like RabbitMQ, contributing to enhanced system responsiveness and reliability.\nCollaborated cross-functionally to gather system requirements and project timelines, resulting in timely delivery of software solutions.\nOversaw the integration of cryptography protocols for secure transactions, elevating the security standards of blockchain-related applications.\nConducted comprehensive code reviews and mentorship sessions, fostering communication and collaboration, which improved overall team productivity by **15%**.\nCreated interactive charts and graphs using **D3.js** for real-time project tracking, enhancing stakeholder visibility and decision-making.\nManaged multiple database systems including **MSSQL** and **MySQL**, optimizing queries resulting in a **25%** improvement in data retrieval performance."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "Leveraged **Scala** to develop and enhance microservices, contributing to a scalable and efficient backend architecture.\nDesigned and implemented **PostgreSQL** databases, optimizing data retrieval and management processes, resulting in a **30%** increase in query performance.\nIntegrated various **APIs** to facilitate seamless communication between distributed systems, ensuring robust data flow across applications.\nUtilized messaging systems to improve asynchronous communication and processing, effectively managing system load during peak operations.\nEmployed **DevOps** practices to support CI/CD pipelines, improving deployment frequency by **40%** and reducing lead time.\nEngaged in site reliability engineering (SRE) to monitor system performance and availability, achieving a **99.9%** uptime.\nContributed to the development of blockchain-based solutions, applying **cryptography** principles to secure transactions and data states.\nCollaborated in a **B2B SaaS** environment, focusing on delivering scalable solutions meeting diverse client needs.\nActively participated in daily standups and code reviews to maintain alignment with project objectives and coding best practices.\nProduced comprehensive technical documentation and user guides, fostering knowledge sharing and team collaboration."
    }
  ],
  "skills": " **Programming Languages**\n\tScala, Go, JavaScript, TypeScript, Python\n\n**Backend Frameworks**\n\tNodeJS, ExpressJS, NestJS, C#, .NET, Microservices\n\n**Frontend Frameworks**\n\tReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n**API Technologies**\n\tRESTful API, GraphQL, APIs\n\n**Serverless and Cloud Functions**\n\tAWS, Azure\n\n**Databases**\n\tMSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB\n\n**DevOps**\n\tCI/CD pipelines, DevOps, SRE\n\n**Cloud & Infrastructure**\n\tDistributed systems, B2B SaaS\n\n**Other**\n\tUX/UI Design, Git, GitHub, Blockchain, Solidity, Ether.js, Web3.js, Ethereum, NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest, Apache Kafka, RabbitMQ, Redis, communication, cryptography, messaging systems",
  "apply_company": "Copper.co"
}