{
  "name": "Mariusz Jan Skobel",
  "role_name": "Senior Frontend Engineer",
  "email": "mariuszskobel15@outlook.com",
  "phone": "+48 735 343 548",
  "address": "Katowice, Poland",
  "linkedin": "https://www.linkedin.com/in/mariusz-skobel-927764397/",
  "profile_summary": "Senior Frontend Engineer with 10+ years of experience delivering high-performance, user-centric software solutions. Expert in modern frontend technologies including **React**, **Redux**, **JavaScript**, **TypeScript**, **HTML5**, **CSS3**, and proficient in **Node.js** for backend integration. Strong advocate for best practices in **Unit Testing**, **Responsive Design**, and code quality using tools like **ESLint** and **Prettier**. Proven track record in developing and maintaining scalable applications, with a keen focus on creating engaging user experiences. Experienced in cloud-native application deployment on **Azure** and **AWS**, and the application of microservices architecture to enhance system robustness. Additionally, brings a strong background in **MLOps**, emphasizing collaboration and impact-driven results. Aiming to leverage seasoned technical skills to contribute effectively to innovative projects.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2012",
      "to_year": "2015",
      "location": "UK",
      "university": "University of Bristol"
    }
  ],
  "experience": [
    {
      "role": "Senior Frontend Engineer",
      "company": "EitBiz",
      "from_date": "Oct 2022",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "•\tDeveloped responsive web applications using **React** (17–18) and **Redux**, ensuring a seamless user experience across different devices and browsers.\n•\tImplemented **JavaScript**, **TypeScript**, **HTML5**, and **CSS3** to create interactive user interfaces and enhance application performance.\n•\tDesigned and executed unit tests with **Selenium**, **Jest**, and **Cypress**, achieving over **90%** code coverage and ensuring robust application functionality.\n•\tOptimized application performance and loading times, resulting in a **30%** improvement in user engagement metrics.\n•\tIntegrated pre-commit hooks with **ESLint** and **Prettier** for consistent code formatting and style, improving code maintainability and readability.\n•\tContributed to the architecture and development of micro frontends, allowing for modular and scalable application design, reducing deployment times by **40%**.\n•\tCollaborated with backend teams using **Node.js** to enhance API interactions and improve data fetching strategies.\n•\tDelivered responsive design solutions using modern CSS practices, ensuring compatibility with various devices and screen sizes.\n•\tParticipated in code reviews, providing constructive feedback to peers and contributing to a culture of learning and improvement.\n•\tFacilitated pair programming sessions to enhance knowledge sharing and improve team collaboration on frontend projects."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Tvn S.A.",
      "from_date": "Oct 2019",
      "to_date": "Sep 2022",
      "location": "Poland",
      "responsibilities": "Developed dynamic, user-focused front-end applications utilizing **React (18)**, **TypeScript**, and **Redux**, ensuring responsive design and enhanced user experience for high-performance financial dashboards and admin portals.\nLed the implementation of unit testing frameworks to enhance code quality and maintainability across multiple projects, leveraging tools like **Selenium**, **ESLint**, and **Prettier** for optimization, resulting in a 30% reduction in bugs during deployment.\nEngineered applications with **JavaScript**, **HTML5**, and **CSS3** while adhering to modern web standards, achieving a load time improvement of 25% for critical pages.\nCollaborated in a microservices architecture environment with **Node.js** (NestJS/Express) as the backend technology, focusing on seamless front-end integration and improving the overall system throughput for high-volume transaction systems.\nEnhanced application efficiency and scalability by incorporating responsive design principles tailored for diverse devices, aligning with industry best practices to boost user engagement.\nIntegrated advanced coding techniques in **Micro Frontends** to modularize applications, increasing deployment speed by 40% and improving team collaboration.\nEnsured continuous improvement in code quality through rigorous unit testing and code reviews, contributing to a more robust and stable codebase.\n"
    },
    {
      "role": "Software Engineer",
      "company": "Timspark",
      "from_date": "Sep 2015",
      "to_date": "Aug 2019",
      "location": "UK",
      "responsibilities": "Developed and optimized robust frontend applications using **React (18)**, **TypeScript**, and **Redux**, ensuring high performance and responsiveness for user interfaces on both web and mobile platforms.\nCreated intuitive and accessible UI designs with a focus on **HTML5**, **CSS3**, and **Responsive Design** principles, achieving compliance with **WCAG 2.1** standards to enhance user experience and accessibility.\nImplemented unit testing and code quality tools such as **Selenium**, **ESLint**, and **Prettier** to maintain high code standards and enhance overall application reliability.\nDesigned micro frontend architectures that promoted greater modularity, allowing parallel development tracks and reducing deployment cycles by up to **30%**.\nStreamlined development workflows, applying best practices in JavaScript and TypeScript, which improved code maintainability by approximately **40%**. \nCollaborated with backend engineers for seamless integration with services built on **Node.js**, enhancing data retrieval performance by **25%** through optimized API calls.\nConducted code reviews and mentored junior developers, promoting team skills in frontend methodologies, which led to a **15%** increase in team productivity.\nEngaged in responsive design techniques that resulted in a **50%** improvement in mobile load times, significantly boosting user engagement metrics."
    }
  ],
  "skills": " **Frontend Frameworks:**\n\tReact, Redux, JavaScript, TypeScript, HTML5, CSS3, Selenium, ESLint, Prettier, Micro Frontends, Unit Testing, Responsive Design\n\n**Backend Frameworks:**\n\tPython (FastAPI, Flask, Django), Node.js\n\n**API Technologies:**\n\tOAuth2, JWT, Keycloak (OIDC, RBAC)\n\n**Serverless and Cloud Functions:**\n\tAWS (Lambda), Azure (App Services)\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS (ECS, RDS, S3), Azure (Blob, SQL)\n\n**Other:**\n\tArtificial Intelligence & Machine Learning: MLflow, Airflow, Kubeflow, Nginx, Let’s Encrypt, Certbot",
  "apply_company": "Pragmatike"
}