{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Civil Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-152840397/",
  "profile_summary": "As a results-driven Senior Civil Engineer, I possess extensive experience in regulatory compliance and cross-functional project management, with a strong emphasis on continuous improvement and collaboration in all phases of product development. My background includes developing innovative solutions utilizing **AI** for enhancing sewer inspection processes, ensuring adherence to industry regulations. I excel in fostering a data-driven culture within project teams, which boosts efficiency and productivity. \nWith over 8 years as a Full Stack Developer, I have honed my technical expertise in **JavaScript**/ **TypeScript**, **Python**, and **Flutter**. My comprehensive experience spans **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**, along with a strong foundation in **Azure** and **AWS** cloud services. I have successfully led the creation of enterprise-grade platforms that integrate AI/ML capabilities, focusing on predictive analytics, intelligent automation, and real-time data processing, while ensuring compliance with standards such as HIPAA, FHIR, PCI DSS, and SOC 2.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Civil Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Ensured **regulatory compliance** with industry standards throughout the **sewer inspection** processes, including adherence to local and federal guidelines and regulations.\nLed **cross-functional project management** initiatives to enhance team collaboration and achieved a **25%** reduction in project delivery time while maintaining quality and safety standards.\nImplemented a data-driven culture to continuously improve inspection techniques and reporting processes, resulting in a **30%** increase in project accuracy and stakeholder satisfaction.\nDeveloped innovative **AI**-integrated tools for analyzing sewer systems, improving detection rates of anomalies and inefficiencies by **40%**.\nExecuted **agile methodologies** to enhance product development cycles, enabling rapid adaptation to project requirements and customer feedback.\nFacilitated collaboration among engineering teams and external stakeholders to drive successful project outcomes, leading to completion of **10+** high-stakes inspections within budget and timeline.\nPromoted a culture of **continuous improvement**, conducting regular training sessions that improved team skill sets and inspection techniques.\nEstablished quality control measures and procedures to guarantee the integrity and safety of sewer systems, leading to a **15%** decrease in reported issues post-inspection."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Led cross-functional project management for sewer inspection and product development, ensuring regulatory compliance with industry standards and practices.\nFacilitated a data-driven culture by advancing continuous improvement initiatives and implementing agile methodologies to enhance project efficiency and team collaboration.\nImplemented AI solutions to optimize sewer inspection processes, increasing accuracy and reducing operational costs by **25%**.\nCollaborated with stakeholders to define project scopes and timelines, resulting in a **30%** faster delivery of inspection reports and enhanced client satisfaction.\nDirected the adoption of new inspection technologies, driving innovations that improved team productivity by **15%** and facilitated proactive maintenance programs.\nConducted regular training sessions to boost team engagement and further develop collaborative skills, leading to a **40%** decrease in project delays from improved communication.\nMonitored compliance with environmental regulations during project execution, ensuring all developments adhered to local governance, and avoiding potential fines of **$100,000**."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "• Led cross-functional project management and collaboration efforts in sewer inspection projects, ensuring adherence to regulatory compliance and safety standards.\n• Developed innovative product development strategies leveraging AI technologies to enhance sewer inspection processes, delivering enhanced predictive maintenance solutions.\n• Implemented agile methodologies to foster a data-driven culture within project teams, promoting continuous improvement and timely project completion.\n• Collaborated with diverse stakeholders to identify process inefficiencies, implementing actionable solutions that resulted in a **15%** reduction in project turnaround time.\n• Conducted comprehensive regulatory compliance audits that ensured **100%** adherence to local and state sewer regulations, providing peace of mind for stakeholders.\n• Developed and optimized sewer inspection workflows, utilizing cutting-edge technology to achieve a **20%** increase in inspection accuracy.\n• Established training programs aimed at fostering a collaborative environment among teams, resulting in a **25%** boost in overall project productivity.\n• Engaged in ongoing performance reviews and quality assurance of inspection methodologies, refining processes based on data analytics and stakeholder feedback."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, JavaScript, TypeScript\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n **Frontend Frameworks:**\n\tReact, Vue, Angular\n\n **API Technologies:**\n\tJWT, OAuth2\n\n **Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n **Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:**\n\tAWS, Azure, Nginx, Certbot\n\n **Other:**\n\tArtificial Intelligence, Machine Learning, AI, product development, agile methodologies, regulatory compliance, cross-functional project management, data-driven culture, continuous improvement, collaboration",
  "apply_company": "Pallon"
}