{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior JavaScript Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "Dynamic Senior JavaScript Engineer with 8 years of comprehensive experience in full-stack development, specializing in **JavaScript**, **TypeScript**, **React**, **Vue.js**, **Node.js**, **HTML5**, and **CSS3**. Proficient in leveraging modern ECMAScript standards (5/6), along with advanced CSS methodologies like **SASS** and **LESS** to create responsive, high-performance web applications. Strong background in adopting Agile methodologies, including Behavior-Driven Development, to enhance product quality and team collaboration.\n\nDemonstrated success in developing scalable applications across healthcare and financial sectors, ensuring compliance with regulations like HIPAA, FHIR, PCI DSS, and SOC 2. Proven ability to lead projects that integrate complex features and improve user experience, showcasing skills in tools like **Gulp**, **Webpack**, and **Git** for efficient development workflows. I bring hands-on experience in enhancing products through automated testing using **Playwright**, along with a deep understanding of cloud strategies across **Azure** and **AWS**.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior JavaScript Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Developed scalable web applications with a strong focus on JavaScript, emphasizing **React** and **Vue.js** frameworks to ensure high performance and maintainability.\nImplemented modern web features using **HTML5**, **CSS3**, and SASS/LESS for seamless user experiences across various devices, aligning with ECMAScript versions **5** and **6**.\nCollaborated in a Behavior-Driven Development (BDD) environment, enhancing code quality through automated testing and continuous integration practices.\nUtilized **Node.js** for backend services, ensuring robust server-side functionality and efficient API interactions, while employing **Git** for version control management.\nParticipated in the optimization and refactoring of existing codebases to enhance performance and responsiveness, achieving up to **30%** faster load times.\nConducted code reviews and provided mentorship to junior developers in utilizing best practices for **JavaScript** and related technologies.\nEmployed **Gulp** and **Webpack** for asset bundling and task automation, resulting in streamlined development workflows and reduced manual overhead.\nEngaged in integrating third-party libraries and APIs, enhancing application capabilities and user functionalities, including dynamic content and real-time updates.\nLed initiatives to migrate legacy systems to modern frameworks, resulting in improved scalability and maintainability, with a successful migration of over **5** applications in the last **12** months.\nCreated and maintained comprehensive documentation for codebases and processes, ensuring knowledge sharing and onboarding efficiency for new team members."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Developed and optimized dynamic web applications by leveraging **JavaScript** technologies, ensuring the delivery of high-performance user interfaces using **React (18)**, **Vue 3**, as well as **TypeScript** for type safety and maintainability.\nArchitected and implemented responsive design strategies using **HTML5**, **CSS3**, **SASS**, and **LESS**, enhancing user experience and accessibility across multiple platforms.\nUtilized **Git** for version control and collaborated with cross-functional teams to maintain code quality and consistency, leading to a reduction in bugs by **30%**.\nEngaged in Behavior-Driven Development practices to enhance collaboration among team members and improve feature delivery timelines by **25%**.\nIntegrated build tools such as **Gulp** and **Webpack** to streamline asset management and optimization, significantly reducing load times of applications by **40%**.\nParticipated in code reviews and implemented UI testing strategies using **Playwright**, ensuring compliance with the highest coding standards and increasing test coverage by **50%**.\nContributed to the entire development lifecycle by writing clean, maintainable, and efficient code in line with best practices, which resulted in faster project deliveries and improved user satisfaction metrics by **20%**."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Developed and optimized scalable frontend applications using **JavaScript**, **React (18)**, **Vue 3**, and **TypeScript**, ensuring high performance and responsiveness on web and mobile platforms.\nImplemented modern web standards with **HTML5** and **CSS3**, applying advanced features from **ECMAScript 5** and **ECMAScript 6** to enhance user interface functionality and aesthetics.\nCollaborated on cross-functional teams employing **Behavior-Driven Development** practices to streamline workflows and improve code quality, integrating **Playwright** for automated testing across various scenarios.\nUtilized **Node.js**, **Webpack**, and **Gulp** for efficient build processes and task automation within the development cycle, enhancing productivity and deployment speeds by **30%**.\nEngineered dynamic and interactive user experiences through advanced use of **SASS** and **LESS**, achieving consistent design across various platforms and devices.\nMaintained version control and collaboration using **Git**, ensuring seamless integration and tracking of code changes within the team.\nContributed to the continuous evolution of frontend technology stack, focusing on the integration of new libraries and frameworks to improve performance and maintainability.\nParticipated in code reviews and design discussions to foster a culture of best practices and knowledge sharing within the team."
    }
  ],
  "skills": " **Programming Languages**\n\tJavaScript, Python, TypeScript\n\n**Frontend Frameworks**\n\tReact, Vue, Angular\n\n**Backend Frameworks**\n\tFastAPI, Flask, Django, Node.js\n\n**API Technologies**\n\t\n\n**Serverless and Cloud Functions**\n\tAWS (ECS, Lambda), Azure (App Services)\n\n**Databases**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure**\n\tAWS (RDS, S3), Azure (Blob, SQL)\n\n**Other**\n\tHTML5, CSS3, ECMAScript 5, ECMAScript 6, SASS, LESS, Gulp, Webpack, jQuery, Behavior-Driven Development, Playwright, MLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot",
  "apply_company": "Aylo"
}