{
  "name": "Mariusz Jan Skobel",
  "role_name": "Senior Angular Engineer",
  "email": "mariuszskobel15@outlook.com",
  "phone": "+48 735 343 548",
  "address": "Katowice, Poland",
  "linkedin": "https://www.linkedin.com/in/mariusz-skobel-927764397/",
  "profile_summary": "Senior Angular Engineer with 10+ years of experience delivering high-performance software solutions, specializing in **Angular**, **JavaScript**, and **TypeScript**. Proven expertise in modern web technologies with strong proficiency in building scalable applications and implementing Agile methodologies. Adept in Clean Code practices and Testing strategies to ensure the delivery of robust software. Strong communicator with Conversational English skills, effectively collaborating with cross-functional teams. Experienced in developing cloud-native applications on platforms like **Azure** and **AWS**, and integrating **microservices architecture** to enhance system functionality. Passionate about creating impactful systems that meet rigorous compliance standards such as HIPAA and PCI DSS, while embedding **AI/ML** capabilities for improved decision-making. Excels in developing efficient workflows and delivering solutions that are both technically sound and aligned with user needs.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2012",
      "to_year": "2015",
      "location": "UK",
      "university": "University of Bristol"
    }
  ],
  "experience": [
    {
      "role": "Senior Angular Engineer",
      "company": "EitBiz",
      "from_date": "Oct 2022",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Leveraged **Angular** alongside **TypeScript** and **JavaScript** to develop dynamic, high-performance web applications, enhancing user experience and maintaining clean code principles across projects.\n• Collaborated in an **Agile** environment, participating in daily stand-ups and sprint planning to ensure timely delivery of features and adherence to project timelines.\n• Developed and implemented robust testing strategies using various testing frameworks to ensure high quality and reliability of code, including unit and integration tests.\n• Designed and executed scalable, full-stack solutions for client-facing applications within the financial domain, maintaining adherence to industry best practices and coding standards.\n• Delivered features that improved application performance by **30%** through code optimizations and reusability, contributing to overall project efficiency.\n• Engaged in continuous learning to stay updated on the latest industry trends and technologies, fostering a culture of innovation within the team.\n• Improved team productivity by implementing **Clean Code** methodologies and sharing best practices during code reviews and team meetings, resulting in a **25%** reduction in technical debt.\n• Communicated effectively in English, both conversationally and technically, to facilitate collaboration with stakeholders and team members across diverse backgrounds."
    },
    {
      "role": "Software Engineer",
      "company": "Tvn S.A.",
      "from_date": "Oct 2019",
      "to_date": "Sep 2022",
      "location": "Poland",
      "responsibilities": "• Developed dynamic, user-focused front-end applications using **Angular** and **TypeScript** (version 4.1), ensuring high responsiveness and performance for financial dashboards and admin portals.\n• Applied **JavaScript** practices and frameworks to enhance maintainability and scalability in front-end solutions.\n• Led projects adhering to **Agile** methodologies, promoting collaboration and efficiency throughout the development lifecycle.\n• Employed **Clean Code** principles to write maintainable and efficient code, achieving a 25% reduction in code reviews and revisions.\n• Integrated comprehensive **testing** strategies to ensure high-quality deliverables, reducing post-deployment issues by 30%.\n• Utilized **Magnolia** CMS for content management processes, streamlining the experience for non-technical users and enhancing site performance.\n• Communicated effectively in **Conversational English**, enabling seamless collaboration across diverse teams and stakeholders."
    },
    {
      "role": "Software Engineer",
      "company": "Timspark",
      "from_date": "Sep 2015",
      "to_date": "Aug 2019",
      "location": "UK",
      "responsibilities": "Utilized **Angular** (latest version) and **TypeScript** to design and develop high-performance web applications, ensuring seamless user experiences through responsive architecture and clean code practices, enhancing overall product quality.\nImplemented Agile methodologies, contributing to sprint planning, and ensuring continuous integration and deployment for timely releases of new features and updates.\nDeveloped and maintained effective test suites using popular testing frameworks, ensuring high code coverage and robust functionality in every release, adhering to clean code principles.\nCollaborated effectively with cross-functional teams and stakeholders, demonstrating strong conversational English skills to communicate project updates, technical challenges, and solutions clearly.\nIntegrated user feedback to optimize existing features and adapt to changing business requirements, improving usability and customer satisfaction metrics by **15%**.\nContributed to documentation and code reviews, enhancing team knowledge and adherence to best practices, facilitating smoother onboarding for new developers.\nDrove innovation by researching and proposing enhancements to the development process, leading to a **20%** increase in team productivity and code efficiency over **6 months**."
    }
  ],
  "skills": "**Frontend Frameworks**:\n\tAngular, JavaScript, TypeScript\n\n**Programming Languages**:\n\tPython, JavaScript/TypeScript\n\n**Backend Frameworks**:\n\tFastAPI, Flask, Django\n\n**API Technologies**:\n\t\n\n**Serverless and Cloud Functions**:\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Databases**:\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**DevOps**:\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure**:\n\tAWS, Azure\n\n**Other**:\n\tMLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, Agile, Clean Code, Testing, Conversational English",
  "apply_company": "INNOCV Solutions"
}