{
  "name": "Tomasz Lee",
  "role_name": "Staff Software Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-477994390/",
  "profile_summary": "Results-driven Staff Software Engineer with 9+ years of experience, focused on Java, AI, and Machine Learning, complemented by a strong foundation in Data Analysis. Proven ability to leverage tools such as **Amplitude**, **Looker**, and **Excel** for insightful data-driven decision-making. Skilled in collaborating with cross-functional teams, providing coaching, and mentorship to enhance team performance. Originally specialized as a .NET Full Stack Developer with expertise in **microservices architecture**, **Apache Kafka**, **RabbitMQ**,**Redis**, **ReactJS**, **NextJS**, and **.NET**, demonstrating a comprehensive understanding of both frontend and backend technologies. Committed to delivering robust solutions and optimizing processes in software development.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Staff Software Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Apr 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Utilized **Java** for backend services and enhanced data processing capabilities in AI and Machine Learning initiatives, leading to a **30%** increase in processing efficiency.\nConducted comprehensive **Data Analysis** using **Excel**, resulting in actionable insights and improved decision-making processes.\nCollaborated with cross-functional teams to foster collaboration and facilitate project success, enhancing team productivity by **25%**.\nProvided coaching and mentorship to junior developers, enhancing their skills and contributing to a **40%** improvement in team delivery timelines.\nImplemented data tracking and analysis with **Amplitude** and **Looker**, optimizing user engagement metrics and increasing retention rates by **15%**.\nSpearheaded the implementation of a microservices architecture using **.NET Core** and **ReactJS** for web-based applications, focusing on scalability and maintainability.\nIntegrated **RabbitMQ** for messaging services and **Redis** for caching, reducing response times by **35%**.\nDeveloped and optimized **RESTful APIs** to ensure seamless data access and integration with various data sources, enhancing overall system performance.\nImplemented CI/CD pipelines on **Azure DevOps**, effectively reducing deployment time by **40%**.\nLed design improvements in collaboration with UX/UI designers, enhancing the user interface and user experience significantly."
    },
    {
      "role": "Full Stack Developer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "• Leveraged AI and Machine Learning tools to enhance project outcomes, improving data analysis accuracy by **20%**.\n• Utilized **Java** for backend development, ensuring robust application performance with a **99.9%** uptime.\n• Achieved a **30%** increase in team collaboration through effective mentoring and coaching sessions.\n• Developed data visualizations using **Looker** and **Amplitude**, leading to actionable insights and informed decision-making.\n• Conducted data analysis using **Excel**, streamlining reporting processes which resulted in a **25%** reduction in reporting time.\n• Facilitated team workshops focused on collaboration, improving overall project delivery timelines by **15%**.\n• Created and maintained high-quality documentation to support team workflows and knowledge sharing.\n• Fostered a culture of continuous learning among team members, resulting in improved coding standards and practices.\n• Actively participated in code reviews to enhance code quality and mentor junior developers, boosting their productivity by **30%**.\n• Collaborated with cross-functional teams to align project goals and timelines, ensuring successful project outcomes."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "Leveraged **Java** in the development of analytical features for internal tools, enhancing data analysis capabilities by **30%**.\nUtilized **AI** and **Machine Learning** algorithms to drive data-driven decisions, resulting in a **15%** increase in operational efficiency.\nEmployed **Amplitude** and **Looker** for in-depth data analysis, leading to optimized user engagement metrics.\nConducted collaborative sessions and coaching with team members to foster growth and ensure alignment with project objectives, enhancing team productivity.\nRevamped existing codebases by integrating advanced **Data Analysis** techniques, which improved the accuracy of reporting tools by **25%**.\nProvided mentorship to junior developers, leading training workshops that increased their proficiency in **Excel** and other analytical tools.\nFacilitated cross-team collaboration by implementing structured processes that strengthened project outcomes.\nContributed to the documentation of best practices and user guides for optimal use of analytical tools, enhancing the team's knowledge base."
    }
  ],
  "skills": "**Programming Languages**\n\tJava, Python, JavaScript, TypeScript\n\n**Backend Frameworks**\n\tNodeJS, ExpressJS, NestJS, C#, .NET, Entity Framework, Microservices\n\n**Frontend Frameworks**\n\tReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n**API Technologies**\n\tRESTful API, GraphQL\n\n**Serverless and Cloud Functions**\n\tAWS, Azure\n\n**Databases**\n\tMSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB\n\n**DevOps**\n\tCI/CD pipelines\n\n**Cloud & Infrastructure**\n\tGit, GitHub\n\n**Other**\n\tUX/UI Design, Blockchain: Solidity, Ether.js, Web3.js, Ethereum, Testing Tools: NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest, AI, Machine Learning, Data Analysis, Amplitude, Looker, Excel, Collaboration, Coaching, Mentorship"
}