{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Integration Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Results-driven Senior Integration Engineer with 13+ years of experience in delivering high-performance applications across various sectors, including healthcare and finance. Proficient in **Python** and **JavaScript**, with extensive use of **RESTful APIs** for seamless integration of systems. Demonstrated expertise in AI/ML technologies, particularly in **Conversational AI** and **NLP**, to enhance user interaction and automating processes.\n\nSkilled in utilizing **Salesforce**, **ServiceNow**, and **MSDynamics** for CRM integration, optimizing customer engagement and service delivery. Proven success in managing project delivery with a strong focus on stakeholder communication and customer-facing engineering roles. Adept at implementing modern communication solutions through **VoIP**, **Video Conferencing**, and **8x8 APIs**. \n\nStrong foundation in deploying applications on cloud platforms with a commitment to compliance-driven development and operational efficiency.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Integration Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Leveraged **Python** and **JavaScript** to integrate advanced **RESTful APIs** for seamless connectivity between customer-facing applications and backend services, enhancing user engagement and operational efficiency.\nUtilized conversational AI techniques to develop intelligent customer solutions, improving user experience through **NLP** functionalities.\nCollaborated with cross-functional teams to ensure effective **Stakeholder Communication** during project delivery, resulting in timely and successful integrations for key clients like Salesforce and ServiceNow.\nDesigned and implemented integration workflows using automation tools, ensuring **Project Delivery** within **8 weeks** for major deployments across CRM platforms.\nConducted thorough testing of integrated systems, maintaining high standards of quality assurance that resulted in a **30% reduction** in post-deployment issues through innovative testing strategies.\nManaged customer-facing engineering initiatives with a focus on delivering high-quality support and maintaining customer satisfaction.\nDeveloped and maintained documentation for integration processes and system architecture, facilitating better knowledge transfer and team collaboration.\nParticipated in strategic planning sessions to identify and recommend improvements in integration processes, ensuring alignment with technology trends and business goals.\n"
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Utilized **Python** and **JavaScript** to develop and modernize core financial platforms, ensuring robust integration with **RESTful APIs** to enhance system interconnectivity and performance.\nImplemented conversational AI strategies through technologies such as **NLP** and **AI**, streamlining customer-facing interactions while aligning with CRM systems including **Salesforce** and **MSDynamics**.\nLed project delivery initiatives by improving stakeholder communication, ensuring alignment with operational goals and timely delivery of enhancements for financial applications.\nIntegrated **VoIP** and **Video Conferencing** services using **8x8 APIs** to enhance user experience and connectivity within support systems, increasing user engagement by **30%**.\nDeveloped scalable microservices architecture using **Node.js** (including **NestJS/Express**) and **Python** frameworks (**FastAPI**, **Django**), improving system scalability by **40%** in high-volume transactional systems.\nBuilt interactive front-end applications with React (**18**), Vue **3**, Next.js, and TypeScript, enhancing user interfaces for financial tools and admin panels.\nOrchestrated the deployment of event-driven architectures using **Kafka**, **RabbitMQ**, and **Azure Service Bus**, ensuring seamless asynchronous communication across critical workflows, leading to a **25%** reduction in response times.\nCreated ETL pipelines utilizing **Apache Airflow** and **Azure Data Factory** for efficient financial data ingestion from various sources, supporting real-time processing capabilities. \nDesigned and built machine learning models for fraud detection using **scikit-learn**, **XGBoost**, and **Azure ML**, proactively identifying suspicious activities based on transaction patterns with an accuracy of **95%**."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "- Developed and maintained **RESTful APIs** using **Python** and **JavaScript** frameworks to enhance system integration and data communication in line with project delivery timelines.\n- Engineered customer-facing features and integrations utilizing **Conversational AI** and **NLP** strategies for improved customer interactions and satisfaction, contributing to a 30% increase in customer engagement.\n- Collaborated with stakeholders to ensure alignment on project objectives and deliverables, facilitating communication between technical teams and business units, and driving effective **CRM** solutions on platforms such as **Salesforce** and **ServiceNow**.\n- Designed video conferencing solutions using **8x8 APIs** for seamless communication, which reduced operational inefficiencies by 25%.\n- Enhanced documentation and communication protocols for integration projects, leading to a 15% improvement in project delivery times.\n- Applied **VoIP** technology to create a robust communication infrastructure, thereby enhancing service quality and reducing costs by 20%.\n- Leveraged data integration techniques to synchronize customer data across multiple platforms, including **MSDynamics**, ensuring GDPR compliance and integrity of sensitive information.\n- Implemented robust testing methodologies and monitoring solutions to guarantee the reliability and performance of developed integrations, achieving a 99.9% uptime.\n- Conducted training sessions for team members on best practices for integration development and customer-facing engineering, contributing to a more knowledgeable and efficient team."
    }
  ],
  "skills": "**Programming Languages:**\n\tPython, JavaScript\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tRESTful APIs, 8x8 APIs\n\n**Serverless and Cloud Functions:**\n\tAWS: ECS, Lambda, \n\tAzure: App Services\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS: RDS, S3, Azure: Blob Storage, SQL Database\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, NLP, AI, CRM, Salesforce, ServiceNow, MSDynamics, VoIP, Video Conferencing, Conversational AI, Customer-Facing Engineering, Project Delivery, Stakeholder Communication",
  "apply_company": "8x8"
}