{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior DevOps Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-karol-kotlinski-bb2520397/",
  "profile_summary": "Results-driven Senior DevOps Engineer with 8 years of experience in building and managing high-performance solutions in cloud environments, specializing in **Microsoft Azure**, **Docker**, **Kubernetes**, **Azure DevOps**, **ArgoCD**, **Terraform**, and **Ansible**. Possessing a robust understanding of CI/CD pipelines, I excel in automating deployment processes and enhancing system reliability, utilizing tools such as **Grafana** and **Prometheus** for monitoring and performance optimization. \n\nI have hands-on experience in scripting with **PowerShell** and **Bash**, ensuring security and compliance aligned with industry standards like HIPAA, FHIR, PCI DSS, and SOC 2. My strong problem-solving skills enhance collaboration across teams, ensuring seamless integration of best practices in networking and security. Additionally, my background as a Full Stack Developer with **Python**, **React**, **Next.js**, **Node.js**, and experience in AI/ML integrations, complements my DevOps expertise by fostering a holistic approach to development and operational excellence.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior DevOps Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Implemented enterprise-level **CI/CD** pipelines using **Azure DevOps**, **Docker**, and **Kubernetes**, incorporating linting, testing, security scans, and multi-environment deployments for both web and API services.\n\nefficiently collaborated with cross-functional teams to ensure security and compliance standards such as HIPAA, FHIR, and PCI DSS, while promoting a culture of **collaboration** and **problem-solving**.\n\nMaintained infrastructure as code using **Terraform** and configured deployment automation with **ArgoCD**, improving deployment consistency and scalability across environments.\n\nUtilized **PowerShell** and **Bash** scripts to automate repetitive tasks, enhancing operational efficiency by **40%**.\n\nMonitored and optimized system performance through integration with **Grafana** and **Prometheus**, providing real-time insights and alerts to improve visibility into system health.\n\nLed the re-architecture of monolithic applications into microservices-based ecosystems, employing **Docker** and **Kubernetes**, achieving **99.9%** uptime and high availability.\n\nImplemented best practices for security and compliance across infrastructure, ensuring thorough documentation and communication to stakeholders, adhering to regulatory compliance requirements.\n\nDeveloped and managed cloud solutions on **Microsoft Azure**, enhancing scalability of applications and services through the use of **Azure Functions** and serverless architectures.\n\nConducted regular security assessments and implemented secure networking practices, contributing to an overall risk reduction of **30%** in potential vulnerabilities.\n\nEngaged in hands-on troubleshooting and performance tuning, showcasing strong **communication** skills to articulate technical concepts to a non-technical audience effectively."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "- Implemented CI/CD practices leveraging **Azure DevOps** and **Docker**, enhancing deployment frequency by **30%** while reducing deployment failures by **25%**.\n- Utilized **Kubernetes** for container orchestration, achieving improved resource utilization by **40%** and ensuring scalable application delivery across cloud environments.\n- Developed Infrastructure as Code (IaC) using **Terraform** and **Ansible** to automate provisioning and configuration management, reducing manual setup time by **50%**.\n- Ensured security and compliance within CI/CD pipelines, integrating tools such as **PowerShell** and **Bash** for automated security scans and compliance checks.\n- Monitored system performance and provided real-time analytics using **Grafana** and **Prometheus**, driving improvements in system availability to **99.9%** uptime.\n- Conducted thorough troubleshooting and problem-solving around networking and system integration, maintaining compliance with industry standards.\n- Fostered collaboration across cross-functional teams, enhancing communication and efficiency within deployment processes.\n- Built dynamic, user-focused front-end applications using **React (18)**, **Vue 3**, and **TypeScript** to interface with financial systems, emphasizing user experience and accessibility.\n- Led the development of ETL pipelines with **Python** and **Apache Airflow**, facilitating data processing capabilities for batch and real-time ingestion of financial data."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Implemented CI/CD pipelines using **Azure DevOps** and **Docker** to automate the deployment process, increasing deployment efficiency by **40%** and reducing downtime during updates.\nManaged container orchestration with **Kubernetes**, ensuring high availability and scaling of application services across environments while maintaining security and performance compliance.\nConfigured and automated infrastructure provisioning with **Terraform** and **Ansible**, achieving a **30%** decrease in manual setup time and enhancing consistency across development and production environments.\nMonitored application performance and system health using **Prometheus** and **Grafana**, enabling proactive issue resolution and optimizing resource allocation, leading to a **25%** improvement in system response times.\nEnsured system security and compliance by implementing role-based access control (RBAC) and regular auditing processes, aligning with GDPR and other relevant compliance standards.\nFacilitated smooth collaboration between development and operations teams by enhancing communication protocols and providing continuous support, resulting in improved problem-solving and faster incident resolution.\nDeveloped automated scripts using **PowerShell** and **Bash** for routine maintenance tasks, thereby reducing workload on engineering teams and increasing operational efficiency.\nDeployed monitoring solutions that ensure system uptime and performance metrics, reinforcing the infrastructure's reliability in production environments.\nExecuted networking configurations and security protocols to safeguard sensitive data, ensuring robust application performance while maintaining stringent compliance standards."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n **Frontend Frameworks:**\n\tJavaScript, TypeScript, React, Vue, Angular\n\n **API Technologies:**\n\tJWT, OAuth2, Keycloak (OIDC, RBAC)\n\n **Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL), Microsoft Azure\n\n **Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Azure DevOps, ArgoCD, Terraform, Ansible, CI/CD, Helm, Docker Compose\n\n **Cloud & Infrastructure:**\n\tGrafana, Prometheus, Networking, Security, Compliance\n\n **Other:**\n\tPowerShell, Bash, Problem-solving, Communication, Collaboration"
}