{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Backend Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Senior Backend Engineer with over 13 years of experience specializing in backend development using **Java**, **Spring Boot**, **Postgres**, and **Docker**. Proven ability to implement Test Driven Development methodologies, ensuring high-quality and maintainable code. Expertise in cloud services like **gcloud** and container orchestration with **Kubernetes**. Skilled in designing and deploying AI/ML solutions that enhance predictive analytics and automation, alongside a solid foundation in **Machine Learning** and mathematics.\n\nDemonstrated proficiency in working with databases such as **MongoDB**, **Cassandra**, and **Astra-DB**, bringing a deep understanding of financial products and the stock market. Known for strong communication, accountability, teamwork, problem-solving, and decision-making skills, consistently delivering high-performance applications in compliance-driven environments.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Backend Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Developed scalable backend solutions for financial products using **Java** and **Spring Boot**, implementing best practices in **Test Driven Development** to ensure high code quality and reliability.\n• Designed and maintained robust databases leveraging **PostgreSQL** and **MongoDB**, ensuring optimal data storage and retrieval for complex financial transactions with a focus on performance metrics.\n• Containerized applications using **Docker** and managed deployments via **Kubernetes**, achieving a deployment efficiency improvement of **50%** while reducing downtime.\n• Integrated third-party APIs and services to enhance product functionality, ensuring smooth operations for end-users in stock market applications.\n• Collaborated effectively with cross-functional teams, enhancing communication and accountability, leading to a **30%** increase in project delivery speed.\n• Implemented machine learning models to enhance data predictions, incorporating advanced algorithms and mathematics for analysis in financial sectors, resulting in a **25%** higher accuracy in forecasts.\n• Maintained and optimized CI/CD pipelines on **gcloud** to automate deployment processes, resulting in reduced manual errors and accelerated release cycles by **40%**.\n• Conducted code reviews and mentoring sessions, fostering a culture of team play and collaboration, which improved overall team performance and knowledge sharing.\n• Developed and executed comprehensive testing strategies using community tools to ensure software reliability and functionality, including unit, integration, and performance tests.\n• Analyzed system performance and user feedback, optimizing application functionality for better decision-making and problem-solving capabilities in real-time financial data processing."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "• Developed financial applications using **Java** and **Spring Boot**, ensuring high performance and reliability in backend systems for financial transactions.  \n• Implemented **Test Driven Development** (TDD) strategies to enhance code quality and maintainability, contributing to a **40%** reduction in bugs during production.  \n• Managed database systems, including **Postgres**, **MongoDB**, and **Cassandra**, optimizing queries for improved performance and storage efficiency, achieving a **30%** increase in query response times.  \n• Deployed containerized applications on **Kubernetes** and **Docker**, leveraging orchestration for seamless deployment and scaling, and decreasing downtime in updates by **25%**.  \n• Utilized **gcloud** services to manage cloud infrastructure and streamline CI/CD pipelines, achieving a significant reduction in deployment times to less than **10 minutes**.  \n• Collaborated with cross-functional teams to design and implement financial products, employing strong **communication** and **problem-solving** skills to align project goals with business objectives.  \n• Applied **machine learning** techniques for risk assessment and financial forecasting, ensuring accuracy in predictions by utilizing knowledge in **mathematics** and data analysis.  \n• Demonstrated accountability and teamwork in delivering high-impact features, contributing to an increase in client satisfaction and consistent project delivery on time."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Developed and optimized backend services for high-traffic applications using **Java**, **Spring Boot**, and **Postgres**, ensuring high availability and scalability across critical business modules.\nImplemented Test Driven Development (TDD) practices to enhance code quality and reliability, achieving a **30% reduction** in post-deployment bugs and issues.\nUtilized **Kubernetes** for container orchestration and deployment, managing application configurations and ensuring smooth integrations with CI/CD pipelines.\nCreated Docker images and maintained microservices architecture to improve deployment times by **25%**, facilitating rapid iteration and deployment cycles.\nEngineered robust data storage solutions leveraging **MongoDB**, **Cassandra**, and **Astra-DB** for distributed data management, supporting high-traffic workflows and improving data access speeds.\nApplied machine learning algorithms to develop predictive analytics features that optimize user interactions and personalize product offerings, contributing to a **15% increase** in conversion rates.\nCollaborated within cross-functional teams, demonstrating effective communication and accountability to drive project success while adhering to tight deadlines.\nConducted problem-solving sessions and applied critical decision-making skills to troubleshoot and resolve complex technical challenges.\nMentored junior developers in best practices including TDD, functional programming, and agile methodologies, fostering a culture of collaboration and team play within the team.\nEnsured the secure handling of sensitive data by implementing role-based access control (RBAC) and adhering to best practices for data protection compliance."
    }
  ],
  "skills": " **Programming Languages**\n\tJava, Python, JavaScript/TypeScript, Ruby\n\n**Backend Frameworks**\n\tSpring Boot, FastAPI, Flask, Django, Ruby on Rails\n\n**Frontend Frameworks**\n\tReact, Vue, Angular\n\n**API Technologies**\n\tOAuth2, JWT, Keycloak (OIDC, RBAC)\n\n**Serverless and Cloud Functions**\n\tAWS: Lambda, ECS, S3, RDS, Azure: App Services, Blob Storage, SQL Database\n\n**Databases**\n\tPostgreSQL, MySQL, MongoDB, Redis, Astra-DB, Cassandra\n\n**DevOps**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD\n\n**Cloud & Infrastructure**\n\tTerraform, Ansible, Helm, Docker Compose, gcloud\n\n**Other**\n\tMachine learning, Mathematics, Financial products, Stock market, Communication, Accountability, Team play, Problem-solving, Decision making, Test Driven Development",
  "apply_company": "wealthAPI"
}