{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Full Stack Developer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-187801395/",
  "profile_summary": "Full Stack Developer with 13+ years of experience in delivering high-performance applications, particularly utilizing **TypeScript**, **React**, **Next.js**, **Node.js**, and **PostgreSQL**. Proficient in frontend and backend development, with a solid grasp of both **React Native** and **Expo** for mobile applications. Demonstrated capability in building scalable solutions and enhancing user experiences through agile practices. \nSkilled communicator, fluent in both English and Polish, with strong teamwork and self-motivation skills, which have facilitated successful collaboration across multidisciplinary teams.\nAdditionally, possesses hands-on expertise in **Python**, **Flutter**, and experience in hands-on deployment of applications in cloud environments such as **AWS** and **Azure**. Familiarity with compliance-driven development and adeptness in leveraging AI/ML technologies for advanced predictive analytics and automation.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Full Stack Developer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Utilized **TypeScript** to design and build full-stack platforms focused on healthcare and fintech, ensuring responsive and efficient user interfaces with **React** and **Next.js**.\nImplemented server-side rendering using **Node.js** to enhance application performance and SEO for financial and health-related web applications.\nManaged data persistence with **PostgreSQL**, ensuring database integrity and optimized queries to handle high volumes of transactions and data retrieval.\nDelivered mobile applications for iOS and Android leveraging **React Native** and integrating features via **Expo**, ensuring a smooth user experience across platforms.\nEmployed effective communication skills in a collaborative team environment to deliver projects on time, while also demonstrating self-motivation and initiative in problem-solving and enhancements.\nMaintained and updated existing applications to utilize modern libraries and frameworks, ensuring they adhered to the latest technologies and standards.\nContributed to a team-oriented atmosphere by facilitating communication and collaboration among team members, aligning development objectives with stakeholder requirements.\nDeveloped user-centric applications, prioritizing scalability and performance, utilizing modern web technologies to achieve business goals.\nEnhanced collaboration strategies within the team, promoting best practices in coding and agile methodologies to optimize workflows for continuous improvement.\nDemonstrated adaptability by learning and integrating new frameworks and libraries as required to meet project demands, enhancing overall team productivity."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Utilized **TypeScript**, **React** (18), and **Next.js** to build interactive front-end applications, enhancing user experience for financial tools and admin panels.\nImplemented scalable back-end solutions with **Node.js** (NestJS/Express) and **PostgreSQL**, improving performance for high-volume transactional systems.\nCollaborated effectively in a team environment, leveraging strong **communication skills** to coordinate with cross-functional teams on project development.\nModernized core financial platforms by migrating to microservices architecture, incorporating efficient development practices and self-motivation to meet project deadlines.\nDelivered real-time analytics dashboards using **React**, **D3.js**, and **Power BI Embedded**, which provided operational teams with insights into transactions and anomalies, improving decision-making.\nDesigned an event-driven architecture utilizing **Kafka**, **RabbitMQ**, and **Azure Service Bus**, allowing seamless asynchronous communication across critical workflows.\nDeveloped and optimized ETL pipelines for ingesting financial data from both internal and third-party sources using **Python**, **Apache Airflow**, and **Azure Data Factory**, ensuring reliable data processing.\nCreated ML models for fraud detection employing **scikit-learn**, **XGBoost**, and **Azure ML**, enhancing proactive security measures and improving transactional safety metrics by **30%**.\nBuilt machine learning pipelines for various operational needs, including credit scoring and transaction classification, integrating them into back-end services using **MLflow** and **Airflow**."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Utilized **TypeScript** in developing responsive, user-friendly applications using **React** (18) and **Next.js**, ensuring high code quality and maintainability for cross-platform solutions.\nEngineered backend services with **Node.js** frameworks such as **Express** to create seamless integrations with database systems like **PostgreSQL**, optimizing performance for a high-traffic global e-commerce platform.\nCollaborated effectively in a cross-functional team environment, leveraging **English** and **Polish** communication skills to discuss project specifications and ensure alignment on deliverables.\nDesigned and implemented robust API services to interact with client-side applications, facilitating real-time data flow and enhancing user engagement.\nApplied efficient debugging and troubleshooting strategies to resolve issues quickly, improving application uptime and overall user satisfaction by **20%**.\nContinuously improved development workflows with self-motivation and a proactive approach to learning emerging technologies relevant to the tech stack.\nParticipated in agile project management, contributing to sprint planning and retrospectives, which improved team productivity and cohesiveness, reducing project delivery time by **15%**.\nEngaged in teamwork to brainstorm and execute innovative solutions for complex coding challenges while adhering to best practices in development and version control using tools like Git.\nActively contributed to maintaining documentation, providing clear guidelines and maintenance instructions for future developers, ensuring smooth transitions and handoffs.\nUtilized feedback from peer code reviews to refine skills and foster a collaborative working environment focused on mutual growth."
    }
  ],
  "skills": "### **Programming Languages**\n\tPython\n\tJavaScript\n\tTypeScript\n\n### **Frontend Frameworks**\n\tReact\n\tNext.js\n\tReact Native\n\tVue\n\tAngular\n\n### **Backend Frameworks**\n\tFastAPI\n\tFlask\n\tDjango\n\tNode.js\n\n### **API Technologies**\n\tSupabase\n\n### **Databases**\n\tPostgreSQL\n\tMySQL\n\tMongoDB\n\tRedis\n\n### **DevOps**\n\tDocker\n\tKubernetes\n\tGitHub Actions\n\tGitLab CI/CD\n\tTerraform\n\tAnsible\n\tHelm\n\tDocker Compose\n\n### **Serverless and Cloud Functions**\n\tAWS: ECS, Lambda, RDS, S3\n\tAzure: App Services, Blob Storage, SQL Database\n\n### **Cloud & Infrastructure**\n\tNginx\n\tLet’s Encrypt\n\tCertbot\n\n### **Other**\n\tMLflow\n\tAirflow\n\tKubeflow\n\tEnglish\n\tPolish\n\tcommunication skills\n\tself-motivation\n\tteamwork"
}