{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior HubSpot Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "As a Senior HubSpot Engineer with 8 years of full-stack development experience, I possess strong skills in integrating and automating workflows using **HubSpot**, **API**, and **REST APIs**. My technical proficiency also includes **JavaScript**, **HTML**, and **CSS**, enabling me to create versatile solutions tailored for CRM and automation needs. I have effectively utilized tools like **Zapier** and **Workato** to streamline processes and enhance data manipulation capabilities.\n\nIn my previous roles, I have developed and managed automated pipelines and workflows aimed at improving operational efficiency. My expertise in data handling and problem-solving allows me to tackle complex challenges with attention to detail. I have successfully communicated with cross-functional teams to deliver high-performance solutions that meet business objectives, particularly in sectors focused on technology-driven growth.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior HubSpot Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Developed and managed automated processes in **HubSpot** using **HubL** for CRM integration and data manipulation to enhance customer relationship management efficiency.\nCreated and optimized **REST APIs** for seamless data flow between **HubSpot** and various applications, improving data accessibility and communication across platforms.\nDesigned CRM automation workflows with tools like **Zapier** and **Workato** to streamline operations and enhance user engagement based on analyzed data insights.\nBuilt and maintained high-performance data pipelines for import/export activities, ensuring data integrity and accuracy in compliance with client specifications.\nUtilized **JavaScript**, **HTML**, and **CSS** for customizing user-facing elements in **HubSpot** solutions, improving user experience and interface interaction.\nExecuted SQL queries to retrieve and manage data effectively within **HubSpot**, enabling precise data manipulation for analytics and reporting.\nDemonstrated strong problem-solving skills by addressing automation issues, ensuring smooth operation workflows under tight deadlines and with attention to detail.\nFostered effective communication channels with stakeholders to gather requirements, troubleshoot issues, and deliver solutions tailored to client needs.\nImplemented a structured testing strategy covering unit and integration tests for automated workflows and APIs, enhancing the reliability of developed processes."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Developed and maintained **REST APIs** and **CRM** integrations using **JavaScript**, **HTML**, and **CSS**, ensuring seamless communication between **HubSpot** and other platforms that enhanced customer engagement and experience.\nImplemented automation pipelines using **Zapier** and **Workato**, streamlining repetitive tasks and improving overall operational efficiency by reducing manual errors by **30%**.\nCollaborated effectively with cross-functional teams to identify business needs and translate them into technical requirements, enhancing user satisfaction through problem-solving and attention to detail.\nExecuted comprehensive data manipulation and analysis using **SQL**, enabling the extraction of actionable insights and strategic decision-making that boosted lead conversion rates by **25%**.\nDesigned and built user-friendly front-end applications leveraging **JavaScript** frameworks, delivering responsive and adaptive interfaces to elevate customer interactions within the HubSpot ecosystem.\nLed training sessions for internal staff on the usage of **HubSpot** functionalities, improving team competency and enhancing CRM utilization by **40%** over **6 months**.\nUtilized extensive knowledge of API integrations to enhance the HubSpot platform's capabilities, ensuring compliance with business processes and strategies.\n"
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "- Developed and integrated **API** solutions within the **HubSpot** ecosystem, leveraging **REST APIs** for effective data manipulation and interaction with various client systems.\n- Automated marketing workflows utilizing **Zapier** and **Workato**, significantly enhancing operational efficiency and reducing manual intervention by up to **75%**.\n- Collaborated with cross-functional teams to create user-friendly and dynamic CRM interfaces using **JavaScript**, **HTML**, and **CSS**, leading to improved engagement and user satisfaction scores of **+30%**.\n- Implemented robust automation pipelines within HubSpot, ensuring seamless data flow and integrity across **CRM** systems and achieving data accuracy improvements of **50%**.\n- Engaged in strategic problem-solving and communication with stakeholders to refine requirements, demonstrating strong attention to detail and delivering solutions aligned with business objectives.\n- Conducted comprehensive performance analysis and adjustments to HubSpot integrations, optimizing system responsiveness and reducing downtime by **20%**.\n- Maintained thorough documentation of technical processes and configurations, ensuring transparency and facilitating improved onboarding processes for new team members."
    }
  ],
  "skills": " **Programming Languages:**\n\tJavaScript, Python, TypeScript, HTML, CSS\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tREST APIs, API\n\n**Serverless and Cloud Functions:**\n\tAWS (Lambda), Azure\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis, SQL\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS (ECS, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, Keycloak, JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, HubSpot, CRM, automation, pipeline, HubL, Zapier, Workato, data manipulation, communication, problem-solving, attention to detail",
  "apply_company": "Somewhere"
}