{
  "name": "Tomasz Lee",
  "role_name": "Senior Fullstack Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Dedicated Senior Fullstack Engineer with 9+ years of experience in designing, developing, and implementing complex applications. Proficient in **Python**, **Go**, **TypeScript**, and **React**, with a strong focus on **APIs**, **Distributed Systems**, and **cloud services** such as **GCP** and **AWS**. Expertise in modern containerization and orchestration technologies including **Docker** and **Kubernetes**. Demonstrated success in delivering robust, scalable solutions while optimizing performance and enhancing user experiences. Exceptional collaborative skills, leading cross-functional teams and driving projects to successful completion. Strong foundation in accounting software systems, with a commitment to applying technology solutions to meet business needs.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Senior Fullstack Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "• Developed RESTful APIs using **Python** and **TypeScript** that integrated seamlessly with front-end frameworks like **React**, enhancing system performance by 30%.\n• Spearheaded the implementation of a microservices architecture utilizing **Docker** and **Kubernetes**, improving deployment efficiency by 25%.\n• Collaborated on distributed systems architecture employing **GCP** and **AWS**, enabling seamless scalability to support user growth by 50% within 6 months.\n• Enhanced data processing capabilities by integrating messaging systems such as **RabbitMQ** and **Apache Kafka**, resulting in a 40% increase in data handling throughput.\n• Designed and optimized cloud-based solutions with focus on fault tolerance and high availability, achieving a system uptime of 99.9% in a production environment.\n• Utilized advanced caching strategies with **Redis** to dramatically reduce average response time by 35%, optimizing overall application performance.\n• Built and deploy microservices that interact with various data sources, ensuring consistent and seamless data flow across platforms using **APIs**.\n• Contributed to the development of accounting software features, leveraging strong knowledge in financial data handling enhancing accuracy and compliance.\n• Engaged UI/UX teams to enhance user interfaces, leading to a significant uplift in user satisfaction metrics by 25%.\n• Implemented CI/CD practices leveraging **Azure DevOps**, achieving a reduction in deployment time by 40% across multiple iterations."
    },
    {
      "role": "Software Engineer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "Utilized **TypeScript** to develop and maintain intricate frontend components within the React ecosystem, resulting in a 25% increase in user engagement.\nDesigned and implemented robust and scalable RESTful APIs with **Python** and **Go** for seamless integration with various backend services.\nEmployed **Docker** and **Kubernetes** for containerization and orchestration of applications, enhancing deployment efficiency by 20%.\nLeveraged cloud services such as **GCP** and **AWS** for infrastructure management, ensuring high availability and performance of distributed systems.\nCreated and optimized shared **APIs** for communication between microservices, streamlining the data flow and reducing latency by 30%.\nDeveloped interactive data visualizations using **React** and third-party libraries to enhance reporting functionalities for end users.\nLed migration efforts to adopt **cloud-based** accounting software, improving financial reporting accuracy and accessibility.\nCollaborated across multidisciplinary teams to define requirements, timelines, and development standards to ensure project goals were consistently met.\nConducted thorough code reviews to uphold software quality standards, mentoring junior developers and improving team output.\nImplemented CI/CD practices to automate deployment processes, decreasing lead time for features from **4 weeks** to **1 week**."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "Implemented distributed systems using **Python** and **Go**, enhancing system scalability and reliability.\nDeveloped dynamic user interfaces with **TypeScript** and **React**, leading to a 30% increase in user engagement.\nArchitected and deployed containerized applications with **Docker** and **Kubernetes**, achieving a 25% reduction in infrastructure costs.\nLeveraged cloud services from **GCP** and **AWS** to optimize application performance and ensure high availability.\nIntegrated and developed APIs for seamless data interchange among microservices, improving system interoperability.\nParticipated in Agile methodologies, contributing to daily standups and milestone planning for project efficiency.\nMaintained and improved legacy systems by applying best practices in debugging and code optimization, resulting in a **15%** decrease in downtime.\nContributed to the documentation of software architecture and API specifications, ensuring comprehensive understanding across teams.\nProvided guidance on implementing accounting software integrations, facilitating more accurate financial reporting for clients."
    }
  ],
  "skills": " **Programming Languages**\n\tPython, TypeScript, Go\n\n **Backend Frameworks**\n\tNodeJS, ExpressJS, NestJS, C#, .NET, Entity Framework, Microservices\n\n **Frontend Frameworks**\n\tReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n **API Technologies**\n\tRESTful API, GraphQL, APIs\n\n **Serverless and Cloud Functions**\n\tAWS, GCP\n\n **Databases**\n\tMSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB\n\n **DevOps**\n\tDocker, Kubernetes, CI/CD pipelines\n\n **Cloud & Infrastructure**\n\tAzure\n\n **Other**\n\tUX/UI Design, Git, GitHub, Redux, Blockchain: Solidity, Ether.js, Web3.js, Ethereum, Distributed Systems, Accounting Software, Messaging & Caching: Apache Kafka, RabbitMQ, Redis, Testing Tools: NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest",
  "apply_company": "Rho"
}