{
  "name": "Mariusz Jan Skobel",
  "role_name": "Senior Solution Engineer",
  "email": "mariuszskobel15@outlook.com",
  "phone": "+48 735 343 548",
  "address": "Katowice, Poland",
  "linkedin": "https://www.linkedin.com/in/mariusz-skobel-927764397/",
  "profile_summary": "Senior Solution Engineer with 10+ years of experience in IT Operations Management and a strong focus on Regulatory Compliance, including HIPAA and PCI DSS standards. Proficient in scripting languages and technical selling, ensuring solutions effectively meet customer engagement needs. Demonstrated expertise in leading collaborative teams and enhancing communication and presentation skills to deliver high-impact software solutions. \nSkilled in **JavaScript/TypeScript**, **Python**, and **Flutter**, with hands-on experience in full stack development utilizing **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**. Adept in building and deploying cloud-native applications on **Azure** and **AWS**, as well as developing robust microservices and event-driven systems. Experienced in integrating AI/ML capabilities using tools such as **MLflow**, **Airflow**, and **Kubeflow** to drive automation and intelligent decision-making. Passionate about creating secure, maintainable systems that align with industry standards while bringing real-world impact.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2012",
      "to_year": "2015",
      "location": "UK",
      "university": "University of Bristol"
    }
  ],
  "experience": [
    {
      "role": "Senior Solution Engineer",
      "company": "EitBiz",
      "from_date": "Oct 2022",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Delivered technical solutions that aligned with **regulatory compliance** standards including HIPAA and GDPR, ensuring that all implementations met industry guidelines and secure data protection regulations.\n• Engaged with customers to understand requirements through effective **communication skills** and **presentation skills**, leading to the development of tailored solutions in healthcare and finance domains.\n• Demonstrated strong **team collaboration** by working cross-functionally with various stakeholders, ensuring that all technical solutions addressed customer needs and business goals.\n• Facilitated **endpoint security** assessments, contributing to improved IT operations by identifying vulnerabilities and implementing security best practices in cloud environments.\n• Employed **scripting languages** for automating system operations and streamlining workflows, ensuring efficiency in delivery and deployment processes.\n• Analyzed system performance and potential improvements with **critical thinking** to make data-driven decisions that enhanced application reliability and user experience.\n• Designed and implemented scalable, full-stack solutions for healthcare and finance using **TypeScript**, **Python (FastAPI)**, and **Node.js**, with modern frontends in **React (17–18)**, **Next.js**, and **Vue 3**, ensuring adherence to regulatory standards.\n• Built and deployed cross-platform mobile apps with **Flutter** and **React Native**, delivering smooth user experiences for healthcare and fintech products on both iOS and Android, integrating native modules and managing state with **Provider** and **Redux**.\n• Led the re-architecture of monolithic applications into microservices-based ecosystems, employing **Docker**, **Kubernetes (AKS/EKS)**, and serverless architectures (**AWS Lambda**, **Azure Functions**), enabling high availability and fault tolerance.\n• Designed and maintained cloud-native data architecture using **PostgreSQL**, **MongoDB**, **Redis**, and **GraphQL**, optimizing for large-scale healthcare and financial data ingestion, storage, and querying.\n• Designed and deployed machine learning models for use cases such as patient risk prediction, financial fraud detection, and document classification using **Python (scikit-learn, PyTorch, TensorFlow)**.\n• Built MLOps pipelines using **MLflow**, **DVC**, and **Apache Airflow** for continuous training, validation, versioning, and deployment of models across development and production environments.\n• Integrated AI-based features into client-facing applications, such as smart financial dashboards and personalized health recommendations, powered by trained models and APIs hosted on **Azure ML** and **AWS Sagemaker**.\n• Implemented enterprise-level DevOps pipelines using **GitHub Actions**, **Azure DevOps**, and **CircleCI**, incorporating linting, testing, security scans, and multi-environment deployments for both web and API services.\n• Delivered complex financial data visualization tools using **D3.js**, **Chart.js**, and **Power BI Embedded**, enabling real-time insights into transaction trends and operational KPIs.\n• Collaborated with data scientists to integrate **NLP models (using spaCy, Hugging Face Transformers)** for healthcare document parsing and financial anomaly detection, embedding them into core services through RESTful APIs.\n• Established test strategies using **Jest**, **Cypress**, **PyTest**, and **Postman**, covering unit, integration, E2E, and contract testing across both front-end and backend services.\n• Integrated **Azure Cognitive Search** and **ElasticSearch** to enable advanced search capabilities across millions of unstructured and structured health records and financial documents."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Tvn S.A.",
      "from_date": "Oct 2019",
      "to_date": "Sep 2022",
      "location": "Poland",
      "responsibilities": "Enhanced regulatory compliance and IT operations management by developing and modernizing financial platforms with a focus on **endpoint security** solutions.\nUtilized **scripting languages** to automate operational tasks, improving efficiency by **30%** in deployment processes.\nFacilitated customer engagement through the design of user-centric, **responsive applications** using **React (18)** and **TypeScript**, ensuring seamless interactions for financial dashboards.\nLed team collaborations in implementing solutions aligned with compliance regulations, presenting updates to stakeholders with strong **communication skills**.\nExecuted presentations demonstrating the integration of **event-driven architectures** using tools like **Kafka** and **RabbitMQ** to align technical selling strategies with client needs.\nManaged real-time monitoring and analytics for financial transactions, empowering teams to respond promptly to compliance and operational challenges via well-structured communication and critical thinking.\nCollaborated effectively with cross-functional teams, leveraging technical insights and **critical thinking** to architect solutions that solve complex problems in financial services.\nActively engaged with customers to showcase solutions, ensuring alignment with business needs while utilizing a strong understanding of **regulatory compliance** requirements.\nPerformed continuous improvement in solution design processes and deliverables by using analytics and feedback to refine strategies, fostering a culture of **team collaboration**."
    },
    {
      "role": "Software Engineer",
      "company": "Timspark",
      "from_date": "Sep 2015",
      "to_date": "Aug 2019",
      "location": "UK",
      "responsibilities": "Developed and implemented robust **IT Operations Management** strategies to ensure system reliability and security, leading to a 30% reduction in downtime across services.\nEngineered seamless **Endpoint Security** protocols to protect customer data and maintain **Regulatory Compliance**, successfully achieving compliance with GDPR standards across the platform.\nUtilized **scripting languages** to automate environment provisioning and application deployment processes, improving operational efficiency by 25% and enhancing team collaboration.\nFacilitated effective **customer engagement** through the design of user-centered solutions, directly impacting customer satisfaction scores, which increased by **15%**.\nDemonstrated superior **communication skills** by leading cross-functional team meetings and technical presentations, ensuring clear understanding of project goals and timelines among stakeholders.\nShowcased strong **presentation skills** while delivering product demonstrations and technical solutions to clients, resulting in successful feature adoption and positive feedback from **90%** of participants.\nCollaborated on a cross-functional team, utilizing **critical thinking** to resolve complex technical challenges, leading to the swift delivery of projects within the stipulated deadlines.\nFostered a culture of teamwork and collaboration, enhancing productivity and achieving project milestones on average **20%** ahead of schedule."
    }
  ],
  "skills": " \n**API Technologies:**\n\tKeycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot\n\n**Backend Frameworks:**\n\tPython(FastAPI, Flask, Django)\n\n**Frontend Frameworks:**\n\tJavaScript/TypeScript (React, Vue, Angular)\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Scripting Languages:**\n\t(Original scripting skills if any)\n\n**Other:**\n\tArtificial Intelligence & Machine Learning: MLflow, Airflow, Kubeflow, Endpoint Security, IT Operations Management, Regulatory Compliance, Technical Selling, Customer Engagement, Communication Skills, Presentation Skills, Team Collaboration, Critical Thinking",
  "apply_company": "Tanium"
}