{
  "name": "Rei Taro",
  "role_name": "Senior Test Engineer",
  "email": "rei515@outlook.com",
  "phone": "+48732529451",
  "address": "Warszawa, Poland",
  "linkedin": "https://www.linkedin.com/in/rei-taro-81a410391/",
  "profile_summary": "Dynamic Senior Test Engineer with over 10 years of experience in backend development, focusing on creating robust testing strategies for high-performing applications using **TypeScript**, **Playwright**, **Python**, **Pytest**, **Selenium**, and **Cypress**. Proficient in leveraging **AWS**, **GCP**, and **Azure** for cloud testing and deployment, driving efficient automation and QA processes. Proven ability to design scalable test frameworks that enhance performance and ensure quality across various financial platforms and AI/ML solutions. A track record of impactful contributions at leading organizations, including VISA, Sii Poland, and Reply Polska.",
  "education": [
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2010",
      "to_year": "2015",
      "location": "Japan",
      "university": "Keio University"
    }
  ],
  "experience": [
    {
      "role": "Senior Test Engineer",
      "company": "Leobit",
      "from_date": "Aug 2022",
      "to_date": "Present",
      "location": "Poland",
      "responsibilities": "Utilized **TypeScript** and **Playwright** for automated testing frameworks to enhance the testing capabilities for web applications.\nImplemented robust test strategies with **Pytest**, **Selenium**, and **Cypress** to ensure the highest quality of software delivered at **99%** accuracy.\nConducted performance testing with a focus on scalability and reliability of services hosted on **AWS** and **GCP**.\nCollaborated with development teams to design test plans and strategies that align with Agile methodologies, enhancing deployment frequency by **30%**.\nLeveraged **GitHub** for version control and managing code repositories, resulting in a streamlined development cycle and reduced merge conflicts by **50%**.\nDeveloped and maintained CI/CD pipelines for deployment to **Azure**, ensuring rapid and dependable release of new features.\nEngaged in continuous improvement of testing processes, reducing test cycle time by **40%** through automation and efficient resource allocation."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Innovature",
      "from_date": "Nov 2018",
      "to_date": "Jun 2022",
      "location": "Japan",
      "responsibilities": "Utilized **TypeScript** and **Playwright** in automated testing scenarios, ensuring comprehensive test coverage and reliability across web applications.\nImplemented test automation frameworks with **Python**, incorporating **Pytest** and **Selenium** to enhance testing efficiency by over **30%**.\nDeveloped end-to-end testing strategies utilizing **Cypress** for real-time feedback and immediate bug detection, significantly reducing time to deployment by **25%**.\nManaged version control and collaboration processes using **GitHub**, facilitating a seamless integration and deployment workflow across the development team.\nDesigned and executed performance and load testing to validate application stability under varying conditions on **AWS** and **Azure**, achieving a latency reduction of **15%**.\nCollaborated cross-functionally with product and development teams to define testing requirements and ensure alignment with user expectations and regulatory compliance.\nParticipated in code reviews and maintained best practices to ensure high-quality outcomes in the testing processes."
    },
    {
      "role": "Software Developer",
      "company": "Wizcorp",
      "from_date": "Apr 2015",
      "to_date": "Nov 2018",
      "location": "Japan",
      "responsibilities": "Utilized **Python** and **PyTest** to develop and execute comprehensive automated test suites, enhancing code reliability and performance by up to **30%**.\nIntegrated **TypeScript** and **Playwright** for end-to-end testing of applications, ensuring consistent quality across different environments and reducing bugs by **15%**.\nCollaborated with development teams to implement **AWS** and **GCP** solutions for test environments, achieving faster deployment times by **25%** and improving scalability.\nLeveraged **GitHub** for version control and to streamline collaboration among teams, facilitating smoother code reviews and integration processes.\nAdopted **Cypress** and **Selenium** for functional and regression testing, ensuring high coverage and robustness of applications across varying platforms.\nImplemented cloud-based testing strategies on **Azure**, allowing for seamless testing and production parity.\nConducted code reviews and provided mentorship on best practices for test automation using modern frameworks and tools."
    }
  ],
  "skills": "**Programming Languages**\n\tPython (3.8+), TypeScript, SQL, Bash, JavaScript\n\n**Backend Frameworks**\n\tFastAPI, Flask, Django, Celery\n\n**Frontend Frameworks**\n\tPlaywright, Selenium, Cypress\n\n**API Technologies**\n\tREST/gRPC APIs, Microservices\n\n**Serverless and Cloud Functions**\n\tAWS (EC2, S3, Lambda), Azure, GCP\n\n**Databases**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps**\n\tDocker, Kubernetes, GitHub Actions, Azure DevOps, CI/CD, PyTest, Git\n\n**Cloud & Infrastructure**\n\tAWS, Azure\n\n**Other**\n\tPandas, NumPy, scikit-learn, TensorFlow, Airflow, MLflow, Kafka",
  "apply_company": "SentinelOne"
}