{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Go Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-187801395/",
  "profile_summary": "Go Engineer with 13+ years of full stack development experience, specializing in building high-performance applications with robust infrastructures. Proficient in cloud services such as **AWS**, **Azure**, and **Google Cloud**, along with comprehensive expertise in **Kubernetes**, **Terraform**, and Infrastructure as Code principles. Skilled in CI/CD practices, implementing **GitOps**, and ensuring quality through unit and integration testing.\nStrong background in developing distributed systems with a focus on security measures, IAM, and telemetry. Proven problem-solving capabilities complemented by effective collaboration and communication skills. Adept at integrating emerging technologies, including AI/ML, delivering solutions aligned with industry compliance standards. Proficient with **JavaScript/TypeScript**, **Python**, and **Flutter**, while also leveraging frameworks like **React**, **Node.js**, and **FastAPI**.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Go Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Developed scalable and secure **Go** applications leveraging **AWS**, **Azure**, and **Google Cloud** to manage cloud infrastructure and services.\n- Designed and implemented CI/CD pipelines using tools such as **Terraform**, ensuring automated deployment and infrastructure as code practices to enhance operational efficiency.\n- Architected distributed systems with microservices architecture, utilizing **Kubernetes** for orchestration and management of containerized applications, leading to improved scalability and resilience.\n- Implemented robust security measures by integrating IAM protocols and telemetry, achieving compliance with organizational security standards and best practices.\n- Created comprehensive unit testing and integration testing frameworks using **Linux/Unix** environments to guarantee code quality and reliability.\n- Collaborated with cross-functional teams, enhancing communication on project requirements and deliverables while supporting agile methodologies to speed up development cycles.\n- Employed problem-solving techniques to troubleshoot complex technical issues within the codebase and infrastructure, contributing to smoother operational workflows and reduced downtime.\n- Developed monitoring and logging solutions for applications, providing key performance metrics and insights to enhance system stability and performance."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Utilized **AWS** and **Azure** to enhance cloud infrastructure for financial applications, focusing on scalability and security across distributed systems.\nDeveloped CI/CD pipelines with **Terraform** and GitOps strategies, ensuring efficient deployment and management of services in a Kubernetes environment.\nImplemented unit testing and integration testing frameworks for **Go**, ensuring the reliability and performance of microservices within the application stack.\nCollaborated with cross-functional teams to improve **Infrastructure as Code** principles, enabling rapid provisioning and management of cloud resources across **Google Cloud**, **AWS**, and **Azure**.\nDesigned robust IAM strategies to strengthen security protocols, ensuring compliance and protecting sensitive financial data.\nLeveraged telemetry tools for enhanced monitoring and logging, providing real-time insights into application performance and system operations.\nDemonstrated exceptional problem-solving skills by identifying bottlenecks in the architecture and enhancing system responsiveness by **30%**.\nEngaged in regular communication with stakeholders to align engineering goals with business objectives, fostering a collaborative work environment.\nContributed to the optimization of deployment processes, achieving a **50%** reduction in deployment time through efficient CI/CD practices."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Designed and optimized distributed systems leveraging **Go** and **AWS**, ensuring high availability and scalability across microservices for a global e-commerce platform.\nImplemented Infrastructure as Code using **Terraform** to manage and provision cloud infrastructure across **AWS**, enhancing deployment efficiency and reliability.\nDeveloped CI/CD pipelines with **Kubernetes** and GitOps principles, enabling streamlined code integration, automated testing, and deployment workflows that reduced lead time by **30%**.\nCollaborated with cross-functional teams to implement role-based access control (RBAC) and security measures, ensuring compliance with IAM standards and enhancing application security.\nEngineered telemetry solutions for performance monitoring and log management, improving system observability and problem-solving capabilities.\nConducted unit testing and integration testing to deliver high-quality code, achieving a test coverage rate of **85%** and ensuring seamless functionality across services.\nHoned problem-solving and communication skills by participating in agile ceremonies and brainstorming sessions, enhancing team collaboration and reducing feature delivery time by **20%**.\nParticipated in code reviews and knowledge-sharing sessions, fostering a culture of continuous improvement and collaboration within the engineering team.\nUtilized **Linux/Unix** environments for application deployment and management, ensuring optimal performance and reliability across production systems."
    }
  ],
  "skills": " **Programming Languages:**\n\tGo,\n\tPython,\n\tJavaScript/TypeScript\n\n **Backend Frameworks:**\n\tFastAPI,\n\tFlask,\n\tDjango\n\n **Frontend Frameworks:**\n\tReact,\n\tVue,\n\tAngular\n\n **API Technologies:**\n\tKeycloak (OIDC, RBAC),\n\tOAuth2,\n\tJWT\n\n **Serverless and Cloud Functions:**\n\tAWS: ECS,\n\tLambda,\n\tAzure: App Services,\n\tGoogle Cloud\n\n **Databases:**\n\tPostgreSQL (Fintech),\n\tMySQL (Healthcare),\n\tMongoDB (Gaming),\n\tRedis\n\n **DevOps:**\n\tDocker,\n\tKubernetes,\n\tGitHub Actions,\n\tGitLab CI/CD,\n\tCI/CD,\n\tGitOps\n\n **Cloud & Infrastructure:**\n\tTerraform,\n\tAnsible,\n\tHelm,\n\tDocker Compose,\n\tInfrastructure as Code,\n\tIAM,\n\tSecurity\n\n **Other:**\n\tMLflow,\n\tAirflow,\n\tKubeflow,\n\tDistributed Systems,\n\tTelemetry,\n\tUnit Testing,\n\tIntegration Testing,\n\tLinux/Unix,\n\tProblem-solving,\n\tCollaboration,\n\tCommunication"
}