{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Lead Sitecore Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-karol-kotlinski-bb2520397/",
  "profile_summary": "As a Lead Sitecore Engineer with 8 years of comprehensive experience, I specialize in **Sitecore**, **C#**, and **.NET 8**, driving high-performance solutions within the healthcare and financial sectors. My technological expertise includes **Azure Web Apps**, **Azure Functions**, **Azure SQL Databases**, and **Azure DevOps**, accompanied by hands-on skills in **PowerShell** and **Kubernetes**. I am proficient in **TypeScript**, **JavaScript**, **Vue3**, and **React**, allowing me to develop seamless full-stack applications.\n\nI have successfully led the development of enterprise-grade platforms that seamlessly integrate AI/ML capabilities for predictive analytics and intelligent automation. My deep cloud experience enhances application reliability and scalability, ensuring compliance with standards like HIPAA, FHIR, and PCI DSS. Additionally, I have a robust foundation in microservices architecture and CI/CD automation, which I leverage to build secure applications. My background also includes developing machine learning pipelines and implementing MLOps workflows using tools like MLflow, Airflow, and Kubeflow.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Lead Sitecore Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Designed and developed scalable solutions using **TypeScript**, **C#**, and **.NET 8**, ensuring seamless integration with **Azure Web Apps** and **Azure SQL Databases** to meet rigorous performance criteria.\nLed the implementation of cloud services with **Azure Functions** while leveraging **Azure DevOps** for CI/CD pipelines to streamline deployment processes, achieving a deployment frequency of more than 9 releases per week.\nArchitected and deployed high-performing applications using **Kubernetes** and **AKS**, ensuring scalability and resilience for mission-critical services with uptime exceeding **99.9%**.\nImplemented responsive designs using **CSS**, **Vue3**, and **React**, enhancing user experience and accessibility across all platforms, improving engagement metrics by over **30%**.\nCreated and maintained custom modules in **Sitecore**, optimizing backend infrastructure and ensuring compliance with a range of enterprise-level standards.\nFacilitated cross-functional collaboration by integrating third-party APIs, driving enhancements that support business logic for complex application workflows, achieving a reduction in operational overhead by **15%**.\nManaged database solutions using **Azure SQL Databases** for transactional processing and data storage, enhancing data retrieval speed by leveraging indexed queries, with an overall query performance improvement of **50%**.\nUtilized **PowerShell** scripts for automation and management tasks within the Azure environment, reducing manual overhead by over **40 hours per month**.\nEngaged in continuous learning and implementation of modern development practices to keep the team abreast of technological advancements, mentoring junior engineers on best practices with **Azure DevOps** and modern frameworks like **React** and **Vue3**.\nEstablished testing methodologies and automated testing infrastructures ensuring code quality through tools such as Jest and Cypress with rigorous CI/CD integration, totaling over **100 unit tests** covered for new features."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "- Developed and maintained scalable web applications using **C#** and **.NET 8**, ensuring high performance and responsiveness for user interactions.\n- Led the integration of **Azure Web Apps** and **Azure Functions** to support microservices architecture, enhancing system reliability and deployment efficiency.\n- Utilized **TypeScript** and modern JavaScript libraries, including **Vue 3** and **React**, to create intuitive user interfaces that improved customer engagement and satisfaction.\n- Implemented continuous integration and delivery practices using **Azure DevOps**, streamlining development workflows and reducing deployment time by **30%**.\n- Managed data storage solutions with **Azure SQL Databases**, focusing on performance optimization and secure access for large data sets relevant to financial applications.\n- Utilized **Kubernetes** and **AKS** for container orchestration, leading to enhanced scalability and management of cloud-based services with minimal downtime.\n- Enhanced search functionalities through integration with **Solr Cloud**, achieving a **40%** improvement in search result accuracy and retrieval times.\n- Leveraged **PowerShell** for automation of tasks and deployment processes, improving operational efficiency by **25%**.\n- Conducted code reviews and mentor junior developers on best practices in **React**, **Vue 3**, and **CSS**, fostering a culture of quality and continuous improvement within the team."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Developed and optimized scalable applications in **Azure Web Apps** using **.NET 8** and **C#**, ensuring high performance in key modules central to e-commerce functionalities.\nLeveraged **Azure Functions** for serverless processing and webhook integrations, enabling efficient data handling and real-time feature enhancements.\nUtilized **Azure SQL Databases** coupled with caching strategies for robust data management and rapid access in high-traffic scenarios, preparing for **10K+** customer transactions per day.\nImplemented CI/CD pipelines with **Azure DevOps** for seamless deployment and version control, reducing deployment times by **50%** and ensuring rapid iteration cycles.\nCreated and maintained responsive UIs using **React** and **Vue3**, ensuring accessibility compliance with **WCAG 2.1** and improving mobile engagement metrics by **30%**.\nApplied **Kubernetes** and **AKS** for container orchestration, streamlining application scaling and resilience across both development and production environments while reducing uptime issues to less than **1%**.\nIntegrated real-time search functionality using **Solr Cloud**, increasing search speed and relevance for users navigating through **10K+** products.\nEmployed **PowerShell** scripts for automation and toolchain management, boosting operational efficiency in development workflows.\nDeveloped frontend components with **TypeScript** and ensured styling consistency through **CSS** frameworks tailored for e-commerce platforms, improving developer productivity across the team.\nArchitected feature-rich, secure PayPal and Stripe payment integrations, implementing PCI compliance measures to safeguard customer transactions."
    }
  ],
  "skills": " **Programming Languages:**\n\tC#, TypeScript, JavaScript, Python\n\n**Backend Frameworks:**\n\t.NET 8, FastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Vue3, Angular, CSS\n\n**API Technologies:**\n\tJWT, OAuth2, Keycloak (OIDC, RBAC)\n\n**Serverless and Cloud Functions:**\n\tAzure Functions, AWS Lambda\n\n**Cloud & Infrastructure:**\n\tAzure Web Apps, Azure SQL Databases, Azure DevOps, Kubernetes, AKS, Docker, Terraform, Ansible, Helm, Docker Compose, GitHub Actions, GitLab CI/CD\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis, Azure SQL Databases\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, Nginx, Certbot, Solr Cloud"
}