{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Test Automation Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-karol-kotlinski-bb2520397/",
  "profile_summary": "As a highly skilled Senior Test Automation Engineer with 8 years of experience, I excel in Test Automation and CI/CD processes, utilizing tools such as **Jenkins**, **GitLab CI**, and **Docker**. My technical expertise includes **Python** and automation frameworks like **Playwright**, ensuring efficient and effective testing solutions. I possess strong skills in performance and load testing, leveraging tools like **Elastic Stack** and **Splunk** for comprehensive log collection and analysis. \nIn addition to my automation prowess, my background includes deep experience in cloud services such as **AWS**, **Azure**, and **GCP**. My problem-solving abilities, combined with effective communication and collaboration skills, support the development of robust testing environments in both **Linux** and **Windows** platforms. Moreover, my proficiency in **Kubernetes** complements my dedication to building scalable and resilient test automation frameworks. With a proven track record of driving quality and compliance in high-performance environments, I am committed to delivering top-notch solutions.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Test Automation Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Implemented test automation strategies across diverse applications using **Python** and **Playwright**, ensuring robust test coverage and enhanced software quality.\n- Developed and maintained CI/CD pipelines using **Jenkins**, **GitLab CI**, and **Azure DevOps**, facilitating seamless integration and deployment across multiple environments.\n- Collaborated with development teams to conduct performance testing and load testing on applications, utilizing tools like **JMeter** or **K6** to measure application scalability under load conditions of up to **50,000** concurrent users.\n- Utilized **Docker** and **Kubernetes** for containerization and orchestration of testing environments, improving consistency and reducing deployment times by **30%**.\n- Incorporated log collection mechanisms using **Elastic Stack**, **Splunk**, and **ArcSight** to monitor application performance and troubleshoot testing issues, improving incident response times by **25%**.\n- Conducted thorough problem-solving sessions with cross-functional teams, enhancing communication and collaboration while addressing critical testing bottlenecks and improving test accuracy.\n- Designed automated test suites using **Linux** and **Windows** environments, achieving an average test execution speed improvement of **40%** compared to manual testing.\n- Programmed effective test strategies using popular frameworks and libraries, including **Jest** and **Cypress**, to ensure high-quality deliverables in both web and backend services.\n- Worked on integrating advanced observability tools into the testing framework to gather insights and analyze performance metrics in real-time, fostering a culture of continuous improvement.\n- Conducted training workshops for team members on best practices in test automation, CI/CD, and collaborative tools, enhancing team skills and productivity."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "- Developed and implemented **test automation** frameworks leveraging **Python**, **Playwright**, and **Docker**, enhancing test coverage and execution speed by **30%**.\n- Collaborated with development teams to integrate **CI/CD** pipelines using **Jenkins** and **GitLab CI**, enabling automated testing and deployment processes, reducing release time by **40%**.\n- Conducted **performance testing** and **load testing** of financial applications with peak loads of **10,000+ concurrent users**, ensuring system stability and responsiveness.\n- Utilized **Elastic Stack** and **Splunk** for effective **log collection mechanisms**, enhancing error detection and system monitoring for real-time insights.\n- Created and maintained automated test scripts across different environments, including **Linux** and **Windows**, ensuring cross-platform compatibility and reliability.\n- Engaged in **problem-solving** and **collaboration** with cross-functional teams, fostering improvements in testing strategies and processes.\n- Integrated **Kubernetes** for container orchestration in test environments, increasing resource efficiency and scalability for testing applications.\n- Designed and executed testing strategies for applications deployed in **AWS**, **Azure**, and **GCP**, ensuring compliance and performance in a multi-cloud environment.\n- Championed the use of **Microsoft Azure Sentinel** for security testing and monitoring, enhancing detection of potential threats in deployment pipelines."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Implemented **Test Automation** strategies using **Playwright** to ensure robust functionality and performance across e-commerce applications, leveraging Python as the primary programming language.\nDesigned and maintained CI/CD pipelines utilizing **Jenkins** and **GitLab CI**, enhancing deployment efficiency with automated testing processes that reduced release times by up to **30%**.\nUtilized **Docker** and **Podman** for containerization, ensuring consistent testing environments across **Linux** and **Windows** operating systems, resulting in improved collaboration among development and testing teams.\nConducted **Performance Testing** and **Load Testing** to evaluate the scalability of backend services, utilizing tools such as **Elastic Stack** and **Splunk** to analyze test results and optimize system performance.\nDeveloped and executed log collection mechanisms to monitor application behavior, leveraging tools like **ArcSight** and **Microsoft Azure Sentinel** for effective incident management and security monitoring.\nCollaborated with cross-functional teams to identify and resolve issues, showcasing strong **problem-solving** and **communication** skills while driving a culture of quality assurance within agile frameworks.\nImplemented security best practices in test automation, ensuring compliance with **GDPR** and secure data handling in accordance with **OAuth 2.0** protocols.\nParticipated in cloud infrastructure testing on platforms like **AWS**, **Azure**, and **GCP**, enhancing scalability and reliability of cloud services used in continuous delivery workflows.\nActively contributed to team knowledge-sharing sessions, fostering collaboration and improving overall testing methodologies within the organization."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, JavaScript/TypeScript\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n **Frontend Frameworks:**\n\tReact, Vue, Angular\n\n **API Technologies:**\n\t\n\n **Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n **Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Jenkins, CI/CD, Terraform, Ansible, Helm, Docker Compose, Podman\n\n **Cloud & Infrastructure:**\n\tAWS, Azure, GCP\n\n **Other:**\n\tTest Automation, Playwright, Linux, Windows, Performance Testing, Load Testing, Log Collection Mechanisms, Elastic Stack, Splunk, ArcSight, Microsoft Azure Sentinel, Google Chronicle, Problem-solving, Communication, Collaboration"
}