{
  "name": "Mariusz Jan Skobel",
  "role_name": "Senior iOS Developer",
  "email": "mariuszskobel15@outlook.com",
  "phone": "+48 735 343 548",
  "address": "Katowice, Poland",
  "linkedin": "https://www.linkedin.com/in/mariusz-skobel-789557397/",
  "profile_summary": "Senior iOS Developer with over 10 years of experience in delivering high-performance applications in healthcare and finance. Proficient in **Swift**, **SwiftUI**, **UIKit**, and **Combine** for developing scalable and responsive iOS applications. Expertise in utilizing **Core Data** for local data management, implementing **URLSession** for network communication, and integrating **REST APIs** and **WebSockets** for real-time features. Strong knowledge in **biometric authentication**, **APNs**, and **Firebase Cloud Messaging** to enhance user experience and security. Experienced in applying **MVVM** and **VIPER** design patterns while adhering to **Clean Architecture** principles, ensuring maintainable and testable code. Skilled in employing **XCTest** for robust unit testing to maintain high code quality.\n\nAdditionally, I have hands-on experience in modern web technologies including **JavaScript/TypeScript**, **Python**, and **Flutter**, as well as frameworks such as **React**, **Next.js**, and **Django**. I bring practical knowledge in driving cloud-native application deployment on **Azure** and **AWS**, and have led enterprise platforms incorporating AI/ML for analytics and automation. My strong background in **microservices architecture** and **CI/CD** automation ensures that I deliver secure solutions compliant with standards like HIPAA and PCI DSS, creating systems that are impactful and technically sound.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2012",
      "to_year": "2015",
      "location": "UK",
      "university": "University of Bristol"
    }
  ],
  "experience": [
    {
      "role": "Senior iOS Developer",
      "company": "EitBiz",
      "from_date": "Oct 2022",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "•\tConstructed high-quality, user-centric applications utilizing **Swift**, **SwiftUI**, and **UIKit**, ensuring smooth performance and responsiveness across iOS devices.\n•\tImplemented REST APIs and **WebSockets** for real-time data synchronization and communication, enhancing user engagement and application responsiveness.\n•\tDeveloped data management solutions using **Core Data** for efficient data storage, retrieval, and manipulation in iOS applications, optimizing resource usage and performance.\n•\tIntegrated secure user authentication and data protection features with **Keychain** and **biometric authentication**, thereby ensuring compliance with data protection regulations.\n•\tUtilized **Combine** for asynchronous programming, streamlining data flow and improving the overall structure of the application.\n•\tEmployed **GCD** and **Operation Queues** for efficient background processing, improving UI responsiveness and task execution times by over **30%**.\n•\tDesigned and executed testing strategies using **XCTest**, ensuring robust unit tests and seamless integration testing for reliability before deployment.\n•\tLeveraged **MVVM** and **VIPER** architecture patterns to enhance the scalability of the application, promoting a clean and maintainable codebase.\n•\tManaged push notifications through **APNs** and **Firebase Cloud Messaging**, improving user engagement and retention by targeting specific user actions.\n•\tCollaborated with cross-functional teams to refine product features and improve the overall user experience, resulting in a **25%** increase in user satisfaction metrics.\n"
    },
    {
      "role": "Senior Software Engineer",
      "company": "Tvn S.A.",
      "from_date": "Oct 2019",
      "to_date": "Sep 2022",
      "location": "Poland",
      "responsibilities": "Utilized **Swift** and **SwiftUI** for developing intuitive and responsive iOS applications, enhancing user experience by 30% through efficient UI designs and leveraging **UIKit** for seamless animations and transitions.\nImplemented **Combine** for reactive programming, improving data flow management and reducing boilerplate code by 25% across various modules.\nApplied **GCD** and **Operation Queues** to optimize background tasks, effectively increasing app performance by 40% during high-load scenarios.\nManaged local data persistence using **Core Data**, achieving a 50% reduction in load times for frequently accessed user data.\nDeveloped and integrated robust **REST APIs** and **WebSockets** to facilitate real-time data updates in applications, enhancing the responsiveness of features by 60%.\nSecured user data by implementing **Keychain** for sensitive information storage and biometric authentication methods, improving security measures in line with current standards.\nConfigured **APNs** and **Firebase Cloud Messaging** for push notifications, achieving a user engagement increase of 20% through timely updates and alerts.\nEmployed MVVM and VIPER architectural patterns to ensure codebase scalability and maintainability, resulting in a 35% decrease in onboarding time for new developers.\nConducted unit testing using **XCTest**, achieving a test coverage of over 90%, ensuring reliability and robustness in application deployment."
    },
    {
      "role": "Software Engineer",
      "company": "Timspark",
      "from_date": "Sep 2015",
      "to_date": "Aug 2019",
      "location": "UK",
      "responsibilities": "Developed and optimized iOS applications using **Swift** and **SwiftUI**, ensuring high performance and smooth UX through best practices in **MVVM** and **Clean Architecture**.\nImplemented asynchronous operations and background task management via **GCD** and **Operation Queues** to enhance app responsiveness and performance, decreasing load times by up to **30%**.\nDesigned and integrated RESTful APIs utilizing **URLSession** and **WebSockets**, enabling real-time communication and dynamic data updates, which improved user engagement metrics by **25%**.\nArchitected data persistence solutions using **Core Data**, ensuring efficient storage and management of user data while maintaining app performance across various iOS versions including **14** and **15**.\nIncorporated secure authentication mechanisms using **Keychain** and **biometric authentication**, ensuring compliance with privacy standards and enhancing user trust through robust security practices.\nUtilized **Firebase Cloud Messaging** and **APNs** for push notifications, leading to a **40%** increase in app re-engagement rates by effectively reaching users with timely updates.\nConducted rigorous testing with **XCTest**, achieving a test coverage of over **85%** and ensuring the stability and reliability of applications prior to deployment.\nEngaged in code reviews and collaborative design sessions with cross-functional teams to ensure alignment on user experience, resulting in a more cohesive product development cycle.\nParticipated in the implementation of architectural patterns such as **VIPER** for better modularity and scalability, facilitating easier updates and feature additions in future releases."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, JavaScript/TypeScript, Swift\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular, SwiftUI, UIKit, Combine, MVVM, VIPER\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**API Technologies:**\n\tREST APIs, WebSockets, URLSession\n\n**Serverless and Cloud Functions:**\n\tAWS (Lambda), Azure (App Services)\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis, Core Data\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS (ECS, RDS, S3), Azure (Blob, SQL)\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, Firebase Cloud Messaging, APNs, Keychain, biometric authentication, XCTest, Clean Architecture, GCD, Operation Queues"
}