{
  "name": "Patryk Zaslawski",
  "role_name": "Java Developer",
  "email": "patrykzas0428@outlook.com",
  "phone": "+48669862402",
  "address": "Gdanski, Poland",
  "linkedin": "https://www.linkedin.com/in/patryk-z-107978395/",
  "profile_summary": "As a seasoned Java Developer with a robust foundation in Object-Oriented Programming (OOP) and Design Patterns, I bring 8+ years of experience in crafting robust software solutions. Expert in **Java**, I excel in building and optimizing **RESTful APIs** and implementing **multithreading** for enhanced application performance. My technical proficiency includes frameworks such as **Spring** and **Struts**, alongside database management skills with **MySQL** and **SQL** for effective query optimization. I employ tools like **Maven** and **Gradle** for streamlined build processes and leverage **CI/CD** strategies to ensure efficient development cycles. Additionally, I emphasize **secure coding** and effective **debugging** practices in all my projects. With a strong focus on performance optimization, I am dedicated to delivering reliable, scalable, and high-quality software solutions tailored to meet business objectives.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2014",
      "to_year": "2017",
      "location": "United Kingdom",
      "university": "The University of Manchester"
    }
  ],
  "experience": [
    {
      "role": "Java Developer",
      "company": "Binary Studio",
      "from_date": "Aug 2023",
      "to_date": "Present",
      "location": "United Kingdom (Remote)",
      "responsibilities": "- Developed and maintained scalable, high-performance applications utilizing **Java**, focusing on **OOP** principles and **Design Patterns** to create modular, efficient code.\n- Implemented **RESTful APIs** to facilitate seamless service interactions and enhance the integration of third-party systems.\n- Enhanced system performance by executing **Query Optimization** techniques within **MySQL** and **SQL** databases, resulting in improved response times by **30%**.\n- Led **CI/CD** initiatives using tools like **Maven** and **Gradle**, streamlining the deployment process and reducing release cycles by **25%**.\n- Verified the integrity and reliability of applications via comprehensive **Testing** strategies, including unit tests and integration tests, ensuring top-quality deliverables.\n- Leveraged **Multithreading** capabilities in **Java** to maximize application throughput and efficiency, enhancing user experience under high load conditions.\n- Utilized **Servlets** and **JSP** technologies to create dynamic web interfaces, directly improving user engagement metrics by **15%**.\n- Conducted code reviews to promote **Secure Coding** practices, addressing vulnerabilities proactively and ensuring compliance with security standards.\n- Implemented **Filters** for request/response handling, optimizing application performance and user access management.\n- Collaborated with cross-functional teams to debug complex issues, utilizing advanced debugging techniques and tools.\n- Mentored junior developers on best practices in **Java** programming, enhancing team expertise in **Secure Coding** and system architecture.\n- Integrated **Git** version control for effective change management and collaboration in software development projects."
    },
    {
      "role": "Software Engineer",
      "company": "Ardigen",
      "from_date": "Mar 2020",
      "to_date": "Aug 2023",
      "location": "Poland",
      "responsibilities": "• Developed and optimized scalable, maintainable Java applications utilizing **Spring** and **Design Patterns**, enhancing design quality and code efficiency.\n• Designed and implemented RESTful APIs in Java, ensuring secure communication between applications while adhering to **Secure Coding** practices and supporting multithreaded operations.\n• Led performance optimization initiatives for Java applications, achieving a **30%** increase in response times and managing **500+** concurrent users effectively.\n• Collaborated with the database team to optimize SQL queries and enhance data retrieval processes, leading to a **40%** improvement in overall application performance.\n• Implemented unit testing and debugging strategies using **JUnit** and **Mockito**, achieving **95%** code coverage and ensuring reliability before deployment.\n• Managed CI/CD pipelines using **Maven** and **Gradle** for automated testing and deployment processes, streamlining production workflows.\n• Engaged in code reviews focusing on **OOP** principles and multithreading to uphold coding standards and best practices.\n• Developed and maintained comprehensive documentation for applications and APIs, facilitating better knowledge sharing and onboarding for new developers.\n• Successfully integrated with various databases using **MySQL**, improving data integrity and retrieval times through advanced **Query Optimization** techniques.\n• Assisted in the design and implementation of software architecture patterns, significantly enhancing the maintainability and scalability of the software solutions."
    },
    {
      "role": "Software Engineer",
      "company": "Altum Software",
      "from_date": "Oct 2017",
      "to_date": "Feb 2020",
      "location": "United Kingdom",
      "responsibilities": "Utilized **Java** to design and optimize backend services following **OOP** principles and **Design Patterns**, improving scalability and performance.\nDeveloped robust **RESTful APIs** using **Spring** and **Struts** to ensure seamless integration between frontend and backend systems for high-volume transactions.\nLeveraged **MySQL** with **Java** ORM frameworks for efficient management and optimization of databases, resulting in reduced latency by **30%**.\nImplemented **Multithreading** techniques in **Java** applications to enhance app responsiveness and handle concurrent user requests effectively, leading to performance improvements by **25%**.\nAutomated CI/CD processes utilizing **Maven**, **Gradle**, and **Git** to ensure consistent feature delivery and reduce deployment times.\nConducted performance optimization and debugging for Java applications, reducing processing times by **15%** through targeted improvements and enhancements.\nDeveloped unit and integration tests using frameworks like **JUnit** and **Mockito**, ensuring code quality and minimizing bugs before release.\nEmployed caching strategies and query optimization techniques to improve response times for frequently accessed resources, successfully handling peak traffic loads.\nEnsured secure coding practices by implementing security features like input validation and trust management in **Java** applications to protect against vulnerabilities.\nCollaborated in an Agile environment, working closely with cross-functional teams to gather requirements and iterate based on user feedback, enhancing overall satisfaction with system performance."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, Java\n\n **Backend Frameworks:**\n\tFastAPI, Django, Flask, Spring, Spring Boot, Struts\n\n **Frontend Frameworks:**\n\tAngular (1–16), React (15–18), Next.js, Vue.js (2/3), Blazor\n\n **API Technologies:**\n\tREST & gRPC APIs, RESTful API, JWT, OAuth2\n\n **Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n **Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis, SQL, Query Optimization\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, CI/CD, Git\n\n **Cloud & Infrastructure:**\n\tNginx, Certbot\n\n **Other:**\n\tOOP, Design Patterns, Multithreading, Performance Optimization, Testing, Debugging, Secure Coding"
}