{
  "name": "Tomasz Lee",
  "role_name": "Senior Backend Developer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-477994390/",
  "profile_summary": "Results-driven Senior Backend Developer with 9+ years of experience in building and deploying scalable applications. Proficient in **Java 17**, **Dropwizard**, **Restler**, and **MongoDB**, with a strong command of **Redis**, **Apache Kafka**, **Kafka Streams**, **Elasticsearch**, and **OpenSearch**. Expertise in data processing algorithms and implementing **CI/CD** pipelines to enhance productivity and streamline workflows. Demonstrated ability to solve complex problems and optimize system performance. A collaborative team player with exceptional communication skills and strong analytical capabilities to lead projects and deliver successful outcomes.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Senior Backend Developer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Apr 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Utilized **Java 17** and **Dropwizard** for the development of scalable backend services, ensuring high-performance and maintainability of the application.\nImplemented **MongoDB** for data storage and **ClickHouse** for analytical processing, optimizing data retrieval and enhancing application efficiency.\nIntegrated **Redis** for caching to significantly reduce average latency in data access by **35%**.\nEmployed **Apache Kafka** and **Kafka Streams** for real-time data processing, enhancing system throughput and resilience.\nDeveloped RESTful APIs compatible with **Elasticsearch** and **OpenSearch**, facilitating seamless integration and robust search capabilities.\nImplemented CI/CD pipelines using **Airflow**, reducing deployment time by **40%** and improving workflow efficiency.\nOptimized queries and indexing for **MongoDB**, leading to a **20%** reduction in average query execution time.\nConducted A/B testing to evaluate feature effectiveness, using data processing algorithms to derive actionable insights.\nFostered a collaborative environment as a team player, effectively communicating technical concepts to non-technical stakeholders.\nExhibited strong problem-solving skills to troubleshoot and resolve issues promptly, enhancing overall system reliability."
    },
    {
      "role": "Full Stack Developer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "Utilized **Java 17** and **Dropwizard** frameworks to design and develop robust backend solutions, promoting code quality and maintainability.\nImplemented **CI/CD** pipelines, which reduced production deployment errors by **30%**, streamlining the deployment processes.\nCreated and optimized data storage solutions using **MongoDB** and **ClickHouse**, resulting in **25%** faster data retrieval times, enhancing application performance.\nDesigned and integrated **RESTful APIs** following microservices architecture principles using **RabbitMQ** for task orchestration, improving system scalability.\nConducted **A/B Testing** for feature releases, leading to informed decisions that increased user satisfaction by **15%**.\nApplied **Redis** for caching to minimize latency in frequent API calls, achieving a **20%** improvement in response times.\nCollaborated with cross-functional teams to define system requirements, reflecting strong **communication skills** and ensuring successful project execution.\nEmployed **Apache Kafka** and **Kafka Streams** for efficient event-driven data handling, enhancing real-time data processing capabilities.\nApplied analytical problem-solving strategies to optimize backend processes, resulting in significant performance enhancements.\nParticipated in code reviews and provided mentorship to junior developers, fostering teamwork and increasing overall productivity."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "Utilized **Java 17** and **Dropwizard** to develop scalable backend solutions, increasing system responsiveness by **30%**.\nImplemented **MongoDB** for efficient data storage and retrieval, achieving a **25%** improvement in query performance.\nDesigned and maintained RESTful APIs using **Restler**, facilitating seamless integration with various front-end applications.\nLeveraged **Apache Kafka** and **Kafka Streams** for real-time data processing, enhancing data throughput by **40%**.\nWorked with **Redis** for caching strategies, significantly reducing data access times during high-load scenarios.\nIntegrated **Elasticsearch** and **OpenSearch** to optimize searching capabilities, boosting user satisfaction ratings by **15%**.\nCollaborated in a CI/CD environment to automate deployments, reducing release times by **50%**.\nParticipated in A/B testing frameworks to optimize feature releases based on user engagement metrics.\nDeveloped data processing algorithms to analyze user data for enhanced decision-making.\nFostered a team-oriented culture through effective communication and problem-solving strategies in weekly scrum meetings.\nProduced detailed technical documentation and facilitated knowledge-sharing sessions to upskill team members effectively."
    }
  ],
  "skills": " **Programming Languages** \n\t Java 17, Python, JavaScript, TypeScript \n\n **Backend Frameworks** \n\t Dropwizard, NodeJS, ExpressJS, NestJS, C#, .NET \n\n **Frontend Frameworks** \n\t ReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS \n\n **API Technologies** \n\t RESTful API, GraphQL \n\n **Serverless and Cloud Functions** \n\t AWS, Azure \n\n **Databases** \n\t MongoDB, MSSQL Server, MySQL, PostgreSQL, DynamoDB, CosmosDB, ClickHouse \n\n **DevOps** \n\t CI/CD pipelines, A/B testing \n\n **Cloud & Infrastructure** \n\t Apache Kafka, RabbitMQ, Redis, Kafka Streams, Elasticsearch, OpenSearch, Airflow \n\n **Other** \n\t UX/UI Design, Git, GitHub, Solidity, Ether.js, Web3.js, Ethereum, Testing Tools: NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest, Data processing algorithms, Problem-solving, Communication, Team player, Analytical skills"
}