{
  "name": "Tomasz Lee",
  "role_name": "Senior Hardware Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Results-driven Senior Hardware Engineer with 9+ years of experience in electronics design, PCB layout, and FPGA development. Proficient in embedded systems programming with expert knowledge in **C** and **C++**, leveraging **Yocto** for system integration and optimization. Familiarity with EMC standards, AC/DC power systems, and DFM/DFT principles ensure high-quality hardware solutions. Strong analytical and problem-solving skills, complemented by a commitment to collaborative project management and innovation in hardware engineering.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Senior Hardware Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Engineered electronic systems leveraging **C** and **C++** to design scalable and efficient hardware solutions for diverse applications.\nDeveloped and optimized Printed Circuit Boards (PCBs), ensuring compliance with **DFT** and **DFM** principles, reducing production errors by 30%.\nUtilized **FPGA** technology to enhance system performance, achieving processing speed improvements of up to **50%** compared to previous designs.\nImplemented **Yocto** for creating adaptable software environments in embedded systems, reducing integration time by **25%**.\nConducted electromagnetic compatibility (EMC) testing and modifications to **AC/DC** power supplies, improving regulatory compliance rates to **98%**.\nDesigned wireless communication modules that increased connectivity range by **40%** in various products.\nCollaborated with cross-functional teams to ensure timely project completion, resulting in successful product launches within **6 months** of conception.\nPerformed thorough testing and validation on embedded systems, ensuring reliability and performance under diverse operating conditions.\nDeveloped documentation and training materials for engineering teams, enhancing departmental knowledge by facilitating workshops and presentations."
    },
    {
      "role": "Software Engineer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "Designed and implemented electronic systems focusing on **DFM** (Design for Manufacturing) and **DFT** (Design for Test) principles, improving the overall production efficiency by **20%**.\nDeveloped and optimized **C** and **C++** code for embedded systems, achieving a performance increase of **15%** in device functionality.\nEngineered digital and analog **PCB** layouts that meet stringent **EMC** (Electromagnetic Compatibility) standards, ensuring compliance for product launches.\nUtilized **FPGA** technology to enhance processing capabilities in devices, resulting in a significant reduction in signal processing time by **30%**.\nCollaborated with cross-functional teams to integrate **wireless** technologies, enhancing device connectivity and expanding product features.\nDefined and executed test plans for **AC/DC** power management systems, successfully reducing power consumption by **25%**.\nImplemented the **Yocto** project for building custom Linux distributions tailored for embedded devices, streamlining development workflows.\nParticipated in design reviews and provided mentorship on best practices for junior engineers, fostering a collaborative and innovative team environment.\nConducted thorough analyses of existing designs to identify areas for improvement, leading to a **15%** decrease in failure rates during testing."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "• Designed and developed PCB layouts for various electronic products, ensuring compliance with **DFM** and **DFT** strategies to optimize manufacturability and testability.\n• Programmed in **C** and **C++** for embedded systems, successfully optimizing firmware that improved system performance by **30%**.\n• Utilized **FPGA** technology to enhance digital signal processing capabilities, contributing to a **25%** increase in data throughput.\n• Implemented **Yocto** for building custom Linux-based operating systems, streamlining development for embedded platforms.\n• Ensured electronic designs met **EMC** standards, reducing noise interference and enhancing product reliability in the field.\n• Developed testing frameworks to validate wireless communication modules, enhancing the reliability of **AC/DC** power supplies by conducting rigorous evaluations.\n• Collaborated with cross-functional teams on project specifications and timelines, ensuring the delivery of projects on time and within budget.\n• Delivered technical documentation for designs and processes, improving knowledge sharing across teams and reducing onboarding time by **15%**.\n• Participated in daily standups and design reviews, fostering collaboration and maintaining adherence to project standards and deadlines.\n• Researched and implemented improvements in embedded systems design, leading to a reduction in production costs by **20%**."
    }
  ],
  "skills": " \n**Programming Languages** \n\tC, C++, Python, JavaScript, TypeScript \n\n**Backend Frameworks** \n\tNodeJS, ExpressJS, NestJS, C#, .NET, Entity Framework, Microservices \n\n**Frontend Frameworks** \n\tHTML, CSS, ReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS \n\n**API Technologies** \n\tRESTful API, GraphQL \n\n**Serverless and Cloud Functions** \n\tAWS, Azure \n\n**Databases** \n\tMSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB \n\n**DevOps** \n\tCI/CD pipelines \n\n**Cloud & Infrastructure** \n\t \n\n**Other** \n\tUX/UI Design, Git, GitHub, NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest, Blockchain: Solidity, Ether.js, Web3.js, Ethereum, electronics, PCB, FPGA, Yocto, EMC, wireless, AC/DC, DFM, DFT, embedded",
  "apply_company": "Etteplan"
}