{
  "name": "Patryk Zaslawski",
  "role_name": "Senior Fullstack Engineer",
  "email": "patrykzas0428@outlook.com",
  "phone": "+48669862402",
  "address": "Gdanski, Poland",
  "linkedin": "https://www.linkedin.com/in/patryk-z-9b9455391/",
  "profile_summary": "Results-driven Senior Full Stack Engineer with 8+ years of experience in software development, specializing in building scalable and secure applications. Proficient in **Python**, **Node.js**, **TypeScript**, and modern frontend frameworks such as **React** and **AngularJS**. Demonstrated expertise in designing and implementing **REST APIs** and optimizing both **RDBMS** and **NoSQL** databases like PostgreSQL and MongoDB. Skilled in leveraging cloud services such as **AWS**, and proficient in implementing **DevSecOps** practices, CI/CD pipelines, and Infrastructure as Code. Adept at employing Agile methodologies and Test-Driven Development (TDD) to enhance software delivery. My background includes delivering high-performance solutions tailored to the e-commerce, financial, and healthcare sectors while maintaining a strong focus on system reliability and industry best practices.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2014",
      "to_year": "2017",
      "location": "United Kingdom",
      "university": "The University of Manchester"
    }
  ],
  "experience": [
    {
      "role": "Senior Fullstack Engineer",
      "company": "Binary Studio",
      "from_date": "Aug 2023",
      "to_date": "Present",
      "location": "United Kingdom (Remote)",
      "responsibilities": "- Developed and led the implementation of **Python**-based scalable solutions, ensuring the integration of **REST APIs** for effective communication between services.\n- Utilized **AWS** resources to enhance system architecture, optimizing performance and reliability across applications.\n- Spearheaded CI/CD pipelines integration with **GitHub Actions** and **Azure DevOps**, elevating deployment efficiency by up to **30%**.\n- Leveraged frameworks such as **React** and **AngularJS** for building dynamic front-end components, resulting in improved user experience and engagement metrics by **25%**.\n- Established and maintained test-driven development (TDD) practices using **Python** to achieve a bug reduction of over **40%** during production releases.\n- Designed and executed cloud solutions with principles of **DevSecOps**, embedding security best practices throughout the software development life cycle.\n- Managed diverse databases, optimizing data storage using **RDBMS** and **NoSQL** solutions, which enhanced data retrieval speeds by **50%**.\n- Mentored junior engineers in project best practices, focusing on **Python**, **TypeScript**, and modern development methodologies, fostering a collaborative team environment.\n- Implemented infrastructure as code using tools such as **Terraform**, streamlining environment setups and reducing provisioning time by **60%**.\n- Integrated search functionalities using **OpenSearch**, significantly improving query performance across data repositories.\n- Collaborated in an agile team, ensuring rapid adjustments and adaptations to project scopes, thereby increasing delivery timelines by **20%**."
    },
    {
      "role": "Software Engineer",
      "company": "Ardigen",
      "from_date": "Mar 2020",
      "to_date": "Aug 2023",
      "location": "Poland",
      "responsibilities": "Developed and maintained scalable applications leveraging **Python** and **Node.js** to effectively manage data using **RDBMS** and **NoSQL** databases, enhancing performance and reliability.\nDesigned robust **REST APIs** ensuring seamless integrations between front-end and back-end using **React**, **AngularJS**, and **TypeScript**, improving user experience and application responsiveness.\nImplemented **AWS** infrastructure solutions with an emphasis on **Infrastructure as Code**, reducing deployment times by **30%** and increasing system reliability.\nEmbraced **Agile** methodologies to deliver incremental updates and improvements, participating in daily stand-ups and sprint planning meetings.\nUtilized **TDD** practices to develop comprehensive unit tests, achieving a **95%** test coverage leading to increased code reliability and reduced bugs in production.\nConfigured Continuous Integration and Continuous Deployment (CI/CD) pipelines using **GitHub Actions** and **Azure DevOps**, enabling faster release cycles by **40%**.\nEnsured adherence to **DevSecOps** principles, integrating security checks into the development lifecycle to protect sensitive data and maintain compliance.\nManaged cloud-based services and applications to ensure high availability and performance, utilizing monitoring tools to track application metrics and server health.\nUtilized **OpenSearch** for real-time data analysis and log management, enhancing the debugging and monitoring capabilities of existing applications.\nParticipated in architectural discussions to incorporate new technologies and improve system architecture, ensuring alignment with best practices and industry standards."
    },
    {
      "role": "Software Engineer",
      "company": "Altum Software",
      "from_date": "Oct 2017",
      "to_date": "Feb 2020",
      "location": "United Kingdom",
      "responsibilities": "- Developed and optimized full-stack applications using **Python** and **Node.js**, enhancing performance and maintainability across e-commerce platforms.\n- Designed robust **REST APIs** in **Python** to integrate with front-end frameworks like **React**, **AngularJS**, and other modern technologies, ensuring efficient and effective user interactions.\n- Leveraged **RDBMS** solutions such as **PostgreSQL** and **MySQL** alongside **NoSQL** databases like **MongoDB** to handle transactional and unstructured data, boosting system scalability.\n- Implemented **CI/CD** pipelines using GitHub Actions and Azure DevOps, automating the deployment process and reducing release time by **30%**.\n- Applied **TDD** principles, writing unit and integration tests in **Python** (using **PyTest**), ensuring high test coverage and reliability of the codebase.\n- Migrated outdated systems to a microservices architecture using **Python**, allowing for distributed development and easier scalability of backend services.\n- Employed **Infrastructure as Code** practices to automate provisioning and management of cloud resources on **AWS**, reducing manual configuration errors by **40%**.\n- Developed responsive web applications with modern frameworks like **Next.js** and **React**, achieving a **20%** increase in user engagement through improved UI/UX design.\n- Used **TypeScript** for building robust front-end applications, enhancing code quality and reducing bugs through static typing.\n- Automated performance testing with **Apache JMeter** and **k6**, identifying and resolving bottlenecks to ensure systems can handle peak loads effectively.\n- Integrated **OpenSearch** for efficient data retrieval, enhancing search functionalities within applications to improve user experience.\n- Collaborated within an **Agile** team environment, participating in daily scrums and sprint planning to ensure successful project completion.\n- Implemented **DevSecOps** strategies, integrating security practices into the development lifecycle, significantly enhancing the overall security posture of applications.\n- Built and maintained containerized applications using **Docker**, ensuring consistency across development, testing, and production environments."
    }
  ],
  "skills": "**Programming Languages**:\n\tPython, Node.js, TypeScript\n\n**Backend Frameworks**:\n\tFastAPI, Django, Flask, Spring Boot\n\n**Frontend Frameworks**:\n\tAngular (1–16), AngularJS, React (15–18), Next.js, Vue.js (2/3), Blazor\n\n**API Technologies**:\n\tREST APIs, gRPC APIs\n\n**Serverless and Cloud Functions**:\n\tAWS (ECS, Lambda, RDS, S3)\n\n**Databases**:\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis, RDBMS, NoSQL\n\n**DevOps**:\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, DevSecOps, CI/CD, Infrastructure as Code\n\n**Cloud & Infrastructure**:\n\tAzure (App Services, Blob, SQL)\n\n**Other**:\n\tSQLAlchemy, Pydantic, Celery, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, TDD, Agile, OpenSearch",
  "apply_company": "Qualio"
}