{
  "name": "Tomasz Lee",
  "role_name": "Senior Backend Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Results-driven Senior Backend Engineer with 9+ years of experience specializing in **Java**, **Kotlin**, and **Springboot** technologies. Proven expertise in building and maintaining microservices and backend systems with efficiency and scalability in mind. Proficient in using **Postgres** for database management and adept in **CI/CD** practices utilizing tools like **CircleCI** and **Spinnaker** to streamline deployments. A strong problem-solver with an emphasis on attention to detail, I have effectively mentored junior developers, fostering their growth while ensuring high-quality code delivery. Known for collaboration across teams, I excel in delivering robust solutions that meet project goals and timelines.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Senior Backend Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Utilized **Java** and **Kotlin** for backend development, enhancing the efficiency of server-side processes by 30%.\nDesigned and developed microservices using **Spring Boot**, promoting modular architecture and improving system scalability.\nImplemented **Postgres** databases to ensure robust data storage and retrieval processes, achieving a 25% increase in data access speed.\nDeveloped front-end components using **React** to create an intuitive user interface, contributing to a 15% increase in user engagement.\nLed CI/CD initiatives using **CircleCI** and **Spinnaker**, optimizing deployment workflows and reducing deployment time by 40%.\nMentored junior developers by conducting weekly code reviews and fostering a collaborative team environment.\nEnhanced application performance by solving complex backend problems, leading to a 50% reduction in system downtimes.\nApplied meticulous attention to detail in code optimization, which improved overall application performance by 20%.\nCollaborated with cross-functional teams to integrate functionalities and improve overall project efficiency.\nDeveloped automated testing protocols for quality assurance, significantly reducing post-deployment bugs and improving software reliability."
    },
    {
      "role": "Software Engineer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "Utilized **Java** and **Kotlin** to design and develop efficient backend solutions, improving code quality and reducing bugs by 20%.\nImplemented **Springboot** for building microservices, enhancing system modularity and scalability, achieving a 30% decrease in response times.\nIntegrated **Postgres** databases for optimized data retrieval, achieving a performance enhancement of 40% through efficient query design.\nLed CI/CD processes with **CircleCI** and **Spinnaker**, successfully automating deployments and reducing release times by 50%.\nFocused on **problem-solving** by troubleshooting complex application issues, leading to a 15% decrease in incident response time.\nMentored team members on best coding practices and design patterns, fostering a collaborative environment that increased team productivity by 25%.\nDeveloped responsive user interfaces using **React**, enhancing user experience and engagement metrics by over 30%.\nConducted regular code reviews, emphasizing **attention to detail** to ensure high standards of code quality across the team.\nPromoted **team collaboration** through effective communication with cross-functional teams, streamlining workflows and project timelines.\n"
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "Utilized **Java** and **Kotlin** to develop robust backend services, enhancing application performance by **30%**.\nImplemented **Spring Boot** for microservices architecture, streamlining deployment processes with **CI/CD** practices using **CircleCI** and **Spinnaker**.\nDesigned and managed databases with **Postgres**, optimizing data retrieval processes that improved query response times by **25%**.\nMentored junior developers, enhancing team collaboration and knowledge sharing across projects, while maintaining a strong focus on problem-solving.\nCreated RESTful APIs using **Ruby on Rails** to ensure efficient communication between the backend services and frontend applications, boosting system efficiency.\nCollaborated with cross-functional teams to ensure project goals were met, demonstrating strong attention to detail in coding standards and documentation.\nParticipated in daily standups and sprint planning, contributing to a more agile workflow and improving project delivery timelines.\nDelivered thorough technical documentation for backend systems, aiding in knowledge transfer and onboarding processes for new team members."
    }
  ],
  "skills": " **Programming Languages** \n\t Java, Kotlin, Python, JavaScript, TypeScript, Ruby\n\n **Backend Frameworks** \n\t Springboot, NodeJS, ExpressJS, NestJS, C#, .NET, Ruby on Rails, Microservices\n\n **Frontend Frameworks** \n\t React, ReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n **API Technologies** \n\t RESTful API, GraphQL\n\n **Serverless and Cloud Functions** \n\t AWS, Azure\n\n **Databases** \n\t PostgreSQL, MSSQL Server, MySQL, MongoDB, DynamoDB, CosmosDB\n\n **DevOps** \n\t CI/CD, CircleCI, Spinnaker, CI/CD pipelines\n\n **Cloud & Infrastructure** \n\t Cloud Technologies\n\n **Other** \n\t UX/UI Design, Git, GitHub, problem-solving, mentoring, attention to detail, team collaboration, Testing Tools: NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest, Blockchain: Solidity, Ether.js, Web3.js, Ethereum, Messaging & Caching: Apache Kafka, RabbitMQ, Redis",
  "apply_company": "AlphaSights"
}