{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Software Developer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-187801395/",
  "profile_summary": "Results-driven Software Developer with 13+ years of experience in crafting high-performance applications using the **MERN stack**. Proficient in **Node.js**, **Express.js**, **ReactJS**, **Redux**, and **TypeScript**, demonstrating strong capabilities in frontend and backend development. Expert in employing **RabbitMQ** and **Redis** for effective data handling and messaging in scalable applications. Adept at ensuring high-quality code through testing frameworks like **Jest** and **Mocha**, and maintaining code versioning using **Git** and **GitLab** while effectively tracking project progress with **Jira**.\n\nSkilled in UI/UX design, creating intuitive interfaces while ensuring a seamless user experience. Experienced in integrating **Social Network APIs** to enhance application functionality.  Additionally, I leverage **Styled Components** for efficient styling and theming.\n\nStrong background in healthcare and financial industries with proficiency in building AI/ML-powered platforms, deploying cloud-native systems on AWS and Azure, and implementing microservices and CI/CD pipelines. Well-versed in compliance-driven development aligning with HIPAA, FHIR, PCI DSS, and SOC 2 standards.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Software Developer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Utilized **MERN stack** technologies, including **Node.js**, **Express.JS**, and **ReactJS**, to design and build innovative web platforms, ensuring rapid development cycles and high-performance applications.\nCreated interactive user interfaces employing **Redux**, **Redux-Saga**, and **Styled Components** for enhanced UI/UX design, leading to a 30% increase in user engagement.\nImplemented end-to-end testing strategies utilizing **Jest** and **Mocha** to ensure code quality and reduce defects by 25% in production.\nCollaborated with cross-functional teams using **Git** and **GitLab**, managing source code and workflows via **GitLab CI** for effective version control and continuous integration.\nDesigned and maintained asynchronous messaging solutions with **RabbitMQ**, improving system reliability and throughput by 40%.\nOptimized data caching using **Redis**, which resulted in a 50% reduction in response times for high-frequency data queries.\nDeveloped monitoring and logging systems utilizing the **ELK Stack** to track application performance and diagnose issues in real-time, enhancing operational efficiency.\nIntegrated various **Social Network APIs** to expand application functionality and reach, contributing to a 20% growth in user acquisition.\n\nLeveraged Agile methodologies with tools like **Jira** to manage development schedules and project timelines effectively, ensuring all deliverables met client needs and quality standards.\nParticipated in collaborative design sessions to innovate UI/UX strategies, streamlining user workflows and overall application usability.\nConducted code reviews and provided mentorship to junior developers, fostering a culture of continuous improvement and skill development within the team."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Utilized **Node.js** and **Express.JS** within the **MERN stack** to modernize core financial platforms by migrating to a microservices architecture, enhancing scalability and performance for high-volume transactional systems.\nDeveloped interactive front-end applications using **ReactJS (18)**, **TypeScript**, and **Redux**, creating responsive interfaces for financial tools and admin panels with sleek design.\nImplemented state management with **Redux-Saga** and memoization techniques with **Reselect**, improving the performance of applications supporting up to **5000** daily active users.\nTested and maintained applications using **Jest** and **Mocha**, ensuring high code quality and reliability for complex financial software.\nDesigned a robust event-driven architecture utilizing **RabbitMQ** to ensure asynchronous communication across critical workflows, significantly reducing latency in transaction processing by **30%**.\nLeveraged **Git** and **GitLab CI** for version control and continuous integration, enhancing collaboration and deployment efficiencies across development teams by **40%**.\nConducted UI/UX design review sessions to improve user interfaces, leading to a **25%** increase in user satisfaction scores.\nCollaborated on integrating **Social Network APIs** to enhance user engagement and streamline authentication processes, increasing user sign-ups by **15%**.\nEmployed **Styled Components** for consistent styling across applications, ensuring adherence to design standards and guidelines.\nKept abreast of industry trends and emerging technologies to incorporate best practices and innovative solutions in future projects."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Utilized the **MERN stack** to develop innovative web applications, ensuring seamless integration and performance across all platforms.\nEngineered and optimized backend services using **Node.js** (Express.js) and **Redis** for rapid data caching and improved response times for high-traffic workflows.\nImplemented real-time messaging services utilizing **RabbitMQ** to provide instant order updates and notifications, significantly enhancing user engagement.\nCreated dynamic user interfaces and rich web applications using **ReactJS**, incorporating state management with **Redux** and styling through **Styled Components** for greater user experience.\nDeveloped comprehensive frontend testing strategies leveraging **Jest** and **Mocha**, improving code reliability and reducing bugs by **30%**.\nCollaborated with cross-functional teams utilizing **Git** and **GitLab CI** for streamlined version control and integration, ensuring smooth deployment processes and code quality.\nDesigned RESTful APIs and backend services that adhere to secure coding practices while implementing **Social Network APIs** for enhanced integration.\nApplied modern **UI/UX design** principles to create user-friendly interfaces, achieving a user satisfaction rating of over **90%**.\nRegularly participated in Agile methodologies, using **Jira** for effective task management and project tracking to meet deadlines consistently.\nMaintained clear documentation and communication through **GitLab**, facilitating easier onboarding and project understanding for new team members."
    }
  ],
  "skills": " **Programming Languages:** \n\tPython, JavaScript/TypeScript, Node.js\n\n **Backend Frameworks:** \n\tExpress.JS, FastAPI, Flask, Django\n\n **Frontend Frameworks:** \n\tReact, Vue, Angular, ReactJS, Redux, Redux-Saga, Reselect, Styled Components\n\n **API Technologies:** \n\tSocial Network APIs\n\n **Serverless and Cloud Functions:** \n\tAWS: Lambda, Azure: App Services\n\n **Databases:** \n\tPostgreSQL, MySQL, MongoDB, Redis\n\n **DevOps:** \n\tDocker, Kubernetes, Git, GitHub Actions, GitLab CI/CD, GitLab, Jira\n\n **Cloud & Infrastructure:** \n\tAWS: ECS, RDS, S3, Azure: Blob Storage, SQL Database, Terraform, Ansible, Helm, Docker Compose\n\n **Other:** \n\tMLflow, Airflow, Kubeflow, RabbitMQ, Nginx, Let’s Encrypt, Certbot, ELK Stack, Jest, Mocha"
}