{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Support Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "Dedicated Senior Support Engineer with 8 years of extensive experience in providing top-tier support solutions, proficient in Linux environments and adept at troubleshooting applications built on **JavaScript**, **HTML5**, **CSS3**, and **RestAPI** frameworks. My background includes hands-on experience with **MySQL** for database management and bug tracking systems, ensuring seamless application performance and user satisfaction. I excel in programming and have a solid foundation in problem-solving methodologies, aiming to deliver effective and timely resolutions. Alongside my technical expertise, I have successfully built high-performance solutions in the healthcare and financial sectors using various technologies including **React**, **Next.js**, and **Node.js**. My ability to adapt to evolving tech environments, including cloud platforms like **Azure** and **AWS**, and my knowledge in enterprise-grade platforms set me apart as a versatile engineer committed to maintaining compliance and enhancing operational efficiencies.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Support Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Provided expert-level technical support in **Linux** environments, ensuring the stability and performance of healthcare and financial applications.\n- Conducted thorough troubleshooting and bug tracking using various tools, resolving issues in a timely manner and enhancing user satisfaction across platforms.\n- Collaborated with development teams to integrate **MySQL** for efficient data management and optimized query performance in existing databases.\n- Assisted in the front-end development of applications using **HTML5**, **CSS3**, and **JavaScript**, contributing to responsive web design and user experience enhancements.\n- Developed and optimized **RestAPI** interfaces, facilitating seamless communication between microservices and enhancing overall application interoperability.\n- Delivered comprehensive documentation and training materials to support users and stakeholders, ensuring smooth onboarding and knowledge transfer for new systems.\n- Employed monitoring and performance analysis tools to assess application functionality, leading to a **15%** reduction in response times and improved service reliability.\n- Led initiatives for continuous improvement and best practices in programming and software development methodologies across the organization.\n- Developed automated scripts to streamline repetitive tasks and enhance workflow efficiency, resulting in a reduction of manual intervention required by **30%**.\n- Actively participated in cross-functional teams to tackle complex technical challenges, fostering a culture of collaboration and innovation within the engineering team."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "- Provided expert-level support for **Linux** environments, leveraging scripting and troubleshooting skills to enhance system stability and performance.\n- Managed database solutions using **MySQL** to ensure data integrity, optimize performance, and streamline backup and recovery processes in alignment with application needs.\n- Developed and maintained **HTML5** and **CSS3** user interfaces for application enhancements, ensuring compatibility and responsiveness across various web browsers and devices.\n- Leveraged **JavaScript** to implement dynamic features and improve user experience on existing platforms, enhancing usability metrics by **30%**.\n- Ensured the efficiency of APIs through **RestAPI** development, conducting thorough testing to identify and resolve bugs, improving response times by **25%**.\n- Utilized bug tracking tools to monitor, log, and coordinate resolution processes, resulting in a **40%** reduction in unresolved issues over a **3-month** period.\n- Provided highly-efficient programming support to develop automated solutions, enhancing system functionality and user satisfaction ratings by achieving **98%** positive feedback from users."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Ensured seamless operation of e-commerce applications with a strong focus on **Linux** environments, maintaining system stability and performance.\nUtilized **MySQL** for efficient data management and implemented effective **bug tracking** strategies to enhance system reliability and end-user satisfaction.\nDeveloped and documented **REST APIs** to facilitate smooth communication between frontend and backend systems, improving integration capabilities.\nDesigned and implemented responsive, user-friendly e-commerce interfaces using **HTML5**, **CSS3**, and **JavaScript**, ensuring alignment with WCAG 2.1 standards for accessibility.\nExecuted bug analysis and resolution processes, successfully decreasing bug resolution time by **30%** while enhancing customer experience.\nCollaborated with cross-functional teams to deliver on-time solutions, achieving a **95% on-time delivery** rate for support initiatives.\nEngaged in programming best practices, contributing to coding standards and quality assurance, which led to a **40% reduction** in production incidents.\nProvided advanced technical support for e-commerce tools, contributing to enhanced user functionalities and system optimizations.\nMaintained comprehensive documentation of application changes and technical solutions, ensuring knowledge transfer and team continuity for complex systems."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, JavaScript, TypeScript\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular, HTML5, CSS3\n\n**API Technologies:**\n\tRestAPI\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tLinux\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, Bug Tracking, Programming",
  "apply_company": "MGID"
}