{
  "name": "Rei Taro",
  "role_name": "Senior JavaScript Engineer",
  "email": "rei515@outlook.com",
  "phone": "+48732529451",
  "address": "Warszawa, Poland",
  "linkedin": "https://www.linkedin.com/in/rei-taro-81a410391/",
  "profile_summary": "Results-driven Senior JavaScript Engineer with over 10 years of experience in developing robust backend systems, with a strong focus on **JavaScript**, **Node.js**, and creating scalable **REST** and **SOAP** APIs. Proficient in databases such as **SQL**, **SQLite**, and **PostgreSQL** while leveraging **AWS Lambda** and **API Gateway** for cloud-native solutions. Skilled in implementing **Serverless Framework** for efficient application development and automated testing to ensure high-quality deliverables. Proven ability to contribute to successful **B2B SaaS** projects, fostering teamwork and clear communication throughout the development process. Extensive background in delivering impactful solutions for top-tier organizations such as VISA, Sii Poland, and Reply Polska, alongside expertise in financial platforms, AI/ML pipelines, and high-performing automation tools.",
  "education": [
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2010",
      "to_year": "2015",
      "location": "Japan",
      "university": "Keio University"
    }
  ],
  "experience": [
    {
      "role": "Senior JavaScript Engineer",
      "company": "Leobit",
      "from_date": "Aug 2022",
      "to_date": "Present",
      "location": "Poland",
      "responsibilities": "Developed robust REST and SOAP APIs using **Node.js** to enhance backend services and streamline B2B SaaS products.\nEngineered serverless solutions utilizing **AWS Lambda** and **API Gateway**, enhancing system scalability and efficiency in transaction processing.\nImplemented automated testing frameworks ensuring code quality and reliability, reducing bug occurrence by **30%**.\nDesigned and managed SQL databases including **PostgreSQL** and **SQLite**, optimizing query performance and storage efficiency for **500+** users.\nCollaborated effectively with cross-functional teams, fostering clear communication and teamwork to address integration challenges and enhance system performance.\nFacilitated the transition of legacy systems to modern architecture, resulting in a **40%** increase in application responsiveness and user satisfaction.\nLed the development and maintenance of comprehensive documentation, improving onboarding for new team members by **25%**."
    },
    {
      "role": "Software Engineer",
      "company": "Innovature",
      "from_date": "Nov 2018",
      "to_date": "Jun 2022",
      "location": "Japan",
      "responsibilities": "Developed robust RESTful APIs and microservices in **JavaScript** and **Node.js**, enhancing system integration and user experience for B2B SaaS applications.\nDesigned and implemented automated testing processes to ensure code quality and reliability, achieving a **95%** test coverage rate.\nEngineered scalable data storage solutions using **PostgreSQL** and **SQLite**, optimizing data access and management for applications serving over **10,000** users.\nUtilized **AWS Lambda** and **API Gateway** to build serverless applications, significantly reducing infrastructure costs by **30%**.\nCollaborated effectively with cross-functional teams, ensuring clear communication and alignment on project goals and timelines.\nStreamlined documentation workflows and developed comprehensive guides for new features, contributing to a successful release cycle of **5 major updates** per year.\nImplemented security best practices and data protection protocols to meet compliance with industry standards, focusing on user data integrity and privacy."
    },
    {
      "role": "Software Developer",
      "company": "Wizcorp",
      "from_date": "Apr 2015",
      "to_date": "Nov 2018",
      "location": "Japan",
      "responsibilities": "- Developed and maintained robust **REST** APIs for seamless interactions between front-end and back-end systems, fostering a responsive and user-friendly interface.\n- Engineered backend services using **Node.js** and **PostgreSQL** to support B2B SaaS applications, managing **9 million** transactions efficiently.\n- Collaborated with cross-functional teams to design cloud-native solutions utilizing **AWS Lambda**, ensuring high availability and scalability.\n- Implemented automated testing frameworks such as **Jest** and **Mocha** to enhance code reliability and streamline the QA process by reducing bugs by **30%**.\n- Advocated for and implemented **Serverless Framework**, reducing infrastructure costs by **20%** and simplifying deployment processes.\n- Utilized **SQL** for complex queries and data management, optimizing database performance and ensuring data integrity across applications.\n- Engaged in continuous integration and deployment practices to maintain project momentum and adapt swiftly to changes, achieving delivery timelines consistently.\n- Served as a clear communicator and team player, fostering collaboration to solve complex problems while ensuring compliance with industry standards."
    }
  ],
  "skills": "**Programming Languages**\n\tJavaScript, Python (3.8+), SQL\n\n**Backend Frameworks**\n\tFastAPI, Flask, Django, Node.js, Celery\n\n**Frontend Frameworks**\n\t\n\n**API Technologies**\n\tREST, SOAP, REST/gRPC APIs, API Gateway\n\n**Serverless and Cloud Functions**\n\tAWS Lambda, Serverless Framework\n\n**Databases**\n\tPostgreSQL, MySQL, MongoDB, SQLite, Redis\n\n**DevOps**\n\tDocker, Kubernetes, GitHub Actions, Azure DevOps, CI/CD\n\n**Cloud & Infrastructure**\n\tAWS (EC2, S3), Azure\n\n**Other**\n\tAutomated testing, B2B SaaS, Team player, Clear communicator, AI/ML Tools: Pandas, NumPy, scikit-learn, TensorFlow, Airflow, MLflow, Microservices, Kafka, PyTest, Git",
  "apply_company": "Memtime"
}