{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Google Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "As a Senior Google Engineer with 8 years of experience, I excel in IT Consulting and Project Management, leveraging my expertise in Cloud Migration and Networking. My proficiency in **Google Cloud** and **Google Workspace** enables me to deliver seamless IT solutions tailored to organizational needs. I am adept in **Windows**, **Active Directory**, and **Exchange** environments, ensuring a robust infrastructure that supports high-performance applications.\nMy background in full-stack development, utilizing technologies like **JavaScript**, **Python**, and **Flutter**, complements my technical skills, allowing me to create innovative solutions in complex domains. A strong collaborator, I thrive in team environments while continuously enhancing my knowledge through **Continuous Learning**. I am fluent in both **German** and **English**, facilitating effective communication across diverse teams.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Google Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Provided IT consulting and project management expertise in coordinated cloud migration efforts, ensuring seamless transitions to **Google Cloud** environments.\n- Spearheaded team collaboration initiatives, leveraging effective communication in **English** and **German** to enhance productivity and integration across departments.\n- Designed and implemented strategies for Windows environment management, including **Active Directory** and **Exchange**, ensuring robust security and efficient user management.\n- Developed and maintained networking protocols that improved organizational efficiency and reduced downtime by **20%**.\n- Led continuous learning workshops to upskill team members on **Google Workspace** tools, integrating productivity best practices into daily workflows.\n- Oversaw service orientation enhancements, leading to a **30%** improvement in client satisfaction ratings.\n- Executed comprehensive project management methodologies, including Agile practices, resulting in project delivery that exceeded timelines by **15%**.\n- Collaborated with cross-functional teams to drive innovations in cloud technology solutions, positioning the organization as a leader in IT consulting within the industry."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Utilized **Google Cloud** services to enhance cloud migration strategies for financial platforms, improving system efficiency and reliability by **30%** during the transition phase.\nCollaborated in a team environment to implement **Google Workspace** tools, fostering seamless communication and project management across departments, which resulted in **20%** faster project completion.\nConducted IT consulting sessions focused on optimizing infrastructure, leading to improved networking capabilities and reduced downtime by **15%**.\nManaged documentation and data sharing within **Windows**, **Active Directory**, and **Exchange**, ensuring secure access and effective team collaboration.\nEngaged in continuous learning initiatives to stay updated on best practices in cloud technologies, ultimately advancing organizational skills in **IT Consulting** and project execution.\nImplemented service orientation principles, actively improving user experiences and supporting a customer-focused approach in cloud solutions.\nWorked with cross-functional teams to refine operational processes, contributing to successful project management and enhancement of service delivery metrics.\nDemonstrated proficiency in both **German** and **English**, facilitating effective communication in diverse team settings."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Managed **Google Cloud** migrations and configurations to ensure seamless integration with legacy systems, improving service uptime by **30%**.\nConducted IT consulting sessions, leveraging **Google Workspace** for enhanced productivity and collaboration, leading to a **25%** reduction in operational costs.\nOversaw Active Directory management, implementing role-based access control (RBAC) and ensuring compliance with security protocols and user data protection criteria.\nFacilitated networking solutions that improved data transfer rates by **40%**, contributing to faster service delivery and enhanced user experience.\nCoordinated with cross-functional teams to execute project management strategies, achieving project milestones on time and staying within budget by **10%**.\nDeveloped and maintained user accounts in **Windows** and **Exchange**, ensuring secure and reliable access for over **100** users.\nProvided continuous learning opportunities and training in emerging technologies to team members, fostering a culture of professional growth and development.\nUtilized collaborative tools to support team collaboration, resulting in improved communication and project outcomes.\nSupported German and English-speaking clients, ensuring exceptional service orientation and satisfaction metrics well above industry standards."
    }
  ],
  "skills": "Programming Languages:\n\tPython, JavaScript, TypeScript\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tJWT, OAuth2\n\n**Serverless and Cloud Functions:**\n\tAWS (Lambda), Google Cloud\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS (ECS, RDS, S3), Azure (App Services, Blob, SQL), Cloud Migration\n\n**Other:**\n\tArtificial Intelligence, Machine Learning, MLflow, Airflow, Kubeflow, Authentication & Security, Keycloak (OIDC, RBAC), Let’s Encrypt, Nginx, Certbot, Windows, Active Directory, Exchange, Networking, IT Consulting, Project Management, Service Orientation, Team Collaboration, Continuous Learning, German, English",
  "apply_company": "PCG DACH"
}