{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Mid-Level Full Stack Engineer (Backend-Focused)",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-623a26390/",
  "profile_summary": "Mid-Level Full Stack Engineer with 13+ years of experience in building robust applications within healthcare and financial industries. Proficient in **C#**, **.NET**, **MySQL**, **PostgreSQL**, **DynamoDB**, **JavaScript**, and **TypeScript**, with strong capabilities in **React** for frontend development. Adept in cloud services including **AWS**, **GCP**, and **Azure**, as well as infrastructure management with **Terraform**. Experienced with Agile methodologies and behavior-driven development using **Gherkin** and **SpecFlow**. \nIn addition to backend systems, I hold hands-on expertise in **Python** and have developed applications leveraging **Flutter**. Proven track record of delivering AI/ML-infused solutions for predictive analytics and real-time processing. Committed to compliance-driven development, ensuring adherence to standards such as HIPAA, FHIR, PCI DSS, and SOC 2. Strong background in deploying microservices and managing CI/CD pipelines.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Mid-Level Full Stack Engineer (Backend-Focused)",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Developed robust backend systems using **C#**, **.NET**, and **MySQL**, ensuring high performance and security for applications in healthcare and fintech sectors.\n- Implemented business logic and API integrations with **PostgreSQL** and **DynamoDB**, managing data flows effectively to support heavy data ingestion and real-time analytics.\n- Designed and maintained cloud infrastructure on **AWS**, **GCP**, and **Azure**, utilizing **Terraform** for Infrastructure as Code (IaC) to streamline deployment processes.\n- Collaborated within an **Agile** team, employing methodologies to ensure timely delivery of features and adherence to project timelines.\n- Integrated frontend experiences using **JavaScript**, **TypeScript**, and **React**, ensuring seamless user interactions powered by backend services.\n- Leveraged **Gherkin** and **SpecFlow** for behavior-driven development, enhancing application testing and clarity of business requirements.\n- Established and optimized CI/CD pipelines with a focus on quality assurance, including automated testing and deployment workflows across multiple environments.\n- Participated in code reviews and provided mentorship to junior developers, fostering a culture of high technical standards and continuous improvement within the team.\n- Assisted in the migration of monolithic applications to microservices, utilizing industry best practices to enhance scalability and maintainability."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Engineered robust backend services leveraging **C#**, **.NET** to ensure high-performance and maintainability in financial applications.\nDeveloped interactive front-end features using **JavaScript**, **TypeScript**, and **React** (18), enhancing user experience with responsive designs and optimized performance.\nImplemented database solutions using **MySQL**, **PostgreSQL**, and **DynamoDB**, ensuring efficient data storage and retrieval for enhanced transaction processing.\nArchitected cloud-based solutions utilizing **AWS**, **GCP**, and **Azure**, enabling scalable infrastructure to support continuous deployment and high availability across applications.\nUtilized **Terraform** for infrastructure as code, streamlining deployment processes and enhancing environment setup consistency across multiple stages.\nCollaborated in an **Agile** environment, employing **Gherkin** and **SpecFlow** for behavior-driven development, leading to improved software quality and stakeholder alignment.\nDesigned ETL pipelines with Python, Apache Airflow, and Azure Data Factory, achieving a processing capacity of **3 million transactions per day** and significantly improving data accessibility.\nEmployed machine learning models to enhance fraud detection capabilities, achieving **95% accuracy** in identifying suspicious transactions, leading to a decrease in false positives.\nExecuted end-to-end testing frameworks and unit testing, enhancing application reliability and reducing deployment issues by **40%**."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Utilized **C#** and **.NET** to design and optimize backend services for scalable applications, achieving high availability and low latency across key modules, with performance metrics improved by **30%**.\nDeveloped robust APIs and services leveraging **MySQL** and **PostgreSQL**, ensuring efficient data handling and storage across high-traffic applications, resulting in a **20%** increase in database query performance.\nImplemented cloud services using **AWS**, **GCP**, and **Azure** to deploy applications, employing infrastructure as code practices with **Terraform** to maintain operational efficiency and reduce deployment errors by **15%**.\nEnhanced user interfaces utilizing **React** and **TypeScript**, ensuring responsive and accessible designs that met **WCAG 2.1** compliance standards, contributing to a more inclusive user experience.\nEngaged in Agile methodologies and practices, including sprint planning and retrospective meetings, to ensure successful project delivery with improved team collaboration.\nCollaborated on test-driven development (TDD) utilizing **Gherkin** and **SpecFlow** frameworks to build comprehensive testing scenarios, leading to a **40%** decrease in bug reports post-deployment.\nParticipated in code reviews and knowledge sharing sessions to promote best practices and continuous learning within the development team, fostering a culture of excellence and innovation.\nDesigned and maintained robust CI/CD pipelines that automated testing and deployment processes, increasing deployment frequency by **50%** and reducing lead time for changes substantially."
    }
  ],
  "skills": "**Programming Languages:**\n\tC#, Python, JavaScript, TypeScript\n\n**Backend Frameworks:**\n\t.NET, FastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tGherkin, SpecFlow, OAuth2, JWT\n\n**Serverless and Cloud Functions:**\n\tAWS, Azure, GCP, Lambda\n\n**Databases:**\n\tMySQL, PostgreSQL, DynamoDB, MongoDB, Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD\n\n**Cloud & Infrastructure:**\n\tECS, RDS, S3, App Services, Blob Storage, SQL Database, Terraform, Ansible, Helm, Docker Compose\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, Nginx, Let’s Encrypt, Certbot, Agile"
}