{
  "name": "Rei Taro",
  "role_name": "Senior Angular Engineer",
  "email": "rei515@outlook.com",
  "phone": "+48732529451",
  "address": "Warszawa, Poland",
  "linkedin": "https://www.linkedin.com/in/rei-taro-81a410391/",
  "profile_summary": "Results-driven Senior Angular Engineer with 10+ years of backend development experience, bringing deep expertise in designing and delivering high-quality web applications. Proficient in **Angular**, **TypeScript**, and **Tailwind**, with a strong focus on responsive design to ensure seamless user experiences. Demonstrated ability to work within Agile and Scrum frameworks, utilizing exceptional problem-solving skills to tackle complex development challenges. Strong backend experience includes developing high-performing APIs and scalable services using **Python (FastAPI, Django, Flask)** and cloud platforms like **AWS** and **Azure**. Proven success in impactful projects with top organizations, including VISA, Sii Poland, and Reply Polska.",
  "education": [
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2010",
      "to_year": "2015",
      "location": "Japan",
      "university": "Keio University"
    }
  ],
  "experience": [
    {
      "role": "Senior Angular Engineer",
      "company": "Leobit",
      "from_date": "Aug 2022",
      "to_date": "Present",
      "location": "Poland",
      "responsibilities": "- Developed responsive and user-friendly interfaces using **Angular**, **TypeScript**, and **Tailwind** to enhance the overall user experience for web applications.\n- Participated in **Agile** methodologies and **Scrum** practices to ensure effective project management and timely delivery of features.\n- Engineered backend services in **Python** using **FastAPI** to streamline document automation, user onboarding, and reporting workflows.\n- Developed event-driven solutions with **Celery** and **Redis** to manage asynchronous processing for financial transaction requests, achieving a processing efficiency improvement of **30%**.\n- Deployed microservices on **Azure App Services** and utilized **Terraform** for managing infrastructure as code, ensuring seamless cloud operations with a deployment frequency of **weekly**.\n- Created and maintained data pipelines for regulatory data exchange using **Apache Airflow** and **Azure Functions**, ensuring timely and accurate data flow across systems with a latency reduction of **15%**.\n- Led security assessments and successfully integrated **OAuth2** and **Azure AD B2C** for secure, scalable authentication systems, improving security compliance by **20%**.\n- Collaborated with cross-functional teams to address system integration challenges, ensure compliance, and oversee release strategies, resolving project bottlenecks effectively."
    },
    {
      "role": "Software Engineer",
      "company": "Innovature",
      "from_date": "Nov 2018",
      "to_date": "Jun 2022",
      "location": "Japan",
      "responsibilities": "Utilized **Angular** and **TypeScript** frameworks to develop dynamic user interfaces and ensure responsive design, enhancing user engagement by **30%**.\nEmployed **Tailwind CSS** for styling the application, improving UI consistency and reducing development time by **20%** through utility-first design principles.\nAdhered to **Agile** methodologies and participated in **Scrum** ceremonies, which led to a **15%** increase in team efficiency and timely delivery of project milestones.\nDesigned and implemented user-friendly components that solved complex problems, resulting in a **25%** reduction in reported user issues and improved overall customer satisfaction.\nCollaborated closely with backend developers and stakeholders to ensure seamless integration of frontend and backend systems, meeting project deadlines and specifications.\nConducted regular code reviews and mentored junior developers in best practices of **Angular** development, contributing to a more skilled and cohesive team environment."
    },
    {
      "role": "Software Developer",
      "company": "Wizcorp",
      "from_date": "Apr 2015",
      "to_date": "Nov 2018",
      "location": "Japan",
      "responsibilities": "Utilized **Angular** and **TypeScript** to develop dynamic and responsive user interfaces, enhancing user experience with a focus on **Tailwind** for streamlined styling.\nCollaborated in an **Agile** environment as part of a **Scrum** team to deliver high-quality software solutions, utilizing problem-solving skills to overcome development challenges.\nLed initiatives to ensure responsive design principles were implemented, achieving an improved UI adaptability across **9** device types and screen resolutions.\nContributed to the project by participating in regular sprint reviews, enhancing team communication and ensuring alignment with business objectives.\nImplemented performance optimizations, resulting in a **30%** improvement in loading times and overall application responsiveness.\nDeveloped comprehensive documentation and training materials for the frontend processes, ensuring knowledge transfer and maintaining high development standards.\nFostered a collaborative atmosphere, mentoring junior developers and facilitating problem-solving sessions, leading to increased team productivity by **15%**."
    }
  ],
  "skills": "**Frontend Frameworks**\n\tAngular, TypeScript, Tailwind, Responsive Design\n\n**Programming Languages**\n\tPython (3.8+), SQL, Bash, JavaScript\n\n**Backend Frameworks**\n\tFastAPI, Flask, Django, Celery\n\n**API Technologies**\n\tREST/gRPC APIs, Microservices\n\n**Databases**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**Cloud & Infrastructure**\n\tAWS (EC2, S3, Lambda), Azure\n\n**DevOps**\n\tDocker, Kubernetes, GitHub Actions, Azure DevOps, CI/CD, Git\n\n**Other**\n\tAI/ML Tools: Pandas, NumPy, scikit-learn, TensorFlow, Airflow, MLflow, Agile, Scrum, Problem Solving",
  "apply_company": "Gizli"
}