{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Lead Software Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-karol-kotlinski-bb2520397/",
  "profile_summary": "As a Lead Software Engineer with 8 years of experience, I have a proven track record in building high-performance solutions across industries, leveraging **Java**, **Spring Boot**, **Python**, and **Microservices** architecture. My expertise includes implementing **Agile** methodologies, **TDD**, and **DevOps** practices while utilizing cloud technologies with **AWS**, **Azure**, and **GCP**. I have extensive experience with **CI/CD** pipelines, **Docker**, and **Kubernetes**, ensuring efficient deployment and robust application performance.\n\nI have successfully led the development of complex systems that adhere to compliance standards and prioritize **Code Quality** through numerous best practices in **Automated Testing** and **Software Architecture**. My strong communication skills enable me to mentor teams effectively and drive collaborative efforts on projects. I am also experienced in integrating AI/ML functionalities and developing machine learning workflows, enhancing operational efficiency and innovation.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Lead Software Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Utilized **Java** and **Spring Boot** to architect and develop scalable microservices-based healthcare and financial platforms, ensuring robust software architecture and compliance with industry standards (HIPAA, PCI DSS, etc.).\nLed Agile development initiatives, focusing on Test-Driven Development (TDD) to enhance code quality and maintainability, utilizing tools like Jest and PyTest for comprehensive testing.\nEngineered CI/CD pipelines using **AWS**, **Azure DevOps**, and **Docker**, enabling rapid deployment cycles, automated testing, and code quality assurance for both web and API services.\nDeployed containerized applications using **Kubernetes**, ensuring high availability and scalability while managing complex system architectures.\nDesigned and developed solutions leveraging **Python**, incorporating modern frameworks and libraries, with an emphasis on creating efficient and performant applications.\nCollaborated across teams to integrate and deploy cloud services, including **GCP** for data storage and processing, enhancing system resilience and fault tolerance.\nManaged and mentored engineering teams, fostering effective **communication** and agile methodologies to ensure timely project delivery and team cohesion.\nEstablished metrics for monitoring application performance and reliability, utilizing advanced logging and analytics to inform development processes.\nContributed to the design of machine learning models for predictive analytics, applying insights to enhance both healthcare outcomes and financial fraud detection strategies.\nLed architectural reviews and code walkthroughs, focusing on enhancing software architecture principles and improving maintainability across projects."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "• Led software architecture initiatives utilizing **Microservices** and **Agile** methodologies, enhancing scalability and delivery timelines by **30%** for high-traffic financial platforms.\n• Developed robust back-end services in **Python** (FastAPI, Django) and integrated with **Java** and **Spring Boot** frameworks to streamline financial operations and improve code quality through **TDD** practices.\n• Championed the adoption of **DevOps** principles, implementing **CI/CD** pipelines with tools like **Docker** and **Kubernetes** to ensure continuous integration and delivery, reducing deployment time by **50%**.\n• Collaborated with cross-functional teams to enhance communication and foster collaboration, ensuring project milestones were met on time within an **Agile** environment.\n• Engaged in cloud technology implementation on **AWS**, **Azure**, and **GCP** to optimize performance and leverage cloud resources for high availability and disaster recovery.\n• Conducted code reviews and automated testing practices, ensuring code quality and adherence to industry standards, resulting in a **20%** reduction in post-deployment issues.\n• Spearheaded the modernization of financial dashboards using **React** (18), **Vue 3**, and **Next.js**, improving user experience and performance metrics by **25%** with the use of **Tailwind CSS** and **Redux Toolkit**.\n• Integrated event-driven architectures using **Kafka**, **RabbitMQ**, and **Azure Service Bus**, enhancing system resilience and reliability for processing real-time transaction events.\n• Developed and automated ETL pipelines with **Apache Airflow** and **Azure Data Factory**, facilitating data ingestion processes with an increase in operational efficiency by **40%**.\n• Implemented machine learning fraud detection solutions using **scikit-learn**, **XGBoost**, and **Azure Machine Learning**, which successfully flagged up to **15%** of potential fraudulent activities in real-time, ensuring secure banking operations.\n• Created end-to-end ML pipelines for critical business functions such as credit scoring and churn prediction, utilizing **MLflow** for model management and integration with back-end services."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "• Led the implementation of **Microservices** architecture using **Java (Spring Boot)**, ensuring modularity and scalability across various e-commerce services.\n• Utilized **Agile** methodologies to drive project delivery timelines, enhancing team collaboration and communication, resulting in a **30%** improvement in sprint efficiencies.\n• Championed **DevOps** practices with **CI/CD** pipelines in **AWS** and **Azure**, optimizing deployment cycles and reducing downtime by **25%** during production releases.\n• Promoted coding standards by implementing **Automated Testing** and **Code Quality** tools, which yielded a **40%** reduction in bug counts after release.\n• Spearheaded the migration of legacy systems to **Cloud Technologies** including **GCP**, ensuring a smoother transition with minimal service disruption for users.\n• Fostered a culture of collaboration through effective **Communication**, facilitating knowledge sharing and mentoring of junior engineers, resulting in a more proficient team.\n• Enhanced backend services using **Python**, focusing on scalability and performance, and integrated **Microservices** with existing systems to streamline workflows.\n• Developed an effective **Software Architecture** that supports rapid iteration and feature enhancement, leveraging principles of **TDD**.\n• Contributed to team discussions around **Docker** and **Kubernetes** for container orchestration and management, enabling consistent environments across development and production.\n• Overhauled legacy workflows by adopting **Agile** methodologies, enabling faster delivery of features and improvements based on user feedback.  \n"
    }
  ],
  "skills": " **Programming Languages:**\n\tJava, Python\n\n **Backend Frameworks:**\n\tSpring Boot, FastAPI, Flask, Django, Microservices\n\n **Frontend Frameworks:**\n\tJavaScript/TypeScript (React, Vue, Angular)\n\n **API Technologies:**\n\t\n\n **Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL), GCP\n\n **Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, CI/CD, Automated Testing, TDD, Code Quality\n\n **Cloud & Infrastructure:**\n\tTerraform, Ansible, Helm, Docker Compose, Cloud Technologies\n\n **Other:**\n\tAgile, Software Architecture, Communication, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, MLflow, Airflow, Kubeflow"
}