{
  "name": "Patryk Zaslawski",
  "role_name": "Alignment Engineer (International)",
  "email": "patrykzas0428@outlook.com",
  "phone": "+48669862402",
  "address": "Gdanski, Poland",
  "linkedin": "https://www.linkedin.com/in/patryk-zaslawski-6b04a8397/",
  "profile_summary": "Results-driven Alignment Engineer with extensive experience in IT administration and technical support, leveraging a strong foundation in hardware and software applications to enhance telecommunications infrastructure. Possessing outstanding problem-solving and organizational skills, I effectively manage workstations and network operating systems, ensuring seamless operation of Microsoft Windows environments. Bringing proven capabilities in client relationship management and documentation management, I excel in multitasking, attention to detail, and effective communication within cross-functional teams. My holistic approach combines a proactive initiative with strong interpersonal skills, ensuring high-quality service delivery while working autonomously. With a background in web technologies and experience in developing scalable solutions, I am prepared to contribute valuable insights and drive improvements in alignment processes on an international scale.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2014",
      "to_year": "2017",
      "location": "United Kingdom",
      "university": "The University of Manchester"
    }
  ],
  "experience": [
    {
      "role": "Alignment Engineer (International)",
      "company": "Binary Studio",
      "from_date": "Aug 2023",
      "to_date": "Present",
      "location": "United Kingdom (Remote)",
      "responsibilities": "Managed IT administration and technical support for a scalable and secure Healthcare Experience Platform utilizing **Python** technologies including **FastAPI**, **Django**, and **Flask**.\nFacilitated seamless communication across telecommunications infrastructure through effective integration of **payment gateways** such as **Stripe**, **PayPal**, and **Adyen**, ensuring secure and multi-currency transactions.\nImplemented software applications that adhere to compliance standards (HIPAA, FHIR, GDPR) and optimized for **cloud** deployment, achieving a 100% audit success rate.\nDeveloped detailed documentation management processes for project technical specifications, ensuring clarity and team alignment for over **10+ engineers** in cross-functional teams.\nExercised strong problem-solving skills by creating efficient **mock APIs** and implementing RESTful and **gRPC** APIs in **Python** to facilitate secure financial and healthcare workflows.\nDemonstrated organizational and communication skills by managing transactional audits and compliance reporting frameworks effectively integrated with **Power BI**, **Grafana**, and **Azure Monitor**.\nShowcased autonomy in spearheading migrations from monolith architecture to **Python-based microservices**, improving scalability by **30%**.\nEngaged in client relationship management by leading the design and integration of user-friendly microservices that enhanced patient engagement and experience.\nApplied interpersonal skills to mentor junior engineers on Python, FastAPI, and **cloud-native** design patterns, fostering a culture of teamwork and continuous improvement.\nOptimized data query performance through **PostgreSQL** and **Redis**, achieving a response time reduction of up to **50%** for large datasets.\nAutomated workflows and task management for healthcare operations using **Azure Functions** and **Logic Apps**, increasing efficiency in claim adjudication processes by **40%**.\nUtilized **Adobe Experience Manager (AEM)** with **Python** services to enhance digital healthcare experiences, ensuring user-centric design and delivery.\nIntegrated monitoring tools like **Prometheus** and **Grafana** for observability, enabling proactive issue resolution and maintaining **99%** system uptime."
    },
    {
      "role": "Software Engineer",
      "company": "Ardigen",
      "from_date": "Mar 2020",
      "to_date": "Aug 2023",
      "location": "Poland",
      "responsibilities": "Provided **technical support** and **administration** for **telecommunications infrastructure**, enhancing system performance and reliability across various hardware and software applications.\nManaged **network operating systems** and **workstation operating systems** in a critical operational environment, ensuring compliance with **Microsoft Windows** standards for performance and security.\nMaintained detailed **documentation management** processes to track changes, updates, and system configurations, facilitating better **client relationship management** during system upgrades.\nUtilized strong **organizational skills** to oversee multiple projects simultaneously, demonstrating exceptional **problem-solving** abilities in troubleshooting complex technical issues.\nCommunicated effectively with cross-functional teams, showcasing **interpersonal skills** to address client needs and foster teamwork.\nExecuted timely **task management** strategies, achieving a **95%** on-time completion rate for project deliverables.\nDeveloped and delivered key strategies in **web technologies** to improve the usability and performance of client-facing applications.\nApplied **initiative** and **attention to detail** in troubleshooting processes, resulting in a **30%** reduction in average resolution time for technical issues.\nAchieved a **25%** improvement in system uptime through effective **multi-tasking** across various technical support tasks, increasing customer satisfaction ratings.\nPromoted **autonomy** in teams to encourage self-driven problem resolution, enhancing overall service efficiency and effectiveness."
    },
    {
      "role": "Software Engineer",
      "company": "Altum Software",
      "from_date": "Oct 2017",
      "to_date": "Feb 2020",
      "location": "United Kingdom",
      "responsibilities": "- Managed and supported IT infrastructure, ensuring optimal performance of telecommunications systems and hardware applications for international operations.\n- Provided technical support for software applications and network operating systems, enhancing user experience for **Microsoft Windows** workstations.\n- Documented troubleshooting procedures and system configurations to maintain comprehensive knowledge management and effective client relationship management.\n- Developed and implemented organizational strategies to streamline IT processes, demonstrating strong multitasking and problem-solving abilities.\n- Exercised initiative and attention to detail in overseeing IT operations, ensuring adherence to best practices and efficient task management across multiple projects.\n- Collaborated with cross-functional teams to enhance organizational communication and teamwork, fostering a culture of autonomy and cooperation.\n- Analyzed and resolved complex technical issues, applying interpersonal skills to communicate effectively with clients and stakeholders.\n- Optimized workflows for technical operations, ensuring high availability and reliability of IT services in alignment with business goals.\n- Engaged in continuous improvement initiatives, leveraging feedback to refine technical processes and improve service delivery."
    }
  ],
  "skills": "Programming Languages:\n\tPython\n\nBackend Frameworks:\n\tFastAPI, Django, Flask, Spring Boot\n\nFrontend Frameworks:\n\tAngular (1–16), React (15–18), Next.js, Vue.js (2/3), Blazor\n\nAPI Technologies:\n\tREST & gRPC APIs\n\nServerless and Cloud Functions:\n\tAWS (Lambda), Azure (App Services)\n\nDatabases:\n\tPostgreSQL, MySQL, MongoDB, Redis, SQLAlchemy\n\nDevOps:\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD\n\nCloud & Infrastructure:\n\tAWS (ECS, RDS, S3), Azure (Blob, SQL), Nginx, Certbot\n\nOther:\n\tIT administration, technical support, telecommunications infrastructure, hardware applications, software applications, network operating systems, workstation operating systems, Microsoft Windows, web technologies, documentation management, client relationship management, organizational skills, problem-solving, communication skills, interpersonal skills, task management, multi-tasking, initiative, attention to detail, teamwork, autonomy"
}