{
  "name": "Mariusz Jan Skobel",
  "role_name": "Senior AI Engineer",
  "email": "mariuszskobel15@outlook.com",
  "phone": "+48 735 343 548",
  "address": "Katowice, Poland",
  "linkedin": "https://www.linkedin.com/in/mariusz-skobel-927764397/",
  "profile_summary": "Results-driven Senior AI Engineer with 10+ years of experience specializing in deploying Machine Learning (ML) solutions and leveraging AI technologies. Proficient in **Python**, with hands-on expertise in **scikit-learn**, **PyTorch**, **NLP**, and cloud platforms including **AWS**, **Azure**, and **GCP**. Skilled in data manipulation and analysis using **SQL**, and experienced in managing ML workflows with **MLOps** principles and tools. Solid understanding of LLM frameworks such as **LangChain**, **LangGraph**, and **LangFuse**, alongside extensive knowledge in vector databases.\n\nAdept at developing robust data pipelines and integrating statistical methodologies to enhance model performance. Strong command of mathematics and statistics to inform algorithm design and optimization. Experienced in employing **DevOps** practices to streamline development processes and improve application delivery. Committed to building innovative AI-powered applications that create real-world impact while maintaining adherence to industry compliance standards.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2012",
      "to_year": "2015",
      "location": "UK",
      "university": "University of Bristol"
    }
  ],
  "experience": [
    {
      "role": "Senior AI Engineer",
      "company": "EitBiz",
      "from_date": "Oct 2022",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Designed and implemented AI-driven solutions leveraging **Python**, **PyTorch**, and **scikit-learn** for advanced machine learning applications, including patient risk prediction and financial fraud detection.\n• Developed and maintained databases using **SQL** for large-scale data processing and analytics, optimizing queries for performance and efficiency in healthcare and finance domains.\n• Integrated Natural Language Processing (NLP) solutions into applications, utilizing models powered by **LLM**, **LangChain**, **LangGraph**, and **LangFuse** for document parsing and anomaly detection.\n• Developed MLOps pipelines with **MLflow** and **Azure**, ensuring seamless deployment and versioning of machine learning models across environments.\n• Implemented DevOps practices utilizing **AWS** and **Azure DevOps** for continuous integration and delivery (CI/CD) of AI applications, enhancing deployment efficiency by **30%**.\n• Leveraged vector databases for storing and retrieving high-dimensional data representations, ensuring fast access to relevant information for AI-driven insights.\n• Collaborated with cross-functional teams to analyze and apply mathematical and statistical approaches for model training and evaluation, achieving a **15%** improvement in predictive accuracy.\n• Ensured compliance with regulatory standards such as HIPAA and GDPR during the development of AI models and applications.\n• Designed and integrated advanced search capabilities using **ElasticSearch** to handle unstructured data, facilitating real-time information retrieval for healthcare and financial documents.\n• Trained and deployed various machine learning models with a focus on performance metrics, delivering solutions that reduced processing time by an average of **25%**."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Tvn S.A.",
      "from_date": "Oct 2019",
      "to_date": "Sep 2022",
      "location": "Poland",
      "responsibilities": "Implemented AI/ML solutions utilizing **Python**, **scikit-learn**, **PyTorch**, and **MLOps** practices to build and optimize machine learning models for diverse financial applications.\nDeveloped robust data processing and ETL pipelines leveraging **Azure Data Factory** and **Apache Airflow** for efficient data ingestion and transformation, facilitating the seamless integration of financial data from multiple sources.\nApplied statistical methods and mathematics to derive insights from complex datasets, improving decision-making processes in financial services using AI-powered techniques.\nDesigned and integrated Natural Language Processing (NLP) models using **LangChain** and **NLP** frameworks to enhance customer interactions and streamline financial operations.\nCollaborated with cross-functional teams to deploy machine learning models on **AWS** and **GCP**, ensuring scalable and efficient production environments to handle high transaction loads.\nUtilized **SQL** for data querying and analysis to support machine learning initiatives, resulting in improved data reliability and performance in models used for fraud detection and credit scoring.\nConducted rigorous testing and validation of machine learning models to ensure compliance and accuracy, thereby reducing false positives in fraud detection systems by **20%**.\nEnhanced existing financial applications by incorporating advanced algorithms and modern techniques from **DevOps** practices, leading to better maintainability and deployment efficiency."
    },
    {
      "role": "Software Engineer",
      "company": "Timspark",
      "from_date": "Sep 2015",
      "to_date": "Aug 2019",
      "location": "UK",
      "responsibilities": "Developed and optimized AI-driven backend services using **Python** and **scikit-learn** for a global e-commerce platform, ensuring high availability and scalability for LLM integrations.\nEngineered NLP solutions with **LangChain**, **LangGraph**, and **LangFuse**, enabling advanced product recommendation systems that improved user engagement by **30%**.\nApplied **vector DBs** and distributed storage techniques to enhance data retrieval speeds, achieving a **25%** reduction in response times for AI model queries.\nImplemented **ML** and **MLOps** practices to streamline model deployment and monitoring processes in **AWS**, **GCP**, and **Azure**, ensuring efficient scalability and resource management across cloud environments.\nLeveraged statistical methods and mathematics to refine predictive models, increasing accuracy by **15%** for personalized user experiences and behavior analysis.\nUtilized **PyTorch** for building robust machine learning algorithms, improving model training times and facilitating real-time updates to product listings.\nCollaborated with DevOps teams to integrate continuous deployment strategies, enhancing system uptime and reliability during major updates by implementing automated testing frameworks.\nCreated comprehensive documentation and version-controlled codebases, ensuring team alignment and easy onboarding for future AI projects and updates.\nMonitored application performance using advanced analytics tools, identifying bottlenecks and optimizing model outputs based on user feedback and behavior metrics."
    }
  ],
  "skills": " \n**Programming Languages:**\n\tPython, JavaScript, TypeScript\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tOAuth2, JWT, Keycloak (OIDC, RBAC)\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL), GCP\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis, vector DBs, SQL\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, CI/CD & Infrastructure as Code, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS, Azure, GCP\n\n**Other:**\n\tArtificial Intelligence, Machine Learning, LLM, LangChain, LangGraph, LangFuse, PyTorch, scikit-learn, NLP, mathematics, statistics, MLflow, Airflow, Kubeflow",
  "apply_company": "Exadel"
}