{
  "name": "Rei Taro",
  "role_name": "Senior Frontend Engineer",
  "email": "rei515@outlook.com",
  "phone": "+48732529451",
  "address": "Warszawa, Poland",
  "linkedin": "https://www.linkedin.com/in/rei-taro-81a410391/",
  "profile_summary": "Highly skilled Senior Frontend Engineer with over 10 years of experience specializing in developing dynamic user interfaces and high-performance applications. Proficient in **React**, **Typescript**, and **Redux**, with a strong background in implementing **WebGL** for enhanced visual performance. Demonstrated ability to integrate with backend services and databases such as **PostGIS**, **Oracle**, and cloud technologies like **AWS**. Experienced in collaboration through **Git** and **GitHub** for version control, and adept in documentation, testing, and profiling to ensure quality and efficiency of software solutions. Alongside technical expertise, I bring a proven ability to leverage AI/ML strategies in project contributions, significantly impacting outcomes at organizations such as VISA, Sii Poland, and Reply Polska.",
  "education": [
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2010",
      "to_year": "2015",
      "location": "Japan",
      "university": "Keio University"
    }
  ],
  "experience": [
    {
      "role": "Senior Frontend Engineer",
      "company": "Leobit",
      "from_date": "Aug 2022",
      "to_date": "Present",
      "location": "Poland",
      "responsibilities": "Implemented responsive user interfaces using **React** and **Typescript**, enhancing user experience based on feedback from over **100** end-users.\nDeveloped state management solutions with **Redux**, reducing data retrieval time by **30%** compared to previous methods.\nUtilized **Git** and **GitHub** for version control and collaboration among a team of **5** engineers, streamlining the development process.\nExecuted testing and profiling strategies to ensure application performance, achieving a load time reduction of **20%**.\nCreated comprehensive documentation for the frontend architecture and best practices, facilitating onboarding for new team members in under **2 weeks**.\nWorked with data visualization tooling using **WebGL** and maintained compatibility with modern web browsers, ensuring cross-platform functionality.\nCollaborated with backend teams to integrate **PostGIS** and spatial data analysis tools, enhancing feature set for mapping functionalities.\nEngaged in continuous learning and integration of **AI** capabilities to enhance application features, leading to improved user retention by **15%**."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Innovature",
      "from_date": "Nov 2018",
      "to_date": "Jun 2022",
      "location": "Japan",
      "responsibilities": "Utilized **React** and **Typescript** to develop responsive user interfaces, enhancing user onboarding processes for over **10,000** active users.\nImplemented state management solutions using **Redux**, achieving an increase in application performance by **30%** through optimized data flow.\nCollaborated on AI initiatives, integrating machine learning models into the frontend to enrich user experience with data-driven insights and predictions.\nProduced thorough documentation for all frontend development processes, ensuring clear communication within project teams and maintaining project transparency.\nConducted extensive testing and profiling, ensuring application robustness and reducing load times by **40%**.\nLeveraged **Git** and **GitHub** for version control and collaborative development, maintaining a clean codebase and facilitating seamless team contributions.\nExplored advanced visualization techniques using **WebGL** to enhance data representation, resulting in improved user engagement metrics.\nEngaged in regular code reviews and iterative feedback sessions, fostering a culture of continuous improvement and learning within the team."
    },
    {
      "role": "Software Developer",
      "company": "Wizcorp",
      "from_date": "Apr 2015",
      "to_date": "Nov 2018",
      "location": "Japan",
      "responsibilities": "• Translated product requirements into real-time user interfaces using **React** and **TypeScript**, enhancing user experience and overall platform engagement.\n• Developed reusable components with **Redux** to facilitate efficient state management and improve application performance by **30%**.\n• Implemented client-side data handling with effective documentation practices that reduced onboarding time for new developers by **20%**.\n• Collaborated with backend teams to integrate with APIs while ensuring data accuracy and responsiveness using **WebGL** for dynamic visualizations.\n• Employed testing methodologies, utilizing frameworks such as **Jest** and **Enzyme**, leading to a decrease in bug reports by **40%** post-release.\n• Created high-quality, maintainable code and regularly participated in code reviews on **GitHub**, promoting best practices and knowledge sharing.\n• Engaged in profiling and performance tuning strategies that improved application load times by an average of **50ms** across platforms.\n• Leveraged cloud services like **Databricks** and **Snowflake** for data analytics to support scalability and data extraction needs for frontend applications."
    }
  ],
  "skills": " **Programming Languages** \n\t Python (3.8+), SQL, Bash, JavaScript, TypeScript\n\n **Backend Frameworks** \n\t FastAPI, Flask, Django, Celery\n\n **Frontend Frameworks** \n\t React, Redux, WebGL\n\n **API Technologies** \n\t REST/gRPC APIs, Microservices\n\n **Serverless and Cloud Functions** \n\t AWS (EC2, S3, Lambda), Azure\n\n **Databases** \n\t PostgreSQL, MySQL, MongoDB, Redis, PostGIS, Redshift, BigQuery, Snowflake, Databricks, Oracle\n\n **DevOps** \n\t Docker, Kubernetes, GitHub Actions, Azure DevOps, CI/CD, Git\n\n **Cloud & Infrastructure** \n\t AI/ML Tools: Pandas, NumPy, scikit-learn, TensorFlow, Airflow, MLflow\n\n **Other** \n\t Kafka, Documentation, Testing, Profiling, Shortcut",
  "apply_company": "CARTO"
}