{
  "name": "Tomasz Lee",
  "role_name": "Entry-Level Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Detail-oriented Entry-Level Engineer with a strong foundation in **Python**, **SQL**, and **JavaScript**. Proficient in **TypeScript** and experienced in developing applications within **PostgreSQL** environments. Solid understanding of both frontend and backend web development, complemented by knowledge of **Git** for version control, and proficient in Linux for system operations. Equipped with skills in data analysis, machine learning, and APIs, with a passion for leveraging technology to solve problems. With over 9 years of experience as a .NET Full Stack Developer, I bring expertise in microservices architecture and distributed systems, along with familiarity in **Apache Kafka**, **RabbitMQ**, and **Redis**. Recognized for delivering robust solutions, streamlining development processes, and enhancing performance through collaborative teamwork and leadership on projects.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Entry-Level Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "• Developed and maintained efficient web applications leveraging **JavaScript** and **TypeScript** to enhance the functionality and responsiveness of the user interface.\n• Engaged in **Data Analysis** utilizing tools and frameworks to derive actionable insights from user data.\n• Managed database interactions with **PostgreSQL** and **SQL**, optimizing performance and ensuring data integrity.\n• Collaborated in **Backend Web Development** to design RESTful APIs, ensuring seamless integration between the frontend and backend.\n• Employed **Git** for version control to facilitate collaboration and maintain code integrity across teams.\n• Contributed to the creation of user-centric applications through effective **Frontend Web Development** practices, enhancing overall user experience.\n• Applied knowledge of **Data Mining** and **Data Modeling** to structure and analyze data effectively, empowering informed decision-making.\n• Gained proficiency in **Linux** environments to support application deployment and maintenance workflows.\n• Leveraged **Machine Learning** techniques to implement predictive analytics features, improving user engagement metrics by up to **20%**.\n• Participated in cross-functional teams to strategize and execute software solutions, adhering to project deadlines and standards."
    },
    {
      "role": "Full Stack Developer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "Utilized **Python** for data analysis and modeling, enhancing project insights and decision-making processes.\nDeveloped and maintained **APIs** for seamless data fetching from **PostgreSQL** databases, improving data access times by **20%**.\nEngaged in Frontend Web Development using **JavaScript** and **TypeScript**, contributing to the creation of responsive user interfaces that increased user satisfaction by **15%**.\nImplemented backend solutions in **Python** for handling server-side logic and data processing, ensuring efficient application performance.\nAssisted with structured **SQL** queries to optimize database interactions, resulting in a **30%** reduction in data retrieval time.\nCollaborated with cross-functional teams to gather system requirements, ensuring alignment with project goals and timelines.\nParticipated in continuous integration and deployment workflows using **Git**, contributing to a more streamlined development process.\nSupported the Junior Engineers through mentorship and code reviews, fostering a collaborative team environment.\nConducted data mining activities to extract actionable insights, contributing to enhanced project outcomes and client satisfaction.\nEngaged in machine learning experiments, applying foundational algorithms to solve real-world data problems."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "Utilized **Python** and **SQL** to perform data analysis and mining, improving decision-making efficiency in development processes by **30%**.\nDeveloped and maintained frontend applications using **JavaScript** and **TypeScript**, contributing to a **25%** increase in user engagement.\nImplemented **PostgreSQL** for robust data storage and management, enhancing data retrieval speed by **15%**.\nCollaborated on backend development projects, ensuring effective integration of **APIs** for seamless communication between services.\nEngaged in **Linux** server management and debugging to resolve operational issues, minimizing downtime by **10%**.\nVersion controlled code repositories using **Git**, facilitating team collaboration and code quality.\nParticipated in project-based data modeling initiatives, contributing to a better organizational structure of data assets.\nSupported machine learning integration, enhancing predictive capabilities of applications.\nContributed to frontend web development tasks, honing skills in client-side frameworks to improve user interfaces.\nActively participated in daily standups and team meetings, ensuring alignment with project milestones and objectives."
    }
  ],
  "skills": " **Programming Languages**\n\tPython, JavaScript, TypeScript\n\n**Backend Frameworks**\n\tNodeJS, ExpressJS, NestJS, C#, .NET, Entity Framework, Microservices\n\n**Frontend Frameworks**\n\tHTML, CSS, ReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n**API Technologies**\n\tRESTful API, GraphQL, APIs\n\n**Serverless and Cloud Functions**\n\t\n\n**Databases**\n\tMSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB\n\n**DevOps**\n\tAWS, Azure, CI/CD pipelines, Linux\n\n**Cloud & Infrastructure**\n\t\n\n**Other**\n\tGit, GitHub, Data Analysis, Machine Learning, Messaging & Caching: Apache Kafka, RabbitMQ, Redis, Testing Tools: NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest, Blockchain: Solidity, Ether.js, Web3.js, Ethereum, UX/UI Design, Data Mining, Data Modeling"
}