{
  "name": "Tomasz Lee",
  "role_name": "Manual Tester / Support Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-477994390/",
  "profile_summary": "Detail-oriented Manual Tester and Support Engineer with 9+ years of experience in manual testing, bug tracking, and optimizing application performance using robust methodologies. Proficient in SQL and **MySQL** for effective database management, alongside experience using **JIRA** and **GitHub Issues** for issue tracking and project management. Strong background in communication and problem-solving, enabling collaborative efforts across diverse teams. While my technical expertise includes **AWS**, **Azure**, and front-end frameworks like **Vue.js**, my primary focus remains on delivering quality assurance through meticulous testing practices and organizational skills.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Manual Tester / Support Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Apr 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Conducted **manual testing** of web-based customer management platforms, identifying and documenting bugs using **JIRA** and **GitHub Issues** to enhance quality assurance processes.\nCollaborated with development teams to ensure effective **bug tracking**, utilizing **Azure DevOps** for tracking project progress and issue resolution.\nApplied **SQL** for backend database queries, optimizing data retrieval processes to support testing and validation of application functionalities.\nEngaged in regular communication with stakeholders to discuss testing outcomes and software performance improvements, demonstrating strong **communication skills**.\nParticipated in problem-solving sessions to address and rectify technical issues during development, leveraging **problem-solving** strategies effectively.\nOrganized testing schedules and documentation efficiently, showcasing superior **organisational skills** in managing workload.\nUtilized **MySQL** for database testing purposes, ensuring data integrity and reliability.\nImplemented testing frameworks with **Vue.js** for front-end testing, enhancing the overall testing strategy.\nLeveraged cloud services like **AWS** to simulate production environments for thorough end-to-end testing scenarios.\nProvided feedback on user interface design in collaboration with UX/UI teams to support improved user experience."
    },
    {
      "role": "Full Stack Developer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "Conducted **manual testing** to ensure software quality and functionality, leading to a **30% reduction in bug reports**.\nUtilized **bug tracking** tools like **JIRA** and **GitHub Issues** to document and manage software defects, enhancing communication with development teams.\nManaged and optimized **MySQL** and **SQL** databases for project data retrieval and storage, resulting in improved response times by **20%**.\nCollaborated effectively with stakeholders to diagnose issues and gather requirements, showcasing strong **communication** and **problem-solving** skills.\nDeveloped and executed test cases using **Vue.js** for front-end components, ensuring robustness and usability.\nParticipated in flight safety meetings to address testing progress and resolve issues, demonstrating solid **organizational skills**.\nCreated detailed reports and documentation to track progress and share insights on software quality with stakeholders, fostering transparent communication.\nFacilitated knowledge sharing sessions on best practices for testing and quality assurance, enhancing team proficiency.\nLeveraged cloud services like **AWS** and **Azure** to enhance application deployment and maintenance, achieving a **15% decrease in deployment time**.\nMaintained a high level of user satisfaction by effectively troubleshooting and providing support for product functionalities."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "Engaged in **manual testing** to ensure software quality and reliability, identifying and documenting bugs effectively using **JIRA** and **GitHub Issues**.\nCollaborated with development teams to implement **bug tracking** processes, improving issue resolution time by **30%**.\nUtilized **MySQL** and **SQL** for database verification and data integrity checks, ensuring accurate test cases that align with project requirements.\nMaintained clear and effective **communication** with stakeholders to gather requirements and report issues promptly.\nApplied strong **problem-solving** skills to troubleshoot and resolve defects, ensuring that all functionalities meet specifications.\nDemonstrated excellent **organizational skills** by managing multiple tasks and priorities within **Agile** sprints, leading to a **15%** increase in productivity.\nParticipated in frontend testing efforts using **Vue.js**, significantly enhancing the user experience on the client-side dashboard with performance metrics improving by **25%**.\nWorked alongside development teams during code reviews to ensure coding standards and best practices were met.\nProvided comprehensive reports and documentation for internal systems, establishing a solid knowledge base to aid future projects and onboarding.\nAssisted in cloud service integration using **AWS** and **Azure**, streamlining deployment processes and enhancing system capabilities."
    }
  ],
  "skills": " **Programming Languages**\n\t JavaScript, TypeScript, C#, Python\n\n **Backend Frameworks**\n\t NodeJS, ExpressJS, NestJS, .NET, Entity Framework, Microservices\n\n **Frontend Frameworks**\n\t HTML, CSS, ReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n **API Technologies**\n\t RESTful API, GraphQL\n\n **Serverless and Cloud Functions**\n\t AWS, Azure\n\n **Databases**\n\t MSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB\n\n **DevOps**\n\t CI/CD pipelines\n\n **Cloud & Infrastructure**\n\t AWS, Azure\n\n **Other**\n\t UX/UI Design, Git, GitHub, Redux, Testing Tools: NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest, Blockchain: Solidity, Ether.js, Web3.js, Ethereum, manual testing, bug tracking, communication, problem-solving, organisational skills, JIRA, GitHub Issues"
}