{
  "name": "Patryk Zaslawski",
  "role_name": "Senior Software Engineer",
  "email": "patrykzas0428@outlook.com",
  "phone": "+48669862402",
  "address": "Gdanski, Poland",
  "linkedin": "https://www.linkedin.com/in/patryk-zaslawski-6b04a8397/",
  "profile_summary": "As a highly skilled Senior Software Engineer with over 8 years of experience, I specialize in developing robust applications using **Ruby on Rails**, alongside a strong proficiency in databases such as **PostgreSQL** and **MySQL**. I am adept in modern development practices including **Git**, **GitHub**, **Docker**, and **Kubernetes**, ensuring seamless collaboration and deployment processes. My technical expertise extends to frontend technologies like **Stimulus**, **Turbo**, **Tailwind CSS**, and **TypeScript**, which I leverage to enhance user experience and site performance optimization. Additionally, I have experience with **JSON:API**, **GraphQL**, and message brokers like **RabbitMQ** and **Kafka**, facilitating efficient system integration. My passion for collaboration, mentorship, and communication has allowed me to lead teams effectively, while my commitment to automated and unit testing ensures the delivery of high-quality software solutions.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2014",
      "to_year": "2017",
      "location": "United Kingdom",
      "university": "The University of Manchester"
    }
  ],
  "experience": [
    {
      "role": "Senior Software Engineer",
      "company": "Binary Studio",
      "from_date": "Aug 2023",
      "to_date": "Present",
      "location": "United Kingdom (Remote)",
      "responsibilities": "Developed and maintained scalable applications using **Ruby on Rails**, ensuring high performance and optimized site speed to meet user demands.\nIntegrated database solutions such as **PostgreSQL** and **MySQL** to enhance data retrieval and management, improving performance metrics by **30%**.\nImplemented containerization and orchestration using **Docker** and **Kubernetes**, achieving **99.9%** uptime through efficient deployment strategies.\nDesigned and executed CI/CD pipelines with **Git**, **GitHub**, and automated testing frameworks to ensure quality and streamline release processes, improving development velocity by **40%**.\nLeveraged **RabbitMQ** and **Kafka** for asynchronous communication between services, enhancing the application's responsiveness and scalability under heavy load conditions.\nConducted unit testing and automated testing procedures to ensure software reliability, reducing bugs in production by **25%**.\nUtilized **TypeScript** for robust front-end development and collaborated in building interfaces with **Stimulus**, **Turbo**, and **Tailwind CSS**, resulting in improved user experiences.\nMentored junior engineers in best coding practices and development strategies, promoting collaboration and fostering a culture of continuous improvement within the team.\nOptimized data querying and performance with **PostgreSQL** indexing and caching techniques, dramatically improving response times for complex data retrieval operations.\nEngaged in effective communication with cross-functional teams to ensure alignment on project goals and timelines, enhancing overall project delivery efficiency by **35%**.\nAnalyzed and enhanced technical SEO practices, contributing to a **50%** increase in organic search traffic, thereby improving the site’s visibility and user acquisition.\nEnsured software delivery compliance and quality through collaboration on code reviews and pair programming sessions within the team."
    },
    {
      "role": "Software Engineer",
      "company": "Ardigen",
      "from_date": "Mar 2020",
      "to_date": "Aug 2023",
      "location": "Poland",
      "responsibilities": "• Led the development and migration to a **Ruby on Rails** microservices-based backend architecture, improving scalability, maintainability, and performance while integrating services with **PostgreSQL** and **MySQL** for seamless data management.\n• Designed and implemented **JSON:API** and **GraphQL** APIs in **Ruby on Rails**, ensuring secure communication between internal banking mobile applications and other components with real-time transaction updates.\n• Maintained and refactored legacy systems into **Ruby on Rails** microservices, ensuring compatibility with modern platforms while preserving critical business functionality.\n• Built dynamic, user-centric frontends integrated with **Ruby on Rails** backends using **Stimulus**, **Turbo**, and **Tailwind CSS**, applying **TypeScript** for responsive and efficient user interfaces.\n• Developed real-time transaction monitoring dashboards powered by **Ruby on Rails** APIs with integrated **RabbitMQ** for advanced reporting and analytics.\n• Implemented system integrations with **RabbitMQ** and **Kafka** services to streamline ACH transfers, credit card payments, and wire transfers, improving transaction efficiency by **25%**.\n• Ensured robust data protection in **Ruby on Rails** services through automated testing and unit testing, maintaining compliance with financial regulations.\n• Worked with **PostgreSQL**, **MySQL**, and **Docker** in **Kubernetes** environments, optimizing queries and ensuring high availability and reliability for transactional data.\n• Leveraged **Kafka** and **RabbitMQ** with **Ruby on Rails** microservices to build a high-throughput, event-driven architecture capable of handling large-scale financial transactions, processing over **10,000** transactions per minute.\n• Configured and managed **AWS** infrastructure with **Ruby on Rails** services for reliable message brokering between microservices, improving modularity and decoupling.\n• Designed and implemented secure authentication and authorization in **Ruby on Rails** APIs using industry best practices.\n• Built fraud detection services in **Ruby on Rails**, integrating ML models and behavioral data to proactively identify suspicious activities.\n• Developed secure payment gateway integrations in **Ruby on Rails** supporting ACH transfers, credit card payments, and wire transfers, ensuring PCI-compliant interoperability.\n• Built serverless components in **AWS** using Lambda for ETL pipelines, reducing infrastructure overhead and improving responsiveness by **30%**.\n• Implemented the ELK stack (**Elasticsearch**, **Logstash**, **Kibana**) with **Ruby on Rails** services for centralized logging, monitoring, and performance tracking.\n• Managed **Kubernetes** clusters to deploy **Ruby on Rails** microservices, enabling rolling updates, auto-scaling, and high availability.\n• Applied best practices in **Ruby on Rails** development, including automated unit testing and integration testing, ensuring backend service reliability.\n• Designed integration solutions in **Ruby on Rails** for external partners, ensuring secure and compliant financial data exchange.\n• Contributed to event-driven architectures in **Ruby on Rails** using **Kafka** and **RabbitMQ** to decouple systems and enhance performance.\n• Integrated unit tests, static analysis, and CI/CD pipelines (**GitHub** Actions, **Git**) for automated quality assurance and continuous delivery."
    },
    {
      "role": "Software Engineer",
      "company": "Altum Software",
      "from_date": "Oct 2017",
      "to_date": "Feb 2020",
      "location": "United Kingdom",
      "responsibilities": "Designed and optimized backend services using **Ruby on Rails**, ensuring enhanced scalability and performance to improve user experience across e-commerce platforms.\nDeveloped and maintained robust RESTful APIs with **PostgreSQL** and **MySQL**, ensuring seamless integration for real-time customer interactions and reducing latency.\nImplemented caching strategies using **RabbitMQ** and **Kafka** for efficient data handling and processing in high-traffic scenarios.\nLeveraged **Docker** for containerization of applications to streamline deployments and improve development workflows across environments.\nAutomated builds, testing, and deployments through **GitHub** and CI/CD pipelines to deliver consistent and reliable software releases within a **2-week sprint cycle**.\nConducted unit testing and automated testing strategies to maintain high code quality, significantly decreasing the number of reported bugs by **30%**.\nUtilized **TypeScript**, **Stimulus**, and **Turbo** for building responsive and interactive frontends, ensuring a seamless integration with backend services.\nOptimized site performance with technical SEO best practices, achieving a **20% increase** in page load speed and improving user engagement metrics.\nCollaborated closely with cross-functional teams, offering mentorship and fostering communication to enhance project outcomes and team efficiency.\nPerformed performance testing using tools like **JMeter** and **Locust**, identifying bottlenecks in existing systems and implementing improvements that increased transaction processing speed by **25%**.\nEngaged in code reviews and maintained documentation to promote collaboration and knowledge sharing within the software engineering team."
    }
  ],
  "skills": "**Backend Frameworks:**\n\tRuby on Rails\n\n**Programming Languages:**\n\tPython, TypeScript\n\n**Frontend Frameworks:**\n\tAngular (1–16), React (15–18), Next.js, Vue.js (2/3), Blazor, Stimulus, Turbo, Tailwind CSS\n\n**API Technologies:**\n\tREST & gRPC APIs, JSON:API, GraphQL\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Git\n\n**Cloud & Infrastructure:**\n\tAWS, Azure\n\n**Other:**\n\tSQLAlchemy, Pydantic, Celery, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, RabbitMQ, Kafka, Automated testing, Unit testing, Technical SEO, Site performance optimization, Collaboration, Mentorship, Communication"
}