{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior React Native Software Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-187801395/",
  "profile_summary": "Senior React Native Software Engineer with 13+ years of experience, specializing in **React Native**, **JavaScript**, and **TypeScript**. Adept in creating seamless **RESTful APIs**, and implementing **asynchronous data flows** for high-performance applications. Hands-on expertise in building rich, interactive user interfaces following user experience best practices and UI design principles.\nProficient in **BLE** and **Bluetooth Low Energy (BLE)** libraries, enabling smart home technology and IoT integrations, specifically in energy systems and EV charging technologies. Experienced with **Git** and **CI/CD processes** to streamline development workflows.\nStrong interpersonal skills foster effective collaboration and communication across teams, ensuring project alignment and timely delivery. Additionally, skilled in leveraging my extensive background in full-stack development, including frontend and backend technologies like **Node.js**, **React**, **Next.js**, and **Django**.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior React Native Software Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Developed advanced mobile applications using **React Native** and **TypeScript**, ensuring adherence to **User Interface (UI)** design principles and **user experience best practices**.\n• Led the implementation of **RESTful APIs** to facilitate asynchronous data flows, enhancing application responsiveness and user interactions.\n• Designed and executed **CI/CD processes** utilizing tools like **GitHub Actions** and **CircleCI**, ensuring robust automation of deployment workflows with comprehensive test coverage.\n• Collaborated with cross-functional teams, enhancing **communication** and **collaboration** skills while integrating various **Bluetooth Low Energy (BLE)** functionalities into applications.\n• Built and maintained native modules leveraging **JavaScript** for seamless interaction with native device features, optimizing performance across iOS and Android platforms.\n• Implemented and managed effective testing tools, ensuring the delivery of high-quality code that meets project standards and user requirements.\n• Integrated IoT capabilities to enhance user experience in smart home technologies, focusing on **energy systems** and **EV charging technology**.\n• Developed 9+ user-centric features, directly improving the overall application usability and user satisfaction ratings.\n• Delivered 3+ major applications with extensive **real-time interactions**, achieving noteworthy improvements in user engagement and retention metrics.\n• Leveraged agile methodologies to ensure timely delivery of development milestones, adapting to evolving project requirements and user feedback."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "• Developed interactive mobile applications in **React Native**, leveraging **JavaScript** and **TypeScript** to create user-friendly interfaces that enhance overall user experience in energy systems and IoT applications.\n• Implemented **RESTful APIs** for seamless integration and communication between front-end interfaces and back-end services, promoting efficient asynchronous data flows.\n• Collaborated with cross-functional teams to design and refine **UI** and **UX** based on best practices, positively impacting user engagement metrics by over **30%**.\n• Utilized **Git** for version control and implemented **CI/CD processes** to streamline the development lifecycle, resulting in a **25%** reduction in deployment times.\n• Integrated **Bluetooth Low Energy (BLE)** technologies into applications to enhance connectivity with smart home devices and energy solutions, facilitating innovative features within the mobile ecosystem.\n• Developed and maintained comprehensive test suites with testing tools to ensure robustness and quality of the applications, achieving a code coverage of over **85%**.\n• Demonstrated strong collaboration and communication skills in agile environments, fostering a productive and creative team dynamic to drive project success.\n• Researched and implemented **native modules** and **BLE libraries** to extend application capabilities, enriching the user experience and functionality in the smart home technology domain."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Developed high-quality mobile applications using **React Native** while adhering to **JavaScript** and **TypeScript** best practices to ensure seamless integration with backend services and enhance user experience.\nDesigned and implemented **RESTful APIs** to facilitate effective communication between the mobile app and backend services, maintaining asynchronous data flows for smooth user interactions.\nCollaborated closely with cross-functional teams to ensure adherence to **UI design** principles and **user experience** best practices, resulting in a 30% improvement in user satisfaction rates.\nUtilized **Git** for version control and actively participated in **CI/CD processes**, ensuring efficient management of codebase and timely delivery of application updates.\nEngaged in rigorous testing with **testing tools** to identify and resolve issues, thus achieving a reduction in bugs by 25% prior to app deployment.\nHarnessed **Bluetooth Low Energy (BLE)** technology for implementing features that connect mobile applications with smart home devices, significantly enhancing home automation experiences.\nIntegrated native modules using relevant **BLE libraries**, allowing seamless interaction with IoT devices to expand the app's functionality in the smart home ecosystem.\nProduced documentation and conducted training sessions that improved team collaboration and communication, fostering a productive work environment.\nMonitored application performance and user feedback, making iterative improvements to the platform that increased usage rates by 15% over a **6-month** period.\nStayed up to date with advancements in **EV charging technology** and **energy systems**, ensuring the application meets the evolving needs of users in the green technology sector."
    }
  ],
  "skills": " **Programming Languages:**\n\tJavaScript, TypeScript, Python\n\n **Frontend Frameworks:**\n\tReact, React Native, Vue, Angular\n\n **API Technologies:**\n\tRESTful APIs, OAuth2, JWT\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n **Other:**\n\tBluetooth Low Energy (BLE), Native modules, BLE libraries, User Interface (UI) design, User experience best practices, Collaboration, Communication, Asynchronous data flows, Testing tools, IoT, Smart home technology, Energy systems, EV charging technology\n\n **DevOps:**\n\tDocker, Kubernetes, Git, GitHub Actions, GitLab CI/CD, CI/CD processes\n\n **Cloud & Infrastructure:**\n\tAWS: ECS, Lambda, RDS, S3, Azure: App Services, Blob Storage, SQL Database, Terraform, Ansible, Helm, Docker Compose\n\n **Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n"
}