{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Angular Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "As a dedicated Senior Angular Engineer with 8 years of experience, I specialize in developing dynamic, high-performance applications utilizing **Angular**, **TypeScript**, and **Tailwind**. My proficiency in responsive design and Agile methodologies ensures that I deliver user-focused solutions that enhance functionality and usability. I am well-versed in Scrum frameworks, driving collaborative projects that yield impactful results.\nAdditionally, my experience includes building full-stack solutions using **React**, **Next.js**, **Vue**, **Node.js**, and implementing CI/CD automation strategies to ensure smooth and secure deployments. My background in healthcare and financial sectors has equipped me with a strong understanding of compliance standards such as HIPAA and PCI DSS, enabling me to create applications that meet critical regulatory requirements. My problem-solving skills are complemented by my ability to integrate AI/ML capabilities, manage cloud environments in **AWS** and **Azure**, and develop robust microservices architecture.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Angular Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Utilized **Angular** and **TypeScript** to develop scalable and responsive web applications, ensuring high performance and maintainability across multiple deployments.\nLed Agile and Scrum initiatives, coordinating collaborative sprints to enhance product delivery, achieving a 20% improvement in development timelines.\nApplied responsive design principles to optimize user interfaces for various devices, improving user satisfaction scores by **15%**.\nImplemented robust problem-solving methodologies that reduced production issues by **30%**, enabling faster bug resolutions and feature iterations.\nIntegrated **Tailwind CSS** for seamless styling and responsive design, creating visually appealing applications that meet modern UX standards.\nFacilitated cross-functional team collaboration, ensuring effective communication between developers, designers, and stakeholders, leading to successful project outcomes.\nAuthored technical documentation and conducted code reviews to maintain code quality and consistency, which enhanced team efficiency by **25%**.\nContributed to continuous integration and deployment processes, using tools like GitHub Actions to streamline development workflows and reduce deployment times by **40%**.\nMentored junior engineers on Angular best practices and coding standards, fostering a knowledge-sharing environment that improved overall team performance.\nImplemented RESTful APIs to ensure seamless data exchange between front-end applications and backend services, enhancing application functionality and user interactions."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Focused on **Angular** and **TypeScript** development, leveraging **Tailwind CSS** for crafting responsive designs that enhance user experiences in financial applications.\nEmployed Agile methodologies and Scrum practices to ensure efficient project management and delivery, facilitating continuous improvement and adaptability in development cycles.\nUtilized strong problem-solving skills to address complex challenges in developing high-performance applications, ensuring robust solutions that meet user and business needs.\nLed modern web application front-end development using **Angular (latest version)**, ensuring seamless integration with back-end services and enhancing overall system performance.\nCollaborated with cross-functional teams to implement responsive design principles, optimizing UI/UX through rapid iteration and user feedback.\nDeveloped and maintained component libraries in **TypeScript** to ensure reusable, scalable code bases across multiple projects, resulting in a **30%** increase in development efficiency.\nStreamlined project workflows by adhering to Agile and Scrum methodologies, which improved team productivity by **25%** within **3 months** of implementation."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "• Developed robust frontend applications using **Angular** (latest version) and **TypeScript** to deliver seamless, responsive user experiences while actively employing **Tailwind CSS** for efficient styling and layout.\n• Engaged in **Agile** development methodologies, collaborating within **Scrum** teams to iteratively enhance product features and address user feedback effectively.\n• Leveraged strong **problem-solving** skills to address and resolve complex technical challenges in the UI development process, ensuring a high level of code quality and performance.\n• Optimized user interfaces for dynamic e-commerce environments, ensuring compliance with accessibility standards (WCAG 2.1) and enhancing mobile responsiveness.\n• Integrated **Angular** with backend services to facilitate real-time data binding, improving interactivity and user engagement.\n• Created SEO-friendly designs to maximize visibility and engagement across various devices, aiming for a conversion rate uplift of **25%**.\n• Collaborated on cross-team projects, implementing features in alignment with strategic objectives, achieving a **30%** increase in development efficiency through effective team coordination."
    }
  ],
  "skills": "**Frontend Frameworks:**\n\tAngular, TypeScript, Tailwind, Responsive Design\n\n**Agile & Project Management:**\n\tAgile, Scrum\n\n**Programming Languages:**\n\tPython(FastAPI, Flask, Django), JavaScript\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**API Technologies:**\n\tJWT, OAuth2, Keycloak (OIDC, RBAC)\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD\n\n**Cloud & Infrastructure:**\n\tTerraform, Ansible, Helm, Docker Compose\n\n**Artificial Intelligence & Machine Learning:**\n\tMLflow, Airflow, Kubeflow\n\n**Other:**\n\tNginx, Certbot, Problem Solving",
  "apply_company": "Gizli"
}