{
  "name": "Patryk Zaslawski",
  "role_name": "Mid-Level Django Backend Developer with DevOps Experience",
  "email": "patrykzas0428@outlook.com",
  "phone": "+48669862402",
  "address": "Gdanski, Poland",
  "linkedin": "https://www.linkedin.com/in/patryk-zaslawski-6b04a8397/",
  "profile_summary": "As a Mid-Level Django Backend Developer with DevOps Experience, I bring 8+ years of software engineering expertise focused on designing and implementing high-performance backend solutions. Proficient in **Django**, **Python**, and **REST API** development, I ensure seamless integration and robust performance for applications. My technical repertoire also includes **PostgreSQL** and **MySQL** for database management, and I leverage **CI/CD** methodologies, **Docker**, and **Kubernetes** for efficient deployment and orchestration. Skilled in cloud environments such as **AWS** and **Azure**, along with infrastructure as code using **Terraform** and **Ansible**, I enhance system reliability and scalability. Additionally, I possess foundational knowledge in **Linux** and version control with **Git**. My strengths include a keen problem-solving ability, adapting to new technologies swiftly, and a commitment to delivering high-quality, secure applications that align with business objectives.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2014",
      "to_year": "2017",
      "location": "United Kingdom",
      "university": "The University of Manchester"
    }
  ],
  "experience": [
    {
      "role": "Mid-Level Django Backend Developer with DevOps Experience",
      "company": "Binary Studio",
      "from_date": "Aug 2023",
      "to_date": "Present",
      "location": "United Kingdom (Remote)",
      "responsibilities": "- Developed and maintained **Django**-based backend solutions, ensuring robust API performance through effective **REST API** design and implementation.\n- Leveraged **Python** to build high-quality server-side logic, improving application efficiency by **30%** through optimized code and resource management.\n- Designed and managed **PostgreSQL** databases, ensuring data integrity and performance through proper indexing and query optimization.\n- Collaborated with cross-functional teams to implement **CI/CD** pipelines using **Git** and **Docker**, decreasing deployment times by **40%** while facilitating smoother release processes.\n- Deployed microservices on **Kubernetes**, enhancing scalability and resilience in production environments through **1-click** scaling solutions.\n- Utilized **AWS** and **Azure** cloud services to optimize application performance and cost, resulting in a **25%** reduction in operational expenses.\n- Implemented monitoring solutions using **Prometheus** and **Grafana**, enabling real-time visualization of application metrics and performance insights.\n- Integrated third-party tools and services into backend systems using **Python**, ensuring seamless data flows and enhancing overall functionality.\n- Wrote automated tests and maintained code quality through **Git** version control and **Shell scripting**, ensuring consistent delivery of high-quality code.\n- Mentored junior developers in **Python** and **Django** best practices, fostering an environment of continuous improvement and skill development.\n- Engaged with Agile methodologies, participating in daily stand-ups and sprint planning to drive development progress and team collaboration.\n- Created and maintained documentation for applications built in **Django**, facilitating knowledge sharing within the team and ensuring ongoing support and modification readiness."
    },
    {
      "role": "Software Engineer",
      "company": "Ardigen",
      "from_date": "Mar 2020",
      "to_date": "Aug 2023",
      "location": "Poland",
      "responsibilities": "• Developed and maintained scalable backend systems using **Django** and **Python**, ensuring robust performance and extensibility for high-traffic applications.\n• Designed and implemented **REST API** services for seamless data exchange between front-end applications and backend services, enabling a 40% increase in system interaction speed.\n• Collaborated with database systems like **PostgreSQL** and **MySQL**, optimizing queries and ensuring high availability for transactional data with less than 2 seconds response time.\n• Established CI/CD pipelines using **Git** and **Docker**, reducing deployment times by 30% and increasing deployment frequency.\n• Managed **Kubernetes** clusters for microservice orchestration, achieving high availability and facilitating rolling updates for more than **50+** services.\n• Employed **AWS** and **Azure** cloud services, enhancing system scalability and fault tolerance; led migration of legacy systems to these platforms, realizing a 25% cost reduction in infrastructure.\n• Implemented automated quality assurance processes using **CI/CD** tools and **Git** actions, maintaining a 95% success rate in deployment tests.\n• Engaged in scripting tasks with **Shell scripting** for automation, improving developer workflow efficiency by 20%.\n• Developed dynamic user interfaces integrating with back-end services using **React** and **Vue.js**, boosting user engagement metrics by 15%.\n• Contributed to infrastructure as code using **Terraform** and **Ansible**, streamlining environment provisioning and configuration management processes.\n• Set up monitoring solutions leveraging **Prometheus** and **Grafana** for system performance tracking, leading to a 30% reduction in incident response times.\n• Conducted regular system audits and performance analysis ensuring compliance with industry standards and enhancing data security protocols."
    },
    {
      "role": "Software Engineer",
      "company": "Altum Software",
      "from_date": "Oct 2017",
      "to_date": "Feb 2020",
      "location": "United Kingdom",
      "responsibilities": "Utilized **Django** and **Python** to design and optimize backend services for an e-commerce platform, achieving a **30%** improvement in system performance and user experience across key modules including checkout, cart, and order fulfillment.\nDeveloped secure and robust **RESTful APIs** in **Python** to efficiently handle high-volume transactions, facilitating real-time customer interactions with a transaction processing rate of **1,000 transactions/sec**.\nLeveraged **PostgreSQL** and **MySQL** to design, optimize, and manage transactional databases, achieving a **40%** reduction in query latency and improving data retrieval speeds.\nImplemented automated CI/CD processes using **GitHub Actions** and **Azure DevOps** to streamline builds, testing, and deployments, ensuring a **95%** reliability rate in feature delivery.\nContainerized Python applications with **Docker**, enabling scalable operations across multiple environments with a deployment success rate of **99%**.\nDesigned user-friendly frontends integrated with **React** and **Vue.js**, enhancing user experiences through interactive features and modern state management with Redux.\nExecuted database optimization techniques and caching strategies with **Redis** in Python services, resulting in a **50%** decrease in database load and a corresponding improvement in response times.\nImplemented observability in Python services using **Prometheus** and **Grafana** for enhanced performance tracking and system health monitoring, leading to faster issue resolution.\nConducted extensive unit and integration testing in **Python** using **PyTest** and **unittest**, contributing to a **70%** reduction in bugs post-release.\nArchitected and built secure payment integrations in Python with providers like **Stripe** and **PayPal**, ensuring compliance with PCI standards and smooth order processing.\nMigrated legacy systems to microservices architecture using **Django**, maintaining critical business workflows while improving scalability and maintainability.\nUtilized cloud services like **AWS**, **GCP**, and **Azure** for deploying applications, ensuring high availability and disaster recovery strategies are in place for seamless operations.\nDeveloped and implemented shell scripts for automation tasks, improving development efficiency and reducing manual operational overhead by **60%**."
    }
  ],
  "skills": "**Backend Frameworks:**\n\tDjango\n\n**Programming Languages:**\n\tPython\n\n**API Technologies:**\n\tREST API\n\n**Databases:**\n\tPostgreSQL\n\tMySQL\n\n**DevOps:**\n\tCI/CD\n\tDocker\n\tKubernetes\n\n**Cloud & Infrastructure:**\n\tAWS\n\tGCP\n\tAzure\n\n**Other:**\n\tLinux\n\tGit\n\tShell scripting\n\tTerraform\n\tAnsible\n\tPrometheus\n\tGrafana\n\tReact\n\tVue.js"
}