{
  "name": "Mariusz Jan Skobel",
  "role_name": "Senior Backend Engineer",
  "email": "mariuszskobel15@outlook.com",
  "phone": "+48 735 343 548",
  "address": "Katowice, Poland",
  "linkedin": "https://www.linkedin.com/in/mariusz-skobel-789557397/",
  "profile_summary": "Senior Backend Engineer with over 10 years of experience specializing in **Python**, **Django**, and **Flask** frameworks, alongside a robust proficiency in relational databases such as **Postgres** and **MSSQL**. Adept in utilizing **Git** for version control, enhancing collaboration, and maintaining code quality. Demonstrated leadership skills with a focus on effective communication, driving team success and delivering high-performance software solutions in complex environments.\nProficient in developing scalable backend systems and implementing secure, maintainable applications that meet industry standards. Experienced in building cloud-native applications and managing the full development lifecycle, ensuring seamless integration and efficient deployment strategies. Committed to leveraging technical expertise to contribute to innovative solutions that have a tangible impact.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2012",
      "to_year": "2015",
      "location": "UK",
      "university": "University of Bristol"
    }
  ],
  "experience": [
    {
      "role": "Senior Backend Engineer",
      "company": "EitBiz",
      "from_date": "Oct 2022",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "•\tDeveloped and maintained backend solutions using **Python** with frameworks such as **Django** and **Flask**, ensuring code quality and performance across applications in the healthcare sector.\n•\tImplemented and optimized database architectures with **Postgres** and **MSSQL**, enhancing data retrieval times by up to **30%** through effective indexing and query optimization.\n•\tLed team initiatives promoting best practices in version control using **Git**, facilitating team collaboration and smoother deployment processes.\n•\tCommunicated effectively with cross-functional teams to translate business requirements into technical requirements, ensuring clarity and alignment throughout the project lifecycle.\n•\tMentored junior developers, enhancing team capabilities and fostering a culture of continuous improvement and knowledge sharing.\n•\tDesigned robust APIs integrating with various third-party services, improving system interoperability while maintaining a focus on security and data integrity.\n•\tConducted code reviews and provided constructive feedback, promoting high code quality standards and adherence to industry best practices within the team.\n•\tImplemented agile methodologies, promoting effective sprint planning and retrospectives, resulting in a **25%** increase in team productivity over **6 months**.\n•\tAutomated deployment pipelines using tools like **Docker** and CI/CD processes, reducing deployment times by **40%** and minimizing downtime for critical services."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Tvn S.A.",
      "from_date": "Oct 2019",
      "to_date": "Sep 2022",
      "location": "Poland",
      "responsibilities": "Developed and maintained backend services using **Python**, **Django**, and **Flask** to enhance application performance and reliability, achieving a **25% reduction** in response times for API calls.\nLed cross-functional teams to implement solutions using **Git** for version control, ensuring smooth deployment processes and teamwork efficiency in software development and maintenance.\nEngaged in architectural decisions that facilitated a microservices-based architecture, improving our system’s scalability and maintainability to handle over **1 million transactions** daily.\nCommunicated effectively with stakeholders to gather requirements and translate them into technical specifications that align with business goals, reducing project turnaround time by **30%**.\nImplemented robust database solutions using **Postgres** and **MSSQL**, optimizing queries that resulted in a **40% increase** in data retrieval speeds for complex queries.\nManaged multiple projects simultaneously, leveraging leadership skills to mentor junior developers and ensure adherence to coding standards and best practices, leading to increased team productivity by **20%**.\nConducted regular code reviews and maintained documentation, fostering clear communication and knowledge sharing within the development team, which was crucial during the transition to Agile methodology.\nEstablished best practices for CI/CD pipelines and automated testing, contributing to a **50% improvement** in the deployment frequency and reducing production downtime."
    },
    {
      "role": "Software Engineer",
      "company": "Timspark",
      "from_date": "Sep 2015",
      "to_date": "Aug 2019",
      "location": "UK",
      "responsibilities": "• Developed and optimized backend services for a robust e-commerce platform utilizing **Python** and **Django** to ensure high availability and scalability, achieving a system uptime of **99.9%**.\n• Leveraged **PostgreSQL** as the primary database solution, ensuring efficient data storage and retrieval with optimized queries that reduced response time by **30%**.\n• Collaborated with cross-functional teams to enhance communication and streamline project workflows, leading to an increase in delivery efficiency by **25%** through agile methodologies.\n• Integrated version control using **Git**, promoting best practices in code management and facilitating seamless collaboration among team members.\n• Implemented RESTful APIs utilizing **Flask** for smooth data exchange between the frontend and backend services, ensuring low latency and high performance.\n• Applied advanced database strategies including normalization and indexing within **Postgres** to enhance query performance and reduce execution time by **20%**.\n• Demonstrated effective leadership and mentorship to junior engineers, fostering a productive team environment that encouraged learning and professional growth.\n• Established clear communication protocols within the team, resulting in improved morale and collaboration during the development cycle.\n• Contributed to system architecture discussions, advocating best practices and innovative solutions to improve deployment processes and system reliability."
    }
  ],
  "skills": "**Programming Languages:**\n\tPython, .NET C#\n\n**Backend Frameworks:**\n\tDjango, Flask\n\n**Frontend Frameworks:**\n\tJavaScript/TypeScript (React, Vue, Angular)\n\n**API Technologies:**\n\t\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis, MSSQL\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS, Azure\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, Leadership, Communication"
}