{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Software Developer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-187801395/",
  "profile_summary": "Software Developer with 13+ years of experience specializing in delivering high-performance applications across various industries. Proficient in **Java** and **Kotlin**, with extensive expertise in **Spring Boot** and **PostgreSQL**. Skilled in **Python** and familiar with **Golang**, utilizing innovative AI-assisted development tools for optimized project outcomes. Experienced in frontend technologies like **Vue 3** and backend development within robust frameworks.\nDemonstrated ability to implement structured solutions that enhance collaboration and communication within teams. Known for a strong initiative and self-driven approach, underpinned by curiosity and adaptability to new challenges. Proven track record in building AI/ML-powered platforms, deploying cloud-native systems on **AWS** and **Azure**, and adhering to compliance frameworks. Familiar with MLOps using **MLflow**, **Airflow**, and **Kubeflow**.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Software Developer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Utilized **Kotlin** and **Java** for developing scalable backend services in a **Spring Boot** environment, enhancing system efficiency and reliability.\nEngineered data storage solutions with **PostgreSQL**, ensuring high availability and optimized query performance for real-time applications.\nDesigned and implemented microservices architecture leveraging **Golang** for performance-driven applications, resulting in a **30%** increase in deployment speed.\nCollaborated with cross-functional teams to integrate **Vue 3** for dynamic user interfaces, enhancing user experience and interaction.\nImplemented AI-assisted development tools to streamline coding processes, increasing productivity by **20%** and reducing error rates.\nDeveloped eCommerce solutions using **Shopify**, **Magento**, and **WooCommerce**, ensuring seamless integration with existing ERP and PIM systems for enhanced operational efficiency.\nPromoted open communication and collaboration among team members, fostering a culture driven by curiosity and initiative.\nDefined project structures and best practices, ensuring a structured approach to software development that enhanced team self-organization.\nDrove requirements gathering and translation into actionable development tasks, ensuring alignment with business objectives and technical feasibility.\nDemonstrated continuous self-driven learning by exploring new technologies and frameworks, adapting quickly to changing project needs."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Developed and maintained scalable backend services using **Kotlin** and **Spring Boot** to enhance performance in financial applications.\nImplemented efficient database solutions with **PostgreSQL** for robust data management supporting high-volume transactions.\nContributed to the integration and management of e-commerce platforms using **Shopify**, **Magento**, and **WooCommerce** to streamline financial operations.\nUtilized **Python** for data-driven applications, implementing AI-assisted development tools for improved coding efficiency and accuracy.\nCollaborated effectively with cross-functional teams, demonstrating strong **communication** and **collaboration** skills to meet project deadlines and objectives.\nEmphasized **curiosity** and **initiative** in exploring new technologies and methodologies to improve system architecture and processes.\nApplied **self-driven** strategies to ensure project success, taking ownership of critical components in the development lifecycle.\nEstablished a structured approach to software development, enhancing team productivity and maintaining high code quality standards.\nLeveraged agile methodologies to drive project timelines and deliver solutions, meeting **99%** of sprint commitments over a **12-month** period."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Developed and optimized backend services using **Kotlin** and **Spring Boot**, ensuring high availability and scalability across key modules, leading to a reduction in request latency by **30%**.\nEngineered robust integration with **PostgreSQL** for efficient data storage and retrieval in complex e-commerce workflows, handling up to **1 million** transactions daily.\nImplemented frontend solutions using **Vue 3**, enabling fast and responsive user experiences, resulting in a **25%** increase in user engagement on web platforms.\nCollaborated with cross-functional teams to support integration with platforms such as **Shopify**, **Magento**, and **WooCommerce**, enhancing ecosystem compatibility and feature deployment speed by **15%**.\nLeveraged AI-assisted development tools to streamline coding processes, fostering a culture of curiosity and initiative in project execution, improving development speed by approximately **20%**.\nApplied Agile methodologies for iterative development, enhancing team communication and collaboration, which contributed to a **40%** reduction in time-to-market for new features.\nImplemented secure transactions using tools like **Stripe** and **PayPal**, ensuring compliance with PCI standards to protect sensitive data effectively.\nAdopted best practices for coding structure and organization, driving self-driven project management and consistency across development tasks.\nDesigned responsive UIs cultivated by SEO techniques using HTML5/CSS3, maintaining accessibility compliance (WCAG 2.1) and ensuring optimal engagement across devices."
    }
  ],
  "skills": "Programming Languages:\n\tKotlin, Java, Python, Golang\n\n**Backend Frameworks:**\n\tSpring Boot, FastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tVue 3, React, Vue, Angular\n\n**API Technologies:**\n\tOAuth2, JWT\n\n**Serverless and Cloud Functions:**\n\tAWS: Lambda, Azure: App Services\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS: ECS, RDS, S3, Azure: Blob Storage, SQL Database\n\n**Other:**\n\tArtificial Intelligence & Machine Learning: MLflow, Airflow, Kubeflow, AI-assisted development tools, collaboration, communication, curiosity, initiative, structure, self-driven, Nginx, Let’s Encrypt, Certbot, Shopify, Magento, WooCommerce, ERP systems, PIM systems"
}