{
  "name": "Sebastian Lukasz Nowak",
  "role_name": "Senior Engineer",
  "email": "sebastiannowak425@outlook.com",
  "phone": "+48 732 489 778",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/sebastian-nowak-756157396/",
  "profile_summary": "As a Senior Engineer with 8 years of experience, I possess a strong foundation in **programming**, **data structures**, and **algorithms**, essential for building high-performance solutions within the healthcare and financial sectors. My technical expertise includes proficiency in **Java**, **AWS**, and **Kubernetes**, alongside a deep understanding of **distributed systems** and **microservices** architecture. \nI have successfully developed enterprise-grade platforms that leverage **big data** technologies and integrate **AI/ML** capabilities for predictive analytics and real-time data processing. With hands-on experience in designing **event-driven systems** and implementing **CI/CD automation**, I ensure the creation of robust, secure applications that adhere to compliance standards such as HIPAA, FHIR, PCI DSS, and SOC 2.\nAdditionally, I am skilled in developing machine learning pipelines, serving ML models in production, and executing MLOps workflows using tools like **MLflow**, **Airflow**, and **Kubeflow**. My passion for continuous learning drives me to stay abreast of the latest technologies and techniques, enabling me to deliver innovative solutions.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "",
      "from_year": "2001",
      "to_year": "2006",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Engineer",
      "company": "DeepInspire",
      "from_date": "Oct 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Utilized advanced **programming** skills in **TypeScript**, **Python (FastAPI)**, and **Node.js** to architect and develop scalable, full-stack healthcare and financial platforms, ensuring compliance with regulations such as HIPAA and GDPR.\nLeveraged **microservices** architecture by re-architecting monolithic applications, implementing **Docker**, **Kubernetes (AKS/EKS)**, and serverless technologies like **AWS Lambda** to enhance system scalability and fault tolerance.\nDesigned and maintained robust data structures using **PostgreSQL**, **MongoDB**, and **Redis** while ensuring efficient data ingestion and querying in high-volume healthcare and financial data environments, achieving **significant throughput and performance metrics**.\nDeveloped complex **AI**-based features and machine learning models for applications, utilizing libraries such as **scikit-learn**, **PyTorch**, and **TensorFlow**, with real-time inference services integrated into the backend for **patient risk prediction** and **financial fraud detection**.\nImplemented full-cycle MLOps pipelines using **MLflow** and **Apache Airflow**, enabling continuous model training and deployment across varied environments, achieving automated and efficient workflows.\nEnsured effective **communication** with cross-functional teams to integrate **big data** processing capabilities using technologies like **Apache Flink**, enabling real-time analytics for healthcare decisions and financial insights.\nEstablished enterprise-level DevOps practices by utilizing tools such as **GitHub Actions**, **Azure DevOps**, and **CircleCI**, streamlining deployment processes and enhancing security through integrated testing and code quality checks.\nImplemented mobile application development using **Flutter** and **React Native**, focusing on integrating native modules and state management, delivering a seamless user experience across **iOS** and **Android** platforms.\nDelivered data visualization tools with **D3.js**, **Chart.js**, and **Power BI Embedded**, allowing users to derive insights from transaction trends and operational KPIs with real-time data updates.\nDeveloped advanced search functionality by integrating **Azure Cognitive Search** and **ElasticSearch**, facilitating efficient access to a wealth of structured and unstructured data across healthcare records and financial documents.\nContributed to software performance through rigorous implementation of **data structures** and **algorithms**, optimizing complex tasks and ensuring high-quality code throughout development cycles."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Britenet",
      "from_date": "Sep 2015",
      "to_date": "Sep 2021",
      "location": "Poland",
      "responsibilities": "Utilized expertise in **programming** and **data structures** to lead the development and modernization of financial platforms, incorporating a microservices-based architecture leveraging **Node.js (NestJS/Express)** and **Python (FastAPI, Django)**, resulting in a **25%** boost in scalability and throughput for high-volume transaction systems.\nEmployed **algorithms** and dynamic UI development skills to create user-focused front-end applications using **React (18)**, **Vue 3**, **Next.js**, and **TypeScript**, while applying **Redux Toolkit** and **Tailwind CSS** for responsive designs on financial dashboards and admin portals with an average load time improvement of **30%**.\nImplemented real-time transaction monitoring and analytics dashboards using **React**, **D3.js**, and **Power BI Embedded**, which improved operational efficiency by enabling teams to track financial activity, detect anomalies, and generate insights, contributing to a **15%** reduction in false positives.\nDesigned and integrated robust event-driven architecture with **Kafka**, **RabbitMQ**, and **Azure Service Bus**, facilitating asynchronous communication and real-time processing of over **1 million** transactions per day across alerts and compliance workflows.\nDeveloped scalable ETL pipelines using **Python**, **Apache Airflow**, and **Azure Data Factory** for batch and real-time data ingestion of financial data from internal and third-party sources, enhancing data availability and processing speed by **40%**.\nLeveraged **AI/ML** techniques to implement advanced fraud detection systems utilizing **scikit-learn**, **XGBoost**, and **Azure Machine Learning**, analyzing patterns and proactively flagging suspicious banking activities with an accuracy rate of **92%**.\nCreated ML pipelines for credit scoring, churn prediction, and transaction classification combining **MLflow** and **Airflow**, allowing real-time decision-making and model inference directly integrated into back-end services, reducing processing times by **50%**."
    },
    {
      "role": "Software Engineer",
      "company": "Binary Studio",
      "from_date": "Jan 2007",
      "to_date": "Aug 2015",
      "location": "UK",
      "responsibilities": "Developed and optimized microservices architectures for a high-traffic e-commerce platform, utilizing **Java** and **Kubernetes** to ensure scalability, resilience, and efficient resource management.\nEngineered distributed systems for real-time data processing, incorporating **Apache Flink** and leveraging **AWS** cloud services to enhance application performance and reliability.\nImplemented advanced algorithms and data structures to improve backend processes, achieving a **30%** reduction in latency for critical transactions and transactions per second (TPS) metrics.\nDesigned and integrated machine learning models to enhance user experience through personalized recommendations, employing big data technologies to analyze and process vast datasets efficiently.\nUtilized comprehensive communication protocols and secure APIs to ensure robust interaction between services, maintaining high standards of data integrity and compliance with regulations like GDPR.\nConducted rigorous performance testing and code reviews, ensuring adherence to industry best practices in software development and deployment lifecycle.\nFacilitated cross-functional team collaboration, mentoring junior engineers in programming principles and effective use of distributed systems techniques, fostering a culture of knowledge sharing and continuous improvement.\nManaged cloud deployment processes, ensuring seamless integration of new features into production environments and reducing downtime during major updates by **40%**."
    }
  ],
  "skills": "**Programming Languages**\n\tJava, Python, JavaScript, TypeScript\n\n**Backend Frameworks**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks**\n\tReact, Vue, Angular\n\n**API Technologies**\n\t\n\n**Serverless and Cloud Functions**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Databases**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**DevOps**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure**\n\tAWS, Azure\n\n**Other**\n\tMachine Learning (ML), Artificial Intelligence (AI), Data Structures, Algorithms, Distributed Systems, Microservices, Communication, Compilers, Operating Systems, Big Data, Apache Flink",
  "apply_company": "Toughbyte"
}