{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Sales Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Senior Sales Engineer with a robust background in **Technical Solution Design** and a customer-oriented approach, leveraging 13+ years of experience to deliver high-performance applications in the healthcare and financial sectors. Proven ability to engage with stakeholders and understand their needs by employing **Active Listening** and effective **Presentation Skills**. Demonstrated initiative in crafting tailored solutions for clients, with a focus on compliance and efficiency. Strong German and English language proficiency enhances communication with diverse clientele. Original strengths include expertise in **JavaScript/TypeScript**, **Python**, and **Flutter**, alongside hands-on experience in both frontend and backend technologies such as **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**. Adept at leveraging **AWS** and **Azure** for deploying **cloud-native systems** and implementing microservices, showcasing a keen understanding of technological trends and customer needs.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Sales Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Developed and delivered innovative technical solutions designed to enhance customer relationship management, emphasizing stakeholder management and customer orientation.\nUtilized **TechnicalSolutionDesign** principles to create effective relationships between lighting systems and client needs, ensuring energy-efficiency and sustainability.\nLed stakeholder engagement presentations that showcased solutions in a clear and compelling manner, enhancing user comprehension and satisfaction.\nImplemented proactive customer orientation strategies to nurture relationships, ensuring clients felt valued and understood.\nExercised initiative to identify opportunities for process improvements and technical enhancements, resulting in increased client satisfaction by **25%**.\nUtilized **ElectricalEngineering** skills to provide technical expertise in the integration of lighting systems, applying rigorous testing methodologies to ensure quality and reliability.\nSuccessfully managed bids and proposals for projects, achieving a **30%** win rate in competitive tenders through detailed market analysis and strategic positioning.\nDemonstrated exceptional **ActiveListening** skills during client meetings, resulting in tailored solutions that responded directly to customer needs.\nArticulated complex technical concepts in both **German** and **English**, facilitating communication with a diverse clientele and supporting international project collaborations.\nMaintained a strong emphasis on **PresentationSkills**, delivering workshops and product demonstrations that emphasized product benefits and technical advantages, further driving engagement and interest."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Utilized strong **Customer Relationship Management** skills to engage stakeholders and identify their needs, ensuring tailored solutions that enhance customer satisfaction and drive sales.\nDesigned and implemented **Technical Solutions** that align with customer requirements, showcasing expertise in **Electrical Engineering** to advise on complex systems effectively.\nExecuted persuasive **Presentation Skills** to convey technical concepts and project proposals, leading to successful client engagements and an increase in bid acceptance rates by **25%**.\nDemonstrated **Active Listening** to understand customer feedback and requirements, adapting solutions for greater alignment with expectations, resulting in a **30%** improvement in customer retention.\nTook the **Initiative** in developing innovative sales strategies, leveraging insights from industry trends to enhance service offerings and the bidding process.\nWorked with stakeholders to create actionable plans, employing **Customer Orientation** to prioritize customer needs and ensure a seamless experience during technical consultations.\nConducted negotiations in both **German** and **English**, facilitating better communication and rapport with diverse client bases, which expanded the market reach by **15%**.\nEngaged in **Stakeholder Management** by maintaining ongoing relationships with key clients, providing technical support, and contributing to long-term satisfaction and loyalty."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Designed and optimized technical solutions for effective **Customer Relationship Management** (CRM) in a global e-commerce platform, ensuring high availability and performance across modules.\nManaged stakeholder relationships through exemplary **presentation skills**, facilitating successful engagement and understanding of customer needs.\nLeveraged **Active Listening** to gain insights into customer requirements, driving initiatives to improve overall user satisfaction and platform usability.\nApplied **Customer Orientation** in the design of backend services using **Python** (FastAPI, Django) and **Node.js** (NestJS, Express), achieving a 99.9% uptime for key services like checkout and order fulfillment.\nEngineered real-time features with **Kafka** and **RabbitMQ**, enabling order updates with **<1 second** latency, improving customer experience dramatically.\nUtilized **React** (18), **Vue 3**, and **Angular** for frontend applications, achieving load times reduced by **30%** through optimized applications with **TypeScript** and **Redux Toolkit**.\nImplemented solutions for **Electrical Engineering** needs, ensuring comprehensive performance, reliability, and security in payment workflows integrated with **Stripe**, **PayPal**, and **Razorpay**.\nDrove initiatives for **Stakeholder Management**, offering strategy to integrate AI/ML-based recommendation engines using **scikit-learn** and **TensorFlow**, resulting in a **15%** increase in conversion rates.\nCreated responsive UIs optimized for mobile-first engagement and compliance with **WCAG 2.1**, enhancing accessibility for diverse user groups and achieving a **>90%** satisfaction score in user testing.\nForged secure access protocols using **RBAC** and **OAuth 2.0**, ensuring compliance with GDPR and safeguarding sensitive customer data throughout the platform."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython: FastAPI, Flask, Django\n\tJavaScript/TypeScript: React, Vue, Angular\n\n**Backend Frameworks:**\n\tFastAPI\n\tFlask\n\tDjango\n\n**Frontend Frameworks:**\n\tReact\n\tVue\n\tAngular\n\n**API Technologies:**\n\tKeycloak (OIDC, RBAC), OAuth2, JWT\n\n**Serverless and Cloud Functions:**\n\tAWS: ECS, Lambda, RDS, S3\n\tAzure: App Services, Blob Storage, SQL Database\n\n**Databases:**\n\tPostgreSQL (Fintech)\n\tMySQL (Healthcare)\n\tMongoDB (Gaming)\n\tRedis\n\n**DevOps:**\n\tDocker\n\tKubernetes\n\tGitHub Actions, GitLab CI/CD\n\n**Cloud & Infrastructure:**\n\tTerraform\n\tAnsible\n\tHelm\n\tDocker Compose\n\n**Other:**\n\tCustomerRelationshipManagement\n\tTechnicalSolutionDesign\n\tLightingSystems\n\tBidding\n\tStakeholderManagement\n\tPresentationSkills\n\tElectricalEngineering\n\tActiveListening\n\tCustomerOrientation\n\tInitiative\n\tGermanLanguage\n\tEnglishLanguage",
  "apply_company": "Eaton"
}