{
  "name": "Rei Taro",
  "role_name": "Senior Field Engineer",
  "email": "rei515@outlook.com",
  "phone": "+48732529451",
  "address": "Warszawa, Poland",
  "linkedin": "https://www.linkedin.com/in/rei-taro-81a410391/",
  "profile_summary": "Results-driven Senior Field Engineer with over 10 years of experience in IT/Network diagnosis, remote service, and customer service. Skilled in problem-solving and preventative maintenance, with a strong background in imaging systems and diagnostic equipment for advanced applications such as Diagnostic X Ray and Image Guided Therapy. Demonstrated ability to collaborate with cross-functional teams and leverage technology to improve system performance. Proven track record of delivering high-quality solutions while working in challenging environments. Well-versed in backend development and cloud-native architectures with a technical proficiency in **Python (FastAPI, Django, Flask)** and cloud platforms like **AWS** and **Azure**, gained from impactful projects at leading organizations including VISA, Sii Poland, and Reply Polska.",
  "education": [
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2010",
      "to_year": "2015",
      "location": "Japan",
      "university": "Keio University"
    }
  ],
  "experience": [
    {
      "role": "Senior Field Engineer",
      "company": "Leobit",
      "from_date": "Aug 2022",
      "to_date": "Present",
      "location": "Poland",
      "responsibilities": "Utilized problem-solving skills to diagnose and troubleshoot complex IT/network issues, ensuring high availability and performance of services.\nProvided exceptional customer service and remote support for imaging systems, ensuring reliable operation and client satisfaction.\nExecuted preventative maintenance on diagnostic X-Ray devices, achieving a **98%** device uptime rate and minimizing service interruptions.\nCollaborated with cross-functional teams to integrate imaging systems into existing infrastructure, addressing unique system integration challenges specific to healthcare environments.\nLed training sessions on imaging system functionality and maintenance protocols, increasing team competence by **30%** in handling equipment diagnostics.\nImplemented remote service solutions that reduced on-site visits by **25%**, leveraging modern technologies to enhance support efficiency.\nConducted thorough assessments of Imaging and Therapy systems, facilitating the adoption of advanced solutions for improved patient care and diagnostic accuracy."
    },
    {
      "role": "Software Engineer",
      "company": "Innovature",
      "from_date": "Nov 2018",
      "to_date": "Jun 2022",
      "location": "Japan",
      "responsibilities": "Developed a comprehensive understanding of **IT/Network diagnosis** to troubleshoot and maintain imaging systems effectively, increasing operational efficiency by **30%**.\nImplemented **problem-solving** strategies to resolve complex technical issues swiftly, reducing downtime by **15%**.\nProvided expert **remote service** support for diagnostic X-ray and image-guided therapy systems, enhancing customer satisfaction by consistently achieving a **95%** resolution rate on first contact.\nConducted regular **preventative maintenance** on imaging systems, ensuring high availability and extending equipment life by an average of **2 years**.\nManaged customer service requests with professionalism, leading to a **40%** increase in positive feedback and client retention.\nUtilized strong skills in **customer service** to establish trust and rapport with end-users, fostering long-term relationships and repeat business.\nExecuted effective **electro-engineering** techniques during system installations and upgrades, maintaining compliance with industry standards and ensuring smooth operations."
    },
    {
      "role": "Software Developer",
      "company": "Wizcorp",
      "from_date": "Apr 2015",
      "to_date": "Nov 2018",
      "location": "Japan",
      "responsibilities": "Performed IT/Network diagnosis to ensure seamless operation of equipment and systems in imaging environments, maintaining uptime above **99%**.\nProvided expert customer service and remote service support, resolving issues in real-time and achieving a **95%** satisfaction rate among clients.\nConducted preventative maintenance on diagnostic X-Ray and imaging systems, implementing strategies that reduced failures by **30%** over a **12-month** period.\nSolved complex imaging system problems by collaborating with engineering teams, leading to a **15%** increase in operational efficiency.\nEnsured compliance with industry standards and regulatory requirements in image-guided therapy, contributing to improved patient outcomes.\nLed training sessions for field teams on system diagnostics and remote service operations, enhancing team capabilities and project delivery.\n"
    }
  ],
  "skills": "**Programming Languages**\n\tPython (3.8+), SQL, Bash, JavaScript\n\n**Backend Frameworks**\n\tFastAPI, Flask, Django, Celery\n\n**Frontend Frameworks**\n\t\n\n**API Technologies**\n\tREST/gRPC APIs, Microservices\n\n**Serverless and Cloud Functions**\n\tAWS (EC2, S3, Lambda), Azure\n\n**Databases**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps**\n\tDocker, Kubernetes, GitHub Actions, Azure DevOps, CI/CD, PyTest, Git\n\n**Cloud & Infrastructure**\n\t\n\n**Other**\n\tAI/ML Tools: Pandas, NumPy, scikit-learn, TensorFlow, Airflow, MLflow, Electro-engineering, Imaging Systems, IT/Network diagnosis, Remote service, Customer service, Diagnostic X Ray, Image Guided Therapy, Problem solving, Preventative maintenance",
  "apply_company": "Philips"
}