{
  "name": "Tomasz Lee",
  "role_name": "Product Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Results-driven Product Engineer with 9+ years of experience in building and delivering robust applications. Proficient in **Python**, **Django**, and cloud services such as **AWS**, complemented by strong skills in frontend frameworks like **Vue.js**. Expertise in **Agile methodology** and **modular design**, ensuring streamlined development processes and a user-centric approach to UX/UI design. Strong problem-solving abilities and experience in collaborative team environments, leading projects to successful outcomes. Proven track record in optimizing application performance and maintaining code quality through rigorous code reviews.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Product Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Utilized **Python** and **Django** to develop and maintain scalable web applications, ensuring a modular design approach to enhance code reusability and collaboration among team members.\nImplemented **AWS** services for cloud hosting and storage solutions, optimizing deployment strategies and leveraging best practices in cloud architecture.\nLed the transitions to **Vue.js** for creating responsive user interfaces, improving design consistency and user engagement by **30%**.\nConducted code reviews and facilitated collaboration sessions within an Agile methodology, boosting team productivity and project delivery speed by **25%**.\nIntegrated AI tools to automate processes and enhance functionality, resulting in a **15%** reduction in manual tasks.\nEngaged closely with UX/UI design principles to refine user experiences, driving user satisfaction metrics higher through iterative feedback and testing.\nEmploy a strong problem-solving mindset to address technical challenges promptly, ensuring project timelines are met.\nChampion modular design strategies to simplify both front-end and back-end components across projects, promoting seamless development workflows.\nFostered a collaborative team environment that emphasized outcome-focused objectives, enhancing overall project success rates."
    },
    {
      "role": "Full Stack Developer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "• Developed and maintained cloud-based applications using **AWS** services and **Python** with **Django**, resulting in a 20% reduction in infrastructure costs.\n• Applied **Agile methodology** to enhance team collaboration, ensuring consistent project delivery within **2-week sprints**.\n• Implemented modular design principles to improve code reusability and maintainability, leading to a **30%** reduction in development time.\n• Conducted thorough code reviews to uphold coding standards and enhance team productivity by mentoring junior developers.\n• Collaborated with UX/UI designers to create intuitive interfaces via **Vue.js**, resulting in a **15%** increase in user satisfaction scores.\n• Utilized advanced **AI tools** for implementing predictive analytics features, improving decision-making processes by **25%**.\n• Managed project timelines and stakeholder communications effectively, securing project delivery within budget and on schedule.\n• Designed interactive prototypes that improved user engagement through clear visual representations and user-centered designs.\n• Solved complex technical problems quickly, demonstrating strong problem-solving skills and maintaining project focus on desired outcomes."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "Developed and implemented solutions using **Python** and **Django** to create efficient internal tools that enhance productivity by **15%**.\nUtilized **AWS** cloud services to deploy applications, ensuring scalability and reliability, contributing to a **30%** reduction in downtime.\nDesigned user-centric features with a strong focus on **UX/UI design**, improving user satisfaction ratings by **25%**.\nCollaborated with cross-functional teams in an **Agile methodology** environment, leading to faster project iterations and successful delivery within deadlines.\nApplied a **modular design** approach to streamline code management, reducing technical debt by **40%**.\nConducted comprehensive **code reviews** to ensure high-quality standards and mentor junior developers on best practices, increasing code efficiency.\nLeveraged **Vue.js** for enhanced frontend performance, integrating AI tools for smarter data visualization.\nEngaged in team collaboration to brainstorm and troubleshoot issues, fostering an outcome-focused mindset that drives project success.\nParticipated in daily standups to maintain clear communication and alignment with project goals, boosting overall team morale and productivity."
    }
  ],
  "skills": " **Programming Languages**\n\tPython\n\n **Backend Frameworks**\n\tDjango\n\n **Frontend Frameworks**\n\tVue.js, ReactJS, NextJS, Angular, Flutter, NuxtJS, Material UI, Three.js, D3.js, Chakra UI, TailwindCSS\n\n **API Technologies**\n\tRESTful API, GraphQL\n\n **Serverless and Cloud Functions**\n\tAWS\n\n **Databases**\n\tMSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB\n\n **DevOps**\n\tAzure, CI/CD pipelines\n\n **Cloud & Infrastructure**\n\tAWS\n\n **Other**\n\tUX/UI Design, Git, GitHub, Agile methodology, Code review, Problem-solving, Team collaboration, Outcome-focused mindset, Modular design, Messaging & Caching: Apache Kafka, RabbitMQ, Redis, Testing Tools: NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest, Blockchain: Solidity, Ether.js, Web3.js, Ethereum, Microservices"
}