{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Value Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "As a Senior Value Engineer, I leverage strong analytical skills and strategic thinking to deliver value-driven solutions in the technology sector. My background in full-stack development with expertise in **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, **Django**, **JavaScript**, **TypeScript**, **Python**, and **Flutter** enables me to understand and communicate complex technical concepts effectively. With 8 years of experience, I have a proven track record of engaging in value-based selling and consulting, ensuring that client needs are met through high-performance solutions.\n\nI have successfully managed projects in the healthcare and financial sectors, guiding teams through the intricacies of SaaS applications and business analysis. My extensive experience in cloud services, particularly **Azure** and **AWS**, complements my project management skills and enhances collaboration with stakeholders. I am adept at analyzing requirements and aligning technology strategies with business objectives to increase efficiency and drive growth.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Value Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Conducted **business analysis** to identify client needs and enhance overall value-engineering strategies, driving customer satisfaction and project success for **SaaS** platforms.\n- Utilized strong **analytical skills** to assess and optimize the efficiency of full-stack applications and platforms, quantitatively improving process metrics by **25%**.\n- Managed multiple projects simultaneously, consistently meeting deadlines and delivering results on schedule and within budget, with a track record of overseeing **9** successful software releases per year.\n- Fostered collaboration among cross-functional teams to ensure effective communication and project alignment, enhancing stakeholder relationship management.\n- Applied **strategic thinking** to develop and implement innovative solutions leveraging **Docker, Kubernetes**, and other technologies to transition from monolithic to microservices architectures, improving system scalability.\n- Engaged in **value-based selling** by articulating the benefits of proposed technology solutions to stakeholders, leading to a **15%** increase in client acquisition.\n- Provided consulting services that resulted in improved operational efficiencies, projecting future growth based on data-driven insights and metrics.\n- Delivered detailed documentation and project updates through clear **communication**, keeping all stakeholders informed of progress and risks.\n- Developed training materials and conducted sessions to enhance team **project management** skills, directly contributing to **30%** improvement in team productivity.\n- Enhanced client offerings by integrating analytical and machine learning capabilities into the SaaS products, significantly increasing adoption rates.\n- Leveraged best practices from **Azure DevOps** and testing frameworks to ensure high-quality deliverables, enhancing deployment frequency by **40%** through automation and CI/CD practices.\n- Collaborated on enterprise initiatives that incorporate advanced **AI-based features**, working alongside data scientists to support both healthcare and financial sectors."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Utilized **business-analysis** and **strategic-thinking** skills to lead the development and modernization of financial platforms, adopting a microservices-based architecture using **Node.js** (**NestJS/Express**) and **Python** (**FastAPI, Django**), resulting in a **30% boost** in scalability and throughput for high-volume transaction systems.\nLeveraged **analytical-skills** to build dynamic, user-focused front-end applications using **React (18)**, **Vue 3**, **Next.js**, and **TypeScript**, applying **Redux Toolkit** and **Tailwind CSS** to create responsive and performant user interfaces for financial dashboards and admin portals, enhancing user engagement by **25%**.\nEmployed **project-management** and **consulting** techniques to develop real-time transaction monitoring and analytics dashboards with **React**, **D3.js**, and **Power BI Embedded**, facilitating operations teams in tracking financial activity and generating actionable insights, contributing to a **40% reduction** in anomaly detection time.\nImplemented advanced event-driven architecture by integrating **Kafka**, **RabbitMQ**, and **Azure Service Bus** to enable asynchronous communication and real-time event processing for transactions, alerts, and compliance workflows, improving system response times by **15%**.\nDesigned and orchestrated ETL pipelines utilizing **Python**, **Apache Airflow**, and **Azure Data Factory**, allowing for the batch and real-time ingestion of financial data from various sources, which improved data accessibility and processing efficiency by **20%**.\nApplied **SaaS** solutions by implementing AI/ML-powered fraud detection systems with **scikit-learn**, **XGBoost**, and **Azure Machine Learning**, analyzing transaction patterns and user behavior to proactively flag suspicious activities, achieving a **50% increase** in detection accuracy.\nEstablished ML pipelines for credit scoring, churn prediction, and transaction classification using **MLflow** and **Airflow**, ensuring integration of model inference directly into backend services for real-time decision-making, thus driving operational efficiency."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Utilized **analytical-skills** to design and optimize backend services for a global e-commerce platform, ensuring high availability, low latency, and scalability across key modules like checkout, cart, and order fulfillment, leveraging **Python (FastAPI, Django)** and **Node.js (NestJS, Express)**.\nExecuted **business-analysis** and **value-engineering** methodologies to engineer real-time features using **WebSockets** and event-driven architecture powered by **Kafka** and **RabbitMQ**, enabling responsive order updates and dynamic inventory tracking.\nDirected **project-management** to develop frontend applications using **React (18)**, **Vue 3**, and **Angular**, enhanced with **TypeScript**, **Redux Toolkit**, and **Tailwind CSS**, delivering fast, responsive user experiences on web and mobile platforms, achieving a 30% increase in user engagement.\nLeveraged **MongoDB**, **PostgreSQL**, **Redis**, and **Cassandra** for distributed data storage management, ensuring fast, fault-tolerant data access for high-traffic e-commerce workflows, handling up to **1M** concurrent users.\nIntegrated AI/ML-based recommendation engines using **scikit-learn**, **LightGBM**, and **TensorFlow** to personalize product listings, optimize search relevance, and improve conversion rates by **25%** based on real-time behavioral data.\nImplemented **Redis** caching for product metadata, shopping cart sessions, and search results, leading to a **50%** reduction in read pressure on databases and significant application responsiveness improvement.\nApplied **strategic-thinking** through the implementation of feature flags and blue-green deployments using **LaunchDarkly** and **Kubernetes**, facilitating controlled rollouts, A/B testing, and risk mitigation during major platform updates.\nCreated responsive, SEO-friendly e-commerce user interfaces with **Next.js**, **Vue 3 + Nuxt**, and **HTML5/CSS3**, optimized for mobile-first engagement demonstrating compliance with accessibility standards (WCAG **2.1**).\nBuilt secure payment workflows integrated with **Stripe**, **PayPal**, and **Razorpay**, applying tokenized transactions and adhering to PCI compliance for handling sensitive data securely.\nExecuted effective **communication** and **collaboration** strategies by applying role-based access control (RBAC) and **OAuth 2.0** for secure customer and admin access, ensuring GDPR compliance and user data protection throughout the platform."
    }
  ],
  "skills": "**Programming Languages:**\n\tPython, JavaScript, TypeScript\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, CI/CD & Infrastructure as Code (Terraform, Ansible, Helm, Docker Compose)\n\n**Cloud & Infrastructure:**\n\n**Other:**\n\tvalue-engineering, business-analysis, SaaS, value-based-selling, consulting, analytical-skills, strategic-thinking, project-management, communication, collaboration",
  "apply_company": "dbt Labs"
}