{
  "name": "Patryk Zaslawski",
  "role_name": "Manual QA Engineer (Mobile)",
  "email": "patrykzas0428@outlook.com",
  "phone": "+48669862402",
  "address": "Gdanski, Poland",
  "linkedin": "https://www.linkedin.com/in/patryk-zaslawski-6b04a8397/",
  "profile_summary": "Results-driven Manual QA Engineer (Mobile) with 8+ years of experience, specializing in mobile testing and API testing to ensure high-quality software delivery. Proficient in using tools such as **Postman**, **Swagger**, and proxy debugging tools including **Proxyman**, **Charles**, and **Fiddler** for comprehensive testing processes. Skilled in database management with experience in **MongoDB Compass** to enhance data handling capabilities. Adept in maintaining test documentation and performing functional testing and A/B testing to validate software performance. Strong collaborator with excellent communication skills, coupled with critical and analytical thinking abilities. Proven adaptability in fast-paced environments and effective time management to deliver projects on schedule.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2014",
      "to_year": "2017",
      "location": "United Kingdom",
      "university": "The University of Manchester"
    }
  ],
  "experience": [
    {
      "role": "Manual QA Engineer (Mobile)",
      "company": "Binary Studio",
      "from_date": "Aug 2023",
      "to_date": "Present",
      "location": "United Kingdom (Remote)",
      "responsibilities": "Conducted thorough **API testing** on mobile platforms, utilizing tools such as **Postman** and **Swagger** to ensure functional accuracy and overall performance.\nCollaborated with cross-functional teams to document test strategies and results in **Jira** and **Confluence**, promoting transparency and effective communication.\nExecuted comprehensive **functional testing** for mobile applications, focusing on user stories and acceptance criteria, ensuring seamless user experiences.\nDeveloped and maintained detailed **test documentation** to facilitate consistency and adherence to quality standards across the team.\nLeveraged **proxy debugging tools** like **Charles** and **Fiddler** for in-depth analysis and debugging of API interactions, enhancing the reliability of mobile services.\nUtilized **MongoDB Compass** for database verification, ensuring data integrity and accurate retrieval within mobile applications.\nImplemented **A/B testing** strategies to analyze user interaction data, enhancing mobile application performance and user satisfaction.\nExercised strong **analytical thinking** and **problem-solving** skills to identify, track, and resolve defects efficiently, contributing to improved application quality.\nFacilitated regular **SCRUM** meetings to ensure alignment with project timelines and foster effective collaboration within the QA team.\nDemonstrated **attention to detail** and **adaptability** in a fast-paced environment, meeting project deadlines while maintaining high quality standards.\nManaged time effectively to balance multiple testing projects, ensuring thorough testing coverage and prompt feedback to development teams.\nPromoted a culture of continuous improvement by proactively identifying testing gaps and suggesting enhancements to the testing workflow."
    },
    {
      "role": "Software Engineer",
      "company": "Ardigen",
      "from_date": "Mar 2020",
      "to_date": "Aug 2023",
      "location": "Poland",
      "responsibilities": "Conducted thorough **mobile testing** on banking applications, ensuring adherence to functional specifications and exceptional user experiences.\nUtilized **API testing** methodologies with tools like **Postman** and **Swagger** to validate RESTful and gRPC APIs, ensuring robust communication across the system.\nDeveloped and executed **test documentation** strategies to detail testing processes, enhancing clarity and organization in the QA workflow.\nCollaborated in a **SCRUM** environment, actively participating in sprint planning and retrospectives to improve team dynamics and project outcomes.\nApplied **critical thinking** and **analytical thinking** skills to troubleshoot and resolve complex issues identified during testing phases.\nLeveraged **proxy debugging tools** such as **Proxyman**, **Charles**, and **Fiddler** to intercept and analyze mobile traffic for deeper insights into application performance.\nManaged defect tracking and reporting effectively through **Jira** and **Confluence**, facilitating communication between QA and development teams.\nExecuted **functional testing** with meticulous **attention to detail**, ensuring all aspects of the mobile applications function as intended under various scenarios.\nAdapted testing strategies based on evolving project needs, demonstrating **adaptability** and excellent **time management** skills to meet tight deadlines.\nConducted **A/B testing** to evaluate user experience improvements and drive evidence-based decisions for application enhancements.\nEngaged in continuous improvement processes by providing feedback and insights from **mobile testing**, fostering collaboration among cross-functional teams.\nDocumented test results and authored reports detailing findings, ensuring clear communication of issues and risk assessments to stakeholders."
    },
    {
      "role": "Software Engineer",
      "company": "Altum Software",
      "from_date": "Oct 2017",
      "to_date": "Feb 2020",
      "location": "United Kingdom",
      "responsibilities": "Conducted **mobile testing** to ensure optimal functionality and performance of mobile applications across various devices.\nPerformed **API testing** utilizing tools like **Postman** and **Swagger** to validate RESTful services and confirm seamless integration between mobile and backend systems.\nUtilized **proxy debugging tools** such as **Proxyman**, **Charles**, and **Fiddler** to diagnose issues and enhance mobile application performance through efficient traffic analysis.\nWorked closely with databases including **MongoDB** to ensure data integrity and effective communication between mobile apps and backend databases, optimizing access patterns and query performance.\nCollaborated within **SCRUM** teams, participating in sprint planning and retrospective meetings using tools like **Jira** and **Confluence** for maintaining high standards in test documentation and project visibility.\nExecuted **A/B testing** strategies to assess user experience across different mobile application versions, guiding product decisions based on analytical insights.\nEngaged in **functional testing** to identify bugs and ensure compliance with business requirements, enhancing user satisfaction and app reliability.\nDemonstrated **critical thinking** and **problem-solving skills** to analyze issues and propose efficient solutions during manual testing phases.\nCommunicated effectively with cross-functional teams to foster collaboration and coordinate efforts, ensuring alignment in development and testing processes.\nMaintained a keen **attention to detail** while developing test cases and executing test plans, ensuring thorough coverage of requirements and mitigating risk.\nExhibited **adaptability** in managing priorities and **time management** skills to meet project deadlines and deliver quality results.\nAnalyzed test results meticulously, providing actionable feedback to development teams to guide product improvements and enhance overall application quality across **9 mobile platforms**."
    }
  ],
  "skills": "**API Technologies**:\n\tPostman, Swagger, REST & gRPC APIs\n\n**Databases**:\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), MongoDB Compass, Redis\n\n**Cloud & Infrastructure**:\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Backend Frameworks**:\n\tPython (FastAPI, Django, Flask), SQLAlchemy, Pydantic, Celery, Spring Boot\n\n**Frontend Frameworks**:\n\tAngular (1–16), React (15–18), Next.js, Vue.js (2/3), Blazor\n\n**Cloud Functions**:\n\tDocker, Kubernetes\n\n**Other**:\n\tKeycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, Jira, Confluence, SCRUM, test documentation, A/B testing, functional testing, critical thinking, analytical thinking, collaboration, problem-solving, communication, attention to detail, adaptability, time management, proxy debugging tools, Proxyman, Charles, Fiddler, mobile testing, API testing"
}