{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Digital Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Senior Digital Engineer with 13+ years of experience in Digital Verification and ASIC development. Expert in **SystemVerilog**, **UVM**, and **RTL** design verification methodologies, utilizing **Cadence Xcelium** for simulation and debugging. Proficient in **Python**, **Perl**, and **Bash** for developing robust testbench solutions and enhancing automation in verification processes. Skilled in technical communication and collaboration to ensure compliance with project requirements and standards. \nStrong background in delivering high-performance software applications using a comprehensive tech stack, including **JavaScript/TypeScript**, **Flutter**, **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**. Experience in creating AI/ML-powered platforms for predictive analytics and real-time processing, along with deploying cloud-native systems on **AWS** and **Azure** while implementing microservices architecture and CI/CD pipelines.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Digital Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Developed and executed digital verification strategies for ASIC designs using **SystemVerilog** and **UVM** to ensure compliance with the latest industry standards.\n- Created and maintained detailed testbenches, utilizing **Cadence Xcelium** for simulation, enabling comprehensive validation of RTL designs and improving functional coverage by **30%**.\n- Conducted debugging and fault isolation using advanced **simulation** techniques, achieving a reduction in the average debugging time from **15 hours** to **5 hours** per project.\n- Collaborated effectively with cross-functional teams, enhancing communication regarding project milestones and technical challenges, resulting in a **20%** improvement in project delivery timelines.\n- Leveraged **Python** and **Perl** scripts to automate testing processes, yielding a **40%** increase in testing efficiency and accuracy.\n- Designed and implemented comprehensive validation plans, enhancing the robustness of verification processes for digital systems involving **ASIC** technologies.\n- Provided mentorship in **Bash** scripting and testbench methodologies to junior engineers, fostering a knowledge-sharing environment that improved team performance.\n- Engaged in rigorous simulation and testing activities, ensuring that all digital designs adhered to quality benchmarks, as evidenced by a **25%** decrease in post-silicon issues.\n- Developed communication protocols for reporting test results and verification outcomes, contributing to improved stakeholder engagement and satisfaction."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Utilized **SystemVerilog** and **UVM** to develop and verify digital designs, ensuring high-quality deliverables through robust **Testbench** architectures.\nLeveraged **Cadence Xcelium** for advanced simulation, improving verification efficiency by **30%** and reducing time-to-market for critical ASIC projects.\nConducted debugging and troubleshooting of complex digital designs, enhancing communication between stakeholders to address issues promptly and efficiently.\nImplemented RTL design specifications and methodologies, ensuring compliance with industry standards and improving overall project quality and performance metrics.\nCollaborated with cross-functional teams using clear and concise communication, leading to a **25%** increase in project alignment and stakeholder satisfaction.\nDeveloped automated testing frameworks using **Python** and **Perl**, streamlining verification processes and reducing manual testing time by **40%**.\nExecuted performance analysis and optimization of digital systems, contributing to a significant improvement in operational effectiveness and efficiency across various projects.\nInterfaced with development and engineering teams to better understand system requirements and drive continuous improvement initiatives."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Utilized **SystemVerilog** and **UVM** for designing and verifying ASIC and digital systems, ensuring high-quality verification processes and adherence to industry standards in **RTL** design.\nExecuted simulation and debugging processes using **Cadence Xcelium**, leading to a **30%** reduction in verification time while maintaining rigorous testing protocols.\nDeveloped comprehensive testbenches employing **Python** and **Perl** scripts to automate simulation tasks, optimizing workflows and improving testing efficiency by **25%**.\nApplied effective communication skills to collaborate with cross-functional teams, conveying complex technical concepts clearly to ensure alignment with project objectives.\nImplemented robust debugging techniques resulting in the identification and correction of **50+** critical issues prior to system deployment, enhancing product reliability and performance.\nConducted thorough reviews of verification strategies and methodologies, driving continuous improvement in processes and propelling overall team productivity by **15%**.\nExecuted detailed documentation for verification protocols and methodologies, ensuring best practices are maintained and accessible for team reference."
    }
  ],
  "skills": "**Programming Languages:**\n\tPython, Perl, Bash, JavaScript/TypeScript\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tOAuth2, JWT\n\n**Serverless and Cloud Functions:**\n\tAWS: ECS, Lambda, RDS, S3, Azure: App Services, Blob Storage, SQL Database\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tNginx, Let’s Encrypt, Certbot\n\n**Other:**\n\tDigital Verification, SystemVerilog, UVM, RTL, Cadence Xcelium, MLflow, Airflow, Kubeflow, Testbench, Simulation, Debugging, Communication",
  "apply_company": "Oxford Nanopore Technologies"
}