{
  "name": "Tomasz Lee",
  "role_name": "Senior Robotics Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Dynamic Senior Robotics Engineer with 9+ years of experience in leveraging **Python**, **C++**, and **PyTorch** to develop advanced AI solutions, including Vision-Language Models and Deep Learning applications. Proficient in **Reinforcement Learning** and skilled with robotics simulation tools such as **Isaac Sim** and **MuJoco**, along with frameworks like **Nemo** and **TensorRT** for optimal inference server strategies. Extensive background in delivering complex solutions through innovative methodologies, fostering a growth mindset, and enhancing collaboration across multidisciplinary teams. Recognized for exceptional communication skills and the ability to effectively translate technical concepts for stakeholders.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Senior Robotics Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "- Leveraged **Python** and **C++** to develop advanced AI algorithms, including **Vision-Language Models** for enhanced robotic perception and interaction.\n- Implemented **Deep Learning** models using **PyTorch**, optimizing performance with **TensorRT** to accelerate inference by **40%**.\n- Developed and tested reinforcement learning strategies in **Isaac Sim** environment, achieving a **25%** improvement in training efficiency.\n- Designed robotics simulations in **MuJoCo** for real-time evaluation of robotic models, ensuring robust testing protocols.\n- Integrated data processing scripts for real-time data analytics, utilizing pipelines built with **Nemo** for model deployment.\n- Collaborated with cross-functional teams to enhance communication and foster a **growth mindset** within technical projects.\n- Communicated findings and strategies effectively, translating complex technical concepts to non-technical stakeholders.\n- Contributed to ongoing projects by providing insights from data science principles to improve system capabilities and user engagement.\n- Conducted workshops on advanced robotics techniques, empowering team members with cutting-edge technological skills."
    },
    {
      "role": "Software Engineer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "• Developed and implemented advanced AI algorithms in **Python** and **C++** for robotics simulation to enhance performance in real-world environments.\n• Utilized **PyTorch** for training deep learning models, optimizing workloads using **TensorRT** for quicker inference times, achieving a 20% boost in processing speed.\n• Designed Vision-Language Models that improved interaction capabilities in robotics applications, resulting in a 15% increase in task accuracy.\n• Conducted experiments using **Isaac Sim** and **MuJoCo** for realistic physics simulation, validating designs against **Nemo** and **Triton Inference Server** for scalable deployment.\n• Employed Reinforcement Learning techniques to develop intelligent algorithms for robotics, achieving a 30% reduction in training time.\n• Collaborated with cross-functional teams using effective **communication** skills to gather requirements and report on project progress, ensuring alignment with project goals.\n• Mentored junior engineers in data science principles and AI frameworks, fostering a **growth mindset** within the team and improving collective knowledge.\n• Created and maintained documentation for all AI projects and models, ensuring reproducibility and ease of understanding for all team members.\n• Regularly reviewed code for quality assurance and adherence to best practices, leading to a 25% decrease in project bugs."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "Utilized **Python** and **C++** to implement and optimize **Deep Learning** models for robotics applications, improving processing speed by **30%**.\nDeveloped and integrated **Vision-Language Models** using **PyTorch**, enhancing object recognition capabilities in robotic systems.\nEngaged in **Reinforcement Learning** techniques to optimize robotic actions, achieving a simulation success rate of **85%**.\nDesigned and executed robotic simulations in **Isaac Sim** and **MuJoco**, allowing for robust testing and development cycles.\nCollaborated with cross-functional teams to assess AI-driven solutions, ensuring alignment with business goals and improving **communication** across departments.\nConceived training datasets and feedback loops for **Robotics Simulation**, boosting model accuracy by **25%**.\nMaintained and optimized inference pipelines using **TensorRT** and **Triton Inference Server**, resulting in improved real-time application performance.\nPromoted a **Growth Mindset** among team members through mentorship and knowledge sharing, fostering an innovative work environment.\nProvided detailed **technical documentation** related to AI models and simulations to facilitate knowledge transfer and ensure project continuity.\nParticipated in daily standups to facilitate project alignment and progress monitoring, enhancing team communication."
    }
  ],
  "skills": " **Programming Languages**\n\tPython, C++, TypeScript, JavaScript\n\n **Backend Frameworks**\n\tNodeJS, ExpressJS, NestJS, C#, .NET, Entity Framework, Microservices\n\n **Frontend Frameworks**\n\tReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n **API Technologies**\n\tRESTful API, GraphQL\n\n **Serverless and Cloud Functions**\n\tAWS, Azure\n\n **Databases**\n\tMSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB\n\n **DevOps**\n\tCI/CD pipelines\n\n **Cloud & Infrastructure**\n\tCommunication\n\n **Other**\n\tUX/UI Design, Git, GitHub, Testing Tools: NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest, Blockchain: Solidity, Ether.js, Web3.js, Ethereum, Messaging & Caching: Apache Kafka, RabbitMQ, Redis, AI, Deep Learning, Vision-Language Models, PyTorch, Nemo, TensorRT, Triton Inference Server, Reinforcement Learning, Robotics Simulation, Isaac Sim, Isaac Lab, MuJoco, Data Science, Growth Mindset",
  "apply_company": "NVIDIA"
}