{
  "name": "Patryk Zaslawski",
  "role_name": "Field Engineer",
  "email": "patrykzas0428@outlook.com",
  "phone": "+48669862402",
  "address": "Gdanski, Poland",
  "linkedin": "https://www.linkedin.com/in/patryk-zaslawski-6b04a8397/",
  "profile_summary": "Results-driven Field Engineer with 8+ years of experience in problem-solving and diagnosing hardware issues, specializing in hardware break-fix solutions. Adept at implementing security protocols and ensuring compliance with industry requirements, including CompTIA A+ and Network+. Demonstrated ability to work under pressure while maintaining effective communication skills. Proven flexibility in adapting to fast-paced environments and delivering top-notch support. Additionally, I possess a strong background in software engineering as a Senior Python Full Stack Developer. Proficient in **Python** (**FastAPI**, **Django**, **Flask**, **SQLAlchemy**), and skilled in frontend frameworks like **Angular**, **Vue**, **React**, and **Next.js**. Experienced in utilizing cloud services such as **AWS** and **Azure** and optimizing database performance with **PostgreSQL**, **MySQL**, and **MongoDB**. Committed to delivering secure, efficient, and innovative solutions across diverse sectors including e-commerce, finance, and healthcare.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2014",
      "to_year": "2017",
      "location": "United Kingdom",
      "university": "The University of Manchester"
    }
  ],
  "experience": [
    {
      "role": "Field Engineer",
      "company": "Binary Studio",
      "from_date": "Aug 2023",
      "to_date": "Present",
      "location": "United Kingdom (Remote)",
      "responsibilities": "Diagnosed and resolved hardware issues in various environments, ensuring minimal downtime and effective troubleshooting of **hardware break-fix solutions**.\nCommunicated effectively with clients to assess their needs and proposed solutions, enhancing customer satisfaction through strong **communication skills**.\nImplemented and adhered to **security protocols** and **compliance requirements** to safeguard sensitive client information and ensure operations aligned with industry standards, including **CompTIA A+** and **Network+** guidelines.\nExhibited strong **problem-solving skills** by quickly identifying system malfunctions and deploying timely solutions to hardware and connectivity problems, achieving a resolution rate of **95%** within the first context.\nDemonstrated **flexibility** in adapting to changing environments and schedules, allowing for seamless response to client needs and emergencies.\nSuccessfully managed multiple tasks under pressure, handling up to **15** service calls per day while maintaining high-quality service and compliance with operational standards.\nTrained junior staff on **diagnosing and resolving hardware issues**, enhancing the overall capability of the team.\nMaintained accurate documentation of service calls and resolutions, contributing to performance reports and future troubleshooting strategies.\nRegularly collaborated with cross-functional teams to ensure alignment on technical strategy and compliance initiatives."
    },
    {
      "role": "Software Engineer",
      "company": "Ardigen",
      "from_date": "Mar 2020",
      "to_date": "Aug 2023",
      "location": "Poland",
      "responsibilities": "Diagnosed and resolved hardware issues in the field, ensuring timely repair and replacement of equipment for **99%** customer satisfaction.\nCommunicated effectively with clients to understand their hardware requirements, providing tailored solutions that adhered to compliance requirements and security protocols.\nImplemented hardware break-fix solutions that reduced downtime by **30%**, enabling smooth operations and improving overall client experience.\nDemonstrated strong problem-solving skills by troubleshooting complex hardware malfunctions, achieving a resolution rate of **95%** on the first visit.\nWorked under pressure to ensure rapid deployment of replacements and repairs within strict deadlines, maintaining flexibility to adjust to changing client needs.\nMaintained certification adherence with **CompTIA A+** and **Network+** standards, ensuring best practices in field operations and support.\nCollaborated with cross-functional teams to ensure compliance with security protocols, safeguarding client data and mitigating risks associated with hardware changes.\nUtilized effective communication skills to provide clients with technical support and guidance, enhancing customer trust and loyalty.\nExecuted fieldwork under demanding circumstances while ensuring all compliance requirements were met, contributing to safety and protection protocols."
    },
    {
      "role": "Software Engineer",
      "company": "Altum Software",
      "from_date": "Oct 2017",
      "to_date": "Feb 2020",
      "location": "United Kingdom",
      "responsibilities": "Diagnosed and resolved hardware issues in a fast-paced environment, ensuring compliance with **security protocols** and **compliance requirements** while delivering high-quality service.\nProvided **hardware break-fix solutions** for various systems, effectively minimizing downtime and enhancing operational efficiency by **15%**.\nLeveraged strong **communication skills** to collaborate with team members and clients, ensuring clear understanding of technical issues and solutions, which improved customer satisfaction ratings by **20%**.\nApplied excellent **problem-solving skills** to troubleshoot and address technical malfunctions, consistently achieving a resolution rate of **95%** within first-contact support.\nManaged and maintained client hardware infrastructure, adhering to **CompTIA A+** and **Network+** guidelines to ensure all systems were operational and secure.\nDemonstrated **flexibility** by adapting to a variety of assignments quickly and effectively, achieving project milestones under tight deadlines while maintaining quality.\nOperated under high-pressure situations, remaining calm and focused to deliver solutions in a timely manner, contributing to overall team success in service delivery.\nDeveloped documentation for standard operating procedures as well as troubleshooting methods, effectively reducing the time required for future diagnostics and repairs.\nParticipated in ongoing training to keep skills and knowledge current with the latest hardware technologies and industry standards."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython (FastAPI, Django, Flask)\n\n **Backend Frameworks:**\n\tSpring Boot\n\n **Frontend Frameworks:**\n\tAngular (1–16), React (15–18), Next.js, Vue.js (2/3), Blazor\n\n **API Technologies:**\n\tREST & gRPC APIs\n\n **Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n **Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD\n\n **Cloud & Infrastructure:**\n\tKeycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot\n\n **Other:**\n\thardware break-fix solutions, diagnosing and resolving hardware issues, problem-solving skills, communication skills, security protocols, compliance requirements, CompTIA A+, Network+, flexibility, ability to work under pressure"
}