{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Automation Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Senior Automation Engineer with 13+ years of experience, adept at crafting high-performance, automated solutions. Proficient in **n8n**, REST API integration, OAuth authentication, and webhooks, with strong expertise in JavaScript, SQL, and ETL processes. Demonstrated ability to leverage automation best practices while enhancing workflow efficiency using tools like **Airtable**, **HubSpot**, **Slack**, **Notion**, and **Stripe**. Skilled in problem-solving and effective communication, facilitating seamless project execution and collaboration.\n\nBringing hands-on experience in both frontend and backend development with **React**, **Node.js**, **FastAPI**, and **Django**, as well as cloud-native deployments on **AWS** and **Azure**. Well-versed in building AI/ML-powered platforms and implementing microservices and CI/CD pipelines, aligning solutions with compliance-driven standards such as HIPAA, FHIR, PCI DSS, and SOC 2.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Automation Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Implemented automation workflows using **n8n** to streamline data processing and integration between services like **HubSpot**, **Airtable**, and **Slack**, increasing efficiency by **40%**.\nDesigned and developed robust REST APIs that facilitate data exchange in JSON format, ensuring secure user authentication through **OAuth** and improved data integrity across platforms.\nConducted ETL processes to transform and load data from various sources, leveraging **SQL** for complex queries and analysis, providing actionable insights with a response time reduction of **30%**.\nCreated real-time automation scripts utilizing **webhooks** to trigger actions based on specific events, significantly reducing manual intervention and error rates by **25%**.\nCollaborated with cross-functional teams to foster effective communication and problem-solving, driving successful project outcomes in a remote environment.\nUtilized **JavaScript** to enhance automation scripts, ensuring compatibility across different platforms and improving execution speed by **15%**.\nEstablished best practices for automation, leading training sessions that improved team productivity in automation tasks by **20%**.\nOptimized existing automation processes, resulting in a **50%** reduction in task completion times across various workflows.\nIntegrated **Stripe** for secure payment processing within automated solutions, ensuring compliance with industry standards and increasing transaction success rates.\nCreated and maintained documentation in **Notion** for all automation processes, enabling seamless knowledge sharing and onboarding of new team members.\nLeveraged **Google Workspace** tools for project management and collaboration, enhancing team coordination and project tracking efficiency.\n"
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Implemented **REST API** integrations and **webhooks** to automate workflows across platforms like **HubSpot**, **Airtable**, and **Slack**, enhancing operational efficiency by **30%** through streamlined data exchange.\nEngineered automated solutions using **n8n**, enhancing automation and integration between various services to reduce manual efforts by **50%**.\nSpearheaded the improvement of data handling by designing seamless data transformation processes with **ETL** methodologies, ensuring high data quality for analysis and reporting.\nUtilized **JSON** for structuring data between systems, ensuring consistent communication and integration across service platforms.\nEmployed **OAuth** protocols for secure API access, building trust with users and stakeholders while maintaining adherence to security standards.\nLeveraged **SQL** for querying and managing databases, optimizing data retrieval speeds by **40%** and improving response times.\nDemonstrated strong **problem-solving** skills by identifying automation gaps and proposing solutions, achieving a project completion rate of **95%** on time.\nFostered effective **communication** among cross-functional teams to facilitate collaboration and alignment on automation projects, resulting in improved stakeholder satisfaction metrics by **20%**."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Developed and maintained **REST APIs** using **Python** and **Node.js**, ensuring seamless integration with **Slack**, **HubSpot**, and **Airtable** for efficient data handling and automation.\nEngineered real-time automation workflows with **n8n** and **webhooks**, optimizing operational processes and enhancing cross-platform communication within the organization.\nImplemented secure authorization protocols using **OAuth 2.0** to safeguard sensitive information while enabling automated workflows through various platforms and third-party services.\nUtilized **JavaScript** to script automated solutions, integrating with data sources and ensuring real-time data synchronization across various services, improving transactional efficiency by **30%**.\nDesigned ETL processes that leveraged **SQL** and JSON for data extraction, transformation, and loading, improving data accuracy and reducing processing time by **25%**.\nCollaborated with cross-functional teams to identify automation needs and troubleshoot issues, applying strong problem-solving skills to enhance process efficiency.\nMaintained communication with stakeholders via **Google Workspace**, ensuring that all automation solutions meet business requirements and project timelines.\nAutomated routine tasks using best practices in automation, leading to a **40%** increase in team productivity and significantly reducing manual errors.\nMonitored and optimized existing API integrations, ensuring high availability and performance across critical systems, thereby supporting seamless customer interactions and internal operations.\n"
    }
  ],
  "skills": " **API Technologies:**\n\tREST API, webhooks, OAuth, JSON\n\n**Frontend Frameworks:**\n\tJavaScript/TypeScript: React, Vue, Angular\n\n**Backend Frameworks:**\n\tPython: FastAPI, Flask, Django\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis, SQL\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS: ECS, Lambda, RDS, S3, Azure: App Services, Blob Storage, SQL Database\n\n**Other:**\n\tn8n, HubSpot, Airtable, Slack, Notion, Stripe, Google Workspace, MLflow, Airflow, Kubeflow, automation best practices, problem-solving, communication",
  "apply_company": "Pet Media Group (PMG)"
}