{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Full Stack Developer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-karol-kotlinski-bb2520397/",
  "profile_summary": "Results-driven Full Stack Developer with 8 years of experience specializing in **MERN stack** technologies, specifically **Node.js**, **Express.js**, and **ReactJS**. Proficient in building high-performance solutions with **TypeScript**, employing state management with **Redux**, **Redux-Saga**, and **Reselect**, while leveraging **Styled Components** for scalable UI design. Extensive experience in developing robust back-end architectures using **REST APIs**, and integrating message brokers like **RabbitMQ** and caching solutions including **Redis**. \nExpert in automated testing frameworks such as **Jest** and **Mocha**, and familiar with Git for version control, as well as CI/CD practices utilizing **GitLab CI**. I've successfully delivered enterprise-grade platforms compliant with industry standards and regulations. My comprehensive tech stack further includes **Elastic Stack** and expertise in Jira for project management. \nAdditionally, I possess strong foundations in cloud technologies across **Azure** and **AWS**, and a commitment to implementing CI/CD automation and microservices architecture, ensuring the secure and efficient operation of applications in the healthcare and financial sectors.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Full Stack Developer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Developed and maintained robust web applications leveraging the **MERN stack** including **Node.js**, **Express.js**, and **ReactJS**, ensuring high reliability and performance.\n- Implemented state management solutions using **Redux** and **Redux-Saga** for efficient data handling across applications, improving responsive UI interactions by **30%**.\n- Designed and optimized REST APIs with **Node.js** and **Express.js**, facilitating seamless communication between front-end and back-end services, reducing latency by **25%**.\n- Built and maintained asynchronous job processing systems using **RabbitMQ** to enhance application response times during peak loads, achieving throughput improvements of up to **40%**.\n- Utilized **Redis** for caching mechanisms to optimize data retrieval times, contributing to a **50%** decrease in server response times.\n- Conducted thorough unit and integration testing using frameworks such as **Jest** and **Mocha**, achieving **95%** test coverage across codebases, ensuring high-quality software delivery.\n- Managed version control and collaborative development processes using **Git**, **GitLab**, and **GitLab CI**, streamlining deployment pipelines for continuous integration and delivery.\n- Collaborated in Agile teams using tools like **Jira** to track progress and maintain project deadlines, enhancing overall team productivity by **20%**.\n- Created scalable and reusable UI components with **Styled Components**, improving design consistency and enhancing developer efficiency across **5+** projects.\n- Integrated **Elastic Stack** for sophisticated log management and search capabilities, drastically improving system monitoring and response to anomalies.\n- Participated in code reviews and pair programming sessions to ensure best practices and foster knowledge sharing among team members, contributing to a collaborative team environment."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Utilized the **MERN stack** to design and implement full-stack web applications, ensuring seamless integration between front-end and back-end services.\nLed the development of scalable back-end solutions with **Node.js** and **Express.js**, enhancing API performance and response time by **30%**.\nDeveloped interactive user interfaces with **ReactJS (18)** and **Redux**, improving user engagement metrics by **25%** through effective state management and dynamic data handling.\nImplemented efficient state management using **Redux-Saga** and **Reselect**, optimizing application performance and ensuring a smooth user experience.\nUtilized **Styled Components** for responsive design, ensuring cross-device compatibility and enhancing UI aesthetics which elevated user satisfaction scores by **20%**.\nManaged asynchronous communication and real-time processing using **RabbitMQ**, allowing for effective handling of user requests and event-driven applications.\nBuilt and maintained REST APIs to facilitate communication between the front-end and back-end, contributing to an overall system throughput increase by **40%**.\nAdopted best practices in version control with **Git** and CI/CD pipelines in **GitLab CI**, streamlining the deployment process and reducing deployment time by **50%**.\nImplemented unit testing and integration testing using **Jest** and **Mocha**, ensuring code reliability and reducing bugs by **35%** in production releases.\nCollaborated on project management using **Jira**, tracking progress and ensuring timely delivery of features aligned with client expectations."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Developed full-stack solutions using **MERN stack** (MongoDB, Express.js, ReactJS, Node.js) to create high-availability web applications, optimized for seamless user experience and performance across various device platforms.\nEngineered and maintained REST APIs to facilitate data interactions, ensuring efficient communication between server-side and frontend components, utilizing frameworks such as **Express.js** for routing and handling middleware.\nImplemented state management in frontend applications using **Redux** and **Redux-Saga**, providing a robust architecture for managing application state across **ReactJS** components.\nLeveraged **Redis** for caching to reduce latency, enhancing response times by up to **30%** during high-traffic periods and improving system limits for real-time data access.\nUtilized **RabbitMQ** for implementing message queuing, ensuring reliable delivery of messages and improved scalability for backend services.\nEstablished a CI/CD pipeline using **GitLab CI** for automated testing and deployments, increasing development efficiency and reducing release timelines by **50%**.\nIntegrated testing frameworks, such as **Jest** and **Mocha**, to ensure code quality and reliability, achieving a test coverage rate exceeding **85%** across applications.\nCollaborated with cross-functional teams using **Jira** for agile project management, maintaining project timelines and delivering features in line with stakeholder expectations.\nImplemented responsive design principles and styling with **Styled Components** and other CSS methodologies, ensuring applications are mobile-friendly and aligned with modern design standards.\nEnforced best practices in version control using **Git**, enabling seamless collaboration across the development team and maintaining a clean project history."
    }
  ],
  "skills": "Programming Languages:\n\tPython, JavaScript, TypeScript\n\n**Backend Frameworks:**\n\tNode.js, Express.js, FastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, ReactJS, Vue, Angular, Redux, Redux-Saga, Reselect, Styled Components\n\n**API Technologies:**\n\tREST APIs\n\n**Serverless and Cloud Functions:**\n\tAWS Lambda, Azure App Services\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, GitLab, Helm, Terraform, Ansible\n\n**Cloud & Infrastructure:**\n\tAWS (ECS, RDS, S3), Azure (Blob, SQL)\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, RabbitMQ, Elastic Stack, Jest, Mocha, Jira, Git"
}