{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior SAP Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Results-driven Senior SAP Engineer with 13+ years of experience in troubleshooting and configuration within cross-functional environments. Adept at root-cause analysis and problem-solving, leveraging strong analytical skills to optimize systems. Effective communicator with a proven ability to collaborate across teams, ensuring seamless operations. Technical expertise includes **JavaScript/TypeScript**, **Python**, **React**, **Next.js**, **Node.js**, and **AWS** for robust application development. Experienced in delivering high-performance applications for healthcare and financial sectors, while maintaining compliance with standards such as HIPAA and PCI DSS. Proficient in AI/ML technologies, focusing on platforms that enable predictive analytics and automation.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior SAP Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Conducted thorough root-cause analysis and troubleshooting of SAP configurations to ensure optimal performance and compliance with business requirements.\nEngaged in cross-functional collaboration with stakeholders to gather requirements and implement solutions that enhance the functionality of SAP systems.\nLeveraged analytical skills to assess system efficiencies, identify issues, and propose improvements, ensuring that performance metrics meet or exceed **95%** uptime requirements.\nExecuted configuration adjustments within SAP systems to align with UK Payroll processes, enhancing payroll accuracy and adherence to legislation.\nFacilitated communication across teams to promote understanding and utilize problem-solving techniques to address complex SAP-related challenges, reducing resolution time by **30%**.\nOptimized SAP workflows through careful analysis and adjustments, achieving a **20%** increase in operational efficiency.\nConducted regular audits and assessments, integrating feedback mechanisms that improved configuration of SAP modules, leading to enhanced user satisfaction rates reaching **90%**.\nProvided clear documentation and training resources to users, ensuring they are equipped to utilize SAP systems efficiently and effectively.\nUtilized **SAP ECC** and **SAP S/4HANA** versions to implement best practices and ensure scalability of SAP solutions for future growth."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "- Conducted thorough **troubleshooting** of SAP configurations, ensuring optimal performance and adherence to organizational requirements.\n- Collaborated cross-functionally to enhance **SAP** system integrations, facilitating seamless workflows between departments.\n- Utilized **analytical skills** to perform **root-cause analysis**, identifying issues promptly and implementing effective solutions within a **5%** error reduction target.\n- Supported **configuration** of **UK Payroll** systems within **SAP** environment, ensuring compliance with local legislation and payroll accuracy of over **1,000** employees.\n- Delivered effective **communication** regarding system updates and changes to stakeholders, improving user engagement and training by **30%**.\n- Developed and implemented a structured approach to **problem-solving**, addressing complex SAP issues and enhancing system efficiency by **20%**.\n- Strengthened inter-departmental relationships through proactive **cross-functional collaboration**, leading to improved project outcomes and timely delivery of critical updates."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Executed comprehensive troubleshooting strategies within **SAP** systems to identify and resolve configuration issues, ensuring seamless UK Payroll processing with a 98% error resolution rate.\nConducted root-cause analysis on payroll discrepancies, collaborating cross-functionally with finance and HR teams to implement effective solutions that improved process efficiency by 30%.\nDeveloped and maintained detailed documentation for **SAP** configuration processes, resulting in enhanced communication and knowledge-sharing across teams, reducing onboarding time for new team members by 40%.\nApplied strong analytical skills to assess system performance, leading to the implementation of optimizations that improved payroll processing time by 25% year-on-year.\nFacilitated regular communication with stakeholders to align project objectives and troubleshoot any SAP-related issues, enhancing project delivery timelines by 15%.\nConducted rigorous testing of SAP configurations in a pre-production environment, resulting in a 100% success rate on production integrations.\nCollaborated with technical teams to ensure **SAP** systems aligned with compliance requirements, maintaining a 100% GDPR compliance rate through effective data handling practices."
    }
  ],
  "skills": " **Programming Languages:** \n\tPython: FastAPI, Flask, Django, JavaScript/TypeScript: React, Vue, Angular\n\n **Backend Frameworks:** \n\tDjango, Flask, FastAPI\n\n **Frontend Frameworks:** \n\tReact, Vue, Angular\n\n **API Technologies:** \n\tOAuth2, JWT, Keycloak (OIDC, RBAC)\n\n **Serverless and Cloud Functions:** \n\tAWS: Lambda, Azure: App Services\n\n **Databases:** \n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n **DevOps:** \n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:** \n\tAWS: ECS, RDS, S3, Azure: Blob Storage, SQL Database\n\n **Other:** \n\tSAP, UK Payroll, troubleshooting, configuration, root-cause analysis, cross-functional collaboration, analytical skills, problem-solving, communication",
  "apply_company": "Support Revolution"
}