{
  "name": "Tomasz Lee",
  "role_name": "Senior DevSecOps Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Results-driven Senior DevSecOps Engineer with 9+ years of comprehensive experience in implementing **Infrastructure as Code** using **Terraform** and developing **CI/CD** pipelines within **Azure** environments. Proficient in **DevSecOps** practices to ensure secure and efficient application deployment. Expertise in agile methodologies to facilitate collaboration and drive project success. Recognized for strong leadership and communication skills, enabling effective cross-team collaboration and project management. Additionally, skilled in **microservices architecture**, **ReactJS**, **NextJS**, **.NET**, **C#**, as well as utilizing tools like **Apache Kafka**, **RabbitMQ**, and **Redis** to enhance application performance and reliability.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Senior DevSecOps Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Led the implementation of **Infrastructure as Code** using **Terraform** to automate and manage cloud infrastructure on **Azure**, resulting in a 30% increase in deployment efficiency.\nUtilized **CI/CD** pipelines on **Azure DevOps** to streamline deployment processes, cutting deployment time by **40%**.\nSpearheaded the integration of **DevSecOps** practices within the development lifecycle, enhancing security compliance and reducing vulnerabilities by **50%**.\nDrove the adoption of **Agile** methodologies within cross-functional teams, leading to more efficient project management and a **25%** improvement in delivery timelines.\nDeveloped and enforced monitoring protocols for cloud resources, significantly improving system uptime and incident response times.\nFostered open lines of **communication** between development and operations teams, leading to enhanced collaborative efforts and innovative solutions.\nProvided **leadership** in identifying and implementing best practices in continuous integration and delivery strategies.\nEnsured systems remained secure and up-to-date through regular audits and the implementation of automation scripts for monitoring.\nMentored junior engineers on **DevSecOps** principles and best practices, enhancing team capabilities and fostering career growth."
    },
    {
      "role": "Full Stack Developer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "Implemented **Azure** cloud solutions to enhance project management capabilities, achieving a **15%** increase in team collaboration efficiency.\nDesigned Infrastructure as Code (IaC) using **Terraform** to streamline environment provisioning and improve deployment consistency.\nDeveloped and maintained CI/CD pipelines using **GitHub Actions**, reducing production deployment errors by **30%** and accelerating release cycles.\nCollaborated with cross-functional teams in an **Agile** environment to define system requirements and development timelines, ensuring on-time project delivery and stakeholder satisfaction.\nConducted regular monitoring and audits of cloud infrastructure to maintain security and compliance, aligning with **DevSecOps** best practices.\nLed a team of developers, fostering leadership through mentorship and code reviews, which boosted overall team productivity.\nCommunicated effectively with stakeholders to gather requirements and provide project updates, enhancing team transparency and collaboration.\nOptimized deployment processes and infrastructure scaling strategies, resulting in a **25%** improvement in performance and resource utilization. \nUtilized advanced monitoring tools and techniques for ongoing evaluations of system performance and security posture.\nGenerated interactive project status tracking reports using custom charts and graphs for enhanced stakeholder engagement."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "Implemented **CI/CD** pipelines in **Azure**, enhancing deployment efficiency and security practices by 30%.\nUtilized **Terraform** for managing **Infrastructure as Code**, ensuring consistency and scalability of cloud resources.\nLed initiatives to integrate **DevSecOps** principles into existing workflows, resulting in a 25% reduction in vulnerabilities.\nMonitored system performance and security using various tools, improving proactive detection of issues by 40%.\nCollaborated with cross-functional teams in an **Agile** environment to deliver high-quality software solutions on time.\nProvided mentorship and training to junior engineers, cultivating a strong team culture and improving communication skills.\nImplemented automated monitoring systems for performance metrics, leading to a 15% improvement in response times.\nParticipated in daily standups and retrospectives, ensuring alignment with project goals and continuous process improvement.\nDelivered comprehensive technical documentation and reports, enhancing knowledge sharing across the organization.\nPromoted effective leadership practices within the team, fostering a collaborative and innovative work environment."
    }
  ],
  "skills": " **Programming Languages**\n\tJavaScript, TypeScript, C#, Python\n\n**Backend Frameworks**\n\tNodeJS, ExpressJS, NestJS, .NET\n\n**Frontend Frameworks**\n\tHTML, CSS, ReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n**API Technologies**\n\tRESTful API, GraphQL\n\n**Serverless and Cloud Functions**\n\tAWS, Azure\n\n**Databases**\n\tMSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB\n\n**DevOps**\n\tCI/CD, DevSecOps, Infrastructure as Code, Terraform, Monitoring\n\n**Cloud & Infrastructure**\n\tCloud & DevOps\n\n**Other**\n\tUX/UI Design, Git, GitHub, Microservices, Agile, Leadership, Communication, Testing Tools: NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest, Blockchain: Solidity, Ether.js, Web3.js, Ethereum, Messaging & Caching: Apache Kafka, RabbitMQ, Redis\n",
  "apply_company": "Fortrea"
}