{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior DevOps Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Senior DevOps Engineer with 13+ years of experience specializing in delivering robust, cloud-native applications. Proficient in **AWS**, **Azure**, **Kubernetes**, **Docker**, **Terraform**, **Ansible**, and **Helm**, with a strong focus on Continuous Delivery and security analysis. Demonstrated expertise in monitoring and logging using **ELK** and **Grafana**. Skilled in collaborative environments and effective communication in English.\n\nAs a Full Stack Developer, I bring extensive knowledge in **JavaScript/TypeScript**, **Python**, and **Flutter**, with hands-on experience in developing scalable systems using **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**. Experienced in building AI/ML-powered platforms, implementing microservices, and establishing CI/CD pipelines, while ensuring compliance with HIPAA, FHIR, PCI DSS, and SOC 2 standards. Strong background in MLOps, covering model training, serving, and orchestration using **MLflow**, **Airflow**, and **Kubeflow**.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior DevOps Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Implemented **Kubernetes** and **Docker** for orchestrating containerized applications, ensuring efficient deployment and scalability across cloud environments.\nUtilized **AWS** services for cloud infrastructure management, enhancing performance and reliability while integrating tools like **Terraform** and **Ansible** for automated provisioning and configuration management.\nDeveloped and maintained CI/CD pipelines emphasizing **Continuous Delivery** practices using **Git** for version control, with integrated monitoring solutions using **Grafana** and ELK stack for proactive system health analysis.\nCollaborated with cross-functional teams to ensure security analysis at every stage of development, promoting secure coding practices and adherence to industry standards.\nLed initiatives for optimizing performance and reliability through automated monitoring strategies, leveraging tools like **Grafana** to visualize system metrics and logging with ELK to identify issues promptly.\nProvided English-language documentation and training materials to promote knowledge sharing and improve team collaboration across diverse backgrounds.\nManaged infrastructure as code (IaC) practices utilizing **Helm** charts for Kubernetes applications, streamlining deployment and upgrade processes in production environments.\nEnsured compliance with security best practices by incorporating threat analysis and mitigation strategies into the DevOps lifecycle, enhancing overall system security and integrity.\nFacilitated regular code reviews and collaborative sessions to encourage continuous improvement in development practices while fostering a culture of teamwork and shared success.\nMonitored and optimized application and system performance with a focus on uptime and efficiency, ensuring zero downtime deployments across critical infrastructure."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Implemented container orchestration using **Kubernetes** and **Docker**, streamlining the deployment processes and enhancing the scalability of microservices and applications.\nAutomated infrastructure provisioning and configuration management with **Terraform**, **Ansible**, and **Helm**, resulting in a **30%** reduction in deployment time.\nExecuted CI/CD pipelines utilizing **Git** and integrated monitoring solutions like **Grafana** and **ELK** for real-time application performance tracking and logs analysis.\nManaged cloud resources on **AWS** and **Azure**, optimizing costs and ensuring secure, scalable environments for application deployment.\nConducted security analysis across the infrastructure, implementing best practices for continuous delivery and security in development and operations.\nFostered collaboration among cross-functional teams, leading initiatives that enhanced team efficiency and reduced project delivery timelines by **25%**.\nMonitored system performance and executed necessary optimizations resulting in improved system reliability and reduced downtime to less than **1%** annually.\nCreated comprehensive documentation and conducted training sessions to elevate team skill levels in **DevOps** practices, contributing to a knowledge-sharing culture."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Implemented and managed **Kubernetes** clusters for container orchestration, ensuring seamless deployment and scaling of applications across cloud environments including **AWS** and **Azure**.\nUtilized **Docker** for containerization of applications, improving deployment efficiency by **30%** and consistency across development, testing, and production environments.\nAutomated infrastructure provisioning using **Terraform** and **Ansible**, reducing setup time by **50%** and enhancing infrastructure reliability with version-controlled configurations.\nMaintained continuous delivery pipelines with **Git** and **Helm**, allowing for rapid and safe deployments, significantly improving deployment frequency and change lead time.\nExecuted comprehensive monitoring and logging strategies employing **ELK** stack and **Grafana**, achieving detailed insights into system performance while proactively identifying bottlenecks.\nConducted security analysis and audits, leading efforts to ensure compliance with best security practices and standards such as PCI and GDPR.\nFacilitated collaboration among cross-functional teams to enhance DevOps practices, promoting effective communication and knowledge sharing in English.\nLed initiatives to enhance application security and resilience by implementing role-based access control (RBAC), ensuring only authorized access based on defined roles.\nLeveraged continuous delivery methodologies to streamline the release process as part of maintaining high operational standards across environments."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, JavaScript/TypeScript\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n **Frontend Frameworks:**\n\tReact, Vue, Angular\n\n **API Technologies:**\n\t\n\n **Serverless and Cloud Functions:**\n\tAWS: ECS, Lambda, RDS, S3, Azure: App Services, Blob Storage, SQL Database\n\n **Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Helm, Ansible, Terraform\n\n **Cloud & Infrastructure:**\n\tAWS, Azure, ELK, Grafana, Monitoring, CI/CD\n\n **Other:**\n\tCollaboration, Security Analysis, Continuous Delivery, English",
  "apply_company": "Deloitte"
}