{
  "name": "Mariusz Jan Skobel",
  "role_name": "Senior Backend Engineer",
  "email": "mariuszskobel15@outlook.com",
  "phone": "+48 735 343 548",
  "address": "Katowice, Poland",
  "linkedin": "https://www.linkedin.com/in/mariusz-skobel-927764397/",
  "profile_summary": "Senior Backend Engineer with 10+ years of experience in developing high-performance software solutions, specializing in **.NET**, **.NET Core**, **MVC**, and **Entity Framework**. Proven track record of building robust APIs and microservices architecture, ensuring seamless integration and functionality. Highly proficient with **PostGreSQL** for database management and effective data handling. Experienced in leveraging **Firebase** for real-time applications and managing application performance. Adept at utilizing **Swagger** for API documentation, enhancing developer interaction and project efficiency. \nIn addition to backend expertise, skilled in delivering solutions in the healthcare and finance sectors using modern technologies such as **JavaScript/TypeScript**, **Python**, and **Flutter**. Demonstrated hands-on experience with **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django** across the full stack, delivering secure, maintainable solutions compliant with standards including HIPAA, FHIR, PCI DSS, and SOC 2. Capable of leading the development of enterprise platforms and embedding AI/ML capabilities for enhanced analytics and decision-making. Passionate about building systems that deliver meaningful impact.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2012",
      "to_year": "2015",
      "location": "UK",
      "university": "University of Bristol"
    }
  ],
  "experience": [
    {
      "role": "Senior Backend Engineer",
      "company": "EitBiz",
      "from_date": "Oct 2022",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "•\tDeveloped and optimized microservices architectures using **.NET**, **.Net Core**, and **MVC**, ensuring high performance and scalability for backend services in healthcare and finance sectors.\n•\tImplemented robust APIs integrated with **Swagger** for clear documentation and testing, enhancing developer experience and interaction with service endpoints.\n•\tDesigned complex data models and conducted database management with **PostgreSQL**, ensuring efficient data storage and retrieval for applications handling millions of records.\n•\tUtilized **Entity Framework** for seamless database operations, streamlining CRUD functionalities and optimizing query performance by **30%**.\n•\tLed the migration of monolithic applications to microservices infrastructure, achieving a **40%** reduction in deployment time and improving system resilience through service isolation.\n•\tManaged cloud functions and real-time data processing using **Firebase**, enhancing the scalability of mobile and web applications.\n•\tEstablished continuous integration and continuous deployment (CI/CD) practices, reducing deployment times by **50%** using modern DevOps tools within the microservices ecosystem.\n•\tCollaborated with front-end teams to integrate backend solutions with user interfaces while ensuring adherence to security protocols and data privacy regulations.\n•\tImplemented comprehensive unit and integration testing frameworks to ensure code quality and reliability across **100%** of deployed services.\n•\tContributed to architectural discussions, promoting best practices in software development and advocating for the adoption of microservices and cloud-native strategies."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Tvn S.A.",
      "from_date": "Oct 2019",
      "to_date": "Sep 2022",
      "location": "Poland",
      "responsibilities": "- Designed and implemented robust RESTful APIs using **.NET** and **.NET Core** to facilitate efficient communication between microservices in a highly scalable architecture.\n- Developed and maintained applications utilizing **ASP.NET MVC** framework to ensure high performance and responsiveness in backend processing for financial services.\n- Optimized database interactions by leveraging **Entity Framework** with **PostgreSQL** for effective data management, improving query performance by up to **30%**.\n- Integrated and documented APIs using **Swagger**, allowing for seamless onboarding of front-end and mobile developers with clear guidance on API endpoints and functionalities.\n- Transitioned legacy systems to a microservices architecture, enhancing maintainability and scalability, reducing system downtime by **25%** during peak transaction periods.\n- Enhanced data security and retrieval speeds by employing **PostgreSQL** as a primary database in conjunction with effective indexing strategies, achieving a **40%** improvement in data access times.\n- Collaborated with cross-functional teams to ensure alignment on system architecture using API-first design principles, streamlining development workflows through better integration of **Firebase**.\n- Championed best practices in development, ensuring clean and maintainable code following industry standards for software development and deployment.  \n"
    },
    {
      "role": "Software Engineer",
      "company": "Timspark",
      "from_date": "Sep 2015",
      "to_date": "Aug 2019",
      "location": "UK",
      "responsibilities": "Developed and maintained robust **.NET** and **.NET Core** backend services with a focus on **Microservices** architecture, enhancing application scalability and maintainability within a high-volume e-commerce platform.\nEngineered RESTful APIs using **MVC** design patterns and documented them with **Swagger** for seamless integration with frontend applications and third-party services.\nLeveraged **Entity Framework** to streamline database interactions and optimize performance, ensuring efficient data retrieval from **PostgreSQL** under heavy traffic conditions.\nImplemented real-time data processing and API responses, resulting in a **30%** improvement in user engagement metrics through reduced latency and increased service availability.\nDesigned and executed performance monitoring strategies, leading to a **40%** decrease in downtime during peak traffic by utilizing cloud solutions and load balancing techniques.\nCollaborated closely with frontend development teams, aligning the API and architectural frameworks to deliver a consistent user experience across devices and platforms.\nFocused on enhancing code quality and maintainability through comprehensive unit and integration testing, achieving **98%** test coverage on critical backend functionalities.\nChampioned best practices in security, implementing role-based access control (RBAC) and robust API authentication methods to secure user data and maintain GDPR compliance.\nConducted system architecture reviews and code audits on a bi-weekly basis to ensure adherence to standards and continuous improvement in the delivery pipeline.\n"
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, JavaScript, TypeScript\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django, .NET, .Net Core, MVC, Entity Framework, Microservices\n\n **Frontend Frameworks:**\n\tReact, Vue, Angular\n\n **API Technologies:**\n\tAPI, Swagger\n\n **Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL), Firebase\n\n **Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:**\n\tAWS, Azure\n\n **Other:**\n\tMLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot",
  "apply_company": "LifeBonder"
}