{
  "name": "Mariusz Jan Skobel",
  "role_name": "Software Developer",
  "email": "mariuszskobel15@outlook.com",
  "phone": "+48 735 343 548",
  "address": "Katowice, Poland",
  "linkedin": "https://www.linkedin.com/in/mariusz-skobel-789557397/",
  "profile_summary": "Results-driven Software Developer with 10+ years of experience building high-performance applications, specializing in **PHP**, **OOP**, **Symfony**, **TypeScript**, **VueJS**, **Nuxt**, and **TailwindCSS**. Proficient in **AWS CDK**, **API Gateway**, and **AWS Lambda**, with extensive experience in containerization using **Docker** and implementing **CI/CD** pipelines to streamline deployment processes. Adept in Agile methodologies to foster collaboration and ensure project milestones are met on time.\n\nBrings practical experience as a Full Stack Developer with strong skills in **JavaScript/TypeScript**, **Python**, and **Flutter**, and hands-on expertise across the full stack using **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**. Proven track record in building and deploying cloud-native applications on **AWS** and **Azure**, with a robust understanding of microservices architecture and event-driven systems. Experienced in developing enterprise platforms that leverage AI/ML capabilities for real-time analytics and decision-making.\n\nAlso possesses strong Quality Assurance experience and a commitment to documentation, ensuring maintainable solutions that are compliant with industry standards. Excellent communication skills in both English and German, driving efficient teamwork and project delivery. Passionate about creating impactful solutions that enhance the user experience.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2012",
      "to_year": "2015",
      "location": "UK",
      "university": "University of Bristol"
    }
  ],
  "experience": [
    {
      "role": "Software Developer",
      "company": "EitBiz",
      "from_date": "Oct 2022",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Developed and maintained dynamic, scalable applications using **PHP**, **TypeScript**, and **Symfony**, ensuring quality through Agile methodologies and strong documentation practices.\n• Constructed responsive user interfaces using **VueJS**, **Nuxt**, and **TailwindCSS**, leading to improved user engagement and satisfaction.\n• Implemented serverless architectures leveraging **AWS Lambda**, **API Gateway**, and **AWS CDK** for deployment and management of microservices, enhancing operational efficiency by **25%**.\n• Collaborated with cross-functional teams, adopting **Docker** and CI/CD pipelines to automate development and deployment processes using Git, resulting in a **30%** reduction in time-to-market.\n• Developed native mobile applications with **Flutter**, targeting both iOS and Android platforms while ensuring high performance and reliability.\n• Conducted robust quality assurance practices using automated testing frameworks, enhancing application stability and user confidence by **20%**.\n• Engaged in effective cross-team collaboration and clear communication in both English and German to foster project success and facilitate problem-solving.\n• Championed the implementation of clean architecture and Object-Oriented Programming (OOP) principles, leading to improved code maintainability and scalability.\n• Provided peer reviews for code quality and collaborated on documentation, ensuring adherence to best practices and compliance with industry standards."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Tvn S.A.",
      "from_date": "Oct 2019",
      "to_date": "Sep 2022",
      "location": "Poland",
      "responsibilities": "• Developed robust and scalable applications using **PHP**, **OOP**, and **Symfony**, ensuring high-quality code and maintainability for complex systems.\n• Implemented dynamic, user-centered front-end applications with **VueJS** (3) and **Nuxt**, leveraging **TailwindCSS** for responsive design, resulting in a 30% increase in user engagement.\n• Designed and optimized APIs with **API Gateway** integrated with **AWS Lambda** to enhance application performance and reduce latency in service calls.\n• Utilized **Docker** for containerization, ensuring consistent deployment practices across development, testing, and production environments, resulting in 40% faster deployments.\n• Collaborated within Agile teams to manage project backlogs, deliver iterative enhancements, and maintain high standards of **Quality Assurance**, ensuring all code met the established guidelines.\n• Employed CI/CD best practices utilizing **Git** for version control, enabling automated testing and deployment pipelines, which improved delivery efficiency by 50%.\n• Demonstrated strong **English** and **German** communication skills to facilitate effective collaboration with international teams and stakeholders, ensuring smooth project delivery.\n• Participated in technical documentation efforts, providing clear and comprehensive resources to support ongoing maintenance and scalability of the application infrastructure.\n• Engaged in continuous learning and application of modern development practices, including the latest enhancements in **Typescript**, participating in peer code reviews and knowledge sharing sessions."
    },
    {
      "role": "Software Engineer",
      "company": "Timspark",
      "from_date": "Sep 2015",
      "to_date": "Aug 2019",
      "location": "UK",
      "responsibilities": "Utilized **PHP** and **Symfony** to design and optimize backend services, ensuring high availability, low latency, and scalability across key modules for the e-commerce platform.\nImplemented **OOP** principles to enhance the structure and maintainability of the codebase, delivering robust and efficient software solutions.\nDeveloped intuitive user interfaces using **VueJS** and **Nuxt**, styled with **TailwindCSS**, providing a fast and responsive user experience across devices, achieving a **20%** increase in user engagement.\nCreated and maintained **APIs** using **AWS Lambda** and **API Gateway**, resulting in **30%** faster response times for customer transactions and product queries.\nEnabled continuous integration and continuous deployment (**CI/CD**) processes using **Docker** and **Git**, leading to a reduction in deployment times by **40%** and improved team productivity.\nLeveraged **AWS CDK** for infrastructure as code, streamlining resource provisioning and management in the cloud.\nConducted thorough **Quality Assurance** testing to ensure optimal performance and compliance with project specifications, achieving a **95%** bug-free deployment rate.\nCollaborated effectively with cross-functional teams through Agile methodology, ensuring timely delivery of new features and enhancements.\nActively documented project processes and technical specifications to facilitate knowledge sharing and technical onboarding among team members.\nApplied effective communication skills in both **English** and **German** to coordinate with international teams and stakeholders, fostering a collaborative working environment."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, PHP, JavaScript, TypeScript\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django, Symfony\n\n **Frontend Frameworks:**\n\tReact, Vue, Angular, VueJS, Nuxt, TailwindCSS\n\n **API Technologies:**\n\tAPI Gateway, AWS Lambda\n\n **Serverless and Cloud Functions:**\n\tAWS Lambda\n\n **Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n **DevOps:**\n\tDocker, Kubernetes, Git, GitHub Actions, GitLab CI/CD, CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:**\n\tAWS, Azure (App Services, Blob, SQL), AWS CDK\n\n **Other:**\n\tOOP, MLflow, Airflow, Kubeflow, Agile methodology, Quality Assurance, Documentation, Collaboration, English communication, German communication"
}