{
  "name": "Rei Taro",
  "role_name": "Senior Field Engineer",
  "email": "rei515@outlook.com",
  "phone": "+48732529451",
  "address": "Warszawa, Poland",
  "linkedin": "https://www.linkedin.com/in/rei-taro-81a410391/",
  "profile_summary": "Dynamic Senior Field Engineer with over 10 years of experience in software systems and mechanical engineering, complemented by expertise in electrotechnics and mechatronics. Proficient in troubleshooting and maintaining complex systems, equipped with strong problem-solving skills to address technical challenges effectively. Exceptional communication abilities foster customer-oriented solutions and enhance collaboration with cross-functional teams. Proven track record in delivering innovative solutions that drive operational excellence and support key projects. Adept at working in fast-paced environments, demonstrating flexibility and adaptability to meet varying demands.",
  "education": [
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2010",
      "to_year": "2015",
      "location": "Japan",
      "university": "Keio University"
    }
  ],
  "experience": [
    {
      "role": "Senior Field Engineer",
      "company": "Leobit",
      "from_date": "Aug 2022",
      "to_date": "Present",
      "location": "Poland",
      "responsibilities": "Utilized strong **problem-solving** skills to troubleshoot and address complex technical issues in electrotechnics and mechatronics systems.\nDemonstrated **flexibility** in adapting to evolving project needs, effectively collaborating with cross-functional teams to implement innovative solutions.\nApplied expertise in **electrotechnics** to develop and maintain sophisticated **controllers** that enhanced system performance and reliability.\nEngaged in proactive **maintenance** practices to ensure optimal functionality of mechanical systems, minimizing downtime by up to **30%**.\nCommunicated effectively with customers to provide tailored solutions, resulting in a **15%** increase in customer satisfaction ratings.\nLed **software** integration tasks, optimizing workflows to ensure seamless operation across interfaces and endpoints, achieving a **20%** improvement in system efficiency.\n"
    },
    {
      "role": "Software Engineer",
      "company": "Innovature",
      "from_date": "Nov 2018",
      "to_date": "Jun 2022",
      "location": "Japan",
      "responsibilities": "• Collaborated with cross-functional teams to ensure effective communication and coordination in troubleshooting and maintenance tasks, achieving a **95%** customer satisfaction rate.\n• Implemented software solutions to streamline field operations, improving efficiency by **30%** through the use of **Python** and **FastAPI**.\n• Developed and integrated controllers for electrotechnics and mechatronics systems, enhancing system performance and reliability.\n• Executed preventative maintenance strategies, reducing breakdown incidents by **20%** over **12 months**.\n• Demonstrated flexibility and problem-solving skills in high-pressure environments, leading to successful project completions and improved team dynamics.\n• Provided customer-oriented support, effectively addressing technical queries and ensuring optimal user experience."
    },
    {
      "role": "Software Developer",
      "company": "Wizcorp",
      "from_date": "Apr 2015",
      "to_date": "Nov 2018",
      "location": "Japan",
      "responsibilities": "• Utilized advanced **software** skills to develop and implement backend services for trade execution, portfolio management, and account tracking, enhancing overall operational efficiency.\n• Leveraged problem-solving techniques to engineer real-time price feed processors with **asyncio**, **WebSockets**, and **Redis** for delivering up-to-the-minute trading data, significantly improving high-frequency transaction capabilities.\n• Fostered strong communication and collaboration with frontend teams to design and deliver seamless data interaction through **REST APIs** and **WebSocket** channels, ensuring minimal latency and improved user experience.\n• Ensured adherence to regulatory requirements such as **MiFID II** and **GDPR**, along with maintaining robust data security protocols, demonstrating flexibility in managing compliance. \n• Implemented thorough testing methodologies using **PyTest**, **tox**, and mock servers, which increased QA efficiency and reduced development cycles by approximately **30%**.\n• Introduced job queuing and scheduling solutions utilizing **Celery** and **RabbitMQ**, optimizing backend task execution and process management aimed at a **50%** performance improvement."
    }
  ],
  "skills": " **Programming Languages**\n\tPython (3.8+), SQL, Bash, JavaScript\n\n**Backend Frameworks**\n\tFastAPI, Flask, Django, Celery\n\n**Frontend Frameworks**\n\t\n\n**API Technologies**\n\tREST/gRPC APIs\n\n**Serverless and Cloud Functions**\n\tAWS (EC2, S3, Lambda)\n\n**Databases**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps**\n\tDocker, Kubernetes, GitHub Actions, Azure DevOps, CI/CD, PyTest, Git\n\n**Cloud & Infrastructure**\n\tAzure\n\n**Other**\n\telectrotechnics, mechatronics, mechanical engineering, software, controllers, troubleshooting, maintenance, communication, customer-oriented, flexibility, problem-solving",
  "apply_company": "Recruitment Team"
}