{
  "name": "Rei Taro",
  "role_name": "Senior Sales Engineer",
  "email": "rei515@outlook.com",
  "phone": "+48732529451",
  "address": "Warszawa, Poland",
  "linkedin": "https://www.linkedin.com/in/rei-taro-81a410391/",
  "profile_summary": "Results-driven Senior Sales Engineer with extensive experience in cybersecurity solutions, specializing in **cloud security**, **SASE**, **Proxy**, **IPS**, **DLP**, **CASB**, and **CNAPP**. Proficient in developing impactful customer engagement strategies and presenting technical solutions to diverse audiences, leveraging strong skills in **value selling** and **account planning**. Proven ability to conduct engaging demonstrations and presentations, driving success in territory planning initiatives. With over 10 years as a Senior Backend Developer, I bring a unique technical perspective, having designed and delivered backend systems, high-performing APIs, and scalable cloud-native architectures using **Python** (FastAPI, Django, Flask) and platforms like **AWS** and **Azure**. My track record includes significant contributions to projects at leading organizations such as VISA, Sii Poland, and Reply Polska, ensuring robust, secure, and efficient solutions.",
  "education": [
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2010",
      "to_year": "2015",
      "location": "Japan",
      "university": "Keio University"
    }
  ],
  "experience": [
    {
      "role": "Senior Sales Engineer",
      "company": "Leobit",
      "from_date": "Aug 2022",
      "to_date": "Present",
      "location": "Poland",
      "responsibilities": "Leveraged **cloud security** protocols to ensure secure deployments and integrate advanced security measures such as **CASB**, **IPS**, and **DLP** across cloud services.\nEngaged customers through **demonstration** and **presentation** of complex cybersecurity solutions encompassing **SASE** architectures.\nUtilized **Cybersecurity** frameworks to address client needs during **customer engagement** sessions, achieving a **30%** improvement in customer satisfaction scores.\nExecuted strategic **account planning** and **territory planning** to enhance client base by **15%** year-over-year, focusing on value-driven sales methodologies.\nConducted in-depth security assessments and recommended appropriate **Proxy** solutions to optimize client infrastructures, significantly reducing risk.\nCollaborated with cross-functional technical teams to deliver tailored solutions and resolve system integration challenges within **5%** of planned timelines.\n"
    },
    {
      "role": "Software Engineer",
      "company": "Innovature",
      "from_date": "Nov 2018",
      "to_date": "Jun 2022",
      "location": "Japan",
      "responsibilities": "Leveraged expertise in **cloud security** to demonstrate and present solutions addressing customer needs in cybersecurity, ensuring the protection of their data and infrastructure.\nEngaged with customers to understand their requirements and provided tailored **CASB**, **CNAPP**, and **DLP** solutions, enhancing their security posture and compliance.\nDeveloped territory planning strategies based on account assessments, resulting in a **30%** increase in sales opportunities in targeted areas.\nConducted presentations and demonstrations of **Proxy** and **IPS** solutions, highlighting their features and benefits, leading to a **25%** uplift in customer engagement and interest.\nCollaborated with product teams to integrate feedback from demonstrations, driving enhancements in offerings, and ensuring alignment with industry standards in **SASE**.\nProvided technical guidance and support during the sales process, facilitating a seamless transition from pre-sales activities to post-sales implementation, achieving a **15%** improvement in customer satisfaction ratings."
    },
    {
      "role": "Software Developer",
      "company": "Wizcorp",
      "from_date": "Apr 2015",
      "to_date": "Nov 2018",
      "location": "Japan",
      "responsibilities": "Focus on cybersecurity solutions that align with client needs through the following key responsibilities:\n- Demonstrated expertise in **cloud security** by presenting tailored solutions in customer engagement sessions, ensuring alignment with SASE and CASB best practices.\n- Engaged in account planning and territory planning to strategize the deployment of **Cybersecurity** measures such as IPS and DLP, contributing to a **25%** increase in client retention over **12 months**.\n- Delivered impactful presentations and demonstrations to stakeholders, utilizing advanced **proxy** technologies to showcase effective data protection strategies, achieving a **30%** rise in leads.\n- Collaborated with product teams to ensure compliance with regulatory requirements and best practices, such as GDPR, enhancing the security posture of client implementations.\n- Utilized advanced analytical tools to assess and improve cybersecurity deployments, measuring success through customer feedback mechanisms with a **90%** satisfaction rate.\n- Developed comprehensive training materials that contributed to **40+** hours of customer training on effectively utilizing cybersecurity solutions integrated with CNAPP frameworks."
    }
  ],
  "skills": "**Programming Languages**\n\tPython (3.8+), SQL, Bash, JavaScript\n\n**Backend Frameworks**\n\tFastAPI, Flask, Django, Celery\n\n**Frontend Frameworks**\n\t\n\n**API Technologies**\n\tREST/gRPC APIs, Microservices\n\n**Serverless and Cloud Functions**\n\tAWS (EC2, S3, Lambda), Azure\n\n**Databases**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps**\n\tDocker, Kubernetes, GitHub Actions, Azure DevOps, CI/CD, PyTest, Git\n\n**Cloud & Infrastructure**\n\t\n\n**Other**\n\tcloud security, SASE, Proxy, Cybersecurity, IPS, DLP, CASB, CNAPP, Value Selling, presentation, demonstration, customer engagement, account planning, territory planning, Pandas, NumPy, scikit-learn, TensorFlow, Airflow, MLflow, Kafka",
  "apply_company": "Zscaler"
}