{
  "name": "Rei Taro",
  "role_name": "Senior SAP Engineer",
  "email": "rei515@outlook.com",
  "phone": "+48732529451",
  "address": "Warszawa, Poland",
  "linkedin": "https://www.linkedin.com/in/rei-taro-81a410391/",
  "profile_summary": "Results-driven Senior SAP Engineer with over 10 years of experience in configuration, troubleshooting, and root-cause analysis within financial systems. Proficient in UK Payroll processes and implementing process improvements to enhance operational efficiency. Highly skilled in analytical problem-solving, fostering cross-functional collaboration, and communicating effectively with stakeholders to ensure project success. Successfully delivered impactful projects for leading organizations, leveraging strong technical and interpersonal skills to drive solutions.",
  "education": [
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2010",
      "to_year": "2015",
      "location": "Japan",
      "university": "Keio University"
    }
  ],
  "experience": [
    {
      "role": "Senior SAP Engineer",
      "company": "Leobit",
      "from_date": "Aug 2022",
      "to_date": "Present",
      "location": "Poland",
      "responsibilities": "Configured and maintained **SAP** systems, specifically focusing on UK Payroll processes ensuring compliance with local regulations and standards.\nConducted root-cause analysis through analytical skills to troubleshoot and resolve configuration issues, achieving a **95%** resolution rate on first attempts.\nImplemented process improvements that enhanced system performance by **30%**, leading to more efficient payroll processing.\nFacilitated cross-functional collaboration among teams to ensure smooth integration of payroll systems into existing workflows, reducing deployment time by **20%**.\nCommunicated effectively with stakeholders to gather requirements and provide updates, ensuring transparency throughout project lifecycles.\nUtilized problem-solving skills to identify and mitigate potential issues before they impacted payroll operations, enhancing overall reliability.\nLeveraged strong configuration expertise to modify SAP modules, aligning the software with business needs and improving user satisfaction ratings by **15%**."
    },
    {
      "role": "Software Engineer",
      "company": "Innovature",
      "from_date": "Nov 2018",
      "to_date": "Jun 2022",
      "location": "Japan",
      "responsibilities": "Configured and managed **SAP** systems to enhance **UK Payroll** processes, ensuring alignment with organizational requirements.\nConducted thorough troubleshooting and root-cause analysis to identify and resolve issues, resulting in a **30% reduction** in system downtime.\nLed process improvement initiatives, successfully implementing new configurations that improved payroll accuracy and efficiency by **25%**.\nCollaborated cross-functionally with HR and finance teams to ensure seamless integration of payroll systems, enhancing communication and service delivery.\nUtilized strong analytical skills to evaluate system performance, providing actionable insights that drove key decision-making processes.\nFacilitated effective communication with stakeholders, ensuring that system configurations met diverse user needs and expectations.\nDeveloped comprehensive documentation for system configurations and troubleshooting processes, contributing to knowledge sharing within the team."
    },
    {
      "role": "Software Developer",
      "company": "Wizcorp",
      "from_date": "Apr 2015",
      "to_date": "Nov 2018",
      "location": "Japan",
      "responsibilities": "Utilized **SAP** for configuration and troubleshooting of UK Payroll systems to ensure seamless payroll processing across **5** international markets.\nConducted root-cause analysis on payroll discrepancies, resulting in a **30%** reduction in processing errors and improved data accuracy.\nImplemented process improvements in payroll workflows, increasing efficiency by **25%** and enhancing cross-functional collaboration between finance and HR departments.\nEngaged in consistent communication with stakeholders to understand requirements, delivering tailored solutions that align with business objectives.\nDisplayed analytical skills by analyzing payroll data trends and identifying areas for optimization, contributing to strategic decision-making.\nSolved complex problems related to payroll systems, ensuring adherence to compliance standards and regulations.\nFostered cross-functional collaboration through regular meetings and feedback loops, facilitating a cohesive approach to system enhancements."
    }
  ],
  "skills": "**Programming Languages**\n\tPython (3.8+), SQL, Bash, JavaScript\n\n**Backend Frameworks**\n\tFastAPI, Flask, Django, Celery\n\n**API Technologies**\n\tREST/gRPC APIs, Microservices\n\n**Databases**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**Cloud & Infrastructure**\n\tAWS (EC2, S3, Lambda), Azure\n\n**DevOps**\n\tDocker, Kubernetes, GitHub Actions, Azure DevOps, CI/CD, Git\n\n**Other**\n\tAI/ML Tools: Pandas, NumPy, scikit-learn, TensorFlow, Airflow, MLflow, SAP, UK Payroll, configuration, troubleshooting, root-cause analysis, process improvement, communication, analytical skills, problem-solving, cross-functional collaboration",
  "apply_company": "Support Revolution"
}