{
  "name": "Mariusz Jan Skobel",
  "role_name": "Full Stack Engineer",
  "email": "mariuszskobel15@outlook.com",
  "phone": "+48 735 343 548",
  "address": "Katowice, Poland",
  "linkedin": "https://www.linkedin.com/in/mariusz-skobel-118083397/",
  "profile_summary": "Results-driven **Full Stack Engineer** with 10+ years of experience in developing high-performance software solutions for healthcare and finance. Proficient in **Go**, **React**, **Node.js**, and **TypeScript**, with hands-on expertise in **Kubernetes**, **AWS**, **GCP**, and **Azure** for building **cloud-native environments**. Skilled in **CI/CD** processes, **GitOps**, and **Docker**, leveraging **microservices architecture** for scalable applications. Experienced in **API design** and optimizing **cloud billing models**, including Savings Plans (SPs), Commitment Usage Discounts (CUDs), and Reserved Instances (RIs).\n\nPossess a solid background in databases such as **BigQuery**, **ClickHouse**, and **Firestore**, coupled with strong communication and collaboration skills that enhance team productivity. Proven ability to lead enterprise platforms incorporating AI/ML capabilities for real-time analytics, automation, and intelligent decision-making. Committed to developing solutions that comply with standards like HIPAA, FHIR, and PCI DSS, while focusing on secure and maintainable architectures. Passionate about impactful tech systems, supported by practical MLOps experience using tools like MLflow, Airflow, and Kubeflow.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2012",
      "to_year": "2015",
      "location": "UK",
      "university": "University of Bristol"
    }
  ],
  "experience": [
    {
      "role": "Full Stack Engineer",
      "company": "EitBiz",
      "from_date": "Oct 2022",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Designed and implemented scalable, full-stack solutions using **Go**, **TypeScript**, **Node.js**, and **React** in cloud-native environments, ensuring robust API design and adherence to industry standards.\n• Developed microservices architectures employing **Kubernetes**, **Docker**, and cloud platforms, including **AWS** and **GCP**, optimizing for high availability and resource efficiency.\n• Built and maintained CI/CD pipelines utilizing **GitOps** principles for streamlined deployments and integration processes across diverse cloud services.\n• Leveraged **Azure** and **GCP** for efficient cloud billing models, cost optimization strategies, and monitoring of Savings Plans and Reserved Instances (RIs).\n• Managed databases such as **BigQuery**, **ClickHouse**, and **Firestore** to ensure optimal data queries and storage solutions for both healthcare and financial applications.\n• Demonstrated strong **communication** and **collaboration skills** with cross-functional teams to create intuitive user interfaces, enhancing user experience in applications built with **React** (17–18) and **Node.js**.\n• Engineered and optimized microservices and applications for performance and scaling, reducing load times by up to **50%** using modern web frameworks and cloud orchestration tools.\n• Integrated advanced data analytics and visualization tools, such as **Chart.js** and **D3.js**, providing real-time insights into transaction trends and operational KPIs for end-users.\n• Established enterprise-level testing strategies using **Jest**, **Cypress**, and **Postman**, covering unit, integration, and end-to-end tests to ensure deployment robustness across front-end and back-end services.\n• Collaborated with data scientists and engineers to create pipelines facilitating machine learning model deployment, resulting in a **30%** increase in predictive capability and user engagement."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Tvn S.A.",
      "from_date": "Oct 2019",
      "to_date": "Sep 2022",
      "location": "Poland",
      "responsibilities": "- Designed and implemented cloud-native applications using **Node.js** and **React (18)**, enhancing team efficiencies by up to **30%** through optimized API design for financial platforms.\n- Developed microservices architectures utilizing **Docker** and **Kubernetes** to ensure seamless deployment cycles and facilitate CI/CD best practices, reducing deployment time by **50%**.\n- Collaborated on cross-functional teams to integrate **AWS**, **GCP**, and **Azure** cloud services, ensuring effective cloud billing models and cost optimization strategies such as Savings Plans and CUDs, managing expenses that saved the company **$100K** annually.\n- Engineered robust databases with **BigQuery** and **Firestore** for efficient data management, improving data retrieval times by up to **40%**.\n- Orchestrated event-driven systems integrating **Kafka** and **RabbitMQ**, enabling real-time data processing and alert notifications to enhance operational workflows.\n- Leveraged **TypeScript** and modern frontend frameworks including **Next.js** and **Vue 3** to create user-centric interfaces, increasing user engagement metrics significantly.\n- Ensured version control and collaborative development using **GitOps** methodologies, improving code quality and reducing integration issues by **20%**.\n- Established effective communication and collaboration practices within teams, leading to improved project delivery timelines and quality of deliverables."
    },
    {
      "role": "Software Engineer",
      "company": "Timspark",
      "from_date": "Sep 2015",
      "to_date": "Aug 2019",
      "location": "UK",
      "responsibilities": "Designed and optimized backend services leveraging **Node.js** to create scalable microservices that enhance the overall architecture for a global e-commerce platform.\nDeveloped and deployed frontend applications utilizing **React** to provide responsive user experiences, achieving a 30% reduction in page load time on both web and mobile platforms.\nImplemented CI/CD pipelines using **Docker**, enhancing deployment frequency by 40% while ensuring seamless integration and testing within **Kubernetes** environments.\nEngineered real-time features using **API design** and event-driven architecture to deliver responsive order updates, improving customer satisfaction by 25%.\nIntegrated cloud solutions with **AWS**, **GCP**, and **Azure**, optimizing cloud billing models including Savings Plans, resulting in a 15% reduction in operational costs.\nLeveraged **databases** like MongoDB, PostgreSQL, and **BigQuery** for efficient data storage and retrieval, ensuring low latency and high availability across e-commerce workflows.\nCollaborated effectively with cross-functional teams, applying strong communication skills to coordinate features and improvements, leading to a 20% increase in team productivity.\nEstablished robust security protocols using RBAC and OAuth 2.0, ensuring compliance with GDPR and enhancing user data protection across platforms.\nDeveloped cloud-native applications that utilize **microservices** architecture, supporting efficient scaling and management of resources across various cloud environments.\n"
    }
  ],
  "skills": "**Programming Languages:**\n\tPython, Go, JavaScript, TypeScript\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django, Node.js, microservices\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tAPI design\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL), GCP\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis, BigQuery, ClickHouse, Firestore\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, CI/CD, Terraform, Ansible, Helm, Docker Compose, GitOps\n\n**Cloud & Infrastructure:**\n\tcloud-native environments, cloud billing models, cost optimization, Savings Plans, CUDs, SPs, RIs\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, communication skills, collaboration skills"
}