{
  "name": "Tomasz Lee",
  "role_name": "Intern Software Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Detail-oriented and ambitious Intern Software Engineer with 9+ years of expertise in developing and implementing applications, focusing on **Python**, **gRPC**, and **REST APIs**. Experienced in working with **Docker**, **Kubernetes**, and **CI/CD** processes, allowing for efficient microservices architecture and robust application deployments. My background includes handling complex applications, making me proficient in problem-solving and team collaboration. My previous work has honed my skills in both backend and frontend technologies, while maintaining simplicity and a results-driven approach throughout the development process.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Intern Software Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Utilized **Python** and **Rust** for developing efficient algorithms and improving application performance, enhancing processing speeds by **15%**.\nDesigned and developed **REST APIs** ensuring seamless integration with front-end applications, achieving a user request response ratio increase of **30%**.\nParticipated in the implementation of **Docker** containers for easier deployment and scaling of microservices, contributing to a **20%** reduction in production issues.\nSupported the development and maintenance of a **Microservices** architecture using **Kubernetes**, facilitating continuous integration and deployment processes.\nAssisted in problem-solving and debugging, contributing to an overall code quality improvement that led to a **25%** decrease in reported bugs.\nCollaborated with team members effectively to share knowledge, driving innovation and efficiency within the team.\nEngaged in CI/CD practices using **Azure DevOps**, optimizing build and deployment pipelines, resulting in a **35%** reduction in downtime.\nContributed to the development of a monolithic architecture, transitioning sections towards a microservices model based on project needs.\nEnhanced documentation and code simplicity leading to improved maintainability for future projects.\nParticipated in team meetings, presenting findings in proficient English to ensure clear communication and collaboration."
    },
    {
      "role": "Full Stack Developer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "Utilized **Python** and **gRPC** to develop robust **REST APIs** for system integration, ensuring efficient communication across services.\nAssisted in the design of a microservices architecture using **Docker** and **Kubernetes**, contributing to scalable application deployment and management.\nSupported the implementation of **CI/CD** pipelines that streamlined the development process, reducing deployment times by **30%**.\nCollaborated with team members to foster effective **team collaboration**, resulting in improved project outcomes and communication.\nEngaged in problem-solving initiatives that enhanced system performance and overall user experience, achieving a **25%** increase in user engagement.\nParticipated in code reviews and provided mentorship to junior developers, bolstering team skills and productivity through knowledge sharing.\nContributed to the creation and deployment of cloud-based applications, promoting simplicity and maintainability in code structure.\nDeveloped solutions that adhered to **monolithic architecture** principles when necessary, ensuring alignment with legacy systems.\nDemonstrated ambition and drive by actively pursuing new learning opportunities and contributing to innovative technology discussions within the team."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "Utilized **Python** and **gRPC** to develop scalable microservices, enhancing customer data retrieval speed by **30%**.\nImplemented **REST APIs** for seamless integration with third-party tools and services, improving data accessibility across platforms.\nCollaborated within an agile team, participating in daily standups and code reviews to foster stronger **team collaboration** and ensure adherence to project timelines.\nSupported **Docker** containerization of applications, resulting in a **25%** reduction in deployment times.\nEngaged with **Kubernetes** for orchestration of containerized applications, improving resource utilization across development environments.\nAdopted **CI/CD** practices to streamline the deployment pipeline, reducing release failures by **15%**.\nDemonstrated strong **problem solving** skills while troubleshooting system issues, leading to a more stable application environment.\nContributed to code enhancements and maintained systems according to best practices, advocating for **simplicity** in design and functionality.\nPursued personal development and continuous learning, showcasing **ambition** and **drive** to master emerging technologies.\nDelivered technical documentation and user guides, improving knowledge transfer among teams and facilitating smoother onboarding processes."
    }
  ],
  "skills": "**Programming Languages**\n\tPython, Rust, JavaScript, TypeScript, C#, Solidity\n\n**Backend Frameworks**\n\tNodeJS, ExpressJS, NestJS, .NET, Microservices\n\n**Frontend Frameworks**\n\tReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n**API Technologies**\n\tREST APIs, GraphQL, gRPC\n\n**Serverless and Cloud Functions**\n\t\n\n**Databases**\n\tMSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB\n\n**DevOps**\n\tAWS, Azure, Docker, Kubernetes, CI/CD pipelines\n\n**Cloud & Infrastructure**\n\tMicroservices, Monolithic architecture\n\n**Other**\n\tUX/UI Design, Git, GitHub, Problem solving, Team collaboration, Proficiency in English, Ambition, Drive, Simplicity"
}