{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Frontend Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Senior Frontend Engineer with 13+ years of experience in **TypeScript**, **React**, and **React Native**, focusing on secure authentication solutions including **WebAuthn** and **passkeys**. Adept at cross-platform development for high-performance fintech applications, ensuring reliable performance through clean architecture principles. Committed to collaborative teamwork and clear communication to foster innovative user experiences (UX).\nAdditionally, skilled in backend development using **Node.js**, and proficient in building AI/ML-powered platforms that support predictive analytics. Experienced in deploying cloud-native systems on **AWS** and **Azure**, with a strong background in compliance-driven development aligning with standards such as HIPAA and PCI DSS.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Frontend Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Developed responsive and user-centric applications leveraging **TypeScript**, **React (17–18)**, and **React Native** to enhance the user experience in both **fintech** and healthcare domains.\n• Implemented secure authentication features utilizing **WebAuthn** and **passkeys** to ensure regulatory compliance and protect user data.\n• Ensured cross-platform development efficiency through clean architecture principles, resulting in reliable performance across mobile and web platforms.\n• Collaborated with design teams to enhance UX, delivering visually appealing and highly functional interfaces that meet user needs.\n• Engaged in collaborative teamwork to foster innovative solutions, boosting project efficiency by **30%** through enhanced communication and coordinated efforts.\n• Conducted code reviews and contributed to documentation, promoting best practices and clean code standards among team members.\n• Led training sessions to elevate team skills in **React** and modern frontend practices, significantly improving overall productivity.\n• Monitored application performance and implemented optimizations that increased load speed by **25%**, enhancing user retention rates.\n• Participated in stakeholder meetings to align technical solutions with business objectives, ensuring clear communication and project transparency.\n• Worked with agile methodologies to deliver features iteratively and efficiently, meeting project deadlines consistently."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "• Developed interactive front-end applications using **TypeScript** and **React (18)**, ensuring reliable performance and a clean architecture for financial tools and administrative panels.\n• Collaborated in a cross-functional team to enhance user experience (UX) through finely crafted user interfaces while implementing secure authentication methods such as **WebAuthn** and **passkeys**.\n• Optimized applications for **cross-platform development**, increasing accessibility and user engagement in the fintech sector by over **30%**.\n• Employed **React Native** for mobile application development, improving functionality and integration with existing services, leading to a **20%** increase in user retention.\n• Utilized design patterns and principles to maintain code quality and facilitate collaborative teamwork, resulting in a **15%** reduction in development time for new feature releases.\n• Communicated project requirements and updates clearly among team members and stakeholders, ensuring alignment and timely delivery of projects in a fast-paced environment."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Developed and maintained high-quality frontend applications using **React (18)** and **TypeScript**, ensuring reliable performance and user-friendly interfaces.\nDesigned cross-platform mobile experiences leveraging **React Native**, adhering to **clean architecture** principles to promote maintainability and scalability.\nImplemented secure authentication solutions using **WebAuthn** and **passkeys**, enhancing user security and ease of access for e-commerce solutions.\nFocused on user experience (UX) design, optimizing applications for seamless interactions and ensuring accessibility compliance (WCAG 2.1) in all developed features.\nCollaborated closely with backend developers to integrate RESTful APIs, ensuring smooth data flow and consistent performance across **fintech** related applications.\nEmphasized collaborative teamwork and clear communication within agile methodologies, improving project deliverables and timelines by **20%**.\nCreated responsive designs that adhere to mobile-first strategies, enabling superior engagement across devices and platforms.\nDelivered code reviews and mentorship to junior developers, fostering a culture of excellence and continuous improvement in coding practices across the team.\nLeveraged performance metrics and user feedback to iterate and enhance application features, achieving a **15%** increase in user satisfaction scores.\nParticipated in product ideation sessions, contributing to feature development that supports business objectives and aligns with evolving user needs."
    }
  ],
  "skills": "**Programming Languages:**\n\tPython: FastAPI, Flask, Django\n\tJavaScript/TypeScript: React, Vue, Angular\n\n**Frontend Frameworks:**\n\tReact\n\tReact Native\n\n**Backend Frameworks:**\n\tFastAPI\n\tFlask\n\tDjango\n\n**API Technologies:**\n\tWebAuthn\n\tOAuth2\n\tJWT\n\n**Authentication & Security:**\n\tKeycloak (OIDC, RBAC)\n\tsecure authentication\n\tNginx, Let’s Encrypt, Certbot\n\n**Databases:**\n\tPostgreSQL (Fintech)\n\tMySQL (Healthcare)\n\tMongoDB (Gaming)\n\tRedis\n\n**DevOps:**\n\tDocker\n\tKubernetes\n\tGitHub Actions\n\tGitLab CI/CD\n\n**Cloud & Infrastructure:**\n\tAWS: ECS, Lambda, RDS, S3\n\tAzure: App Services, Blob Storage, SQL Database\n\tTerraform, Ansible, Helm, Docker Compose\n\n**Other:**\n\tMLflow\n\tAirflow\n\tKubeflow\n\tfintech\n\tcollaborative teamwork\n\tclear communication\n\tclean architecture\n\treliable performance\n\tcross-platform development\n\tUX",
  "apply_company": "Career Renew"
}