{
  "name": "Patryk Zaslawski",
  "role_name": "Senior DevOps Engineer",
  "email": "patrykzas0428@outlook.com",
  "phone": "+48669862402",
  "address": "Gdanski, Poland",
  "linkedin": "https://www.linkedin.com/in/patryk-z-9b9455391/",
  "profile_summary": "Results-driven Senior DevOps Engineer with 8+ years of comprehensive experience in software engineering and cloud infrastructure management. Proficient in **Terraform**, **Ansible**, **Puppet**, **AWS**, **GCP**, **Azure**, and **Linux**, I excel in automating and optimizing workflows to enhance operational efficiency. Strong skills in Bash scripting and proficient in maintaining robust version control through **GIT**. Experienced in implementing and managing databases like **MySQL**, **MariaDB**, and **AWS RDS**, ensuring high availability and performance. My background in **Python** and **Ruby** allows for seamless integration of development and operations, while my understanding of **PCI-DSS** compliance and networking ensures secure system architectures. With a focus on infrastructure as code and continuous integration/deployment using **Jenkins**, I am committed to delivering scalable and reliable solutions aligned with business objectives.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2014",
      "to_year": "2017",
      "location": "United Kingdom",
      "university": "The University of Manchester"
    }
  ],
  "experience": [
    {
      "role": "Senior DevOps Engineer",
      "company": "Binary Studio",
      "from_date": "Aug 2023",
      "to_date": "Present",
      "location": "United Kingdom (Remote)",
      "responsibilities": "Executed infrastructure as code (IaC) using **Terraform** for provisioning and managing cloud resources on **AWS**, **Azure**, and **GCP**, ensuring automation and consistency across environments.\nImplemented continuous integration and continuous deployment (CI/CD) pipelines with **Jenkins**, **GitHub Actions**, and **Azure DevOps**, enhancing deployment frequency and reducing lead time for changes by **30%**.\nManaged container orchestration with **Docker** and **Kubernetes**, specifically **AKS** and **EKS**, improving application scalability and performance by facilitating **70%** faster deployment cycles.\nDeveloped automation scripts using **Python** and **Bash** to enhance operational efficiency, reducing manual efforts in deployment and configuration management by **50%**.\nConfigured and maintained **Ansible** and **Puppet** scripts for automated system configuration and management, ensuring compliance with organizational policies.\nOptimized database performance by integrating and managing relational databases like **MySQL**, **MariaDB**, and **AWS RDS**, achieving **40%** faster query responses through strategic indexing.\nEnsured robust security practices aligned with **PCI-DSS**, deploying secure networking configurations and access controls across cloud environments.\nMonitored and analyzed system performance using **Grafana** and **Prometheus**, leveraging observability to identify and resolve issues proactively, enhancing uptime by **99.9%**.\nCollaborated with development teams to integrate version control with **GIT**, streamlining code reviews and collaboration processes across a team of **10+** engineers.\nImplemented strategies for backup and disaster recovery in cloud environments, ensuring data availability and integrity under various failure conditions.\nUtilized various cloud services including **AWS Aurora**, **Cloud Spanner**, and **VMWare** to architect cloud-native solutions that meet diverse business needs and compliance standards.\nMentored junior engineers in best practices for cloud infrastructure management, focusing on **Linux** systems, scripting, and cloud technologies, fostering a culture of knowledge sharing and continuous improvement.\nConducted security assessments and compliance audits adhering to **SOC 2**, **ISO 27001**, and other regulatory frameworks, ensuring all systems were audited and secured effectively."
    },
    {
      "role": "Software Engineer",
      "company": "Ardigen",
      "from_date": "Mar 2020",
      "to_date": "Aug 2023",
      "location": "Poland",
      "responsibilities": "Implemented infrastructure as code using **Terraform**, **Ansible**, and **Puppet**, significantly improving deployment efficiency by **40%**.\nDeveloped CI/CD pipelines with **Jenkins** and integrated with **Git** for version control, enhancing release frequency by **30%**.\nManaged cloud environments on **AWS**, **GCP**, and **Azure**, achieving a cost reduction of **25%** through optimized resource allocation and management.\nAutomated provisioning and configuration of servers in **AWS RDS**, **AWS Aurora**, and **MySQL**, ensuring high availability and fault tolerance for critical applications.\nMonitored system performance and security compliance using **Linux** and internal tools, leading to a **20%** reduction in downtime incidents.\nImplemented robust networking solutions within cloud infrastructures, ensuring compliance with **PCI-DSS** and enhancing overall security posture.\nUtilized **Bash** for scripting and automation tasks, contributing to a streamlined deployment process.\nCollaborated with application teams to integrate performance monitoring tools, resulting in a **35%** improvement in performance tracking and responsiveness.\nLeveraged **VMWare** for virtualization needs, facilitating better resource utilization and scalability for development and testing environments.\nPlayed a key role in incident response and troubleshooting, utilizing **Python** and **Ruby** scripts for efficient logging and alerting mechanisms.\nEnsured collaboration between development and operations teams, fostering a culture of continuous improvement and DevOps best practices."
    },
    {
      "role": "Software Engineer",
      "company": "Altum Software",
      "from_date": "Oct 2017",
      "to_date": "Feb 2020",
      "location": "United Kingdom",
      "responsibilities": "- Designed and optimized backend services for an e-commerce platform using **Python** (FastAPI, Django, Flask, SQLAlchemy), improving scalability, performance, and user experience across checkout, cart, and order fulfillment modules.\n- Developed robust RESTful APIs in **Python** to handle high-volume transactions, ensuring seamless integration between frontend interfaces and backend systems for real-time customer interactions.\n- Leveraged **MySQL, AWS RDS,** and **MariaDB** with **Python** ORMs (SQLAlchemy, Django ORM) to design, optimize, and manage transactional databases, improving query performance and reducing latency by up to **50%**.\n- Built dynamic, responsive frontends integrated with **Python** backends using **React, Next.js, Angular,** and **Vue**, applying **Redux**/**NgRx** for modern state management and smooth user experiences.\n- Automated builds, testing, and deployments with CI/CD pipelines (**Jenkins, GitHub Actions,** **Azure DevOps**) to ensure consistent and reliable feature delivery with a deployment success rate of **99%**.\n- Containerized **Python** applications using **Docker**, streamlining deployments and enabling scalable operations across multiple environments, reducing deployment times by **35%**.\n- Worked with NoSQL databases (**MongoDB, Redis**) alongside **Python** services to store unstructured data, ensuring high availability and performance with **99.9%** uptime.\n- Wrote unit and integration tests in **Python** (PyTest, unittest) and automated frontend testing with **Selenium**, ensuring code quality and reducing manual effort by **40%**.\n- Conducted UI and E2E tests to validate functionality and performance, ensuring business alignment and user satisfaction metrics above **90%**.\n- Implemented observability in **Python** services using **Prometheus, Grafana,** and **Azure Monitor** for performance tracking, error detection, and system health monitoring.\n- Migrated legacy systems into **Python** microservices, modernizing backend systems while preserving critical business workflows, with a successful migration rate of **100%**.\n- Utilized **HTML5, CSS3, JavaScript,** and **TypeScript** to deliver responsive, interactive frontends integrated with **Python** APIs.\n- Built real-time WebSocket/AJAX-based chat functionality in **Python**, enhancing customer support with instant communication between users and agents.\n- Implemented RBAC and OAuth 2.0 in **Python** services for secure customer and admin authentication and personalized access.\n- Replaced legacy services with **Python REST/gRPC** services, ensuring reliable communication between microservices and third-party systems.\n- Performed performance testing with **Apache JMeter** and **Locust**, identifying bottlenecks and optimizing **Python** services to handle peak traffic loads, increasing capacity handling by **60%**.\n- Implemented caching strategies with **Redis** in **Python** services, reducing database load and improving response times for frequently accessed resources by up to **70%**.\n- Optimized e-commerce workflows (cart, checkout, payments) with **Python** backends, ensuring low latency and fast transaction processing.\n- Built secure payment integrations in **Python** with providers like **Stripe, PayPal,** and **Razorpay**, ensuring PCI compliant processing and order fulfillment.\n- Leveraged **RabbitMQ** and **Kafka** with **Python** microservices for event-driven architectures, handling orders, inventory updates, and shipping notifications.\n- Designed and developed SEO-optimized, mobile-friendly websites (**Next.js, Angular, Vue, React**) integrated with **Python** APIs for cross-device accessibility.\n- Conducted load and stress testing with **JMeter** and **k6**, simulating real-world traffic to validate performance and system stability."
    }
  ],
  "skills": "**Backend Frameworks:**\n\tFastAPI, Django, Flask, Spring Boot\n\n**Frontend Frameworks:**\n\tAngular (1–16), React (15–18), Next.js, Vue.js (2/3), Blazor\n\n**API Technologies:**\n\tREST & gRPC APIs\n\n**Serverless and Cloud Functions:**\n\tAWS Lambda\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MariaDB, Galera, MongoDB (Gaming), Redis, AWS RDS, AWS Aurora, Cloud Spanner\n\n**Cloud & Infrastructure:**\n\tAWS (ECS, S3), Azure (App Services, Blob, SQL), GCP, VMWare\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Puppet, Ansible, Jenkins, Bash, Linux, GIT\n\n**Other:**\n\tPython, Ruby, SQLAlchemy, Pydantic, Celery, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, Networking, PCI-DSS",
  "apply_company": "emerchantpay"
}