{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Solutions Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Results-driven Senior Solutions Engineer with over 13 years of experience in developing AI and Automation solutions for B2B SaaS applications, including CRM and ERP systems. Proficient in **AWS**, **Azure**, and **Google Cloud** deployments, leveraging **REST**, and **GraphQL** architectures to enhance performance and scalability. Demonstrated expertise in building Conversational AI applications and utilizing **NLP** for improved user interactions.\n\nSkilled in technical communication and presentation, with a proven ability to build relationships and collaborate effectively across teams. Extensive background in developing and integrating AI/ML capabilities in applications, ensuring compliance with key industry standards. Proficient in technologies including **JavaScript/TypeScript**, **Python**, **Flutter**, **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**. Committed to delivering high-performance, compliant solutions within the healthcare and financial sectors.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Solutions Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Leveraged **AWS**, **Azure**, and **Google Cloud** services to design and implement scalable solutions for clients in the B2B SaaS space, achieving a **40%** reduction in cloud infrastructure costs.\nDeveloped AI-driven applications, integrating **NLP** capabilities to enhance customer interaction through **Conversational AI** tools, resulting in a **25%** increase in user engagement.\nAutomated workflows using **RPA** technologies to streamline business processes with major ERP and CRM systems like **Salesforce** and **HubSpot**, leading to a **30%** efficiency gain.\nDesigned and built secure **REST** and **GraphQL** APIs to facilitate seamless integration between various platforms and services, improving system interoperability.\nConducted technical presentations and demonstrations to showcase solution capabilities, strengthening client relationships and driving sales conversions by **15%**.\nCollaborated with cross-functional teams to ensure alignment on project requirements and deliverables, fostering strong relationship building and collaboration throughout the development lifecycle.\nImplemented advanced automation features to enhance product offerings and improve operational workflows, adding significant value to the solutions provided.\nUtilized data visualization strategies through tools like **Power BI Embedded** to deliver insights into operational KPIs, enhancing decision-making processes for clients.\nDefined robust testing and deployment strategies to ensure high-quality solutions that meet client specifications and industry standards while maintaining strong technical communication throughout all phases of delivery."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Leveraged **Cloud** technologies including **AWS**, **Azure**, and **Google Cloud** to modernize core financial platforms through microservices architecture with **Node.js** (NestJS/Express) and **Python** (FastAPI, Django), achieving a **30% increase** in scalability and performance for high-volume transactional systems.\nUtilized **AI** and advanced **NLP** techniques in building interactive front-end applications with **React** (18), **Vue 3**, **Next.js**, and **TypeScript**, implementing **Redux Toolkit** and **Tailwind CSS** for creating sleek, responsive interfaces for financial tools and admin panels, enhancing user engagement by **25%**.\nDelivered real-time analytics dashboards using **D3.js** and **Power BI Embedded**, providing operations teams with instant insights into transactions and anomalies, resulting in a **40% reduction** in response time for transaction issues.\nDesigned and deployed a robust event-driven architecture with **Kafka**, **RabbitMQ**, and **Azure Service Bus**, ensuring asynchronous communication across critical workflows such as payments, alerts, and compliance, which improved workflow efficiency by **35%**.\nDeveloped efficient ETL pipelines for ingesting financial data from internal and third-party sources using **Python**, **Apache Airflow**, and **Azure Data Factory**, facilitating both batch and real-time data processing, handling over **1 million** transactions per day.\nBuilt and deployed machine learning models for fraud detection employing **scikit-learn**, **XGBoost**, and **Azure ML**, enabling proactive detection of suspicious activity based on user behavior and transaction patterns, improving detection rates by **20%**.\nCreated ML pipelines for real-time credit scoring, churn prediction, and transaction classification utilizing **MLflow** and Airflow, seamlessly integrating model inference into backend services, enhancing operational accuracy by **15%**."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Leveraged **AWS**, **Azure**, and **Google Cloud** to design and optimize scalable backend solutions for B2B SaaS applications, enhancing systems integration across CRM and ERP modules to improve efficiency by **25%**.\nAutomated workflows using **RPA** tools to reduce manual processes, streamlining operations and saving over **40 hours** of labor weekly.\nIntegrated AI-driven features into products, utilizing **NLP** techniques to enhance user interactions and deliver personalized experiences, increasing user engagement scores by **30%**.\nDeveloped RESTful and GraphQL APIs for seamless integration with third-party services like **Salesforce** and **HubSpot**, enhancing data flow and access across platforms.\nCollaborated with cross-functional teams to ensure optimal implementation of cloud services and automation strategies, fostering relationship building and effective communication, successfully leading **3** major projects to completion.\nConducted technical presentations to stakeholders, focusing on automation and AI capabilities, resulting in the adoption of new solutions that increased overall customer satisfaction ratings by **15%**.\nEngaged in technical communication and collaborative efforts to refine product specifications and improve service delivery both internally and externally.\n"
    }
  ],
  "skills": "**Programming Languages:**\n\tPython: FastAPI, Flask, Django\n\tJavaScript/TypeScript: React, Vue, Angular\n\n**Backend Frameworks:**\n\t\n\n**Frontend Frameworks:**\n\t\n\n**API Technologies:**\n\tREST, GraphQL\n\n**Serverless and Cloud Functions:**\n\tAWS: ECS, Lambda, RDS, S3\n\tAzure: App Services, Blob Storage, SQL Database\n\tGoogle Cloud\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare)\n\tMongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes\n\tGitHub Actions, GitLab CI/CD\n\tTerraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS, Azure, Google Cloud\n\n**Other:**\n\tAI, Automation, Conversational AI, B2B SaaS, CRM, ERP, NLP, RPA, Salesforce, HubSpot, Technical Communication, Presentation Skills, Relationship Building, Collaboration",
  "apply_company": "Enterprise Bot"
}