{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Java Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Senior Java Engineer with 13+ years of experience in full-stack development, delivering high-performance applications, particularly in the healthcare and financial sectors. Proficient in **Java**, **Spring**, **SQL**, and **NoSQL**, with a strong focus on microservices architecture. Experienced in cloud environments utilizing **AWS**, **Docker**, and **Kubernetes**, ensuring seamless deployment and scalability of applications. Strong expertise in **CI/CD** practices and unit testing to enhance code quality and deployment efficiency. Skilled in frontend technologies including **React** and **Angular**, coupled with exceptional communication skills for effective collaboration.\nAdept at implementing compliance-driven solutions aligned with standards such as HIPAA and PCI DSS. Background in developing AI/ML platforms using Python and libraries like FastAPI and Django, along with MLOps practices for model orchestration and automation.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Java Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Designed and built microservices architectures using **Java** and **Spring**, ensuring scalability and maintainability across complex applications.\nImplemented **CI/CD** pipelines utilizing **Docker** and **Kubernetes** for efficient application deployment and management, achieving deployment frequency of more than **10 releases/month**.\nDeveloped robust backend services with **SQL** and **NoSQL** databases, leading to an improvement in data retrieval performance by **30%**.\nCollaborated with cross-functional teams to document and communicate system designs and architecture, enhancing team understanding and project alignment.\nConducted thorough **unit testing** and integration testing using tools like JUnit, ensuring high code quality and reducing defect rates by **25%**.\nIntegrated frontend applications with frameworks such as **React**, providing seamless user experiences and responsive implementations.\nImproved application reliability and uptime through the application of **Docker**, leading to a **15%** increase in system availability.\nParticipated in Agile ceremonies, fostering open communication and collaboration among team members to drive project success.\nMaintained detailed technical documentation and created knowledge-sharing sessions to support ongoing development efforts and team skill enhancement."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Implemented and maintained **microservices** architecture using **Java** and **Spring**, enhancing the scalability of core financial platforms to handle over **10,000** transactions per minute.\nDeveloped containerized applications with **Docker** and deployed across **Kubernetes** clusters, ensuring efficient resource utilization and seamless scalability.\nDesigned and optimized SQL and **NoSQL** databases, improving data retrieval times by **30%** for high-volume financial applications.\nCollaborated with cross-functional teams to establish best practices for **CI/CD**, reducing deployment time by **40%** through automated pipelines and continuous integration.\nConducted **unit testing** and documentation of codebases, maintaining code quality and compliance with industry standards, leading to a **20%** reduction in bug occurrences post-deployment.\nStreamlined communication between teams to facilitate agile project methodologies, ensuring alignment on project goals and timelines, contributing to a **15%** increase in project delivery speed.\nLed efforts to modernize legacy applications to **microservices**, resulting in improved maintainability and ease of updates with a **98%** successful transition rate."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "• Developed robust backend microservices primarily using **Java** and **Spring**, ensuring high availability and reliability in a distributed environment with **Docker** for containerization.\n• Implemented CI/CD pipelines to automate testing and deployment processes, enhancing software delivery speed and minimizing manual errors.\n• Designed and maintained relational databases with **SQL** and non-relational databases with **NoSQL** options, ensuring efficient data storage and retrieval for high-demand applications.\n• Leveraged cloud services like **AWS** to deploy and scale applications, ensuring optimal performance and resource utilization.\n• Collaborated with frontend teams to build dynamic user interfaces utilizing **Angular** and **React**, ensuring responsive design and seamless integration with backend services.\n• Developed comprehensive unit tests to improve code quality and maintainability, supporting continuous integration practices and fostering a culture of testing.\n• Contributed to documentation for APIs and system architecture, facilitating knowledge sharing and onboarding of new team members.\n• Engaged in effective communication with cross-functional teams to ensure alignment on project goals and timelines, facilitating successful project delivery.\n• Participated in the design and architecture of applications deployed in **OpenShift** and **Kubernetes**, ensuring efficient orchestration of containerized applications.\n• Optimized system performance and resiliency by implementing techniques like load balancing and caching strategies using technologies like **Redis**."
    }
  ],
  "skills": " **Programming Languages:** \n\tJava, Python, JavaScript/TypeScript\n\n **Backend Frameworks:** \n\tSpring, FastAPI, Flask, Django\n\n **Frontend Frameworks:** \n\tAngular, React, Vue\n\n **API Technologies:** \n\tOAuth2, JWT, Keycloak (OIDC, RBAC)\n\n **Serverless and Cloud Functions:** \n\tAWS: Lambda, Azure: App Services\n\n **Databases:** \n\tPostgreSQL, MySQL, MongoDB, Redis, SQL, NoSQL\n\n **DevOps:** \n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:** \n\tAWS: ECS, RDS, S3, Azure: Blob Storage, SQL Database, OpenShift\n\n **Other:** \n\tMLflow, Airflow, Kubeflow, Microservices, Unit Testing, Documentation, Communication, Nginx, Let’s Encrypt, Certbot",
  "apply_company": "R Systems"
}