{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Mobile App Developer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-187801395/",
  "profile_summary": "Experienced Mobile App Developer with 13+ years in delivering high-performance applications, particularly in the healthcare and financial sectors. Specialized in **Google Flutter**, **Dart**, and proficient in **BLoC Architecture**, **Cubit**, and effective **State Management** for robust mobile app design. Highly skilled in both frontend and backend development, leveraging a strong tech stack that includes **JavaScript/TypeScript**, **Python**, **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**.\nDemonstrated ability to create AI/ML-powered platforms with predictive analytics and automation, alongside extensive experience in cloud deployment on **AWS** and **Azure**. Committed to adherence to compliance standards such as HIPAA and PCI DSS and equipped with a solid background in MLOps using **MLflow**, **Airflow**, and **Kubeflow**. A proactive communicator with a strong capacity for team collaboration and independence in remote work environments.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Mobile App Developer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Developed mobile applications for iOS and Android using **Google Flutter** and **Dart**, implementing **BLoC Architecture** and **Cubit** for effective state management and optimized mobile app design.\nExecuted UI/UX designs ensuring intuitive communication and seamless user interaction within applications, improving user engagement by **40%**.\nCollaborated remotely with cross-functional teams to enhance overall team collaboration, successfully reducing project delivery times by **20%**.\nDesigned and implemented scalable state management strategies to ensure high performance and responsiveness across various mobile devices.\nLeveraged agile methodologies to manage project timelines effectively, promoting independence and accountability within the team, leading to an average of **3 successful releases per month**.\nParticipated in code reviews and continuous integration processes to maintain the quality of code and ensure adherence to mobile app design principles.\nFacilitated communication among team members, enhancing project visibility and enabling timely feedback, improving team satisfaction scores by **30%**.\nEngaged in regular participation in team meetings and collaborative discussions to align project goals and milestones, ensuring a consistent workflow and project success."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Developed mobile applications using **Google Flutter** and **Dart**, employing **BLoC Architecture** to ensure streamlined state management and a responsive user interface for various financial services.\nImplemented efficient **Cubit** state management techniques to enhance application performance and responsiveness, resulting in a **30%** increase in user engagement.\nDesigned intuitive mobile app interfaces focusing on seamless user experience and functionality, directly contributing to a **25%** reduction in user-reported issues and enhanced customer satisfaction ratings.\nCollaborated with remote teams using tools like Slack and Zoom to maintain transparent communication and agile project management in a **100% remote work environment**.\nExercised strong team collaboration skills to support multiple development environments, leading to **5** successful app launches within **1 year**, exceeding project deadlines and expectations.\nIndependently researched and integrated best practices in mobile app design and development, focusing on scalability and maintainability of code for future enhancements.\n\n"
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Developed cross-platform mobile applications using **Google Flutter** and **Dart**, implementing **BLoC Architecture** and **Cubit** for effective state management to enhance app performance and user experience.\nApplied mobile app design principles to create intuitive and engaging UI/UX, ensuring seamless navigation and responsiveness across devices.\nCollaborated with cross-functional teams to align project goals and deliver features on time, enhancing team communication and fostering a collaborative work environment while managing remote work effectively.\nDemonstrated independence in troubleshooting and debugging apps, successfully resolving issues in **Flutter** applications and maintaining high-quality standards.\nImplemented agile methodologies for efficient project management, increasing team productivity and accelerating development cycles by 40%.\nParticipated in code reviews and contributed to knowledge-sharing sessions, boosting team collaboration and ensuring high code quality.\nSuccessfully delivered 3 major mobile applications that achieved over **100,000 downloads**, providing features like push notifications and in-app purchases that enhanced user engagement.\nConducted regular performance testing and optimization, improving app load times by **30%** and ensuring a smooth user experience.\nUtilized analytics tools to gather user feedback and iteratively improve app features based on data-driven insights, increasing user satisfaction and retention rates."
    }
  ],
  "skills": "Programming Languages:\n\tDart, Python, JavaScript/TypeScript\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular, Google Flutter\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**API Technologies:**\n\tOAuth2, JWT, Keycloak (OIDC, RBAC)\n\n**Serverless and Cloud Functions:**\n\tAWS: Lambda, Azure: App Services\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD\n\n**Cloud & Infrastructure:**\n\tAWS: ECS, RDS, S3, Azure: Blob Storage, SQL Database\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, Terraform, Ansible, Helm, Docker Compose, BLoC Architecture, Cubit, State Management, Mobile App Design, Communication, Remote Work, Team Collaboration, Independence"
}