{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Field Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Results-driven Senior Field Engineer with a robust background in installation, troubleshooting, and hardware and software support, leveraging 13+ years of experience in delivering high-performance applications. Demonstrated expertise in customer service and effective communication skills, ensuring seamless interaction with clients and stakeholders.\nSkilled in **Linux** operating systems and **networking**, adept at maintaining safety compliance and demonstrating resilience and adaptability in fast-paced environments. Proven ability to analyze and resolve complex technical issues, while fostering a culture of safety and continuous improvement.\nPossesses strong analytical skills and technical knowledge, complemented by a practical understanding of tools such as **AutoCAD**. Experience in delivering tailored solutions in diverse settings, with a commitment to excellence in engineering and client satisfaction.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Field Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Installed, maintained, and troubleshot hardware and software systems in diverse environments, ensuring optimal functionality and compliance with safety standards.\nExecuted comprehensive network installations, utilizing **Linux** for system configurations and integrating with cloud solutions to enhance connectivity and performance.\nDelivered exceptional customer service and support, effectively communicating technical solutions to non-technical stakeholders, while maintaining a focus on resilience and adaptability in challenging situations.\nConducted regular safety compliance audits to ensure that all installations adhered to industry standards and regulations.\nUtilized **AutoCAD** to design technical schematics and documentation for installations, ensuring precision and adherence to client specifications, aiming for a **100%** compliance rate.\nTrained and mentored junior engineers in troubleshooting processes and effective communication practices, fostering a collaborative team environment.\nManaged various mechanical systems' integrations and installations, contributing to a **25%** reduction in downtime through proactive maintenance and rapid response protocols.\nImplemented robust documentation and reporting practices, improving project tracking and transparency for stakeholders.\nAdapted strategies swiftly to meet unique project requirements, demonstrating a high level of flexibility and problem-solving skills in the field."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Provided exceptional **customer service** by effectively troubleshooting issues related to both **hardware** and **software**, ensuring minimal downtime and high satisfaction rates among clients.\nUtilized strong **communication** skills to collaborate with cross-functional teams, enhancing project delivery and efficiency by **30%**.\nDemonstrated **adaptability** by quickly mastering new technologies and tools, including **AutoCAD** and various **Linux** distributions, contributing to a streamlined installation process that reduced project setup times by **20%**.\nEnsured **safety compliance** during field operations, implementing best practices that resulted in a **15%** reduction in incident reports across the team.\nLeveraged **networking** skills to maintain reliable connections between field equipment and central systems, enhancing operational effectiveness and data accuracy.\nExhibited **mechanical** aptitude in diagnosing complex system failures, successfully resolving **95%** of issues on the first visit through systematic troubleshooting.\nEmphasized resilience in challenging environments, effectively managing high-pressure situations while maintaining focus on project goals and timelines."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Provided exceptional **customer service** by offering timely and effective **communication** with clients, ensuring all hardware and software issues were swiftly addressed to minimize downtime and maintain customer satisfaction.\nConducted comprehensive **troubleshooting** of intricate system installations, identifying issues in **hardware** and **software** configurations to restore optimal functionality efficiently and effectively.\nDemonstrated **resilience** and **adaptability** in high-pressure environments, effectively managing on-site challenges such as network disruptions and urgent maintenance needs, resulting in a **97%** on-time service completion rate.\nMaintained adherence to **safety compliance** with established protocols during installations and repairs, ensuring a secure working environment for both the team and clients.\nExecuted detailed assessments of mechanical and electronic systems, employing **AutoCAD** for schematic designs and layouts, which improved project visualization and communication with stakeholders.\nConfigured **Linux** operating systems for embedded hardware, improving system performance by **30%** through optimized settings and effective resource management.\nFacilitated networking solutions that increased data connectivity reliability, achieving a **25%** decrease in latency across deployed systems.\nTrained and supported junior engineers, enhancing team **resilience** and ensuring that best practices in **installation** and maintenance were adhered to across all service operations."
    }
  ],
  "skills": " **Programming Languages:** \n\tPython: FastAPI, Flask, Django, JavaScript/TypeScript: React, Vue, Angular\n\n **Backend Frameworks:** \n\t\n\n **Frontend Frameworks:** \n\t\n\n **API Technologies:** \n\t\n\n **Serverless and Cloud Functions:** \n\tAWS: ECS, Lambda, RDS, S3, Azure: App Services, Blob Storage, SQL Database\n\n **Databases:** \n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n **DevOps:** \n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:** \n\t\n\n **Other:** \n\tinstallation, hardware, software, troubleshooting, AutoCAD, Linux, networking, mechanical, customer service, communication, safety compliance, resilience, adaptability",
  "apply_company": "UVeye"
}