{
  "name": "Rei Taro",
  "role_name": "Senior Frontend Engineer",
  "email": "rei515@outlook.com",
  "phone": "+48732529451",
  "address": "Warszawa, Poland",
  "linkedin": "https://www.linkedin.com/in/rei-taro-81a410391/",
  "profile_summary": "Results-oriented Senior Frontend Engineer with over 10 years of experience in building responsive and accessible user interfaces using **React**, **Next.js**, **JavaScript**, and **TypeScript**. Skilled in crafting high-quality APIs and proficient in tools such as **Postman** for seamless integration and debugging. Strong background in product thinking, ensuring usability and design details are articulated for optimum user experience. A proactive problem solver with a keen curiosity and the ability to work autonomously, contributing to impactful projects at leading organizations. Experienced in backend development with expertise in **Python** (FastAPI, Django, Flask), and cloud services like **AWS** and **Azure**, providing a holistic approach to application development.",
  "education": [
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2010",
      "to_year": "2015",
      "location": "Japan",
      "university": "Keio University"
    }
  ],
  "experience": [
    {
      "role": "Senior Frontend Engineer",
      "company": "Leobit",
      "from_date": "Aug 2022",
      "to_date": "Present",
      "location": "Poland",
      "responsibilities": "Developed responsive user interfaces using **React** and **Next.js**, ensuring seamless user experiences across 3 major devices (desktop, tablet, mobile).\nImplemented TypeScript and JavaScript for type safety and improved maintainability in frontend applications, enhancing overall code quality by **40%**.\nUtilized **APIs** to connect with backend services, optimizing data fetching and management, resulting in a **25%** reduction in load times.\nConducted rigorous accessibility testing to ensure compliance with WCAG standards, improving usability for diverse user groups by **30%**.\nCollaborated closely with UX/UI designers to refine product features and enhancements, driving a **15%** increase in user engagement.\nEmployed debugging tools such as **Postman** for API testing and error resolution, achieving a resolution rate of **95%** on first attempt.\nFostered a culture of curiosity and autonomy within the team, encouraging ongoing learning and adoption of best practices in frontend development."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Innovature",
      "from_date": "Nov 2018",
      "to_date": "Jun 2022",
      "location": "Japan",
      "responsibilities": "Developed responsive UIs using **React** and **Next.js**, delivering high-quality application interfaces that enhance usability and accessibility for end users.\nCollaborated with cross-functional teams to design and implement APIs, ensuring seamless integration and functionality across various platforms.\nUtilized **JavaScript** and **TypeScript** to build robust frontend components that meet product requirements, improving overall application performance by **30%**.\nEmployed **Postman** for API testing and debugging, reducing response time issues by **25%** through meticulous debugging processes.\nConducted comprehensive testing and made design recommendations by applying principles of product thinking, helping to boost user engagement and satisfaction by **15%**.\nDriven by curiosity and autonomy, continuously explored new technologies and methodologies to enhance coding details and improve frontend development standards.\nDemonstrated expertise in accessibility and usability practices, ensuring compliance with industry standards and enhancing user experience across diverse audiences."
    },
    {
      "role": "Software Developer",
      "company": "Wizcorp",
      "from_date": "Apr 2015",
      "to_date": "Nov 2018",
      "location": "Japan",
      "responsibilities": "Developed responsive UI components using **React** and **Next.js**, ensuring accessibility and usability standards were met for all users.\nCollaborated closely with backend teams to seamlessly integrate trading services through **APIs** such as REST and WebSocket channels, enhancing user interaction with the platform.\nUtilized tools such as **Postman** for API testing and debugging, maintaining high quality in the development process.\nImplemented product thinking strategies to ensure design details were thoroughly considered, resulting in a user-friendly interface for **9** major features.\nConducted usability testing sessions, gathering feedback from **100+** users to iteratively improve the frontend experience.\nDemonstrated curiosity and autonomy in exploring new functionalities, contributing to the successful launch of **3** major product updates within the last **12** months.\nLed efforts to maintain compliance with regulatory standards and ensure adherence to usability best practices in the development process."
    }
  ],
  "skills": "****Programming Languages****\n\tPython (3.8+), SQL, Bash, JavaScript, TypeScript\n\n****Frontend Frameworks****\n\tReact, Next.js\n\n****Backend Frameworks****\n\tFastAPI, Flask, Django, Celery\n\n****API Technologies****\n\tREST/gRPC APIs, APIs, HTTP, Postman\n\n****Serverless and Cloud Functions****\n\tAWS (EC2, S3, Lambda), Azure\n\n****Databases****\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n****DevOps****\n\tDocker, Kubernetes, GitHub Actions, Azure DevOps, CI/CD, PyTest, Git\n\n****Cloud & Infrastructure****\n\tAWS, Azure\n\n****Other****\n\tMicroservices, Kafka, AI/ML Tools, Pandas, NumPy, scikit-learn, TensorFlow, Airflow, MLflow, Responsive UI, Accessibility, Usability, Debugging, Product Thinking, Design Details, Curiosity, Autonomy",
  "apply_company": "DualEntry"
}