{
  "name": "Tomasz Lee",
  "role_name": "Senior Analytics Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Results-driven Senior Analytics Engineer with 9+ years of experience in SQL, data modeling, data transformation, and building data pipelines. Proficient in utilizing **Azure Data Factory**, **Snowflake**, **BigQuery**, and **Looker** to create powerful reporting and dashboard solutions. Skilled in implementing KPI frameworks and workflow automation with tools like **dbt**, **Airflow**, **Talend**, and **n8n**. Proven track record of delivering insightful analytics and optimizing data workflows. Adept at leveraging **Python** and **R** for advanced data analysis. Strong collaboration skills with a history of leading cross-functional projects to successful completion. Well-versed in utilizing cloud hosting and SaaS solutions to enhance data processes.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Senior Analytics Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "• Developed data pipelines using **Azure Data Factory** and **Airflow**, enabling efficient data transformation and integration, leading to a 30% increase in data processing speed.\n• Created and optimized SQL queries and **dbt** models for robust data modeling and analytics, enhancing data accuracy by 20%.\n• Designed interactive dashboards and reports using **Looker** and **Power BI**, providing stakeholders with real-time insights and improving decision-making processes.\n• Implemented workflow automation with **Talend** and **n8n** to streamline data extraction and transformation, reducing manual effort by 50%.\n• Utilized **Snowflake** and **BigQuery** for cloud-based data warehousing, managing datasets exceeding 1 TB with efficient storage solutions.\n• Collaborated with cross-functional teams to establish KPI frameworks, ensuring alignment with business objectives and enhancing performance tracking.\n• Developed and maintained robust reporting engines to visualize key metrics and support strategic initiatives.\n• Leveraged **Python** and **R** for data analysis and transformation, resulting in impactful insights for product development.\n• Communicated effectively in **German** with team members and stakeholders, facilitating smooth collaboration in a multilingual environment.\n• Drove improvements in cloud hosting strategies and SaaS integrations, enhancing system capabilities and user experiences."
    },
    {
      "role": "Full Stack Developer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "Developed and optimized **SQL** queries for **PostgreSQL** and **MSSQL** databases, enhancing data retrieval processes and improving performance by **20%**.\nDesigned and implemented **data pipelines** using **Airflow** for automated workflows ensuring timely data updates and transformations.\nBuilt interactive reporting tools and dashboards using **Looker** and **Power BI**, increasing analytical insights for stakeholders by **30%**.\nCreated and maintained **data models** to support effective **data transformation** and enhanced decision-making, contributing to a **15%** improvement in KPI tracking.\nLeveraged **Azure Data Factory** and **dbt** for orchestrating ETL processes, ensuring efficient movement of data to **Snowflake** and **BigQuery**.\nDeveloped and implemented **workflow automation** strategies using **Talend** and **n8n**, resulting in a **25%** reduction in manual tasks and increased operational efficiency.\nCollaborated with cross-functional teams to define analytics requirements and business KPIs, ensuring alignment with project goals and successful delivery.\nMentored junior analysts on best practices in **data modeling** and reporting, leading to a more skilled and productive team environment.\nConducted thorough code reviews and facilitated training sessions to improve the overall quality of analytics deliverables.\nUtilized **Python** and **R** for advanced data analysis, providing actionable insights that supported strategic initiatives."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "• Designed and implemented data pipelines and workflows using **Azure Data Factory** and **Airflow**, enhancing data processing efficiency by **30%**.\n• Developed and maintained reports and dashboards in **Looker** and **Power BI**, providing actionable insights that improved decision-making processes for stakeholders by **25%**.\n• Leveraged **SQL** and **Snowflake** for data modeling and transformation, resulting in an increase in data retrieval speed by **15%**.\n• Collaborated with cross-functional teams to establish KPI frameworks for measuring business performance, driving projects aligned with strategic objectives.\n• Automated data workflows using **Talend** and **n8n**, reducing manual intervention and improving process reliability.\n• Supported cloud hosting and SaaS solutions to ensure scalability and accessibility for analytics processes.\n• Utilized **Python** and **R** for data analysis and transformation, enriching datasets and enhancing analytical capabilities.\n• Delivered comprehensive technical documentation and user guides for analytics tools and processes, facilitating knowledge transfer across teams.\n• Actively participated in daily standups and code reviews to align project milestones and maintain coding standards."
    }
  ],
  "skills": "**Programming Languages**\n\tPython, SQL, R\n\n**Backend Frameworks**\n\tNodeJS, ExpressJS, NestJS, C#, .NET, Entity Framework, Microservices\n\n**Frontend Frameworks**\n\tHTML, CSS, JavaScript, TypeScript, ReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n**API Technologies**\n\tRESTful API, GraphQL\n\n**Serverless and Cloud Functions**\n\tAWS, Azure, cloud hosting, Azure Data Factory\n\n**Databases**\n\tMSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB, Snowflake, BigQuery\n\n**DevOps**\n\tCI/CD pipelines, workflow automation, Talend, n8n, Make\n\n**Cloud & Infrastructure**\n\tReporting, dashboards, KPI frameworks\n\n**Other**\n\tUX/UI Design, Git, GitHub, Blockchain: Solidity, Ether.js, Web3.js, Ethereum, Apache Kafka, RabbitMQ, Redis, data modeling, data transformation, data pipelines, Power BI, Looker, German, Messaging & Caching",
  "apply_company": "Contabo"
}