{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Support Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "Results-driven Senior Support Engineer with 8 years of experience, proficient in API integration, SQL databases, and network security concepts. I possess strong technical support skills with expertise in **Python**, **JavaScript**, and server-side languages like **C#** and **PHP**. I am well-versed in using tools such as **Wireshark**, **Fiddler**, and **Charles Proxy** for troubleshooting and ensuring network security compliance. My knowledge incorporates client communication standards and frameworks, including **OAuth** and **SAML**, enhancing user authentication and authorization processes.\nIn my previous roles, I've successfully contributed to high-performance solutions across various sectors, leveraging modern technologies like **HTML**, **CSS**, **JSON**, and familiarizing myself with platforms like **Salesforce** and **SharePoint**. I am adept in using issue-tracking systems like **Jira** and can efficiently deliver technical support while collaborating with cross-functional teams. My passion for innovation drives my commitment to maintaining security standards while optimizing user experience.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Support Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Provided exceptional **Technical Support** for complex software applications, ensuring high availability and user satisfaction across support channels.\nUtilized **Jira** for efficient ticket tracking and issue resolution, achieving a ticket resolution time reduction by **30%**.\nCollaborated with cross-functional teams to troubleshoot and resolve integration issues involving **API** services and third-party tools, enhancing system interoperability and user experience.\nLeveraged **Python** and **JavaScript** for developing custom scripts to streamline support processes, effectively reducing manual effort by **25%**.\nExecuted detailed **SQL** queries to analyze database issues and provide timely resolutions, maintaining data integrity and service performance.\nMonitored network security using tools like **Wireshark** and **Fiddler**, identifying and mitigating potential security risks to protect sensitive data.\nImplemented solutions for secure authentication protocols such as **OAuth** and **SAML**, ensuring compliance with industry standards.\nProvided technical guidance on platforms including **Salesforce** and **SharePoint**, empowering end-users to maximize their productivity and software utilization.\nConducted comprehensive training sessions that improved team knowledge regarding **XML**, **JSON**, and integration methodologies, fostering a culture of continuous learning.\nEmployed **Docusign** for managing digital agreements, enhancing the efficiency of the document signing process in client solutions.\nDeveloped user-friendly documentation for troubleshooting and best practices, leading to a **20%** decrease in recurring support issues.\nAnalyzed client feedback and communications to identify recurring issues, driving improvements based on real user experiences and enhancing overall service quality."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Provided comprehensive **technical support** for complex financial software systems, ensuring API integrations aligned with business requirements and troubleshooting operational issues.\nUtilized **Python** and **JavaScript** to analyze and rectify issues in integrated services, enhancing system reliability and user satisfaction by **20%** based on feedback metrics.\nCollaborated with cross-functional teams using **Jira** to effectively manage project tasks and document support scenarios, fostering clear communication and accelerating issue resolution.\nManaged and optimized **SQL** database queries for backend services, improving data retrieval speeds by **30%** and ensuring seamless integration with reporting tools.\nExecuted security protocols including **OAuth** and **SAML** for protecting sensitive financial data, enhancing compliance adherence in line with industry standards.\nUtilized **Wireshark** and **Fiddler** to conduct in-depth network analysis and debugging, ensuring system integrity and prompt identification of performance bottlenecks.\nProvided training and developed documentation for internal teams using **SharePoint**, enhancing knowledge sharing and reducing support request volumes by **15%**.\nMaintained meticulous records of support incidents and resolutions, utilizing **JSON** formats for data structuring and reporting.\nFacilitated smooth transitions and user experiences by configuring **Windows PowerShell** scripts for batch processing and automating routine tasks."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Provided technical support and troubleshooting expertise for **API** integrations and application issues, leveraging **Python** and **JavaScript** for efficient problem resolution across multiple platforms.\nUtilized **SQL** for querying databases and diagnosing backend service performance issues, ensuring optimal uptime and responsiveness in critical workflows.\nConducted in-depth analysis and monitoring of network security using tools such as **Wireshark**, **Fiddler**, and **Charles Proxy**, enhancing system integrity and user data protection.\nCollaborated with cross-functional teams using **Jira** to track and manage issue resolution processes, maintaining transparency and communication to drive timely solutions.\nDeveloped and maintained comprehensive documentation for **API** functionalities and configurations, facilitating smoother onboarding for new team members and clients.\nImplemented role-based access control (RBAC) and **OAuth** authentication strategies to safeguard sensitive information and ensure compliance with data protection regulations, including GDPR.\nSupported external integrations with third-party services like **Salesforce** and **Docusign**, ensuring seamless data exchanges and enhancing operational workflows.\nActively engaged in creating and delivering technical communications for end-users, ensuring clarity and urgency in addressing client needs and technical queries.\nExecuted performance optimization strategies through systematic debugging and the application of monitoring tools like **Dynatrace**, resulting in a **30%** reduction in downtime for critical applications.\nFacilitated knowledge sharing sessions on secure coding practices and application maintenance procedures, contributing to a culture of continuous improvement and technical development within the team."
    }
  ],
  "skills": "API, SQL, Python, JavaScript, C#, PHP, XML, HTML, CSS, JSON, Network Security, Wireshark, Fiddler, Charles Proxy, OAuth, SAML, Salesforce, SharePoint, Windows PowerShell, Dynatrace, Jira, Docusign, Technical Support, Communications,\n\n**Programming Languages:**\n\tPython, JavaScript, C#, PHP\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular, jQuery\n\n**API Technologies:**\n\tOAuth, SAML\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS, Azure, Nginx, Let’s Encrypt, Certbot\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, Network Security",
  "apply_company": "Docusign"
}