{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Software Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-karol-kotlinski-bb2520397/",
  "profile_summary": "As a proficient Software Engineer with 8 years of expertise, I am adept in **React**, **JavaScript**, **HTML**, **CSS**, and backend development. I excel at frontend application performance profiling, optimization, and employ modern testing libraries for unit testing, component testing, and end-to-end testing. My background includes extensive collaboration across cross-functional teams, providing mentorship, and leveraging strong problem-solving abilities to drive project success. \nI am also experienced in utilizing **Python**, **Flutter**, **Node.js**, **FastAPI**, and **Django** for high-performance solutions, with a robust understanding of **microservices architecture** and **event-driven systems**. My technical proficiency spans cloud services such as **Azure** and **AWS**, allowing me to lead the development of enterprise-grade platforms. Additionally, I have hands-on experience in developing **AI/ML capabilities**, implementing **MLOps workflows** with tools like **MLflow**, **Airflow**, and **Kubeflow**, aligning applications with compliance standards including HIPAA, FHIR, PCI DSS, and SOC 2. My commitment to open-source contributions further enhances my problem-solving skills and continuous learning.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Software Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Utilized **React (17-18)**, **JavaScript**, **HTML**, and **CSS** to design and implement user-centric, high-performance web applications while ensuring optimal UI/UX.\nCollaborated cross-functionally with teams to deliver robust backend solutions and APIs, demonstrating strong problem-solving skills and mentorship capabilities.\nDeveloped comprehensive unit tests, component tests, and end-to-end testing strategies using **testing libraries** such as **Jest** and **Cypress**, ensuring code quality and reliability.\nEngineered scalable web applications with a focus on frontend application performance profiling and optimization across various devices and browsers.\nParticipated in open-source contributions, enhancing technical knowledge and collaboration with the broader software development community.\nDelivered technical presentations and facilitated discussions to improve team workflow and project outcomes, demonstrating fluent communication in English.\nProvided guidance and leadership in team projects, fostering a culture of knowledge sharing and collaboration among peers.\n\nOriginal Strengths:\n- Architected and developed scalable, full-stack healthcare and financial platforms using **TypeScript**, **Python (FastAPI)**, **Node.js**, and modern front-end frameworks including **Next.js** and **Vue (3.x)** while ensuring compliance with HIPAA, FHIR, GDPR, and financial regulatory standards (e.g., PCI DSS, **SOX**).\n- Developed and deployed cross-platform mobile applications using **Flutter** and **React Native**, demonstrating seamless integration and user experience across **iOS** and **Android** platforms.\n- Led the re-architecture of monolithic applications into microservices-based ecosystems, employing **Docker**, **Kubernetes (AKS/EKS)**, and serverless architectures such as **AWS Lambda** and **Azure Functions**.\n- Designed cloud-native data architecture using **PostgreSQL**, **MongoDB**, **Redis**, and **GraphQL**, optimizing for large-scale data ingestion and querying.\n- Developed machine learning models for use cases like patient risk prediction and financial fraud detection using **Python (scikit-learn, PyTorch, TensorFlow)**.\n- Integrated AI-based features, adding value through smart dashboards and personalized recommendations using trained models powered by **Azure ML** and **AWS Sagemaker**.\n- Established enterprise-level DevOps pipelines with **GitHub Actions**, **Azure DevOps**, and **CircleCI**, enhancing deployment efficiency for web and API services.\n"
    },
    {
      "role": "Senior Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Utilized **React** (18), **JavaScript**, **HTML**, and **CSS** to build dynamic, user-focused front-end applications, enhancing UI/UX for financial dashboards and ensuring high-performance application profiling and optimization.\nEngaged in backend development with **Node.js** (NestJS/Express) and **Python** (FastAPI, Django), successfully modernizing financial platforms and achieving a throughput improvement of **30%** in high-volume transaction systems.\nConducted thorough testing using **unit testing**, **e2e testing**, and **component testing** libraries, ensuring the reliability and robustness of applications through a comprehensive testing strategy.\nFacilitated cross-team collaboration to drive project success and established mentorship programs to elevate team skill sets and foster professional growth.\nCreated real-time transaction monitoring dashboards employing **D3.js** and **Power BI Embedded**, providing operational teams the ability to detect anomalies in financial activities with a **40%** reduction in response time.\nOrchestrated ETL pipelines using **Apache Airflow** and **Azure Data Factory**, enabling effective batch processing and real-time data ingestion of financial data with an increase in data accuracy of **95%**.\nImplemented AI/ML-powered fraud detection systems utilizing **scikit-learn** and **XGBoost**, proactively identifying suspicious transaction patterns through an analysis of user behavior and transaction data.\nContributed to enhancing machine learning pipelines for credit scoring and transaction classification integrated directly into services, optimizing model inference processes using **MLflow** and **Airflow**."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Utilized **React (18)**, **JavaScript**, **HTML5**, and **CSS3** to design responsive, SEO-friendly e-commerce user interfaces, ensuring optimized performance across web and mobile platforms.\nPerformed frontend application performance profiling and optimization, leading to a **30% improvement** in load times and user engagement for high-traffic pages.\nEngaged in cross-team collaboration, actively participating in mentorship programs and promoting knowledge sharing within the engineering team to enhance coding standards and best practices.\nDeveloped backend services leveraging **Python (Django, FastAPI)** and **Node.js (NestJS, Express)** to support scalable and efficient operations, contributing to a **99.9% uptime** for critical services.\nImplemented comprehensive testing strategies, including component, unit, and e2e testing, using industry-standard testing libraries to ensure code reliability and maintainability.\nFacilitated communication among technical teams and stakeholders, demonstrating fluent communication in English to drive project success and foster a collaborative work environment.\nApplied problem-solving skills to troubleshoot and resolve issues, enhancing application performance and user experience.\nContributed to open-source projects, showcasing commitment to continuous learning and community engagement within the software development ecosystem.\nProactively supported optimization initiatives, enhancing backend system efficiency and reducing response times significantly, resulting in improved user satisfaction.\nEmployed **Ruby** and **Go** for microservices development, extensibility, and refining backend functionality, resulting in reduced overhead and maintenance costs."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, JavaScript, JavaScript/TypeScript, Ruby, Go\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular, HTML, CSS\n\n**API Technologies:**\n\tJWT, OAuth2, Keycloak (OIDC, RBAC)\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda), Azure (App Services)\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS (RDS, S3), Azure (Blob, SQL)\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, Nginx, Certbot, e2e testing, component testing, unit testing, testing libraries, frontend application performance profiling, optimization, mentorship, problem-solving, cross-team collaboration, open-source contribution, Fluent communication in English"
}