{
  "name": "Tomasz Lee",
  "role_name": "Software Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-477994390/",
  "profile_summary": "Results-driven Software Engineer with 9+ years of experience in **Python** development and cloud services, including **GCP**, **AWS**, and **Azure**. Proficient in machine learning technologies and database management, leveraging cutting-edge solutions to deliver innovative software applications. Strong background in full-stack development with expertise in **ReactJS**, **NextJS**, and **.NET** technologies. Recognized for improving development efficiency and optimizing application performance through effective team collaboration and project leadership.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Software Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Apr 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Utilized **AWS** and **GCP** to deploy scalable cloud solutions, improving system reliability by 30%.\nDeveloped machine learning models in **Python** to enhance data analytics capabilities, achieving a prediction accuracy of **85%**.\nArchitected cloud-native applications using **Azure** services, leading to a streamlined deployment process and reduced infrastructure costs by **20%**.\nDesigned and implemented a robust database architecture for effective data storage and retrieval, leveraging **MongoDB** for flexibility and enhanced performance.\nIntegrated machine learning algorithms into existing systems, resulting in a **40%** reduction in processing time for data analysis tasks.\nCollaborated with cross-functional teams to gather requirements and deliver high-quality software solutions on time.\nImplemented **CI/CD** practices to optimize deployment workflows and enhance collaboration, reducing rollout times by **50%**.\nParticipated in code reviews and maintained best coding practices to ensure quality and maintainability of the software.\nMentored junior developers and contributed to team knowledge sharing sessions, thereby boosting team productivity and morale."
    },
    {
      "role": "Full Stack Developer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "• Developed cloud-based applications utilizing **GCP**, **AWS**, and **Azure** to optimize scalability and performance, leading to a significant enhancement in operational efficiency.\n• Integrated **Machine Learning** algorithms into existing processes, resulting in data-driven insights that increased productivity by **20%**.\n• Managed and optimized databases, including **PostgreSQL**, **MSSQL**, and **MySQL**, achieving a **30%** reduction in query response times through advanced indexing techniques.\n• Designed and implemented RESTful services in **Python**, ensuring seamless communication between the application and database layers.\n• Collaborated with cross-functional teams to identify system requirements and project timelines, ensuring on-time delivery of **90%** of projects.\n• Conducted code reviews and provided technical mentorship, fostering a culture of continuous improvement and learning among junior developers.\n• Developed and maintained interactive dashboards and reporting tools with **D3.js**, improving project visibility and stakeholder engagement.\n• Led the creation and execution of CI/CD pipelines with tools like **GitHub Actions**, resulting in a **30%** decrease in deployment errors.\n• Spearheaded the integration of caching strategies, including **Redis**, to enhance API call efficiency, improving response times by **25%**."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "Utilized **Python** for developing and deploying scalable applications on **GCP** and **AWS**, enhancing system efficiency by **30%**.\nImplemented cloud solutions in **Azure**, contributing to seamless migration and improved resource management across environments.\nApplied **Machine Learning** algorithms to analyze data patterns, leading to an increase in predictive accuracy by **25%**.\nDesigned and optimized database schemas, improving data retrieval times by **40%** within various projects.\nCollaborated with cross-functional teams to integrate new features into existing software, ensuring alignment with best practices in cloud computing.\nParticipated in code reviews and testing procedures, maintaining high coding standards across the team.\nCreated technical documentation that improved team understanding and usage of cloud-based services and frameworks.\nIntegrated third-party APIs to bolster functionality, ensuring robust and scalable software solutions.\nLed efforts in continuous integration and deployment practices to automate builds and releases in **Azure**.\nMentored junior developers on utilizing cloud architectures and machine learning techniques effectively."
    }
  ],
  "skills": "****Programming Languages****\n\tPython\n\n****Backend Frameworks****\n\tNodeJS, ExpressJS, NestJS, C#, .NET, Entity Framework, Microservices\n\n****Frontend Frameworks****\n\tHTML, CSS, JavaScript, TypeScript, ReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n****API Technologies****\n\tRESTful API, GraphQL\n\n****Serverless and Cloud Functions****\n\tAWS, Azure, GCP\n\n****Databases****\n\tMSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB\n\n****DevOps****\n\tCI/CD pipelines\n\n****Cloud & Infrastructure****\n\tAWS, Azure\n\n****Other****\n\tUX/UI Design, Git, GitHub, Redux, Apache Kafka, RabbitMQ, Redis, NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest, Solidity, Ether.js, Web3.js, Ethereum, Machine Learning"
}