{
  "name": "Tomasz Lee",
  "role_name": "Senior System Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Dynamic Senior System Engineer with 9+ years of experience in DevOps and Infrastructure as Code. Proficient in automation and orchestration using **Ansible**, with strong command of **Linux** and networking principles. Experienced in CI/CD pipelines, leveraging **GCP** for cloud solutions. Solid background in scripting with **Python** and **Go**, coupled with a working knowledge of **PHP**. Recognized for optimizing deployment processes, enhancing system performance, and effectively collaborating with cross-functional teams to deliver powerful technical solutions. Originally specialized as a .NET Full Stack Developer, showcasing diverse technical skills in **.NET**, **C#**, **ReactJS**, and **NextJS**, alongside practical experience in **microservices architecture** and messaging systems like **Apache Kafka**, **RabbitMQ**, and **Redis**.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Senior System Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "• Designed and implemented **Infrastructure as Code** solutions using **Ansible** and **Python**, ensuring repeatable and efficient deployment across environments.\n• Utilized **Linux** environments for production systems, enhancing stability and security in operational processes.\n• Developed **CI/CD** pipelines to automate testing and deployment processes on **GCP**, reducing deployment time by **40%**.\n• Managed networking configurations and optimizations in cloud environments, improving system performance by **15%**.\n• Collaborated on system architecture using **Go**, ensuring scalable and maintainable solutions.\n• Conducted performance assessments and troubleshooting of existing infrastructure, achieving a **20%** reduction in system downtime.\n• Spearheaded training sessions for team members on **DevOps** best practices, elevating the team's operational efficiency.\n• Ensured compliance and security by implementing **RHCSA** and **RHCE** standards in system management.\n• Developed scripts for automation and monitoring, reducing manual intervention by **30%** for routine tasks.\n• Contributed to the design of microservices architecture, allowing for flexible and modular application enhancements."
    },
    {
      "role": "Software Engineer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "Utilized **Python** and **Ansible** for automation in system configuration management, resulting in a **30%** reduction in setup time across environments.\nDesigned and implemented **CI/CD** pipelines leveraging **GCP** tools, enhancing deployment efficiency and reducing application downtime by **20%**.\nDeveloped infrastructure as code solutions to support dynamic deployments, promoting improved scalability and reliability of services.\nManaged Linux servers, demonstrating proficiency in **Linux**, while ensuring optimal performance and security of applications in the production environment.\nCollaborated with cross-functional teams to establish best practices for **DevOps** methodologies, incorporating effective strategies to improve system reliability.\nExecuted **Networking** protocols and configurations that increased network efficiency by **15%** while maintaining stringent security standards.\nConducted thorough performance tuning of applications developed in **Go** and **PHP**, achieving a measurable performance improvement in backend processing.\nProvided mentorship to junior engineers on **RHCSA** and **RHCE** principles, fostering team growth and enhancing technical skills.\nFacilitated regular system audits and updates in compliance with IT best practices, achieving a **100%** adherence rate in system health checks.\nDocumented operational procedures and strategies, ensuring clear communication and continuity across engineering teams."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "• Designed and implemented **Infrastructure as Code** solutions to automate the provisioning of Linux servers, enhancing deployment speed by **30%**.\n• Utilized **Ansible** to manage configuration and application deployments across multiple environments, ensuring consistency and reducing manual errors.\n• Developed automation scripts in **Python** for system monitoring and reporting, increasing operational efficiency by **25%**.\n• Collaborated with the DevOps team to establish **CI/CD** pipelines, minimizing release cycles and facilitating faster delivery of updates.\n• Engaged in networking setup and troubleshooting, improving network reliability and traffic flow management.\n• Managed cloud infrastructure on **GCP**, optimizing resource usage and cost management to achieve a savings of **15%** in monthly expenses.\n• Engaged in performance tuning and optimization of systems, contributing to an elevated uptime of **99.9%**.\n• Implemented automated tests and validation checks in deployment workflows to enhance overall system reliability.\n• Participated in incident response and root cause analysis sessions, driving continuous improvement in operational procedures. \n• Delivered comprehensive training and documentation for team members, improving knowledge retention and operational effectiveness."
    }
  ],
  "skills": "**Programming Languages**\n\tPython, Go, TypeScript, JavaScript, C#, PHP\n\n**Backend Frameworks**\n\tNodeJS, ExpressJS, NestJS, .NET, Entity Framework, Microservices\n\n**Frontend Frameworks**\n\tReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n**API Technologies**\n\tRESTful API, GraphQL\n\n**Serverless and Cloud Functions**\n\tAWS, Azure, GCP\n\n**Databases**\n\tMSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB\n\n**DevOps**\n\tCI/CD, Ansible, Linux\n\n**Cloud & Infrastructure**\n\tInfrastructure as Code, Networking, RHCSA, RHCE\n\n**Other**\n\tUX/UI Design, Git, GitHub, Blockchain: Solidity, Ether.js, Web3.js, Ethereum, Messaging & Caching: Apache Kafka, RabbitMQ, Redis, Testing Tools: NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest, Redux",
  "apply_company": "Hostinger"
}