{
  "name": "Patryk Zaslawski",
  "role_name": ".Net Developer (Foreign Trade)",
  "email": "patrykzas0428@outlook.com",
  "phone": "+48669862402",
  "address": "Gdanski, Poland",
  "linkedin": "https://www.linkedin.com/in/patryk-zaslawski-6b04a8397/",
  "profile_summary": "As a detail-oriented .NET Developer with 8+ years of experience in software engineering, I bring a strong foundation in **.NET**, **.NET Core**, and microservices architecture, specializing in designing and implementing robust RESTful APIs and SQL database solutions. Proficient in cloud environments, particularly **Azure**, I leverage **CI/CD** practices and **Docker** for streamlined deployment processes. My technical skills are complemented by expertise in **RabbitMQ** and **Kafka** for efficient message brokering and orchestration. Adept in agile methodologies, I ensure project alignment with business objectives while delivering quality results. My solid communication skills and consulting experience further enhance my capability to collaborate effectively within cross-functional teams, driving success in foreign trade projects.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2014",
      "to_year": "2017",
      "location": "United Kingdom",
      "university": "The University of Manchester"
    }
  ],
  "experience": [
    {
      "role": ".Net Developer (Foreign Trade)",
      "company": "Binary Studio",
      "from_date": "Aug 2023",
      "to_date": "Present",
      "location": "United Kingdom (Remote)",
      "responsibilities": "- Developed and maintained scalable, **.NET** and **.NET Core** applications utilizing **microservices architecture** for efficient Foreign Trade processes.\n- Designed and implemented **RESTful APIs** for seamless integration with external systems and platforms, enhancing communication and data processing efficiency.\n- Managed and optimized **SQL databases** such as Azure SQL Database and PostgreSQL, achieving data retrieval improvements of 30%.\n- Leveraged **cloud environments** on **Azure** to deploy applications, resulting in a 40% reduction in infrastructure costs.\n- Implemented CI/CD pipelines using **Git**, **Docker**, and **Kubernetes**, enabling a 50% faster deployment cycle across multiple environments.\n- Utilized message brokers such as **RabbitMQ** and **Kafka** to enable asynchronous communication between services, enhancing application responsiveness and reliability.\n- Championed agile methodologies to streamline project workflows, increasing team productivity by 25%.\n- Collaborated with cross-functional teams, sharing insights and delivering presentations to stakeholders, enhancing overall project communication.\n- Led workshops on **cloud environments** and **microservices architecture** for junior developers, significantly elevating team skill levels.\n- Participated in consulting projects where I assessed existing systems and provided recommendations for using **.NET** technologies to improve operational efficiency.\n- Applied best practices in **Docker** and **Kubernetes** to enable container orchestration, ensuring application scalability under load.\n- Integrated front-end technologies such as Angular and React with back-end services in **.NET**, leading to a 20% improvement in user experience.\n- Monitored application performance through observability tools, identifying issues and optimizing system responses to enhance overall application reliability.\n- Supported and maintained security protocols, ensuring compliance with industry standards such as SOC 2 and ISO 27001, enhancing data protection measures."
    },
    {
      "role": "Software Engineer",
      "company": "Ardigen",
      "from_date": "Mar 2020",
      "to_date": "Aug 2023",
      "location": "Poland",
      "responsibilities": "- Developed and migrated backend architecture using **.NET** and **microservices architecture**, enhancing scalability and performance by supporting over **10,000** transactions per minute.\n- Implemented and maintained **RESTful APIs** in **.NET Core** to ensure secure and reliable interaction between foreign trade applications and services.\n- Collaborated with cross-functional teams to adopt **Agile methodologies**, leading daily scrums and sprint planning sessions to improve project delivery times by **25%**.\n- Leveraged **SQL databases** including SQL Server and PostgreSQL to optimize data retrieval processes, achieving a **30%** reduction in query response times.\n- Designed and deployed applications in **cloud environments** utilizing **Azure Services**, ensuring availability and cost-effectiveness.\n- Facilitated cooperation with remote and onsite teams, applying strong **communication skills** to resolve issues and deliver software solutions efficiently.\n- Built and managed **Docker** containers to enable consistent development and production environments, reducing setup time by **40%**.\n- Orchestrated applications using **Kubernetes**, ensuring seamless deployment and management of over **15** microservices.\n- Integrated **Git** for version control, bolstering code management efficiency across collaborative projects.\n- Actively participated in designing CI/CD pipelines with **Azure DevOps** and **GitHub Actions**, improving deployment frequency by **50%** and reducing lead time for changes.\n- Developed message-driven applications using **RabbitMQ** and **Kafka**, facilitating asynchronous communication and enhancing application resilience under load.\n- Provided consulting experience in best practices for software development to enhance team capabilities and solution delivery.\n- Utilized **automated testing** frameworks to ensure software quality and reliability, streamlining the development process."
    },
    {
      "role": "Software Engineer",
      "company": "Altum Software",
      "from_date": "Oct 2017",
      "to_date": "Feb 2020",
      "location": "United Kingdom",
      "responsibilities": "Leveraged **.NET** and **.NET Core** to develop robust microservices architecture, ensuring seamless communication and integration across applications whilst handling high-volume transactions.\nDesigned and optimized **RESTful APIs** within **Azure** cloud environments to improve e-commerce transaction processes, leading to a **30%** increase in transaction efficiency.\nImplemented CI/CD practices utilizing **Git** and **Docker** to automate deployment processes, achieving a **50%** reduction in deployment time and enhancing reliability.\nDeveloped and managed SQL databases for transaction-heavy applications, ensuring data consistency and improving query performance by **40%** through optimized indexing strategies.\nFacilitated communication between microservices using messaging frameworks such as **RabbitMQ** and **Kafka**, enhancing real-time data processing capabilities and system responsiveness.\nApplied agile methodologies in collaboration with cross-functional teams, improving project delivery timelines by **25%** and fostering effective communication.\nConducted performance testing with tools such as Apache JMeter, identifying system bottlenecks and optimizing solutions to handle expected peak loads of **10,000+** concurrent users.\nEngaged with stakeholders through consulting experiences to fine-tune project requirements and expectations, providing solutions that are closely aligned with business objectives.\nContainerized applications using **Docker** and orchestrated with **Kubernetes**, enabling efficient scaling and management of services in production environments.\nUtilized **Azure** cloud services for building and deploying web applications, achieving heightened scalability and disaster recovery capabilities for critical systems.\nImproved application security by implementing secure coding practices and authentication protocols including **RBAC** and **OAuth 2.0**, ensuring compliance with industry standards."
    }
  ],
  "skills": "**Programming Languages:**\n\tPython\n\n**Backend Frameworks:**\n\tFastAPI, Django, Flask, Spring Boot, .NET, .NET Core\n\n**Frontend Frameworks:**\n\tAngular (1–16), React (15–18), Next.js, Vue.js (2/3), Blazor\n\n**API Technologies:**\n\tREST & gRPC APIs, RESTful APIs\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis, SQL databases\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, CI/CD\n\n**Cloud & Infrastructure:**\n\tcloud environments, Azure\n\n**Other:**\n\tSQLAlchemy, Pydantic, Celery, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, RabbitMQ, Kafka, agile methodologies, consulting experience, communication skills"
}