{
  "name": "Mariusz Jan Skobel",
  "role_name": "Senior GenerativeAI Engineer",
  "email": "mariuszskobel15@outlook.com",
  "phone": "+48 735 343 548",
  "address": "Katowice, Poland",
  "linkedin": "https://www.linkedin.com/in/mariusz-skobel-927764397/",
  "profile_summary": "Senior GenerativeAI Engineer with 10+ years of experience in developing high-performance software solutions, specifically in AI and ML domains. Proficient in **Python**, **TensorFlow**, **PyTorch**, and experienced in MLOps practices including model deployment and lifecycle management with **Kubeflow**, **Airflow**, and **MLflow**. Skilled in AI-driven applications utilizing technologies like **HuggingFace** and **GenerativeAIStudio** for building advanced **LLMs** and **DiffusionModels**. Expertise in CI/CD processes and version control, ensuring streamlined and scalable deployments on **Google Cloud** with services including **VertexAI**. Highly effective communicator and collaborator, with a strong commitment to mentorship and driving team success. Bringing a solid track record of integrating AI capabilities into production workflows, fostering innovation while adhering to compliance standards.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2012",
      "to_year": "2015",
      "location": "UK",
      "university": "University of Bristol"
    }
  ],
  "experience": [
    {
      "role": "Senior GenerativeAI Engineer",
      "company": "EitBiz",
      "from_date": "Oct 2022",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "•\tDesigned and implemented scalable, full-stack AI solutions leveraging **Python**, **pytorch**, **TensorFlow**, and **HuggingFace** for generative tasks in healthcare and finance, ensuring adherence to regulatory standards like HIPAA and GDPR.\n•\tBuilt ML pipelines using **MLOps** strategies with **Airflow**, integrating data quality checks, model versioning, and deployment across development and production environments, improving model turnaround time by **30%**.\n•\tIntegrated **Generative AI** features into client applications, delivering personalized recommendations and smart dashboards by utilizing **APIs** and fine-tuning large language models (LLMs) for targeted outcomes.\n•\tDeveloped and managed CI/CD pipelines through GitHub Actions and **Azure DevOps**, enhancing deployment frequencies by **25%** and ensuring seamless integration of AI services.\n•\tCollaborated with data scientists in the development of custom models using **DiffusionModels** and **OpenSourceAI** frameworks to enhance predictive analytics for patient risk and financial fraud detection, improving accuracy metrics by **15%**.\n•\tMentored junior engineers on effective **Prompt Engineering** techniques and model fine-tuning strategies to optimize AI application performance.\n•\tImplemented comprehensive testing frameworks using **PyTest** and integrated testing strategies to cover unit, integration, and E2E testing across modern front-end and back-end services.\n•\tUtilized **Kubeflow** and **Cloud Services** for managing scalable machine learning workflows in **Google Cloud** environments, enhancing resource management and orchestration of AI workloads.\n•\tConducted research on the latest trends in **AI** and **ML**, presenting findings to stakeholders and enhancing company capabilities in **AI Research** integration.\n•\tEstablished effective communication and collaboration practices within cross-functional teams, enhancing project delivery timelines and achieving high-performance standards in AI development."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Tvn S.A.",
      "from_date": "Oct 2019",
      "to_date": "Sep 2022",
      "location": "Poland",
      "responsibilities": "Designed and implemented AI/ML algorithms to enhance financial systems, leveraging **Python** and frameworks like **TensorFlow** and **PyTorch**, contributing to a **30%** improvement in fraud detection accuracy.\nCollaborated with cross-functional teams to establish CI/CD pipelines with **MLOps** practices, streamlining deployments for AI models and reducing overall deployment time by **50%**.\nLed the integration of APIs for various financial applications, allowing seamless communication between systems using **Azure** and **Google Cloud**, achieving a **40%** increase in data accessibility.\nUtilized **Apache Airflow** for orchestrating ML workflows, automating data preprocessing, and model training processes, enhancing operational efficiency.\nDeveloped and fine-tuned generative models using **HuggingFace** and custom architectures for high-quality content generation, such as transaction notifications and customer communication.\nProvided mentorship to junior engineers in AI research methodologies and effective collaboration strategies, fostering a culture of knowledge sharing and innovation.\nConstructed and maintained robust data pipelines for model training and evaluation using **Kubeflow** and **Airflow**, ensuring timely updates to analytical models with a **15%** latency improvement.\nEngaged in prompt engineering techniques to optimize model performance in real-time applications, directly impacting user experience in financial platforms."
    },
    {
      "role": "Software Engineer",
      "company": "Timspark",
      "from_date": "Sep 2015",
      "to_date": "Aug 2019",
      "location": "UK",
      "responsibilities": "Leverage **AI**, **ML**, and **GenerativeAIStudio** to develop and optimize advanced machine learning models, enhancing product personalization and search relevance for a global e-commerce platform.\nUtilize **Python** and **TensorFlow** to implement robust AI pipelines, ensuring efficient training, fine-tuning, and deployment of models, including those based on **LLMs**, **DiffusionModels**, and tools from **HuggingFace**.\nDesign and implement **CI/CD** processes for AI/ML applications, incorporating **MLOps** practices to maintain model performance and streamline updates in production environments.\nCollaborate cross-functionally with product managers and engineers to define project requirements and drive the integration of **APIs** for AI features into existing e-commerce systems.\nOptimize workflows using **Kubeflow** and **Airflow** for orchestrating data pipelines and training jobs, resulting in a **30%** reduction in model deployment time.\nMentor junior team members on best practices in **PromptEngineering** and **fine-tuning** AI models to ensure consistent performance across development cycles.\nConduct regular code reviews and contribute to **OpenSourceAI** initiatives, enhancing the company’s AI capabilities and promoting collaborative learning.\nCommunicate complex AI concepts clearly for diverse stakeholders, ensuring alignment and understanding throughout project lifecycles.\nDevelop and document best practices on model versioning using **VersionControl** tools, ensuring that all AI models maintain compliance and traceability across updates.\nImplement solutions that meet **GDPR** compliance for user data handling within AI-driven features, ensuring a secure and positive customer experience."
    }
  ],
  "skills": " **Programming Languages:** \n\tPython, JavaScript, TypeScript \n\n**Backend Frameworks:** \n\tFastAPI, Flask, Django \n\n**Frontend Frameworks:** \n\tReact, Vue, Angular \n\n**API Technologies:** \n\tAPIs, JWT, OAuth2, Keycloak (OIDC, RBAC) \n\n**Serverless and Cloud Functions:** \n\tAWS (Lambda), Google Cloud (Vertex AI), Azure (App Services) \n\n**Databases:** \n\tPostgreSQL, MySQL, MongoDB, Redis \n\n**DevOps:** \n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, CI/CD, Terraform, Ansible, Helm, Docker Compose \n\n**Cloud & Infrastructure:** \n\tAWS (ECS, RDS, S3), Azure (Blob, SQL) \n\n**Other:** \n\tMLflow, Airflow, Kubeflow, AI, ML, LLMs, Diffusion Models, Hugging Face, PyTorch, TensorFlow, MLOps, Version Control, Prompt Engineering, Fine Tuning, RAG, Generative AI Studio, Open Source AI, AI Research, Communication, Collaboration, Mentorship",
  "apply_company": "Patrianna"
}