{
  "name": "Mariusz Jan Skobel",
  "role_name": "Senior PHP Engineer",
  "email": "mariuszskobel15@outlook.com",
  "phone": "+48 735 343 548",
  "address": "Katowice, Poland",
  "linkedin": "https://www.linkedin.com/in/mariusz-skobel-927764397/",
  "profile_summary": "Senior PHP Engineer with 10+ years of experience in delivering high-performance software solutions, specializing in **PHP**, **Symfony**, and **Laravel** frameworks. Proficient in **TypeScript** and adept at building robust microservices architecture and **RESTful APIs** to ensure seamless integration and scalability. Strong understanding of Agile methodologies, enhancing collaboration and efficiency in development processes. Solid experience with version control using **Git** and message brokers such as **RabbitMQ** and **Kafka** to build reliable, event-driven systems. \nAdditionally, experienced in developing and deploying applications across full-stack environments with technologies like **JavaScript**, **Python**, **React**, **Next.js**, and **Node.js**. Proven track record in creating cloud-native applications on **Azure** and **AWS**, as well as leading the implementation of enterprise platforms integrating AI/ML for intelligent automation. Focused on delivering secure and maintainable solutions that adhere to key compliance standards. Passionate about leveraging technology to create impactful systems.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2012",
      "to_year": "2015",
      "location": "UK",
      "university": "University of Bristol"
    }
  ],
  "experience": [
    {
      "role": "Senior PHP Engineer",
      "company": "EitBiz",
      "from_date": "Oct 2022",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "•\tDeveloped and maintained web applications using **PHP** frameworks such as **Symfony** and **Laravel**, ensuring robust functionality and high performance in delivering scalable software solutions.\n•\tImplemented microservices architecture design principles and strategies, enabling seamless integration and communication through **RESTful APIs**, while contributing to continuous enhancement of services in an **Agile** environment.\n•\tUtilized **TypeScript** for improving the robustness and maintainability of applications, ensuring type safety and enhancing developer experience.\n•\tManaged message queues and stream processing using **RabbitMQ** and **Kafka** for real-time data processing and effective communication between microservices.\n•\tCollaborated with cross-functional teams to deliver innovative features and improvements, following Agile methodologies to ensure timely delivery and effective project management.\n•\tIntegrated version control systems like **Git** for managing and tracking code changes, enhancing collaboration and code quality across development teams.\n•\tDesigned and executed comprehensive testing strategies including unit tests, integration tests, and end-to-end tests for various application components, utilizing tools such as Jest, Cypress, and Postman.\n•\tParticipated in code reviews and technical discussions, fostering a culture of knowledge sharing and continuous improvement within the engineering team."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Tvn S.A.",
      "from_date": "Oct 2019",
      "to_date": "Sep 2022",
      "location": "Poland",
      "responsibilities": "Developed and maintained scalable applications using **PHP** frameworks such as **Symfony** and **Laravel**, ensuring high performance and reliability in a microservices architecture.\nCollaborated with cross-functional teams in an **Agile** environment to deliver features that enhanced user experience and functionality, focusing on **RESTful APIs** integration.\nUtilized **Git** for version control, streamlining development processes and maintaining code quality through structured collaboration.\nDesigned and implemented message-driven architectures using **RabbitMQ** and **Kafka** to facilitate efficient data processing and asynchronous communication across services.\nEnhanced application performance by integrating TypeScript to develop clean, maintainable codebases while building robust APIs and services.\nDrove the adoption of **Microservices** architecture, resulting in a **30%** increase in deployment speed and system scalability.\nImplemented unit and integration testing with a **95%** coverage rate, ensuring the reliability and stability of core functionalities.\nMentored junior developers on best practices for PHP development and contributed to the continuous improvement of coding standards and practices."
    },
    {
      "role": "Software Engineer",
      "company": "Timspark",
      "from_date": "Sep 2015",
      "to_date": "Aug 2019",
      "location": "UK",
      "responsibilities": "Utilized **PHP** frameworks such as **Symfony** and **Laravel** to design and optimize backend services for a global e-commerce platform, ensuring high scalability and reliability.\nImplemented **RESTful APIs** to serve as the backbone for microservices architecture, enabling seamless communication between system components.\nManaged source control and versioning through **Git**, fostering an efficient development environment and collaborative workflows.\nDeveloped real-time messaging features using **RabbitMQ** and **Kafka**, facilitating instant order updates and dynamic inventory management across the platform.\nSpearheaded Agile project methodologies, continuously iterating on features and improvements to streamline e-commerce operations and enhance user satisfaction by **20%**.\nCrafted high-quality frontend applications using **TypeScript**, enhancing application robustness and reducing runtime errors during deployments by **15%**.\nIntegrated with caching systems to optimize database queries and improve response times, achieving a **30%** reduction in latency during high traffic periods.\nBuilt secure and efficient microservices that support transactions and payment processing while ensuring service availability at **99.9%** uptime.\nCollaborated with cross-functional teams to deliver user-centric solutions, improving the overall architecture and code quality through consistent code reviews and testing.\nEmphasized documentation and code maintainability in every phase of the software development lifecycle (SDLC) to facilitate onboarding and knowledge transfer."
    }
  ],
  "skills": " **Programming Languages:**\n\tPHP, Python, JavaScript, TypeScript\n\n**Backend Frameworks:**\n\tSymfony, Laravel, FastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tRESTful APIs, RabbitMQ, Kafka\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS, Azure\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, Keycloak, JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, Microservices, Agile",
  "apply_company": "intive"
}