{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Presales Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-152840397/",
  "profile_summary": "Experienced in **cloud services** and **data integration**, I bring 8 years of expertise in analytics and solution consulting to the role of Senior Presales Engineer. I have a proven track record in enterprise software sales, pre-sales engineering, and C-level engagement, effectively communicating technical discoveries and crafting compelling proof of concepts. My technical acumen is complemented by hands-on experience with **Azure** and **AWS**, and expertise in utilizing tools such as **Minitab Statistical Software** and **Minitab Connect** for advanced analytics solutions. \nIn my previous roles, I successfully developed high-performance solutions in the healthcare and financial sectors using a comprehensive tech stack that includes **JavaScript**, **TypeScript**, **Python**, **React**, **Next.js**, **Node.js**, **FastAPI**, and **Django**. Furthermore, I am adept at leading enterprise-grade platforms that harness AI/ML capabilities for predictive analytics and real-time data processing, while ensuring compliance with industry standards such as HIPAA, FHIR, PCI DSS, and SOC 2.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Presales Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Engaged in **solution consulting** to provide tailored solutions integrating **cloud** services and **data integration** methodologies for healthcare and financial industries, enhancing client relationships and driving early-stage project success.\n- Conducted technical discovery sessions with clients, delivering comprehensive presentations on enterprise software capabilities and integration strategies, utilizing tools like **Minitab Statistical Software** and **Minitab Connect** for advanced analytics.\n- Collaborated closely with clients to define requirements and create proof of concept (PoC) implementations that demonstrate full-stack capabilities across **cloud** platforms, resulting in a **30%** increase in project approval rates.\n- Developed and presented customized analytics solutions that leverage data visualization libraries such as **D3.js** and **Chart.js**, enhancing decision-making capabilities and operational insights for C-level executives.\n- Led strategic **account planning** sessions, focusing on the presentation of value propositions that align technical solutions with client business objectives, driving a **25%** growth in new client acquisitions.\n- Established strong communications with stakeholders, ensuring seamless transitions between pre-sales and project delivery phases, while maintaining a **90%** client satisfaction score through effective engagement techniques.\n- Provided guidance on integrating advanced analytics tools to optimize data usage, improving operational efficiency by leveraging **cloud** resources effectively.\n- Engaged in high-level conversations with C-level executives, showcasing the benefits of proposed solutions through clear technical differentiators and data-driven insights.\n- Managed end-to-end technical implementations for clients, leading presentations that detail architecture and integration processes while ensuring alignment with enterprise standards and compliance requirements."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Conducted solution consulting sessions to understand client requirements, aligning them with cloud strategies and ensuring optimal data integration for effective financial analytics.\nEngaged in pre-sales engineering, delivering compelling presentations to C-level executives to showcase the advantages of implementing advanced analytics solutions and technologies such as **Power BI Embedded** and **Azure Data Factory**.\nLed the technical discovery process, collaborating closely with stakeholders to identify business challenges and present tailored solutions involving **Node.js**, **Python**, and **React**.\nDeveloped proof of concept demonstrations for various financial platforms, utilizing **Kafka**, **RabbitMQ**, and **Azure Service Bus** to illustrate event-driven architecture capabilities.\nOrchestrated account planning sessions to strategize the deployment of enterprise software solutions, incorporating user feedback to enhance product effectiveness and client satisfaction.\nUtilized **Minitab Statistical Software** and **Minitab Connect** to analyze data trends and provide actionable insights which enhanced decision-making processes at the enterprise level.\nProvided comprehensive training on analytics tools and data integration techniques, ensuring smooth implementation and maximizing operational efficiency for clients managing high-volume transactions."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Engaged in **enterprise software sales** and **solution consulting**, identifying client needs and crafting tailored solutions that leverage cloud technologies to enhance operational efficiency.\nConducted **technical discovery** sessions to gather **data integration** and **analytics** requirements, facilitating the transition of recommendations into actionable insights for prospective clients.\nPresented compelling product demonstrations and proof of concept (PoC) implementations, showcasing how our cloud solutions can drive business value and solve complex challenges.\nDeveloped robust presentations tailored for **C-level engagement**, effectively communicating product benefits, technical nuances, and strategic alignment with client goals.\nCollaborated with cross-functional teams to align client feedback with product development pipelines, ensuring solutions meet **customer requirements** and adhere to industry standards.\nPlayed a pivotal role in account planning strategies, defining key metrics for success and sharing best practices for client account management and growth.\nUtilized **Minitab Statistical Software** and **Minitab Connect** for conducting in-depth analysis to support client presentations and drive data-informed decision-making, resulting in improved client satisfaction by over **30%**.\nMaintained open lines of communication with stakeholders, ensuring transparent updates on projects and fostering long-term relationships with clients.\nLeveraged knowledge of cloud services to consult on integrations, resulting in a **20%** increase in system performance across multiple client implementations."
    }
  ],
  "skills": "Cloud & Infrastructure:\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL), cloud\n\nProgramming Languages:\n\tPython(FastAPI, Flask, Django), JavaScript/TypeScript (React, Vue, Angular)\n\nBackend Frameworks:\n\tFastAPI, Flask, Django\n\nFrontend Frameworks:\n\tReact, Vue, Angular\n\nAPI Technologies:\n\tJWT, OAuth2, Keycloak (OIDC, RBAC)\n\nDatabases:\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\nDevOps:\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\nOther:\n\tMinitab Statistical Software, Minitab Connect, data integration, analytics, solution consulting, enterprise software sales, pre-sales engineering, presentation, account planning, communications, technical discovery, proof of concept, C-level engagement",
  "apply_company": "Minitab"
}