{
  "name": "Tomasz Lee",
  "role_name": "Senior Mobile Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Dynamic Senior Mobile Engineer with 9+ years of experience in developing high-quality applications using **Xamarin**, **C#**, and **.NET** frameworks. Proficient in agile methodologies and CI/CD practices, ensuring efficient delivery and seamless integration of mobile solutions. Demonstrated expertise in collaboration, communication, and problem-solving to lead cross-functional teams and drive successful project outcomes. Adept at leveraging version control systems like **Git** and applying the MVVM design pattern to build maintainable and scalable applications. Proven track record in streamlining processes and optimizing application performance.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Senior Mobile Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Utilized **Xamarin** for cross-platform mobile application development, enhancing app accessibility across multiple devices.\nDeveloped mobile applications using **C#** and **.NET** framework, delivering efficient and high-performance solutions.\nImplemented **Git** for version control, ensuring smooth collaboration within a team setting and maintaining code integrity.\nLed Agile project management practices to enhance team communication and collaboration efforts, resulting in a 30% increase in project delivery speed.\nDesigned and executed **CI/CD** pipelines, streamlining deployment processes by 40% and reducing software delivery risks.\nApplied the MVVM design pattern to improve code maintainability and testability, achieving a modular code structure and reduced iteration times.\nDemonstrated exceptional problem-solving skills by troubleshooting complex issues, decreasing bug resolution time by 50%.\nFostered strong communication channels within the development team and stakeholders to ensure project alignment and successful delivery.\nContributed to team efforts by mentoring junior developers, facilitating knowledge sharing and skill advancement within the team."
    },
    {
      "role": "Software Engineer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "● Leveraged **Xamarin** and **C#** to design and develop mobile applications, resulting in a 20% increase in mobile user retention.\n● Utilized **.NET** Core for backend services to enhance application performance and scalability, achieving a 30% faster response time.\n● Implemented **Git** for version control and agile methodologies to streamline the development process and improve project timelines.\n● Led CI/CD initiatives using **GitHub Actions**, reducing deployment errors by 30% and accelerating release cycles by 25%.\n● Applied **MVVM** design principles to create responsive and maintainable UI components.\n● Fostered a collaborative work environment through effective **communication** and **problem-solving**, leading to improved team dynamics and project outcomes.\n● Developed and maintained application features using agile methodologies, contributing to successful sprint deliveries of 2-week intervals.\n● Mentored junior developers, increasing team productivity and facilitating knowledge sharing sessions.\n● Actively participated in stakeholder meetings to define project scope and collaborate on requirements, ensuring alignment with business objectives.\n● Conducted thorough code reviews, enhancing code quality and adherence to best practices across the team."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "Utilized **Xamarin** and **C#** to develop cross-platform mobile applications, enhancing user reach by **30%**.\nImplemented **MVVM** architecture in mobile projects, improving maintainability and scalability of the codebase.\nEmployed **Git** for version control and collaboration, ensuring seamless coordination in an **Agile** development environment.\nLeveraged **CI/CD** pipelines to automate testing and deployment processes, reducing release cycles by **25%**.\nCollaborated with cross-functional teams to resolve complex technical challenges, ensuring project objectives were met effectively.\nContributed to system architecture discussions, advocating best practices that improved overall software quality.\nCreated and maintained documentation for applications, facilitating knowledge sharing and onboarding of new team members.\nParticipated actively in code reviews and sprint retrospectives to foster a culture of continuous improvement.\n\nEmphasized problem-solving skills to troubleshoot existing applications, addressing issues in a timely manner and minimizing downtime.\nMaintained strong communication with stakeholders to align project goals with user needs and expectations."
    }
  ],
  "skills": "**Frontend Frameworks:**\n\tHTML, CSS, JavaScript, TypeScript, ReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n**Backend Frameworks:**\n\tNodeJS, ExpressJS, NestJS, C#, .NET, Entity Framework, Microservices\n\n**Databases:**\n\tMSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB\n\n**API Technologies:**\n\tRESTful API, GraphQL\n\n**Cloud & Infrastructure:**\n\tAWS, Azure\n\n**DevOps:**\n\tCI/CD pipelines\n\n**Messaging & Caching:**\n\tApache Kafka, RabbitMQ, Redis\n\n**Other:**\n\tUX/UI Design, Git, GitHub, Python, Redux, Agile, MVVM, Problem-solving, Communication, Collaboration, Blockchain: Solidity, Ether.js, Web3.js, Ethereum, Testing Tools: NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest",
  "apply_company": "AMCS Group"
}