{
  "name": "Patryk Zaslawski",
  "role_name": "Senior Software Engineer",
  "email": "patrykzas0428@outlook.com",
  "phone": "+48669862402",
  "address": "Gdanski, Poland",
  "linkedin": "https://www.linkedin.com/in/patryk-z-9b9455391/",
  "profile_summary": "As a results-driven Senior Software Engineer with 8+ years of extensive experience in software development, I excel in designing and implementing modern, high-performance solutions using **Golang**, **Node.js**, and **TypeScript**. I possess a strong proficiency in building and optimizing microservices architectures and REST/gRPC APIs, ensuring scalable and robust applications. My technical toolkit includes **Redis**, **ClickHouse**, and **MongoDB** for efficient data storage and retrieval, while I'm adept at deploying and managing applications using **Docker** and **Kubernetes**. Additionally, I utilize **GitHub Actions** for CI/CD pipelines and monitor application performance with tools such as **Prometheus** and **Grafana**. My foundational skills in **Python** (FastAPI, Django, Flask), **PostgreSQL**, and various frontend frameworks like **Vue3** complement my ability to deliver comprehensive solutions across diverse sectors, including e-commerce and healthcare. I am committed to leveraging industry best practices to provide secure and reliable technology solutions.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2014",
      "to_year": "2017",
      "location": "United Kingdom",
      "university": "The University of Manchester"
    }
  ],
  "experience": [
    {
      "role": "Senior Software Engineer",
      "company": "Binary Studio",
      "from_date": "Aug 2023",
      "to_date": "Present",
      "location": "United Kingdom (Remote)",
      "responsibilities": "• Developed and maintained scalable applications using **Golang** and **Node.js**, ensuring high performance and reliability in production environments.\n• Designed RESTful and gRPC APIs to support communication between **microservices**, enhancing system modularity and adaptability to changing requirements.\n• Implemented real-time data processing with **Kafka**, optimizing ETL operations for data ingestion and transformation metrics.\n• Utilized **Redis** and **MongoDB** for efficient caching and storage solutions, achieving up to **30%** reduction in query response times.\n• Led containerization efforts using **Docker** and orchestrated deployments with **Kubernetes**, achieving seamless scalability and fault tolerance across services.\n• Utilized **GitHub Actions** for CI/CD, ensuring streamlined deployment processes, automated testing, and quicker release cycles.\n• Enhanced application security using **Nginx** for load balancing and configured SSL with **Certbot**, improving application uptime by **20%**.\n• Employed **Ubuntu** for deployment and server management, enabling consistent environment setups and reducing time spent on system configuration.\n• Automated server management tasks using **Bash** and **PM2**, optimizing performance and resource utilization on production servers.\n• Contributed to the development of a **microservices** architecture that improved team agility and allowed for independent deployments, supporting a cross-functional team of 10 engineers.\n• Mentored junior developers on best practices in **TypeScript** and leading edge technologies, fostering a collaborative and learning-driven environment.\n• Monitored application performance and availability using **Prometheus** and **Grafana**, enabling proactive issue identification and resolution.\n• Designed and built logging frameworks integrated with real-time dashboards providing insights into system performance, leading to data-driven decision-making processes.\n• Worked on improving application scalability to support a user base growth of **50%** within a year while maintaining performance. \n• Established a robust testing framework in **TypeScript**, ensuring releases are reliable and meet high-quality standards, reducing bug occurrences in production by **40%**."
    },
    {
      "role": "Software Engineer",
      "company": "Ardigen",
      "from_date": "Mar 2020",
      "to_date": "Aug 2023",
      "location": "Poland",
      "responsibilities": "• Developed and maintained microservices using **Golang** and **Node.js**, enhancing scalability and performance in cloud-native environments.\n• Implemented robust caching strategies with **Redis** to optimize data retrieval and reduce response time by **30%**.\n• Designed and built RESTful and gRPC APIs in line with best practices, ensuring high availability and reliability across microservices.\n• Led the deployment and management of Kubernetes clusters for containerized applications, enabling efficient orchestration, auto-scaling, and monitoring.\n• Utilized **ClickHouse** for high-performance data analytics, improving query execution time by **40%** compared to traditional databases.\n• Developed and integrated front-end applications using **Vue3**, ensuring seamless user experiences with responsive design principles.\n• Created ETL pipelines using **Bash** and **TypeScript**, facilitating the transformation and loading of data into structured formats for reporting.\n• Maintained full version control and CI/CD processes with **GitHub Actions**, automating build, test, and deployment cycles for reliable software delivery.\n• Configured and managed **Nginx** and **Certbot** for secure and efficient service deployment, improving application security with SSL encryption.\n• Integrated monitoring solutions utilizing **Prometheus** and **Grafana**, enabling real-time system performance tracking and alerting.\n• Built and enhanced logging systems within microservices using **Docker** for containerization, ensuring accountability and traceability of system events.\n• Developed automated testing frameworks with the latest tools to maintain software quality and enforce standards across the codebase.\n• Executed legacy system migrations ensuring data consistency and seamless upgrades without business interruptions.\n• Fostered collaboration in a cross-functional team environment to drive project success, adhering to agile methodologies for continuous improvement."
    },
    {
      "role": "Software Engineer",
      "company": "Altum Software",
      "from_date": "Oct 2017",
      "to_date": "Feb 2020",
      "location": "United Kingdom",
      "responsibilities": "Designed and optimized backend services using **Golang** and **Node.js**, enhancing system performance and scalability for e-commerce applications by **15%**.\nDeveloped and maintained robust **REST**ful APIs and **gRPC** services to facilitate high-volume transactions, ensuring real-time customer interactions with a **95%** uptime.\nUtilized **Redis** for caching strategies and session management, reducing database load and improving response times by **30%** for frequently accessed resources.\nImplemented event-driven architectures using **Kafka** to handle asynchronous processes such as order fulfillment and inventory updates, enhancing system responsiveness and agility.\nContainerized applications using **Docker** and orchestrated deployments with **Kubernetes**, enabling seamless CI/CD pipelines via **GitHub Actions** for consistent and reliable software delivery.\nIntegrated monitoring and observability tools such as **Prometheus** and **Grafana** for tracking application performance and system health, significantly improving issue detection and response times.\nPerformed rigorous load and stress testing with **JMeter** and **k6**, ensuring the system can withstand peak traffic loads of **2000+** concurrent users efficiently.\nDesigned microservices architectures that improved modularity and maintainability of applications, facilitating more agile development practices and reducing time-to-market by **20%**.\nAutomated server management and deployment processes using **PM2**, ensuring a robust and resilient production environment.\nConfigured Nginx as a reverse proxy for high availability and load balancing, optimizing web application performance under variable traffic loads.\nLeveraged **MongoDB** and **MySQL** for database solutions to manage both structured and unstructured data, ensuring efficient data retrieval and storage.\nUtilized **Bash** scripting for automating routine tasks and improving overall development workflow efficiency.\nDeveloped interactive frontends using **Vue3** and **TypeScript** for optimal user engagement and experience, ensuring responsive design across devices.\nEmployed **ClickHouse** for real-time analytics and reporting, allowing the business to make data-driven decisions swiftly.\nImplemented secure communication protocols and best practices to ensure data protection and user authentication across all services."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, Golang, Node.js, TypeScript, Bash\n\n**Backend Frameworks:**\n\tFastAPI, Django, Flask, Spring Boot, Microservices\n\n**Frontend Frameworks:**\n\tAngular (1–16), React (15–18), Next.js, Vue.js (2/3), Vue3, Blazor\n\n**API Technologies:**\n\tREST, gRPC, OpenRTB\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis, ClickHouse\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, PM2, Prometheus, Grafana\n\n**Cloud & Infrastructure:**\n\tUbuntu, Nginx, Certbot\n\n**Other:**\n\tSQLAlchemy, Pydantic, Celery, JWT, OAuth2, Let’s Encrypt",
  "apply_company": "Luna Media"
}