{
  "name": "Tomasz Lee",
  "role_name": "Senior Software Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Results-driven Senior Software Engineer with 9+ years of extensive experience in developing scalable applications using **Kotlin**, **Spring Boot**, and **Event-Driven Architecture**. Proficient in designing and deploying solutions that leverage **Cloud Infrastructure** and **Infrastructure as Code** for enhanced performance and reliability. Strong technical expertise in **Event Streaming** with hands-on experience in analytical databases, ensuring optimized query performance. Recognized for exceptional problem-solving skills and a customer-focused approach, effectively collaborating with cross-functional teams to drive projects to successful completion.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Senior Software Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Designed and developed scalable cloud-native applications using **Kotlin** and **Spring Boot**, enhancing system scalability and maintainability across cloud infrastructure.\nImplemented Event-Driven Architecture to facilitate real-time data processing and integration, utilizing technologies such as **Apache Kafka** and **RabbitMQ** to improve event streaming effectiveness.\nIntroduced Infrastructure as Code practices, streamlining deployment processes and enhancing operational efficiency.\nOptimized analytical database performance by refining query strategies, which improved query execution time by **20%** through effective indexing and query tuning.\nCollaborated cross-functionally with teams to enrich user-focused solutions that resulted in a **25%** increase in customer satisfaction.\nSpearheaded problem-solving initiatives to troubleshoot and enhance application performance and reliability.\nIntegrated advanced caching strategies with **Redis**, reducing database load and enhancing response times by **35%**.\nDeveloped and maintained RESTful APIs that leverage **MongoDB** for efficient data retrieval, serving various microservices with seamless data access.\nChampion for Continuous Integration/Continuous Deployment (CI/CD) practices on **Azure DevOps**, cutting deployment times by **40%** and improving overall delivery pipelines.\nDesigned interactive data visualizations with **D3.js** and **Three.js**, contributing to enhanced data insights and user engagement.\nImplemented secure application practices with JWT-based authentication and authorization mechanisms."
    },
    {
      "role": "Software Engineer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "• Developed cloud-based solutions leveraging **Kotlin** and **Spring Boot**, enhancing system scalability and reliability, resulting in a 20% increase in application responsiveness.\n• Implemented **Event-Driven Architecture** using **RabbitMQ** and **Apache Kafka** for robust event streaming, which improved team collaboration efficiency by 15%.\n• Employed **Infrastructure as Code** practices to streamline deployment processes, achieving a deployment frequency increase of 40%.\n• Optimized analytical databases, implementing effective **Query Optimization** techniques that led to a 30% reduction in query response times.\n• Designed CI/CD pipelines using cloud infrastructure tools, reducing production deployment errors by 25%.\n• Applied **Collaboration** practices working alongside stakeholders to define system requirements and ensure timely project delivery, achieving a 95% satisfaction rate.\n• Leveraged data caching with technologies like **Redis** to minimize API call latency, yielding a 25% boost in system performance.\n• Developed comprehensive RESTful APIs for real-time data access alongside a PostgreSQL database, enhancing data retrieval speeds.\n• Created interactive data visualizations using **D3.js**, providing a more engaging user experience and project status tracking.\n• Provided mentorship and conducted code reviews, leading to a measurable increase in team productivity and collaboration skills."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "Utilized **Kotlin** and **Spring Boot** to develop scalable and high-performance backend applications, enhancing system responsiveness by **30%**.\nDesigned and implemented an **Event-Driven Architecture** using **RabbitMQ**, optimizing event handling and messaging efficiency across services.\nIntegrated **Cloud Infrastructure** solutions for seamless deployment, improving rollout speed by **25%** while maintaining operational reliability.\nEnhanced database efficiency through **Analytical Databases** and **Query Optimization**, achieving a **40%** reduction in response times for complex queries.\nCollaborated with cross-functional teams to promote a culture of **Collaboration**, **Problem Solving**, and **Customer Focus**, increasing project delivery speed by **15%**.\nContributed to building reusable libraries and frameworks in **Kotlin** for future project simplifications, aiming to reduce development time by **20%**.\nImplemented **Infrastructure as Code** principles to automate environment provisioning and configurations, reducing provisioning time from hours to minutes.\nParticipated in Agile rituals like daily standups and retrospectives to foster teamwork and ensure project goals alignment.\nProvided comprehensive technical documentation and user manuals for internal systems, enhancing team knowledge sharing and onboard efficiency.\nAssisted in integrating third-party APIs for improved functionality, ensuring reliable data exchange with external services."
    }
  ],
  "skills": " **Programming Languages**\n\t Kotlin, JavaScript, TypeScript, C#, Python, Solidity\n\n **Backend Frameworks**\n\t Spring Boot, NodeJS, ExpressJS, NestJS, .NET, Microservices\n\n **Frontend Frameworks**\n\t ReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n **API Technologies**\n\t RESTful API, GraphQL\n\n **Serverless and Cloud Functions**\n\t AWS, Azure\n\n **Databases**\n\t MSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB, Analytical Databases\n\n **DevOps**\n\t CI/CD pipelines, Infrastructure as Code\n\n **Cloud & Infrastructure**\n\t Cloud Infrastructure, Scalability, Query Optimization\n\n **Other**\n\t UX/UI Design, Git, GitHub, Testing Tools: NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest, Collaboration, Problem Solving, Customer Focus, Event-Driven Architecture, Event Streaming, Messaging & Caching: Apache Kafka, RabbitMQ, Redis",
  "apply_company": "Sequence"
}