{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Backend Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "Results-oriented Senior Backend Engineer with 8 years of extensive experience in software development, emphasizing expertise in **Java**, **Spring Boot**, **Postgres**, and **Docker**. Proficient in designing and implementing scalable backend systems in cloud environments utilizing **gcloud** and container orchestration with **Kubernetes**. My programming skills are complemented by a solid understanding of **MongoDB**, **Cassandra**, and experience in **Ruby on Rails** and **Astra-DB** as part of my tech stack.\n\nI excel in implementing Test Driven Development (TDD) principles to ensure high-quality code and foster a culture of code peer-reviews, enhancing team collaboration, ownership, and accountability. My background in mathematics and data-driven decision making allows me to apply statistical practices effectively, contributing to the development of financial products and stock market solutions. With strong communication skills, I thrive in dynamic teams, driving innovative solutions and ensuring alignment with project goals.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Backend Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Developed and maintained scalable backend solutions using **Java** and **Spring Boot**, ensuring high performance and robust application stability across financial product and stock market modules.\nImplemented **Test Driven Development (TDD)** strategies to enhance code quality, resulting in a **30%** reduction in production bugs and improved overall system reliability.\nDesigned and optimized database schemas and queries in **Postgres** and **MongoDB** for seamless data retrieval and integrity, managing over **2 million** financial transactions per day.\nLed the containerization and orchestration of applications using **Docker** and **Kubernetes**, improving deployment efficiency and scaling by **40%** during peak transaction periods.\nCollaborated with cross-functional teams to integrate **Machine Learning** solutions for real-time predictive analytics on stock price trends and investment risks, enhancing decision-making processes.\nParticipated in code peer-reviews, promoting code quality and adherence to best practices, contributing to a **15%** increase in team productivity and cohesion.\nUtilized **gcloud** to deploy and manage cloud resources, ensuring cost-effective infrastructure management aligned with organizational goals.\nEnabled fast iterations and continuous integration through CI/CD pipelines, maintaining high standards of programming through **team collaboration** and shared ownership of codebases.\nConducted regular team meetings to foster **open communication** about project status, challenges, and future plans, enhancing team accountability and project alignment.\nEnhanced data-driven decision-making processes by integrating analytics tools, allowing teams to gain insights from financial and operational metrics effectively."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Developed and maintained backend systems using **Java** and **Spring Boot**, ensuring high performance and responsiveness for financial applications.\nImplemented **Postgres** and **MongoDB** for data storage solutions, optimizing database schema and queries, which improved data retrieval times by **25%**.\nUtilized **Docker** and **Kubernetes** for containerization and orchestration, enhancing deployment efficiency and system scalability across multiple environments.\nLed initiatives in **Test Driven Development (TDD)** to uphold high code quality, conducting thorough code peer-reviews and fostering a culture of accountability within the team.\nCollaborated with cross-functional teams to deliver financial products, incorporating insights from stock market trends and data-driven decision-making to enhance product effectiveness.\nApplied **gcloud** for managing cloud resources, resulting in smoother integration of microservices and overall system reliability.\nConducted analysis using **Machine Learning** techniques to drive insights in financial decision-making processes, contributing to the development of predictive models that improved forecasting by **15%**.\nOwned and drove improvements for system architecture, ensuring continual evolution of data workflows and application performance, thus supporting the organization’s strategic goals."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "• Developed backend services using **Java** and **Spring Boot**, ensuring high availability and scalability in financial applications, achieving a performance benchmark of **95% uptime**.\n• Implemented **Test Driven Development (TDD)** methodologies that resulted in a codebase with **30% fewer bugs** at release.\n• Managed relational databases like **Postgres** and **Astra-DB**, optimizing queries to improve transaction time by **40%** during peak usage.\n• Deployed microservices architecture utilizing **Docker** and **Kubernetes**, enabling streamlined deployments and reducing deployment times by **50%**.\n• Leveraged **gcloud** for scalable cloud-based solutions, facilitating global data access and collaboration across teams.\n• Developed machine learning models for financial products, utilizing **TensorFlow** to provide insights derived from stock market data, achieving predictive accuracy of **88%**.\n• Conducted code peer-reviews and facilitated team collaboration to promote accountability and ownership within the development team.\n• Communicated effectively with stakeholders, ensuring alignment on project goals and timelines, leading to a **25% increase** in project delivery speed.\n• Engaged in data-driven decision making to enhance application performance and user experience, using analytics to inform development strategies.\n• Applied advanced mathematics to model complex financial products, contributing to innovative solutions in a rapidly evolving market."
    }
  ],
  "skills": "**Programming Languages:**\n\tJava, Python, JavaScript, TypeScript, Ruby\n\n**Backend Frameworks:**\n\tSpring Boot, FastAPI, Flask, Django, Ruby on Rails\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tKeycloak, JWT, OAuth2\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL), gcloud\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis, Cassandra, Astra-DB\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS, Azure\n\n**Other:**\n\tMachine Learning, MLflow, Airflow, Kubeflow, Test Driven Development, Financial Products, Stock Market, Mathematics, Data-driven Decision Making, Code Peer-reviews, Team Collaboration, Ownership, Accountability, Communication",
  "apply_company": "wealthAPI"
}