{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Elixir Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Senior Elixir Engineer with 13+ years of experience in backend development, specializing in **Elixir**, **Rust**, and **microservices** architecture. Proven ability to design and implement **event-driven architectures** and apply **domain-driven design** principles to create scalable solutions. Experienced in TDD, employing testing methodologies to ensure robust application functionality.\nSkilled in Agile methodologies, enhancing team collaboration and delivering quality software rapidly. Strong problem-solving capabilities, with a focus on communication and collaboration among cross-functional teams. Previous experience includes delivering high-performance applications in the healthcare and financial sectors, leveraging technologies such as **JavaScript/TypeScript**, **Python**, and frameworks including **React**, **Next.js**, **Vue**, **FastAPI**, and **Django**. Highly proficient in building AI/ML-powered platforms and deploying cloud-native systems on **AWS** and **Azure** while adhering to standards like HIPAA, FHIR, PCI DSS, and SOC 2.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Elixir Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Led backend development utilizing **Elixir** and **Rust** in a microservices architecture to enhance application performance and scalability, achieving up to **30%** reduction in response times.\n• Implemented event-driven architecture using **RabbitMQ** and **Kafka** for real-time data processing, improving system reliability by **20%**.\n• Developed robust software solutions adhering to domain-driven design principles, ensuring clear separation of concerns and maintainability.\n• Championed Test-Driven Development (TDD) practices across the teams to reduce bugs by **40%** and improve code quality.\n• Actively participated in Agile methodologies to promote efficient collaboration, iterating on feedback to deliver features faster and effectively address stakeholder requirements.\n• Demonstrated strong problem-solving skills by devising innovative solutions to complex issues, significantly enhancing application functionality.\n• Maintained effective communication within cross-functional teams, facilitating knowledge sharing and collaborative problem-solving to meet project timelines."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Engaged in **backend development** with a focus on **microservices** architecture, demonstrating proficiency in **Elixir** and other programming languages to enhance system functionality.\nDesigned and implemented **event-driven architecture** using **RabbitMQ**, **Kafka**, and Azure Service Bus, ensuring reliable data flow and communication in high-stakes environments.\nUtilized **domain-driven design** principles to create scalable, maintainable solutions that support complex business requirements in finance.\nApplied **TDD** (Test-Driven Development) methodologies to ensure code quality and reliability throughout the software development lifecycle.\nCollaborated effectively in an **Agile** environment, participating in sprints and stand-ups to continuously improve project workflows and team dynamics.\nLeveraged strong **problem-solving** skills to diagnose and troubleshoot system issues, leading to a **30%** reduction in downtime and quicker response times.\nExhibited excellent **communication** skills to facilitate cross-functional teamwork, ensuring seamless integration between technical and non-technical stakeholders.\nContributed to the modernization of core financial platforms, enhancing scalability and performance for high-volume systems through innovative software design."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "- Engineered robust **backend development** solutions using **Elixir** for a high-performance, event-driven architecture, focusing on microservices and domain-driven design principles to facilitate scalability and maintainability.\n- Leveraged **RabbitMQ** and **Kafka** to implement real-time messaging systems, enhancing application responsiveness and supporting dynamic user interactions across critical modules.\n- Applied **TDD** (Test-Driven Development) methodologies to ensure high-quality code delivery, improving defect rate by **30%** through comprehensive unit and integration tests.\n- Collaborated within an **Agile** team environment, participating in regular scrums and sprint planning to effectively manage project timelines and deliverables.\n- Developed APIs and backend services with **Rust** to optimize performance, achieving response times of under **100ms** in high-load scenarios.\n- Solved complex technical issues through efficient problem-solving techniques, reducing downtime incidents by **25%** through proactive troubleshooting and performance enhancements.\n- Communicated effectively with cross-functional teams, ensuring alignment on project objectives and fostering a positive work environment.\n- Designed and optimized microservices architecture, implementing patterns that improved deployment efficiency by **40%**.\n- Contributed to documentation and knowledge sharing initiatives, enhancing team onboarding processes and overall technical understanding within the organization."
    }
  ],
  "skills": "**Backend Frameworks:**\n\tFastAPI, Flask, Django, Elixir, Rust, RabbitMQ, Kafka\n\n**Programming Languages:**\n\tPython, JavaScript, TypeScript\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tOAuth2, JWT\n\n**Serverless and Cloud Functions:**\n\tAWS: ECS, Lambda, RDS, S3, Azure: App Services, Blob Storage, SQL Database\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tNginx, Let’s Encrypt, Certbot\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, Agile, problem-solving, communication, TDD, domain-driven design, event-driven architecture, microservices",
  "apply_company": "Prima"
}