{
  "name": "Tomasz Lee",
  "role_name": "Senior DevOps Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Results-driven Senior DevOps Engineer with 9+ years of experience in optimizing developer productivity and enhancing observability within infrastructure security. Proficient in **Terraform**, **Kubernetes**, **CI/CD** principles, and cloud services including **Azure** and **AWS**. Experienced in implementing automated deployment strategies and utilizing tools like **Datadog**, **GitHub Actions**, and **GitLab CI** for streamlined workflows. Strong background in application development as a **.NET Full Stack Developer**, specializing in **microservices architecture**, with skills in **ReactJS**, **NextJS**, **.NET**, and **C#**. Committed to delivering robust solutions and collaborating effectively across teams to achieve project success.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Senior DevOps Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Designed and implemented **CI/CD** pipelines on **Azure DevOps** and **GitHub Actions**, reducing deployment time by **40%** for streamlined and automated deployment processes.\nLeveraged **Terraform** for infrastructure as code, enhancing developer productivity and simplifying environment management across multiple cloud providers like **AWS** and **Azure**.\nManaged container orchestration using **Kubernetes**, ensuring high availability and scalability of applications, thus improving system resilience.\nUtilized **Datadog** for observability, enabling real-time monitoring and alerting, leading to a proactive approach in infrastructure security and performance optimization.\nAdvanced the integration of **GenAI** and machine learning techniques, resulting in enhanced automation and predictive capabilities within the development lifecycle.\nCollaborated across teams to enforce infrastructure security practices, ensuring compliance and best practices across all deployments.\nContributed to automated deployment strategies, achieving a significant increase in deployment frequency and developer efficiency.\nApplied insights from observability tools to drive enhancements in system architecture and developer workflows.\n"
    },
    {
      "role": "Full Stack Developer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "Implemented **CI/CD** pipelines using **GitHub Actions** and **GitLab CI**, achieving a **30%** reduction in production deployment errors.\nUtilized **Terraform** for infrastructure as code, facilitating consistent and repeatable deployment processes.\nManaged container orchestration with **Kubernetes**, enhancing deployment efficiency and reliability across multiple environments.\nDeployed and monitored applications on **Azure** and **AWS**, ensuring optimal performance and cost-effectiveness.\nIntegrated **Datadog** for observability, providing real-time insights into application performance and system health.\nAutomated deployment processes that improved **developer productivity** by **25%**, allowing for faster feature rollouts.\nImplemented infrastructure security best practices, safeguarding applications and data against vulnerabilities.\nCollaborated with cross-functional teams to define system requirements and development timelines, ensuring alignment with overall project goals.\nUtilized **GenAI** and **ML** technologies to enhance system capabilities, resulting in improved project outcomes.\nConducted mentorship sessions for junior engineers, fostering a culture of learning and collaboration within the team."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "Implemented CI/CD pipelines using **GitHub Actions** and **GitLab CI** to automate deployment processes, reducing deployment time by **30%**.\nUtilized **Terraform** to manage infrastructure as code, improving consistency and reproducibility in deployments across **Azure** and **AWS** environments.\nManaged container orchestration with **Kubernetes**, optimizing resource allocation and enhancing scalability for services, achieving a **25%** increase in service uptime.\nLeveraged **Datadog** for observability, monitoring system performance, and generating actionable alerts to ensure infrastructure security and operational efficiency.\nIntegrated machine learning (ML) solutions into existing applications, increasing data processing speed and accuracy by **15%**.\nCollaborated with development teams to enhance developer productivity through automated deployment strategies, leading to a **40%** reduction in manual interventions.\nContributed to infrastructure security assessments, ensuring compliance with best practices and reducing security risks.\nDeveloped technical documentation and playbooks for automated deployment processes, improving team onboarding by **50%**.\nParticipated in daily standups and retrospectives to align project statuses and identify opportunities for continuous improvement in deployment workflows."
    }
  ],
  "skills": " **Programming Languages** \n\t Python, JavaScript, TypeScript, C#, Solidity \n\n **Frontend Frameworks** \n\t ReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS \n\n **Backend Frameworks** \n\t NodeJS, ExpressJS, NestJS, .NET, Entity Framework, Microservices \n\n **API Technologies** \n\t RESTful API, GraphQL \n\n **Serverless and Cloud Functions** \n\t AWS, Azure \n\n **Databases** \n\t MSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB \n\n **DevOps** \n\t CI/CD, GitHub Actions, GitLab CI, Terraform, Kubernetes, Datadog \n\n **Cloud & Infrastructure** \n\t Infrastructure Security, Observability \n\n **Other** \n\t UX/UI Design, Git, GitHub, Testing Tools: NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest, Blockchain: Ether.js, Web3.js, Ethereum, GenAI, AI, ML, Automated Deployment",
  "apply_company": "IU International University of Applied Sciences"
}