{
  "name": "Tomasz Lee",
  "role_name": "Senior React Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Results-driven Senior React Engineer with 9+ years of comprehensive experience in building responsive web applications using **React**, **JavaScript**, **TypeScript**, **HTML5**, and **CSS3**. Proficient in developing and integrating **REST APIs** and establishing **Accessibility** standards to enhance user experience. Strong background in full-stack development, including **React Native** for mobile applications. Specialized in implementing modern web design techniques and optimizing performance for improved application responsiveness. Demonstrated success in leading cross-functional teams and delivering high-quality solutions aligned with business objectives.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Senior React Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Developed and maintained high-performing responsive web applications using **React** and **JavaScript**, enhancing user engagement by **30%**.\nUtilized **HTML5**, **CSS3**, and **TypeScript** to create visually appealing and accessible user interfaces that comply with web standards.\nCollaborated with cross-functional teams to design RESTful APIs, ensuring seamless integration with back-end services and achieving a response time reduction of **25%**.\nImplemented responsive web design techniques to ensure applications perform well across multiple devices, improving mobile user retention by **15%**.\nRefined user interface components in compliance with accessibility standards, increasing usability for all users.\nParticipated in code reviews and mentoring sessions to elevate team skills and maintain code quality across projects.\nContributed to performance optimization initiatives, resulting in a **20%** improvement in overall application speed.\nEngaged in continuous learning and adaptation of new React features and tools to keep up with industry best practices."
    },
    {
      "role": "Software Engineer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "• Developed user interfaces using **React** and **JavaScript**, ensuring responsive design that improved user satisfaction by **20%**.\n• Implemented accessibility best practices in web applications, enhancing usability for diverse user groups by **15%**.\n• Designed and created RESTful APIs to support effective data communication, leading to seamless integration and functionality enhancements.\n• Leveraged **HTML5**, **CSS3**, and **TypeScript** in crafting interactive and user-friendly components, driving user engagement up by **25%**.\n• Collaborated with cross-functional teams to define system requirements, aligning project goals with stakeholder expectations.\n• Maintained high coding standards through regular code reviews, resulting in a **10%** increase in development efficiency.\n• Spearheaded the optimization of existing codebases for performance improvement, reducing page load times by **30%**.\n• Utilized **React Native** for cross-platform mobile app development, streamlining project timelines and resource allocation.\n• Championed the adoption of responsive web design principles to enhance the mobile user experience and increase customer retention.\n• Conducted mentorship sessions for junior developers, fostering skills development and increasing overall team productivity."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "Developed and maintained complex user interfaces using **React**, **HTML5**, **CSS3**, and **JavaScript**, enhancing user experience and achieving a 30% increase in user engagement.\nImplemented responsive web design strategies, ensuring compatibility across multiple devices, leading to a 15% decrease in bounce rates.\nUtilized **TypeScript** for scalable application development, improving code reliability and reducing runtime errors by **25%**.\nEngaged in the design and development of **REST APIs** to facilitate efficient data interchange between frontend and backend systems, optimizing data retrieval processes.\nCollaborated with cross-functional teams to integrate accessibility features, ensuring compliance with **WCAG 2.1** standards and enhancing usability for all users.\nMentored junior developers on utilizing **React** best practices and modern JavaScript techniques, fostering a knowledge-sharing culture.\nParticipated in agile ceremonies including daily standups and sprint planning, ensuring timely delivery of project milestones and adherence to coding standards.\nLed code reviews and implemented improvements based on feedback to enhance code quality and maintainability across the team.\nDelivered comprehensive technical documentation and user guides to facilitate smooth onboarding for new team members and support ongoing projects."
    }
  ],
  "skills": "*****Programming Languages\n\tJavaScript, TypeScript, Python\n\n*****Frontend Frameworks\n\tReact, ReactJS, React Native, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, Flutter, Chakra UI, TailwindCSS, HTML, HTML5, CSS, CSS3, Responsive Web Design, Accessibility\n\n*****Backend Frameworks\n\tNodeJS, ExpressJS, NestJS, C#, .NET, Entity Framework, Microservices\n\n*****API Technologies\n\tREST APIs, RESTful API, GraphQL\n\n*****Messaging & Caching\n\tApache Kafka, RabbitMQ, Redis\n\n*****Databases\n\tMSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB\n\n*****DevOps\n\tAWS, Azure, CI/CD pipelines\n\n*****Cloud & Infrastructure\n\tCloud Technologies\n\n*****Other\n\tUX/UI Design, Git, GitHub, Testing Tools: NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest, Blockchain: Solidity, Ether.js, Web3.js, Ethereum",
  "apply_company": "Promise Group"
}