{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Developer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-karol-kotlinski-bb2520397/",
  "profile_summary": "Results-driven Senior Developer with 8 years of comprehensive experience in full-stack development, leveraging a robust skill set in **.NET**, **C#**, **Web API**, **SQL**, **PostgreSQL**, **TypeScript**, and **JavaScript**. Proficient in modern frameworks including **NestJS**, **React**, and **Angular** to build dynamic applications efficiently. I excel in cloud technologies with hands-on experience in **AWS** and possess a strong understanding of Agile methodologies and DevOps practices.\n\nMy background encompasses the creation of automated testing frameworks, continuous integration/continuous deployment (CI/CD) strategies, and the design of modern deployment pipelines, ensuring high-quality code and rapid delivery. I pride myself on being an adept problem-solver with strong communication and collaboration skills, essential for driving successful team outcomes. My previous projects have significantly enhanced operational efficiency and effectiveness in both healthcare and financial sectors.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Developer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Utilized **.NET** and **C#** to architect and develop scalable web applications and APIs, ensuring robust integration with **SQL** and **PostgreSQL** databases for high-performance data management.\nEmployed **TypeScript** and **JavaScript** frameworks, specifically **React** and **NestJS**, to create dynamic user interfaces and enhance user experience in modern web applications.\nImplemented agile methodologies to drive project timelines, enhancing team collaboration and ensuring project deliverables were met efficiently and effectively.\nDesigned and executed CI/CD pipelines using **Azure DevOps** and **GitHub Actions** to automate testing, deployment, and monitoring of applications, significantly improving deployment frequency by **30%**.\nDeveloped automated testing procedures with tools like **Jest** and **Cypress**, achieving high code coverage across both front-end and back-end services to elevate quality assurance processes.\nLed the transformation of legacy monolithic applications into microservices architecture leveraging containerization technologies like **Docker** and orchestrators such as **Kubernetes**, which increased system scalability and reliability.\nUtilized methodologies from Agile and DevOps to enhance team performance and operational efficiency, promoting ongoing iterative improvements with feedback loops.\nCollaborated with cross-functional teams to identify and troubleshoot technical issues, utilizing **problem-solving** and **communication** skills to lift project outcomes and foster a collaborative environment.\nContributed to financial and healthcare software solutions by integrating **Web API** services that streamlined data access and operations across various platforms and third-party tools.\nEngaged with database technology to optimize queries and storage strategies for complex datasets, bolstering application performance and response times by up to **25%**.\nPresented technical and operational reports via visualization tools like **Power BI**, contributing to better decision-making and performance insights based on live data trends.\nFacilitated regular code reviews and knowledge sharing sessions to boost team expertise and ensure alignment with best practices in **DevOps** and software development life cycles."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "• Developed and modernized financial platforms utilizing **.NET** and **C#**, enhancing scalability and throughput for high-volume transaction systems.\n• Created robust **Web API** services and SQL queries to optimize data retrieval and transaction processing, resulting in a 30% increase in system efficiency.\n• Engineered front-end applications with **React** (18), implementing **TypeScript** and **JavaScript** to deliver responsive user interfaces for financial dashboards, achieving a user satisfaction score of **95%**.\n• Collaborated in an **Agile** environment, promoting **DevOps** practices in code deployment which led to a **40%** reduction in deployment times through the establishment of modern deployment pipelines.\n• Integrated automated testing frameworks to improve code quality and enforce best practices, increasing test coverage to **85%** and significantly reducing bugs in production.\n• Designed and implemented CI/CD pipelines using cloud services like **AWS** and Azure, fostering seamless application deployments and updates.\n• Fostered collaboration and communication within cross-functional teams, streamlining processes and improving the delivery of product features ahead of deadlines by **20%**.\n• Provided problem-solving expertise in project tasks, ensuring timely delivery of solutions while mentoring junior developers in the use of best coding practices."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Utilized **.NET**, **C#**, and **Web API** to design and optimize backend services for a global e-commerce platform, achieving high availability and low latency across key modules that cater to **9M+** users.\nImplemented robust SQL and **PostgreSQL** database solutions to manage distributed data storage, enabling **95%** fault tolerance and significantly improving performance under high traffic conditions.\nCreated interactive and responsive frontend applications using **React**, **Angular**, and **TypeScript**, elevating user engagement with a **25-30%** increase in performance on both web and mobile platforms.\nAdopted **JavaScript** and **NestJS** frameworks to engineer real-time features, facilitating dynamic order updates and inventory tracking, thus enhancing customer support responsiveness by **40%**.\nFacilitated modern deployment pipelines with **Agile** methodologies and **DevOps** practices, incorporating automated testing and **CI/CD** to streamline release processes and reduce deployment time by **50%**.\nCollaborated effectively across cross-functional teams to apply problem-solving skills in the integration of secure payment workflows using **Stripe**, **PayPal**, and **Razorpay**, ensuring **PCI** compliance for sensitive data transactions.\nLed the implementation of role-based access control (RBAC) and **OAuth 2.0** protocols for secure customer and admin access, maintaining **100%** GDPR compliance across all user data handling.\nContributed to the creation of SEO-friendly UIs employing **HTML5/CSS3** and **AWS** services, optimized for mobile-first and accessibility compliance (WCAG 2.1), increasing organic traffic by **30%**."
    }
  ],
  "skills": "Programming Languages:\n\tC#, .NET, JavaScript, TypeScript\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django, NestJS\n\n**Frontend Frameworks:**\n\tReact, Angular, Vue\n\n**API Technologies:**\n\tWeb API\n\n**Serverless and Cloud Functions:**\n\tAWS Lambda\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis, SQL\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS, Azure (App Services, Blob, SQL)\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, automated testing, Agile, problem-solving, communication, collaboration, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot"
}