{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Fullstack Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Senior Fullstack Engineer with 13+ years of experience in delivering high-performance applications in the healthcare and financial sectors. Expertise in **Angular**, **React**, **Vue**, **Node.js**, **Java**, and **SpringBoot**, with a strong proficiency in both frontend and backend development. Skilled in deployment and management of cloud-native systems using **AWS** and **Azure**. Solid experience in Git and Jira for version control and project management, enhancing collaboration and productivity within teams.\nProficient in Clean Code principles, ensuring maintainable and efficient codebases. Experienced in building AI/ML-powered platforms supporting predictive analytics and real-time processing, and implementing microservices and CI/CD pipelines. Knowledgeable in compliance-driven development aligned with HIPAA, FHIR, PCI DSS, and SOC 2 standards. Strong background in MLOps with tools like MLflow, Airflow, and Kubeflow for model training and orchestration.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Fullstack Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Utilized **Angular**, **React**, and **Vue** to develop advanced full-stack applications, ensuring seamless user experiences while adhering to **CleanCode** principles.\nLeveraged **Node.js** and **Java** for backend services, implementing **SpringBoot** frameworks to enhance application performance and maintainability.\nDesigned and optimized CI/CD pipelines using **AWS** and **Azure** DevOps tools, facilitating automated testing and efficient deployment workflows across environments.\nCollaborated with cross-functional teams utilizing **Jira** for project tracking and task management, ensuring timely delivery of project milestones.\nImplemented robust data solutions leveraging modern libraries and frameworks, focusing on high data integrity and security standards.\nDeveloped responsive web applications that integrated powerful features like user authentication and real-time updates, enhancing user engagement by **30%**.\nExecuted extensive performance tuning, resulting in a **50%** reduction in average response times and improved application scalability.\nFacilitated code reviews and mentorship sessions to promote best practices in code quality and team productivity, improving code coverage metrics to **85%**.\nConfigured and maintained version control using **Git** to ensure seamless collaboration and integration among team members.\nDelivered comprehensive documentation of software features and updates, enhancing clarity and understanding among stakeholders and technical teams."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "• Developed and maintained full-stack applications using **React (18)**, **Vue 3**, and **Node.js** (NestJS/Express) with **Clean Code** principles, ensuring high-quality and maintainable code structures.\n• Architected solutions incorporating **Angular**, **SpringBoot**, and **AWS** to deliver feature-rich and scalable applications, enhancing user experiences and operational efficiency.\n• Migrated existing applications to **microservices architecture**, improving scalability and performance for high traffic environments, evidenced by a **30% reduction** in latencies.\n• Designed interactive dashboards using **Power BI Embedded** and **D3.js**, improving operational insights with real-time data analytics, achieving a **25% increase** in data visualization capabilities.\n• Implemented CI/CD pipelines using **Git** and **Jira** for efficient project management and deployment processes, reducing deployment times by **40%**.\n• Developed and tested ETL pipelines for financial data using **Python**, **Apache Airflow**, and **Azure Data Factory** to handle both batch and real-time data processing, enhancing data accuracy.\n• Deployed machine learning models for fraud detection using **scikit-learn**, **XGBoost**, and **Azure ML**, identifying suspicious activities with **90% accuracy** based on behavioral patterns.\n• Integrated real-time credit scoring and churn prediction functionalities utilizing **MLflow** and **Airflow**, resulting in improved customer retention by **15%** through proactive engagement strategies."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "• Developed and maintained scalable web applications using **Angular**, **React (18)**, and **Vue 3**, delivering seamless user experiences across various platforms.\n• Engineered robust backend solutions utilizing **Node.js (NestJS, Express)** alongside **Java** and **SpringBoot**, optimizing performance for high-demand applications.\n• Implemented version control and project management through **Git** and **Jira**, ensuring efficient workflow and collaboration within the engineering team.\n• Designed responsive, SEO-friendly UIs, applying **HTML5/CSS3** and frameworks like **Next.js** for mobile-first design and accessibility compliance (WCAG **2.1**).\n• Utilized **AWS** and **Azure** cloud services to deploy applications, ensuring high availability and reducing latency in user requests by up to **30%**.\n• Created and applied clean code principles across all projects, enhancing code maintainability and readability, resulting in a reduction of bugs by **20%**.\n• Leveraged **Redis** and **MongoDB** for optimized data caching and storage solutions, improving data retrieval speeds and application performance metrics by **25%**.\n• Integrated continuous deployment strategies using **Git** and cloud services, streamlining release cycles to achieve deployment frequency of multiple times per week.\n• Collaborated with team members to optimize application performance with constant monitoring and refactoring, ensuring high-quality deliverables in line with industry standards."
    }
  ],
  "skills": " **Programming Languages:**\n\tJava, Python\n\n **Backend Frameworks:**\n\tSpringBoot, FastAPI, Flask, Django, Node.js\n\n **Frontend Frameworks:**\n\tAngular, React, Vue\n\n **API Technologies:**\n\t\n\n **Serverless and Cloud Functions:**\n\tAWS: ECS, Lambda, RDS, S3, Azure: App Services, Blob Storage, SQL Database\n\n **Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n **DevOps:**\n\tDocker, Kubernetes, Git, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:**\n\tAWS, Azure\n\n **Other:**\n\tJira, CleanCode, MLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), OAuth2, JWT, Nginx, Let’s Encrypt, Certbot",
  "apply_company": "RockstarDevelopers GmbH"
}