{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Software Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "Dedicated Senior Software Engineer with 8 years of comprehensive software development experience in healthcare and financial sectors. Proficient in **C/C++**, and skilled in debugging, scripting, and source control practices. I possess strong analytical skills and am committed to continuous integration and development lifecycles, ensuring high-quality software delivery. Known for exceptional problem-solving abilities and customer orientation, I excel in team collaboration and clear technical documentation.\n\nMy technical expertise extends to full-stack development leveraging **JavaScript/TypeScript**, **Python**, **Flutter**, and frameworks such as **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**. Furthermore, my solid background in **cloud technologies** including **Azure** and **AWS** enhances my capability in constructing scalable solutions. I have significant experience implementing microservices architecture and event-driven systems, as well as proficiency in CI/CD automation to streamline deployment processes. Recently, I’ve engaged in developing machine learning pipelines and MLOps workflows utilizing **MLflow**, **Airflow**, and **Kubeflow**, aligning my projects with industry compliance standards such as HIPAA, FHIR, PCI DSS, and SOC 2.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Software Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Utilized **C/C++** for efficient software development, focusing on performance optimization and debugging to enhance application efficiency and reliability.\nEmployed various **scripting** languages to streamline workflows, automate repetitive tasks, and enhance overall development lifecycle efficiency.\nImplemented **continuous integration** practices to ensure high code quality through automated testing and validation, utilizing tools like GitHub Actions and Azure DevOps.\nDemonstrated strong **problem-solving** abilities in complex software development challenges, delivering solutions that meet both customer needs and technical requirements.\nCollaborated effectively within teams, fostering a culture of **team collaboration** and open communication to drive project success.\nCreated and maintained comprehensive **technical documentation** for software projects, ensuring clear understanding for current and future team members.\nEngaged in rigorous **debugging** practices to identify and resolve issues in software applications, enhancing stability and user experience.\nAdapted to multiple programming environments and established **source control** protocols to manage codebases effectively, ensuring version consistency.\nFacilitated thorough knowledge sharing by providing support in **English** and **German**, enhancing team understanding and collaboration in multinational settings."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Demonstrated strong **Software Development** skills by leading the development and modernization of financial platforms using a microservices-based architecture with **Node.js** (NestJS/Express) and **Python** (FastAPI, Django), enhancing scalability and maintainability for high-volume transaction systems.\nExhibited exceptional **Analytical Skills** while building dynamic, user-focused front-end applications using **React** (18), **Vue 3**, **Next.js**, and **TypeScript**, leveraging **Redux Toolkit** and **Tailwind CSS** for responsive financial dashboards and admin portals.\nApplied **Problem Solving** to develop real-time transaction monitoring and analytics dashboards utilizing **React**, **D3.js**, and **Power BI Embedded**, enabling operations teams to effectively track financial activity and generate actionable insights.\nUtilized excellent **Team Collaboration** by integrating **Kafka**, **RabbitMQ**, and **Azure Service Bus** to create a robust event-driven architecture, supporting real-time processing for transactions and alerts.\nExecuted robust **Scripting** and **Debugging** skills in building and orchestrating ETL pipelines with **Python**, **Apache Airflow**, and **Azure Data Factory**, ensuring efficient data ingestion from **3+** internal and third-party sources.\nDesigned and implemented AI/ML-powered fraud detection systems using **scikit-learn**, **XGBoost**, and **Azure Machine Learning**, analyzing transaction patterns to proactively identify **99%** of suspicious activities in banking systems.\nCreated automated ML pipelines for credit scoring and churn prediction with **MLflow** and **Airflow**, integrating real-time model inference into backend services with a focus on enhancing decision-making efficiency."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Utilized **C/C++** and **Assembler** for software development, ensuring adherence to the development lifecycle and excellence in coding standards.\nDeveloped and maintained technical documentation to facilitate clear communication and understanding across cross-functional teams.\nApplied debugging techniques to identify and resolve software issues, enhancing application reliability and performance metrics.\nImplemented continuous integration practices to streamline source control processes, leading to a **30%** reduction in deployment times.\nLeveraged strong analytical skills to assess and improve existing software solutions, ensuring alignment with business objectives and customer needs.\nCollaborated effectively within a team environment, fostering a culture of customer orientation and problem-solving to address challenges proactively.\nDemonstrated proficiency in **English** and **German** to communicate technical concepts to diverse audiences and ensure clarity in project deliverables."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, C/C++, JavaScript, TypeScript, Assembler, Scripting\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n **Frontend Frameworks:**\n\tReact, Vue, Angular\n\n **API Technologies:**\n\tJWT, OAuth2, Keycloak (OIDC, RBAC)\n\n **Serverless and Cloud Functions:**\n\tAWS (Lambda), Azure (App Services)\n\n **Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:**\n\tAWS (ECS, RDS, S3), Azure (Blob, SQL), CI/CD\n\n **Other:**\n\tArtificial Intelligence, Machine Learning, MLflow, Airflow, Kubeflow, Debugging, Software Development, Development Lifecycle, Source Control, Continuous Integration, Analytical Skills, Customer Orientation, Technical Documentation, Problem Solving, Team Collaboration, English, German",
  "apply_company": "Fujitsu"
}