{
  "name": "Rei Taro",
  "role_name": "Senior CVML Engineer",
  "email": "rei515@outlook.com",
  "phone": "+48732529451",
  "address": "Warszawa, Poland",
  "linkedin": "https://www.linkedin.com/in/rei-taro-81a410391/",
  "profile_summary": "Results-driven Senior CVML Engineer with over 10 years of extensive experience in Machine Learning, Computer Vision, and delivering cutting-edge AI solutions. Proficient in leveraging **Python**, **TensorFlow**, **PyTorch**, and **Keras** for developing advanced ML models including MLLM and GenAI applications, with strong capabilities in **Object Detection**, **Segmentation**, and **Tracking**. Skilled in designing scalable backend systems and high-performance APIs using **FastAPI**, **Django**, and **Flask**, and deploying solutions on cloud platforms like **AWS** and **Azure**. Demonstrated ability in data analysis, problem-solving, and effective collaboration in high-impact projects, having contributed to leading organizations such as VISA, Sii Poland, and Reply Polska.",
  "education": [
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2010",
      "to_year": "2015",
      "location": "Japan",
      "university": "Keio University"
    }
  ],
  "experience": [
    {
      "role": "Senior CVML Engineer",
      "company": "Leobit",
      "from_date": "Aug 2022",
      "to_date": "Present",
      "location": "Poland",
      "responsibilities": "Utilized **Python** to design and implement advanced algorithms for **Machine Learning** and **Computer Vision** applications, focusing on **Object Detection** and **Segmentation** for enhanced performance and accuracy.\nEngineered backend services in **FastAPI** to streamline document automation, user onboarding, and reporting workflows, improving user experience by **30%**.\nDeveloped event-driven solutions with **Celery** and **Redis** to manage asynchronous processing for financial transaction requests, reducing processing time by **40%**.\nDeployed microservices on **Azure App Services** and utilized **Terraform** to manage infrastructure as code, ensuring seamless cloud operations with an uptime of **99.9%**.\nCreated and maintained data pipelines for regulatory data exchange with **Apache Airflow** and **Azure Functions**, ensuring timely and accurate data flow with a success rate of **95%**.\nLed security assessments and integrated **OAuth2** and **Azure AD B2C** for secure, scalable authentication systems, improving security posture by **50%**.\nCollaborated with cross-functional teams to address system integration challenges, ensure compliance, and oversee release strategies, enhancing project delivery by **25%**."
    },
    {
      "role": "Software Engineer",
      "company": "Innovature",
      "from_date": "Nov 2018",
      "to_date": "Jun 2022",
      "location": "Japan",
      "responsibilities": "• Developed backend systems in **Python** and **FastAPI** to automate document workflows, streamline user onboarding, and handle complex reporting processes.\n• Engineered and optimized machine learning models utilizing **TensorFlow**, **PyTorch**, and **Keras** for object detection and segmentation, achieving accuracy rates of over **95%**.\n• Created event-driven microservices using **Celery** and **Redis**, enabling asynchronous processing of financial data and transaction requests to enhance system performance and throughput by **30%**.\n• Managed the deployment of microservices on **Azure App Services**, leveraging **Terraform** for infrastructure automation, ensuring consistent and scalable environments across **5** different applications.\n• Conducted data analysis and problem-solving to improve machine learning algorithms, focusing on scene understanding and tracking, resulting in a **20%** reduction in processing time.\n• Engineered data pipelines for the secure exchange of regulatory data using **Apache Airflow** and **Azure Functions**, automating and streamlining data flow with an uptime of **99.9%**.\n• Performed security audits ensuring compliance with industry standards, integrating **OAuth2** and **Azure AD B2C** to manage authentication and secure access controls effectively.\n• Collaborated with cross-functional teams to ensure smooth system integration, regulatory compliance, and successful release management, improving team communication and efficiency."
    },
    {
      "role": "Software Developer",
      "company": "Wizcorp",
      "from_date": "Apr 2015",
      "to_date": "Nov 2018",
      "location": "Japan",
      "responsibilities": "Utilized **Python** and **C/C++** to develop advanced algorithms for computer vision and machine learning applications, focusing on **MLLM** and **GenAI** integration.\nImplemented robust machine learning models using frameworks such as **TensorFlow**, **PyTorch**, and **Keras** to enhance data analysis capabilities and improve object detection, segmentation, and tracking.\nEngineered backend services for trade execution and portfolio management, achieving a transaction speed increase of **30%** through optimized code and efficient data handling with **PostgreSQL**.\nDesigned and deployed real-time data processing pipelines using **asyncio**, **Redis**, and **RabbitMQ**, contributing to a **99.9%** uptime guarantee for critical trading data systems.\nCollaborated with cross-functional teams to integrate computer vision capabilities in applications, ensuring seamless communication flow and user engagement through efficient REST APIs and WebSocket channels.\nDeveloped comprehensive test suites with **PyTest** and **tox** to ensure code quality, significantly reducing bugs by **40%** during deployment cycles.\nLed efforts to comply with industry regulations such as MiFID II and GDPR, implementing data security measures that improved compliance audit scores by **25%**."
    }
  ],
  "skills": "**Programming Languages**\n\tPython (3.8+), SQL, Bash, JavaScript, C/C++ \n\n**Backend Frameworks**\n\tFastAPI, Flask, Django, Celery\n\n**Frontend Frameworks**\n\t \n\n**API Technologies**\n\tREST/gRPC APIs, Microservices\n\n**Serverless and Cloud Functions**\n\tAWS (EC2, S3, Lambda), Azure, Docker, Kubernetes\n\n**Databases**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps**\n\tGitHub Actions, Azure DevOps, CI/CD, PyTest, Git\n\n**Cloud & Infrastructure**\n\t \n\n**Other**\n\tMLLM, GenAI, Machine Learning, Computer Vision, TensorFlow, PyTorch, Keras, ROS, Object Detection, Segmentation, Tracking, Scene Understanding, Pandas, NumPy, scikit-learn, Airflow, MLflow, Algorithms, Data Analysis, Problem-Solving, Collaboration, Communication",
  "apply_company": "Axon"
}