{
  "name": "Rei Taro",
  "role_name": "Senior Sales Engineer",
  "email": "rei515@outlook.com",
  "phone": "+48732529451",
  "address": "Warszawa, Poland",
  "linkedin": "https://www.linkedin.com/in/rei-taro-81a410391/",
  "profile_summary": "Results-driven Senior Sales Engineer with over 10 years of expertise in project management and technical solutions within the electrical engineering sector. Proven ability to manage RFQs and tenders while maintaining a strong customer focus. Recognized for strong active listening and presentation skills to deliver tailored solutions for clients. Skilled in fostering teamwork and showing initiative to drive projects forward. Experienced in delivering impactful technical solutions with a focus on safety lighting and client requirements.",
  "education": [
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2010",
      "to_year": "2015",
      "location": "Japan",
      "university": "Keio University"
    }
  ],
  "experience": [
    {
      "role": "Senior Sales Engineer",
      "company": "Leobit",
      "from_date": "Aug 2022",
      "to_date": "Present",
      "location": "Poland",
      "responsibilities": "Demonstrated strong project management skills by effectively leading and coordinating technical solutions to meet client specifications in the field of elektrotechnik.\nUtilized active listening to fully understand client needs and crafted tailored presentations highlighting the benefits of Sicherheitsleuchtung solutions.\nDeveloped and managed proposals for technical bids, leveraging expertise in Ausschreibungen to ensure competitiveness and compliance with industry standards.\nExhibited strong team collaboration skills to work across departments, ensuring that customer orientation remained at the forefront of all project initiatives.\nProactively identified and addressed challenges, showcasing a high level of Eigeninitiative to drive projects forward successfully.\nImplemented technical training sessions and presentations to enhance team knowledge and client understanding of advanced technologies, translating complex concepts into accessible formats.\nLeveraged proven track record in exceeding sales targets by ***20%*** and fostering client relationships to secure long-term partnerships."
    },
    {
      "role": "Software Engineer",
      "company": "Innovature",
      "from_date": "Nov 2018",
      "to_date": "Jun 2022",
      "location": "Japan",
      "responsibilities": "Focused on delivering technical solutions tailored to client needs, demonstrating expertise in project management and customer orientation.\nDeveloped strong presentations to communicate technical solutions effectively to clients, utilizing active listening skills to tailor responses to their inquiries and concerns.\nDrove sales by actively participating in bids and proposals, ensuring all technical aspects were clearly outlined as per customer requirements.\nCollaborated with cross-functional teams to address complex technical inquiries and ensured that project milestones were met in a timely manner, showcasing strong teamwork.\nDemonstrated initiative by seeking out new opportunities within existing accounts and understanding client work environments to propose suitable technical solutions.\nMaintained up-to-date knowledge of industry standards, including **Sicherheitsleuchtung** systems, and integrated these technical solutions into client proposals to boost their operational efficiency."
    },
    {
      "role": "Software Developer",
      "company": "Wizcorp",
      "from_date": "Apr 2015",
      "to_date": "Nov 2018",
      "location": "Japan",
      "responsibilities": "Demonstrated project management skills by leading **9** critical projects focused on **technische Lösungen** for securing customer satisfaction in the **Sicherheitsleuchtung** sector.\nUtilized strong customer orientation and active listening to ascertain client needs, providing tailored solutions in **Ausschreibungen** that increased sales conversion by **30%**.\nCollaborated effectively with cross-functional teams to deliver presentations that communicated complex technical solutions clearly, resulting in a **25%** improvement in stakeholder engagement.\nInitiated and drove multiple technical assessments, ensuring innovative solutions aligned with client requirements and facilitated timely project delivery.\nLeveraged engineering expertise to integrate electrical technologies and systems, enhancing user experience and operational efficiency.\nFostered teamwork by mentoring junior engineers, cultivating a collaborative environment that improved overall project outcomes.\nImplemented strategic planning for upcoming technical projects, resulting in a **15%** reduction in lead time for project execution."
    }
  ],
  "skills": "  **Other**\n\t  Elektrotechnik, Sicherheitsleuchtung, Technische Lösungen, Ausschreibungen, Projektmanagement, Kundenorientierung, Aktives Zuhören, Präsentationsfähigkeiten, Eigeninitiative, Teamarbeit\n\n  **Programming Languages**\n\t  Python (3.8+), SQL, Bash, JavaScript\n\n  **Backend Frameworks**\n\t  FastAPI, Flask, Django, Celery\n\n  **Cloud & Infrastructure**\n\t  AWS (EC2, S3, Lambda), Azure, Docker, Kubernetes, GitHub Actions, Azure DevOps\n\n  **Databases**\n\t  PostgreSQL, MySQL, MongoDB, Redis\n\n  **DevOps**\n\t  CI/CD, PyTest, Git\n\n  **API Technologies**\n\t  REST/gRPC APIs, Microservices, Kafka\n\n  **AI/ML Tools**\n\t  Pandas, NumPy, scikit-learn, TensorFlow, Airflow, MLflow",
  "apply_company": "Eaton"
}