{
  "name": "Patryk Zaslawski",
  "role_name": "Senior Machine Learning Engineer (AI Platform)",
  "email": "patrykzas0428@outlook.com",
  "phone": "+48669862402",
  "address": "Gdanski, Poland",
  "linkedin": "https://www.linkedin.com/in/patryk-zaslawski-6b04a8397/",
  "profile_summary": "As a results-oriented Senior Machine Learning Engineer specializing in **Python** and machine learning principles, I bring 8+ years of experience in developing scalable AI solutions tailored to business needs. Proficient in **scikit-learn**, **XGBoost**, **TensorFlow**, and **PyTorch**, I expertly design models that drive innovation and efficiency. My strong tech stack includes cloud platforms like **Google Cloud Platform**, **AWS**, and **Azure**, alongside orchestration and automation tools such as **Kubernetes**, **Terraform**, and **CI/CD** for streamlined deployment. I leverage **MLOps** and **Kubeflow Pipelines** to enhance model lifecycle management, ensuring robust performance. Additionally, I bring original strengths in problem-solving, teamwork, and communication, coupled with leadership qualities to spearhead cross-functional initiatives and foster collaboration in fast-paced environments.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2014",
      "to_year": "2017",
      "location": "United Kingdom",
      "university": "The University of Manchester"
    }
  ],
  "experience": [
    {
      "role": "Senior Machine Learning Engineer (AI Platform)",
      "company": "Binary Studio",
      "from_date": "Aug 2023",
      "to_date": "Present",
      "location": "United Kingdom (Remote)",
      "responsibilities": "Leveraged **Python** to design and develop machine learning models using **scikit-learn**, **XGBoost**, **TensorFlow**, and **PyTorch**, contributing to the AI Platform's performance by improving prediction accuracy by **25%**.\nImplemented CI/CD pipelines for machine learning workflows utilizing **GitHub**, **Terraform**, and **Kubernetes**, enhancing deployment efficiency by **30%** and reducing rollback times.\nSpearheaded the adoption of **MLOps** practices within the team, establishing **Kubeflow Pipelines** to automate the training and deployment of machine learning models, leading to a **40%** reduction in time-to-market.\nConducted data preprocessing techniques to ensure high-quality datasets, improving model training outcomes and reducing input errors by **15%**.\nIntegrated **Google Cloud Platform** and **Amazon Web Services** into the development workflow for scalable and efficient model training, achieving a **20%** cost reduction in cloud services.\nFacilitated communication and collaboration within a cross-functional team of **10+ engineers**, mentoring junior team members on best practices in machine learning and **Python** programming.\nImplemented robust software testing frameworks to ensure reliability and maintainability of developed models, achieving a **95%** success rate in model validation.\nActively solved complex problems related to data integration and model performance through innovative thinking and a solid understanding of machine learning principles.\nEnhanced leadership within the team by promoting agile methodologies and fostering a culture of continuous improvement and learning.\nUtilized **Azure** for deploying models and managing data pipelines, contributing to integrated solutions that support data analytics initiatives across applications."
    },
    {
      "role": "Software Engineer",
      "company": "Ardigen",
      "from_date": "Mar 2020",
      "to_date": "Aug 2023",
      "location": "Poland",
      "responsibilities": "Led the design and deployment of machine learning models using **Python** with frameworks such as **scikit-learn**, **XGBoost**, **TensorFlow**, and **PyTorch**, improving model accuracy by **30%**.\nImplemented MLOps practices using **Kubeflow Pipelines** for streamlined model training and deployment, reducing time-to-market by **20 days**.\nManaged cloud infrastructure leveraging **Google Cloud Platform**, **Amazon Web Services**, and **Azure** for scalable machine learning operations, optimizing costs by **15%** through efficient resource allocation.\nDeveloped and enforced best practices in CI/CD processes with tools like **GitHub** and **Terraform**, facilitating automated testing and deployment cycles, resulting in a **40%** increase in deployment frequency.\nConducted data preprocessing techniques to prepare datasets for training, ensuring data quality and compliance, which improved model performance metrics by **25%**.\nUtilized **Kubernetes** for container orchestration of machine learning applications, enhancing application availability and scalability during peak loads.\nApplied software testing methodologies, ensuring robust verification of machine learning models, reducing the error rate to below **2%**.\nDemonstrated strong problem-solving skills by addressing scaling challenges in machine learning workflows, ensuring efficient data handling and model inference.\nChampioned cross-functional team collaboration with effective communication strategies, leading to successful project outcomes and increased stakeholder engagement through presentations and reports."
    },
    {
      "role": "Software Engineer",
      "company": "Altum Software",
      "from_date": "Oct 2017",
      "to_date": "Feb 2020",
      "location": "United Kingdom",
      "responsibilities": "Utilized **Python** and various libraries such as **scikit-learn**, **XGBoost**, and **TensorFlow** to design and implement machine learning models that enhance the intelligence of AI platform functionalities, achieving model accuracies of over **90%**.\nDesigned and deployed CI/CD pipelines using **GitHub Actions**, **Azure**, and **Terraform** for robust model training and deployment, reducing deployment times by **30%**.\nLeverage **Google Cloud Platform** and **Amazon Web Services** for scalable data storage and processing, ensuring high availability for machine learning applications.\nImplemented **MLOps** practices to streamline the model lifecycle management including training, validation, and deployment, improving overall efficiency by **25%**.\nDeveloped and optimized algorithms in **PyTorch** for real-time data preprocessing techniques, ensuring data integrity and usability across machine learning tasks.\nCollaborated closely with cross-functional teams to gather requirements and refine communication strategies for deploying AI solutions, leading to a **40%** increase in stakeholder satisfaction.\nConducted rigorous software testing to validate machine learning models, applying principles of test-driven development to ensure reliability and performance.\nLeveraged **Docker** and **Kubernetes** for containerization and orchestration of machine learning services, ensuring flexible and scalable deployments in varying environments.\nConducted performance monitoring using tools like **Grafana** and **Prometheus** for real-time tracking of model performance and system resource utilization, identifying bottlenecks and optimizing performance metrics by **15%**.\nProvided leadership and mentoring to junior engineers in machine learning principles and software development best practices, fostering a culture of continuous improvement and innovation within the team."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, \n\n**Backend Frameworks:**\n\tFastAPI, Django, Flask, Spring Boot, \n\n**Frontend Frameworks:**\n\tAngular (1–16), React (15–18), Next.js, Vue.js (2/3), Blazor, \n\n**API Technologies:**\n\tREST & gRPC APIs, \n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL), Google Cloud Platform, \n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis, \n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, CI/CD, Terraform, \n\n**Cloud & Infrastructure:**\n\tAWS, Azure, \n\n**Other:**\n\tscikit-learn, XGBoost, TensorFlow, PyTorch, MLOps, Kubeflow Pipelines, machine learning principles, data preprocessing techniques, software testing, problem-solving, leadership, communication, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot"
}