{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Technical Solutions Engineer - Intralogistics Solutions",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-623a26390/",
  "profile_summary": "Results-driven Technical Solutions Engineer specializing in intralogistics solutions with a solid background in data analysis and technical design. Adept at developing automated storage systems, conveyor systems, and sorting systems that enhance material transport solutions by leveraging comprehensive market analysis and negotiation skills. Bringing 13+ years of experience in the software domain with a strong capability in customer service and business development.\nFull Stack skills include hands-on expertise in **JavaScript**, **TypeScript**, **Python**, and **Flutter**, alongside a robust tech stack that features **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django** for both frontend and backend development. Proven experience in deploying cloud-native systems on **AWS** and **Azure**, implementing microservices architectures, and enhancing CI/CD pipelines. Developed AI/ML-powered platforms to bolster predictive analytics and real-time processing capabilities, with significant experience in MLOps using **MLflow**, **Airflow**, and **Kubeflow**. Committed to compliance-driven development by aligning solutions with standards such as HIPAA, FHIR, PCI DSS, and SOC 2.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Technical Solutions Engineer - Intralogistics Solutions",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Developed and delivered **material transport solutions** leveraging **AutoCAD** for technical design, ensuring smooth implementation of **conveyor systems** and **sorting systems** in the intralogistics domain.\n- Conducted thorough **market analysis** to identify customer needs and improve **customer service** strategies, contributing to a **sales support** increase by **20%** over **6 months**.\n- Provided in-depth **data analysis** to enhance automated storage systems efficiency, utilizing effective negotiation skills to streamline vendor partnerships.\n- Collaborated with stakeholders to create customized solutions in **intralogistics**, increasing workflow efficiency by **15%** through innovative design and technology adoption.\n- Implemented advanced technical designs to maximize **material transport solutions**, reducing delivery times by **10%** leveraging enhanced sorting and automated systems.\n- Facilitated workshops to train teams on new technologies and systems, improving internal technical design capabilities and increasing English proficiency in cross-functional teams.\n- Delivered ongoing support and maintenance for existing systems, ensuring continuous improvement in customer satisfaction ratings by **30%**.\n- Engaged in **business development** initiatives to expand service offerings, identify new opportunities, and enhance client relationships within the **intralogistics** sector."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Leveraged **data analysis** skills to optimize intralogistics processes, enhancing material transport solutions for improved efficiency and reduced operational costs by **15%**.\nDelivered comprehensive **technical design** documentation for automated storage systems, conveyor systems, and sorting systems, ensuring clarity and accuracy in project execution for **10+** clients.\nProvided exceptional **customer service** by addressing technical inquiries and resolving issues related to intralogistics systems, resulting in a **20%** increase in customer satisfaction ratings.\nCollaborated with sales support teams to prepare and present market analysis reports that influenced business development strategies, driving sales growth by **25%** within one fiscal year.\nApplied **negotiation skills** in discussions with vendors and service providers to secure favorable contracts, achieving an average savings of **10%** on equipment acquisitions.\nUtilized **AutoCAD** for technical illustrations and design layouts for proposed conveyor and sorting systems, resulting in streamlined design processes and reduced turnaround time by **30%**.\nEngaged in cross-functional teamwork to develop innovative intralogistics solutions tailored to client needs, utilizing business development strategies that increased project win rates.\nConducted training sessions in **English proficiency** to enhance communication skills within multi-disciplinary teams and foster a collaborative work environment."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Applied technical design and development skills to create advanced **intralogistics** solutions enhancing material transport efficiency and automating sorting systems.\nConducted data analysis and market analysis to inform customer needs, tailoring solutions in conveyor systems and automated storage systems for optimal performance and integration.\nUtilized **AutoCAD** for drafting and designing layouts for material handling solutions, ensuring alignment with customer specifications and industry standards.\nProvided exceptional customer service and sales support, collaborating with clients to understand their unique requirements and delivering comprehensive solutions that boost operational efficiency.\nEngaged in business development by negotiating contracts and proposals related to **intralogistics** projects, contributing to a **25% increase** in project wins over a **12-month** period.\nDemonstrated English proficiency in all client interactions, ensuring clear communication and a streamlined development process for technical deep dives.\nCreated technical design documentation and user manuals for proposed solutions, facilitating better understanding for customers and support teams alike.\nTrained and supported clients on newly implemented systems, ensuring they are equipped to leverage the technology for their operations effectively.\nIdentified opportunities for process improvements within existing systems, leading to a **15% reduction** in response time for customer queries and complaints regarding technical issues."
    }
  ],
  "skills": "**Programming Languages:**\n\tPython: FastAPI, Flask, Django\n\tJavaScript/TypeScript: React, Vue, Angular\n\n**Backend Frameworks:**\n\t\n\n**Frontend Frameworks:**\n\t\n\n**API Technologies:**\n\t\n\n**Serverless and Cloud Functions:**\n\tAWS: ECS, Lambda, RDS, S3\n\tAzure: App Services, Blob Storage, SQL Database\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare)\n\tMongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes\n\tGitHub Actions, GitLab CI/CD\n\tCI/CD & Infrastructure as Code: Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\t\n\n**Other:**\n\tintralogistics\n\tdata analysis\n\tAutoCAD\n\tcustomer service\n\tsales support\n\ttechnical design\n\tmaterial transport solutions\n\tconveyor systems\n\tsorting systems\n\tautomated storage systems\n\tmarket analysis\n\tnegotiation skills\n\tbusiness development\n\tEnglish proficiency"
}