{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior IT Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Senior IT Engineer with over 13 years of experience in delivering high-performance applications, leveraging expertise in **PKI**, **HSM**, and **asymmetric cryptography**. Adept in both **Windows** and **Linux** environments, demonstrating strong skills in **EJBCA**, **X.509**, and **PKCS#11** certification processes. Proven ability to align IT solutions with organizational objectives, implement robust **auditing** practices, and adhere to **ITIL** frameworks.\n\nWell-versed in developing and deploying complex applications with a solid foundation in **JavaScript/TypeScript**, **Python**, and **Flutter**, alongside hands-on experience with frameworks such as **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**. Specialized in building AI/ML-powered platforms that enhance predictive analytics and automation.\n\nExpert in cloud-native architectures using **AWS** and **Azure**, implementing microservices, event-driven systems, and CI/CD pipelines. Strong commitment to compliance, with experience in HIPAA, FHIR, PCI DSS, and SOC 2 standards. A collaborative team player, fluent in both **German** and **English**, with a demonstrated readiness and willingness to embrace new learning opportunities.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior IT Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Collaborated effectively with cross-functional teams, showcasing strong **teamwork** skills to deliver integrated IT solutions that leveraged **PKI** and **asymmetrical cryptography** across platforms.\n- Developed and implemented security protocols utilizing **HSM**, ensuring compliance with industry standards and enhancing **auditing** practices for sensitive data management within a **Windows** and **Linux** environment.\n- Demonstrated **adaptability** and **eagerness to learn** new technologies, conducting hands-on training sessions for team members on **EJBCA** and **PKCS#11**, with a focus on best practices for deployment and maintenance.\n- Spearheaded the migration to secure certificate management systems, ensuring that **X.509** standards were accurately applied for both internal and client-facing applications.\n- Led ITIL-based initiatives to streamline operations, resulting in improved service delivery metrics with a **30%** reduction in incident response times.\n- Conducted thorough audits and assessments of current security measures, and identified areas for improvement, successfully implementing changes that increased system robustness by **25%**.\n- Engaged in continuous integration of security features into new applications, maximizing overall **system efficiency** and user trust.\n- Provided bilingual (Deutsch and Englisch) support and documentation, catering to diverse client needs and fostering better communication within the team."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Managed and maintained **PKI** and **HSM** solutions across both **Windows** and **Linux** environments, ensuring secure cryptographic operations for internal applications.\nConducted thorough audits to evaluate security posture and operational compliance regarding **Asymmetrische Kryptografie** protocols including **X.509** standards, leading to a reduction in security risks by **30%**.\nCollaborated with cross-functional teams to implement **EJBCA** for certificate management, streamlining processes and enhancing efficiency in certificate issuance and revocation.\nUtilized **PKCS#11** to optimize hardware security module integrations within workflows, resulting in increased performance for cryptographic operations by **25%**.\nDeveloped and documented ITIL-compliant procedures to improve incident management and operational performance, achieving a **15%** reduction in service response times.\nFacilitated team training sessions on cryptographic best practices in both **Deutsch** and **Englisch**, fostering a collaborative environment and improving team readiness.\nDemonstrated proactive commitment and readiness to tackle emerging technologies and challenges, enhancing team capability through ongoing personal development and **Lernbereitschaft**."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Applied in-depth knowledge of PKI and **HSM** for secure management of cryptographic keys and digital certificates, enhancing system security and compliance with industry standards.\nFacilitated systems integration and configuration on both **Windows** and **Linux** platforms, ensuring robust security measures are in place for various application environments.\nUtilized **Asymmetrische Kryptografie** for secure data transmission, implementing **X.509** standards to ensure the legitimacy of digital certificates and secure communications.\nManaged certificate lifecycle processes using **EJBCA**, overseeing issuance, renewal, and revocation to maintain a secure digital environment.\nImplemented **PKCS#11** interfaces for cryptographic operations, streamlining secure application interactions with hardware security modules.\nAdopted **ITIL** best practices for IT service management, leading initiatives that improved service delivery and operational efficiency by **30%**.\nConducted regular auditing of systems to ensure compliance with security policies and standards, identifying areas for improvement and mitigation of risks.\nCollaborated effectively within a diverse team, showcasing strong **Teamfähigkeit**, **Einsatzbereitschaft**, and **Lernbereitschaft** in adapting to emerging technologies and challenges.\nMaintained bilingual communication in **Deutsch** and **Englisch**, bridging gaps between technical and non-technical stakeholders to ensure clarity and understanding of security protocols and systems."
    }
  ],
  "skills": "**Backend Frameworks**:\n\tFlask, FastAPI, Django\n\n**Frontend Frameworks**:\n\tReact, Vue, Angular\n\n**API Technologies**:\n\tOAuth2, JWT, Keycloak (OIDC, RBAC)\n\n**Serverless and Cloud Functions**:\n\tAWS: Lambda, S3, ECS\n\n**Cloud & Infrastructure**:\n\tAzure: App Services, SQL Database, Blob Storage\n\n**Databases**:\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**DevOps**:\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Other**:\n\tPKI, HSM, Windows, Linux, Asymmetrische Kryptografie, X.509, EJBCA, PKCS#11, ITIL, Auditing, Teamfähigkeit, Einsatzbereitschaft, Lernbereitschaft, Deutsch, Englisch, MLflow, Airflow, Kubeflow",
  "apply_company": "noris network AG"
}