{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Operations Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Results-driven Senior Operations Engineer with 13+ years of experience in high-performance application delivery, especially within healthcare and financial sectors. Expertise in cloud services including **Azure** and **AWS**, alongside containerization technologies such as **Docker** and **Kubernetes**. Proven ability in system monitoring and documentation, contributing to SLA management and operational excellence.\n\nSkilled in **Linux** environments and proficient in addressing complex problems while ensuring robust communications across teams. Experienced in deploying **cloud-native** architectures and employing **IIoT** solutions to enhance efficiency and reliability. Strong background in compliance-driven development, adept at aligning solutions with HIPAA, FHIR, PCI DSS, and SOC 2 standards, and delivering MLOps strategies utilizing **MLflow**, **Airflow**, and **Kubeflow**.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Operations Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Managed and optimized cloud infrastructure utilizing **Azure** and **Linux**, ensuring seamless operation and adherence to **SLA Management** protocols.\nImplemented container orchestration strategies with **Kubernetes** and **Docker** to enhance scalability and performance across multiple environments.\nUtilized monitoring tools to track system performance, implementing proactive measures for **problem solving** and enhancing uptime reliability by **99%**.\nDocumented processes and best practices to streamline workflows, enhancing team communication and efficiency in handling operational tasks.\nDesigned and enforced operational policies focusing on **IIoT** solutions, ensuring compatibility with modern industrial standards and enhancing system reliability.\nCollaborated closely with cross-functional teams to effectively communicate technical requirements and operational challenges, leading to increased project success rates by **30%**.\nConducted regular training sessions on **cloud** technologies and operational best practices, boosting team skills and confidence in handling complex issues.\nDeveloped a comprehensive monitoring strategy that reduced incident response time by **45%**, leveraging tools for enhanced visibility and alerting.\n\n"
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Implemented and managed cloud infrastructure on **Azure**, ensuring high availability and scalability for financial applications, aligned with **SLA Management** best practices.\nUtilized **Docker** for containerization of microservices ensuring rapid deployment and efficient resource management in **Kubernetes** environments.\nMonitored system performance and uptime using **Azure Monitor** and custom scripts in **Linux**, achieving a **99.9%** uptime target across all operational services.\nDeveloped and enforced documentation standards for operational procedures and protocols, enhancing team communication and knowledge sharing.\nLed problem-solving initiatives for operational issues, significantly reducing incident response times by **30%** through refined processes and proactive monitoring strategies.\nOrchestrated the deployment of ETL pipelines using **Azure Data Factory** and **Apache Airflow**, contributing to efficient data ingestion and supporting analytics workflows.\nMigrated legacy systems to modern microservices architecture utilizing **Node.js** (NestJS/Express) and **Python** (FastAPI, Django), improving system performance by **25%** for transactional processing.\nDesigned robust event-driven architectures leveraging **Kafka** and **RabbitMQ**, facilitating seamless communication among diverse microservices critical to financial operations.\nExecuted real-time analytics solutions with **React**, **D3.js**, and **Power BI Embedded**, enhancing business intelligence capabilities for operational decision-making."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Managed and optimized cloud infrastructure on **Azure**, ensuring high availability and fault tolerance while meeting **SLA Management** standards across services.\nImplemented **Kubernetes** orchestration for containerized applications using **Docker**, streamlining deployment processes and enhancing scalability across multiple environments.\nMonitored system performance and resource utilization, deploying **Monitoring** tools and strategies to proactively identify and solve operational issues before they affect users.\nDocumented all operational procedures and changes meticulously, ensuring that technical knowledge is transferable and maintainable within the team.\nCommunicated effectively with cross-functional teams to address technical challenges and improve workflow efficiency, fostering a collaborative problem-solving environment.\nDeveloped IIoT solutions for real-time data collection and analysis, contributing to operational insights that drive improvements across production processes.\nEnsured a secure operating environment by implementing **role-based access control (RBAC)** and enhancing data protection strategies, including compliance with GDPR.\nFacilitated incident handling and problem resolution during production outages, demonstrating strong **Problem Solving** skills while maintaining clear communication with stakeholders throughout the process."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython: FastAPI, Flask, Django\n\tJavaScript/TypeScript: React, Vue, Angular\n\n**Backend Frameworks:**\n\t\n\n**Frontend Frameworks:**\n\t\n\n**API Technologies:**\n\t\n\n**Serverless and Cloud Functions:**\n\tAWS: ECS, Lambda, RDS, S3\n\tAzure: App Services, Blob Storage, SQL Database\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare)\n\tMongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker\n\tKubernetes\n\tGitHub Actions, GitLab CI/CD\n\tTerraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAzure\n\tLinux\n\tCloud\n\n**Other:**\n\tDocumentation\n\tMonitoring\n\tSLA Management\n\tCommunication\n\tProblem Solving",
  "apply_company": "ifm"
}