{
  "name": "Tomasz Lee",
  "role_name": "Senior Consulting Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Results-driven Senior Consulting Engineer with 9+ years of experience in developing scalable applications and solutions. Proficient in **Java**, **API** integration, and **Middleware** technologies, complemented by a strong focus on **Big Data** analytics and **Graph Database** modeling. Expertise in **Agile** methodologies and **DevOps** practices to enhance project delivery efficiency. Proven track record in complex data analysis and mentoring teams to drive performance improvements. Strong attention to detail coupled with a consultative approach to ensure successful stakeholder engagement and project outcomes.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Senior Consulting Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Utilized **Java** for backend development to ensure robust API functionality and integration across various systems.\nDesigned and implemented data modeling strategies for efficient use of **Graph Database** technologies, enhancing analytical capabilities for complex queries.\nSpearheaded the integration of middleware solutions, including **Messaging** services for reliable communication between microservices and external data sources.\nConducted complex data analysis to drive insights and improve decision-making processes, achieving a **20%** increase in data retrieval efficiency.\nMentored junior team members on best practices in **Agile** methodologies and **DevOps** practices, fostering a culture of continuous improvement.\nDeveloped a comprehensive reporting engine utilizing analytics tools to facilitate data visualization, enhancing user engagement by **30%**.\nImplemented best practices for **API** development, resulting in streamlined interfaces for external integrations and improved user experience.\nEmployed attention to detail in system design and coding standards to ensure code quality and maintainability, contributing to a **15%** reduction in bugs reported post-deployment.\nCollaborated cross-functionally in a consultative role to align technology solutions with business needs, demonstrating strong communication and analytical skills.\nEngaged in ongoing learning to keep up with emerging technologies and trends relevant to big data and analytics, ensuring the team remains competitive in rapidly changing environments."
    },
    {
      "role": "Full Stack Developer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "- Collaborated in a **DevOps** environment to design and implement scalable solutions using **Java** and **API** strategies to enhance project delivery.\n- Developed a robust microservices architecture employing **Messaging** systems like RabbitMQ and **Middleware** integration for improved data handling and system performance.\n- Utilized advanced **Data Modeling** techniques to optimize project management tools, driving a **15%** increase in team collaboration efficiency.\n- Implemented analytics solutions to handle **Big Data**, resulting in enhanced system metrics through real-time data access via **PostgreSQL** and **MySQL** databases.\n- Led Agile methodologies throughout the project lifecycle to ensure timely delivery, optimizing teamwork and stakeholder collaboration.\n- Created interactive visualizations with **D3.js** for complex data analytics, ensuring project status transparency and enhancing reporting accuracy.\n- Championed the CI/CD pipeline implementation with **GitHub Actions**, achieving a **30%** reduction in deployment errors.\n- Conducted comprehensive code reviews and mentoring sessions, aiding junior developers in refining their technical skills, boosting overall team productivity.\n- Integrated Redis as a caching layer to significantly enhance API call efficiency, resulting in a **25%** performance improvement in system operations.\n- Engaged with stakeholders to articulate system requirements, adeptly managing communications and expectations within a **Consultative Role** framework."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "• Leveraged **Java** to develop complex data models for a robust Graph Database system, enhancing data connections and visualization efficiency by **30%**.\n• Designed and implemented API interfaces to facilitate seamless communication between systems, improving data integration speeds through optimized **middleware** solutions.\n• Utilized **RabbitMQ** for effective messaging and asynchronous processing, reducing response time on client requests by **25%**.\n• Conducted big data analytics to drive insights and support decision-making for clients, resulting in an increased project completion rate by **15%**.\n• Adopted **Agile** methodologies to manage project workflows, ensuring timely delivery of milestones and adaptive planning.\n• Collaborated with DevOps teams to streamline deployment processes using **DevOps** tools, resulting in a **50%** reduction in deployment time.\n• Mentored junior engineers, fostering a culture of continuous learning and offering support for our consultative approach, enhancing team productivity.\n• Analyzed complex data sets with attention to detail, ensuring integrity and accuracy in all client deliverables and reports.\n• Participated in code reviews and daily standups to maintain alignment with project goals, ensuring compliance with industry standards and fostering team collaboration.\n• Delivered comprehensive technical documentation and training materials, contributing to improved knowledge transfer and operational efficiency."
    }
  ],
  "skills": "**Programming Languages**\n\tJava, Python, JavaScript, TypeScript, C#, \n\n**Backend Frameworks**\n\tNodeJS, ExpressJS, NestJS, .NET, Microservices, \n\n**Frontend Frameworks**\n\tHTML, CSS, ReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n**API Technologies**\n\tRESTful API, GraphQL, API, \n\n**Serverless and Cloud Functions**\n\t\n\n**Databases**\n\tMSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB, Graph Database\n\n**DevOps**\n\tAWS, Azure, CI/CD pipelines, DevOps\n\n**Cloud & Infrastructure**\n\t\n\n**Other**\n\tUX/UI Design, Git, GitHub, Blockchain: Solidity, Ether.js, Web3.js, Ethereum, Analytics, Agile, Messaging, Middleware, Data Modeling, Big Data, Complex Data Analysis, Mentoring, Attention to Detail, Learning, Testing Tools: NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest",
  "apply_company": "Neo4j"
}