{
  "name": "Patryk Zaslawski",
  "role_name": "Senior Frontend Engineer",
  "email": "patrykzas0428@outlook.com",
  "phone": "+48669862402",
  "address": "Gdanski, Poland",
  "linkedin": "https://www.linkedin.com/in/patryk-zaslawski-6b04a8397/",
  "profile_summary": "As a seasoned Senior Frontend Engineer with 8+ years in software development, I excel in **frontend development**, focusing on **responsive design** and **frontend performance optimization** to create high-quality user experiences. Adept at collaborating with cross-functional teams, I leverage my strong **communication skills** and **self-motivation** to drive project success. My technical repertoire includes proficiency in **Angular**, **Vue**, **React**, and **Next.js**, allowing me to effectively contribute to **frontend architecture** and development. Additionally, I have experience with **AI coding tools** and **modern frontend tooling**, ensuring innovative and efficient solutions. I actively engage in **code reviews** and utilize **wireframes and mockups** for clear communication of design concepts. My commitment to **sprint planning** and teamwork fosters a collaborative environment that embodies the values of **respect**, **authenticity**, and **innovation**.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2014",
      "to_year": "2017",
      "location": "United Kingdom",
      "university": "The University of Manchester"
    }
  ],
  "experience": [
    {
      "role": "Senior Frontend Engineer",
      "company": "Binary Studio",
      "from_date": "Aug 2023",
      "to_date": "Present",
      "location": "United Kingdom (Remote)",
      "responsibilities": "- Demonstrated expertise in **frontend development** by building responsive user interfaces with **React**, **Angular**, and **Vue (3.x)**, enhancing user experience and engagement across healthcare applications.\n- Collaborated with cross-functional teams to conduct **code reviews**, ensuring adherence to best practices and high-quality standards in frontend architecture and implementation.\n- Spearheaded the design and development of wireframes and mockups, utilizing modern frontend tools to optimize user flows and interface performance.\n- Implemented **responsive design** strategies, ensuring seamless functionality of web applications across varied devices and screen sizes.\n- Leveraged **AI coding tools** to optimize coding efficiency and enhance the development workflow, fostering innovation within the team.\n- Led **sprint planning** sessions to effectively manage project timelines, ensuring alignment and clear objectives across team members.\n- Championed **frontend performance optimization**, achieving load time reductions of over **30%**, significantly improving user interactions and satisfaction.\n- Fostered a culture of **communication** and collaboration within the team, promoting respect and authenticity in all interactions, which led to enhanced team dynamics and productivity.\n- Introduced modern **frontend tooling** practices that streamlined development processes, integrating **CI/CD pipelines** and automated testing frameworks to improve code quality.\n- Mentored junior developers, sharing knowledge on best practices in **frontend architecture** and responsive design principles, promoting a culture of continuous learning."
    },
    {
      "role": "Software Engineer",
      "company": "Ardigen",
      "from_date": "Mar 2020",
      "to_date": "Aug 2023",
      "location": "Poland",
      "responsibilities": "- Led frontend development by building dynamic, user-centric applications integrated with **Python** backends using **Angular**, **Vue**, **React**, and **Next.js**, ensuring responsive design and efficient user interfaces.\n- Applied modern frontend tooling and techniques, ensuring high frontend performance optimization through the implementation of **Redux** and **NgRx**.\n- Created and maintained wireframes and mockups to align development with stakeholder expectations and promote collaboration within team sprints.\n- Conducted code reviews to ensure best practices in coding and design, promoting innovation and maintaining high-quality standards across projects.\n- Collaborated effectively across teams, demonstrating strong communication skills to articulate frontend architecture decisions and solicit feedback for continuous improvement.\n- Utilized AI coding tools to enhance productivity and streamline development workflows, encouraging a self-motivated approach to development tasks.\n- Implemented responsive design principles, ensuring applications provide an optimal experience across diverse devices and screen sizes.\n- Contributed to sprint planning and project timelines, ensuring alignment with project goals and deadlines, and facilitating seamless project execution.\n- Developed a secure payment gateway integration in **Python** supporting ACH transfers, improving front-end integration with backend services for PCI compliance.\n- Integrated unit tests, static analysis, and CI/CD pipelines (using **Azure DevOps**, **GitHub Actions**, **TFS**) to ensure automated quality assurance of frontend and backend components.\n- Participated in the design of integration solutions in **Python** using **MuleSoft**, contributing to the seamless exchange of financial data between external partners and frontend applications."
    },
    {
      "role": "Software Engineer",
      "company": "Altum Software",
      "from_date": "Oct 2017",
      "to_date": "Feb 2020",
      "location": "United Kingdom",
      "responsibilities": "Led the creation of responsive and interactive frontend applications using **React**, **Next.js**, **Angular**, and **Vue**, driving an increase in user engagement metrics by **25%**.\nConducted thorough code reviews to ensure high-quality standards in frontend development practices, improving overall code maintainability and collaboration across teams.\nCollaborated closely with designers to translate wireframes and mockups into functional code, implementing user-centric features that enhanced the user experience.\nUtilized modern frontend tooling and frameworks to optimize application performance, achieving a **30%** faster initial load time across key pages.\nEngaged in sprint planning sessions, setting realistic goals and expectations that streamlined the development process and facilitated team alignment.\nIncorporated AI coding tools to enhance the efficiency of development workflows, resulting in a **15%** reduction in coding time for repetitive tasks.\nDemonstrated strong communication skills, ensuring clarity in project requirements and fostering a collaborative environment within cross-functional teams.\nDeveloped and maintained a robust frontend architecture that supports scalable applications, allowing for future enhancements and feature expansions.\nDemonstrated self-motivation and a commitment to innovation by proactively researching and implementing new technologies and methodologies.\nFocused on frontend performance optimization to enhance user satisfaction and retention, utilizing metrics and analytics to inform iterative improvements.\nFostered a culture of respect and authenticity within the team, leading to improved team morale and project outcomes."
    }
  ],
  "skills": " **Frontend Frameworks:**\n\tAngular (1–16), React (15–18), Next.js, Vue.js (2/3), Blazor\n\n **Backend Frameworks:**\n\tPython (FastAPI, Django, Flask), Spring Boot\n\n **API Technologies:**\n\tREST & gRPC APIs\n\n **Database Management & Optimization:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n **Cloud & Infrastructure:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD\n\n **Other:**\n\tSQLAlchemy, Pydantic, Celery, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, AI coding tools, responsive design, code reviews, frontend performance optimization, wireframes and mockups, frontend architecture, sprint planning, prompt engineering, modern frontend tooling, communication skills, self-motivation, collaboration, innovation, respect, authenticity"
}