{
  "name": "Tomasz Lee",
  "role_name": "Senior Sales Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Results-driven Senior Sales Engineer with extensive experience in technical sales and business development, specializing in industrial water treatment solutions. Proven track record in proposal management and adept at leveraging **CRM** tools to enhance customer relationship management and drive market research initiatives. Strong proficiency in **Microsoft Office** to create compelling presentations and reports that support sales strategies. Drawing from a background in software development, I possess a unique perspective on technical product offerings, with 9+ years as a **.NET Full Stack Developer** skilled in **microservices**, **Apache Kafka**, **RabbitMQ**, **Redis**, **ReactJS**, **NextJS**, **.NET**, and **C#**. Committed to sustainability and emergency response strategies, providing customers with innovative and compliant solutions.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Senior Sales Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Leveraged **CRM** systems to track client interactions and enhance customer relationship management, leading to a 30% increase in customer retention rates.\nDeveloped and presented comprehensive proposals to clients for industrial water treatment solutions, effectively addressing client needs and improving proposal acceptance rates by 25%.\nConducted market research to identify emerging trends in sustainability and water treatment, informing business development strategies and resulting in a 15% growth in new client acquisitions.\nUtilized **Microsoft Office** tools to create detailed reports and presentations for client meetings, increasing stakeholder engagement.\nCollaborated with technical teams to deliver precise technical sales information, aiding in effectively articulating product benefits to potential customers.\nImplemented emergency response strategies in line with industry standards, ensuring client compliance and safety measures.\nActively engaged in business development efforts, nurturing relationships with key clients and partners to drive overall sales performance.\nStreamlined proposal management processes using **CRM**, reducing proposal preparation time by 20% and enhancing overall efficiency.\nParticipated in trade shows and industry events to promote services and gather valuable market insights, contributing to a 10% increase in lead generation."
    },
    {
      "role": "Software Engineer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "Conduct market research to identify opportunities in the **industrial water treatment** sector, leading to a 20% increase in potential client engagements.\nDevelop and manage proposals using **Microsoft Office** tools, achieving a proposal success rate of 75%.\nUtilize **CRM** systems to track customer interactions and pipeline status, improving customer relationship management and follow-ups by 30%.\nLead technical sales presentations and product demonstrations, highlighting **sustainability** features that resonate with clients, resulting in a 40% increase in product adoption.\nCoordinate emergency response strategies for clients, ensuring compliance with industry regulations and enhancing service offerings.\nEngage in business development activities that drive new accounts and foster existing relationships, contributing to a **15%** revenue increase year-over-year.\nImplement customized proposals based on customer needs, ensuring that each solution is tailored for maximum impact and efficiency.\nProvide insights into product features and advantages through comprehensive product training sessions, improving customer understanding by **25%**.\nCollaborate with cross-functional teams to ensure successful project delivery and maintain high customer satisfaction ratings above 90%."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "Leveraged **CRM** software to enhance customer relationship management strategies, resulting in a **20% increase** in sales team productivity.\nConducted **market research** to identify business opportunities in **industrial water treatment**, driving effective business development initiatives.\nDeveloped and maintained detailed **proposal management** processes, facilitating the delivery of customer proposals in a timely manner with a **95% success rate**.\nUtilized **Microsoft Office** tools for preparing sales presentations and reports that improved communication of project details and outcomes.\nImplemented **customer relationship management** tactics that fostered interactions with clients, enhancing customer satisfaction ratings by **30%**.\nCoordinated with cross-functional teams to support **emergency response** initiatives, ensuring project timelines were met even under pressure.\nParticipated in strategic planning sessions for **sustainability** initiatives, aligning with the company's goals to drive environmental responsibility and secure new business partnerships.\nCollaborated with technical teams to integrate digital solutions which streamlined processes and improved overall efficiency across sales operations.\nEngaged in regular client interactions to foster relationships and identify ongoing needs, contributing to long-term customer loyalty.\nDelivered comprehensive training sessions and workshops for sales teams on best practices in **technical sales**, enhancing team capabilities and knowledge transfer."
    }
  ],
  "skills": " \n  **Programming Languages** \n\tPython, JavaScript, TypeScript, C#, Solidity\n\n  **Backend Frameworks** \n\tNodeJS, ExpressJS, NestJS, .NET, Entity Framework\n\n  **Frontend Frameworks** \n\tReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n  **API Technologies** \n\tRESTful API, GraphQL\n\n  **Serverless and Cloud Functions** \n\tAWS, Azure\n\n  **Databases** \n\tMSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB\n\n  **DevOps** \n\tCI/CD pipelines\n\n  **Cloud & Infrastructure** \n\tAWS, Azure\n\n  **Other** \n\tUX/UI Design, Git, GitHub, Redux, technical sales, business development, industrial water treatment, proposal management, CRM, Microsoft Office, customer relationship management, market research, sustainability, emergency response, testing tools: NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest\n",
  "apply_company": "Nijhuis Saur Industries"
}