{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Sales Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "As a results-driven Senior Sales Engineer with a solid understanding of **CRM** systems and **plant asset management** solutions, I leverage my 8 years of experience to drive B2B sales and cultivate strategic account plans. My technical knowledge enables me to effectively communicate complex solutions to clients, ensuring their needs are met with precision and care. I have a proven track record of utilizing **MS Office** tools to streamline presentations and reports, enhancing client trust and satisfaction. \n\nIn addition to my sales expertise, my background as a Full Stack Developer allows me to understand and articulate the technical details of products, such as those used in **condition monitoring** and **healthcare technologies**. My ability to merge technical acumen with sales strategies results in a deeper connection with clients and a stronger competitive advantage in the market.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Sales Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Proposed and developed **Strategic Account Plans** to enhance client relationships and drive B2B sales, ensuring growth in accounts by **25%** year-over-year.\n• Managed multiple client accounts through a robust **CRM** system, ensuring meticulous tracking of sales performance and customer satisfaction, leading to a **30%** increase in client retention rates.\n• Conducted thorough **Condition Monitoring** and **Plant Asset Management** assessments to offer tailored solutions maximizing operational efficiency for clients.\n• Leveraged deep **Technical Knowledge** of product features to deliver compelling sales pitches, resulting in the conversion of **75** leads into loyal customers within a quarter.\n• Utilized **MS Office** tools to create polished presentations and detailed reports for stakeholders, enhancing comprehension of project developments and outcomes.\n• Developed and maintained strong relationships with key stakeholders, leading to successful negotiations and closure of deals worth over **$1M**.\n• Engaged in regular communication and cross-functional collaboration to ensure alignment between sales objectives and technical capabilities, driving innovative solutions for clients.\n• Led training sessions for junior sales team members, improving their understanding of product offerings and sales strategies by enabling them to exceed quarterly targets by **15%**.\n• Analyzed market trends and customer feedback to recommend enhancements to the existing service offerings, which improved customer satisfaction scores by **20%**."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Utilized **CRM** systems to manage client relationships and streamline sales processes, contributing to a **20%** increase in client engagement metrics over a **12-month** period.\nDeveloped strategic account plans to identify and capitalize on upselling opportunities, resulting in a **15%** growth in revenue from existing accounts.\nApplied technical knowledge to explain the benefits of our solutions, enhancing customer satisfaction and driving repeat business in the **B2B** sector.\nConducted condition monitoring and plant asset management assessments, facilitating the maintenance of operational integrity across multiple locations.\nContemplated and collaborated with cross-functional teams to integrate sales strategies, ensuring alignment with business goals and promoting better communication across departments.\nDelivered presentations and demos using **MS Office** tools, ensuring that key stakeholders understood our offerings and how they aligned with their operational needs.\nMonitored industry trends and client feedback to refine sales tactics and product delivery, keeping ahead of competitors in the market.\nAssisted in the development of training materials for new sales engineers, leveraging personal experiences and best practices to foster team growth.\n"
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Developed and executed strategic account plans to enhance client relations and drive sales growth within the e-commerce sector, increasing overall revenue by **25%**.\nUtilized CRM tools to manage customer interactions effectively, streamlining processes and ensuring a **30%** improvement in customer satisfaction metrics through personalized engagement.\nCultivated strong relationships with key stakeholders and partnered with technical teams to provide insights into system capabilities, ensuring alignment with client needs and addressing technical requirements.\nConducted condition monitoring and analysis of client requirements to propose tailored solutions, leveraging **technical knowledge** to address complex client issues efficiently.\nProvided training and support about **plant asset management** tools, optimizing clients’ operational efficiency and achieving a **15%** reduction in downtime through proactive maintenance strategies.\nMaintained comprehensive sales reports using MS Office to analyze performance metrics, identify opportunities for improvement, and communicate insights to management, enhancing data-driven decision-making.\nImplemented B2B sales strategies that led to the acquisition of **10** new major accounts in a single fiscal quarter by leveraging technical benefits and client-centric approaches.\nDemonstrated *expertise in condition monitoring* techniques to advise clients on best practices, increasing their asset longevity and reducing operational costs by **20%**.\nEnhanced customer outreach through innovative sales techniques, including digital demonstrations of systems integration capabilities, resulting in an **increase in conversions by 40%**."
    }
  ],
  "skills": " **Sales** \n\tSales, B2B Sales \n\n **Account Management** \n\tAccount Management, Strategic Account Plans \n\n **CRM** \n\tCRM \n\n **Condition Monitoring** \n\tCondition Monitoring, Plant Asset Management \n\n **Technical Knowledge** \n\tPython(FastAPI, Flask, Django), JavaScript/TypeScript (React, Vue, Angular), MLflow, Airflow, Kubeflow, Docker, Kubernetes, GitHub Actions, GitLab CI/CD, AWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL), Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, PostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis, Terraform, Ansible, Helm, Docker Compose, MS Office ",
  "apply_company": "Emerson"
}