{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Modern C++ Software Developer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-187801395/",
  "profile_summary": "Modern C++ Software Developer with over 13 years of experience in building high-performance applications, specifically in the healthcare and financial sectors. Proficient in **C++ 20**, with a strong command of **Boost.Asio** for asynchronous programming and unit testing expertise. Skilled in applying design patterns and UML design principles to create scalable architecture. Excellent problem-solving abilities complemented by strong interpersonal and communication skills, ensuring effective collaboration and delivery of solutions that meet business needs.\nIn previous roles, deployed cloud-native systems using **AWS** and **Azure**, and implemented microservices and event-driven architectures. Demonstrated history of integrating AI/ML capabilities for predictive analytics and real-time processing. Familiar with **FIX protocol** and **MetaTrader API**, enhancing functionality in trading applications.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Modern C++ Software Developer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Utilized **C++ 20** for developing high-performance applications, ensuring adherence to **design patterns** and **UML design** principles to maintain code quality and scalability.\nImplemented **Boost.Asio** for asynchronous programming, effectively handling I/O operations in a non-blocking manner to enhance application responsiveness and performance.\nConducted unit testing to validate functionality across the codebase, utilizing robust testing frameworks to ensure software reliability and minimize bugs.\nEngaged in problem-solving throughout the software development lifecycle, collaborating with cross-functional teams to identify and address issues in a timely manner.\nLeveraged the **FIX protocol** and **MetaTrader API** for creating financial trading applications, optimizing order execution and data streaming.\nFostered effective communication and interpersonal skills within teams to facilitate knowledge sharing and agile methodologies, resulting in improved project outcomes.\nDeveloped documentation and technical specifications to support ongoing maintenance and knowledge transfer amongst team members, thereby promoting best practices.\nExecuted performance tuning and optimization techniques to enhance application efficiency, achieving improvements in processing speed by up to **50%**.\nParticipated in code reviews, providing constructive feedback and adopting best practices that resulted in increased code maintainability by **30%**.\nFacilitated Agile ceremonies and coordinated with various stakeholders to ensure project milestones were met within deadlines, delivering projects on time with a focus on quality."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Utilized **C++ 20** to enhance financial applications, ensuring effective implementation of **asynchronous programming** techniques for high-performance execution.\nImplemented **unit testing** frameworks to ensure software reliability and adherence to **design patterns**, significantly increasing the robustness of the system.\nApplied **Boost.Asio** for developing asynchronous network applications, optimizing response times and resource allocation in high-load environments.\nDesigned and documented software architecture using **UML design** methodologies, improving communication with stakeholders and team members.\nIntegrated the **FIX protocol** for real-time electronic trading communications, ensuring compliance and efficiency in transaction processing.\nEngineered solutions leveraging the **MetaTrader API** for developing automated trading systems, enhancing user experience and portfolio management capabilities.\nExhibited problem-solving skills by addressing complex software bugs and inefficiencies, contributing to overall project success and team collaboration.\nDemonstrated strong interpersonal and communication skills in cross-functional team environments to deliver project updates and receive feedback efficiently."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Leverage advanced problem-solving skills to design and implement robust software solutions in **C++ 20** that meet the performance needs of trading platforms utilizing **Boost.Asio** for asynchronous programming and efficient data handling.\nUtilize design patterns and UML design techniques to architect scalable and maintainable software systems, ensuring clear communication and collaboration across development teams.\nConduct thorough unit testing for components and features, enhancing software reliability and performance measurement with a focus on achieving **99%** unit test coverage.\nIntegrate the **FIX protocol** and **MetaTrader API** for seamless interaction with trading systems, ensuring high-speed data processing and execution of trades with minimal latency.\nDemonstrate strong interpersonal and communication skills to coordinate with cross-functional teams and stakeholders, fostering a collaborative environment that encourages innovative solutions.\nAnalyze system requirements and optimize application designs for maximum efficiency, achieving operational improvements and reducing execution time by **30%**.\nEmploy best practices in asynchronous programming to handle multiple tasks concurrently, improving application responsiveness and user experience.\nResolve complex technical challenges through strategic problem-solving approaches, contributing to enhanced overall system performance and reliability.\nMaintain a strong focus on software security and compliance to safeguard sensitive trading data against potential threats and vulnerabilities.\n"
    }
  ],
  "skills": " **Programming Languages:** \n\tC++ 20, Python, JavaScript/TypeScript \n\n **Backend Frameworks:** \n\tFastAPI, Flask, Django \n\n **Frontend Frameworks:** \n\tReact, Vue, Angular \n\n **API Technologies:** \n\tFIX protocol, MetaTrader API \n\n **Serverless and Cloud Functions:** \n\tAWS: Lambda, Azure: App Services \n\n **Databases:** \n\tPostgreSQL, MySQL, MongoDB, Redis \n\n **DevOps:** \n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD \n\n **Cloud & Infrastructure:** \n\tAWS: ECS, RDS, S3, Azure: Blob Storage, SQL Database, Terraform, Ansible, Helm, Docker Compose \n\n **Other:** \n\tMLflow, Airflow, Kubeflow, unit testing, asynchronous programming, design patterns, UML design, problem-solving, interpersonal skills, communication skills, Keycloak (OIDC, RBAC), OAuth2, JWT, Nginx, Let’s Encrypt, Certbot"
}