{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior WebRTC Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "As a dedicated Senior WebRTC Engineer with 8 years of experience, I bring a deep understanding of **WebRTC** along with proficiency in **JavaScript** and **PHP** to deliver high-quality solutions in dynamic environments. My capabilities extend to version control and collaboration tools such as **Git** and **GitHub**, ensuring seamless project management and code integration.\nI have a solid background in Quality Assurance and Cross-Platform Testing, ensuring the robustness and reliability of web applications. My experience also includes leveraging open source technologies, contributing to impactful projects and community-driven initiatives. Alongside my technical expertise, I excel in building scalable applications in the healthcare and financial sectors, with a firm focus on integrating high-performance capabilities and compliance with industry standards.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior WebRTC Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Utilized **JavaScript** and WebRTC technologies to develop real-time communication applications, enhancing user interaction and engagement by up to **30%**.\nLed cross-platform testing initiatives to ensure high performance across various devices and platforms, achieving a **98%** quality assurance success rate.\nCollaborated with cross-functional teams using **Git** and **GitHub** to manage source code, streamline integrations, and track project progress effectively, maintaining a **100%** compliance with version control best practices.\nEngineered and deployed scalable applications leveraging **PHP** for backend services, achieving load handling of up to **10,000** concurrent users.\nImplemented quality assurance protocols, integrating automated testing frameworks to reduce bugs in production by **40%**, ensuring robust and reliable software delivery.\nConducted comprehensive cross-platform testing to guarantee seamless user experiences, contributing to a **25%** increase in customer satisfaction ratings.\nParticipated in open-source projects to integrate advanced functionality, promoting knowledge sharing and technology innovation within the community.\nProvided continuous support for deployed applications, ensuring functionality and performance improvements through regular updates and enhancements."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Leveraged **JavaScript** and **WebRTC** technologies to design and implement real-time communication features in advanced financial platforms, improving user interaction and transaction speed.\nConducted effective **Quality Assurance** and **Cross-Platform Testing** to ensure the reliability and functionality of applications across multiple environments and devices, reducing bugs by **30%** within the development cycle.\nUtilized **Git** and **GitHub** for version control, enabling seamless collaboration among a team of **9** engineers on dynamic projects and maintaining a structured development workflow.\nCreated comprehensive documentation for open-source contributions, promoting best practices and maintaining code quality throughout various phases of the development lifecycle.\nImplemented modern development workflows that incorporated both traditional software development and agile methodologies, ensuring timely delivery of high-quality releases.\nCollaborated with cross-functional teams to gather requirements and design features that enhanced overall platform performance, leading to a **25%** increase in user satisfaction scores.\nAdapted new technologies effectively within existing frameworks while maintaining adherence to industry standards and practices."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Utilized **WebRTC** for real-time communication implementations, enhancing user interactions on a global e-commerce platform through reliable video and audio features.\nDeveloped and maintained robust applications using **JavaScript** and **PHP**, ensuring high performance and responsiveness across various modules, including checkout and customer support.\nImplemented automated testing and **Quality Assurance** practices in the development lifecycle, ensuring that code meets high quality standards and functionality across web and mobile platforms.\nConducted extensive **Cross-Platform Testing** to identify issues, achieving a **99%** decrease in critical bugs reported post-deployment, resulting in improved user satisfaction.\nManaged version control using **Git** and **GitHub**, streamlining collaboration among team members and maintaining code integrity across multiple releases.\nEngaged with **Open Source** tools and libraries to enhance project capabilities, contributing to community-driven improvements and knowledge sharing.\nLed the integration of backend services with existing APIs, ensuring seamless communication between microservices and external platforms.\nDesigned intuitive user interfaces and user experiences that comply with best practices for accessibility, significantly improving user engagement rates by **30%** over **6 months**.\nOptimized database interactions with **10%** faster query performance across **MongoDB** and **PostgreSQL**, streamlining data retrieval processes across all traffic scenarios.\nParticipated in planning and executing continuous integration and deployment strategies, enhancing product delivery timelines by **25%**."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, JavaScript, TypeScript, PHP\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tWebRTC\n\n**Serverless and Cloud Functions:**\n\tAWS (Lambda), Azure (App Services)\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps:**\n\tDocker, Kubernetes, Git, GitHub, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS (ECS, RDS, S3), Azure (Blob, SQL)\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, Quality Assurance, Cross-Platform Testing, Open Source",
  "apply_company": "Nextcloud"
}