{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Web Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Senior Web Engineer with 13+ years of experience specializing in **TypeScript**, API integration, and web infrastructure. Proven track record in enhancing developer experience through effective documentation and collaboration. Highly skilled in building scalable applications across healthcare and financial industries using **JavaScript/TypeScript**, **React**, **Next.js**, and **Node.js**. Proficient in utilizing **gRPC** for efficient communication and managing dependencies with modern build tooling techniques. \nExperienced in delivering high-performance systems that incorporate AI/ML technologies, enabling predictive analytics and automation. Demonstrated ability to deploy cloud-native applications on **AWS** and **Azure**, implementing microservices and CI/CD pipelines effectively. Familiar with compliance frameworks including HIPAA and PCI DSS, ensuring robust security and adherence to industry standards.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Web Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Developed and maintained web infrastructure using **TypeScript** for building robust and scalable applications, ensuring top-notch developer experience and seamless API integration.\n• Collaborated with cross-functional teams to implement effective documentation and dependency management strategies that enhance team workflow and project deliverables.\n• Executed SDK integrations and leveraged **gRPC** to enhance communication between microservices, fostering a scalable architecture for the applications.\n• Designed and structured build tooling to streamline development processes, resulting in a **30%** increase in overall deployment efficiency.\n• Spearheaded collaborations with stakeholders to ensure project requirements and updates are thoroughly documented, improving project visibility and accountability.\n• Enhanced developer experience by creating comprehensive onboarding materials and guidelines, reducing new developer ramp-up time by **25%**.\n• Implemented rigorous testing frameworks across the web stack, contributing to improved code quality and stability, with **95%** test coverage achieved.\n• Opted for cloud solutions that heighten performance and reliability using technologies such as **Azure DevOps** for CI/CD workflows optimized for team collaboration.\n• Employed data-driven approaches to guide API integration efforts, achieving a more cohesive connection between different systems and applications.\n• Ensured cross-functional collaboration, enhancing communication pathways via agile methodologies, resulting in more timely project deliveries by **20%**."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Designed and implemented robust **web infrastructure** using **TypeScript** and **Node.js** to enhance **API integration** and improve **developer experience**.\nDeveloped and maintained comprehensive documentation for APIs and applications, ensuring clarity and accessibility for all team members and stakeholders.\nCollaborated with cross-functional teams to effectively manage dependencies, utilizing modern **build tooling** strategies to streamline development workflows.\nIntegrated **gRPC** for efficient communication between microservices, optimizing performance and reducing latency in high-load environments.\nParticipated in code reviews and provided mentorship to junior engineers, fostering collaboration and knowledge sharing across the team.\nCreated and maintained SDKs that provided easy access to core functionalities, improving overall **developer experience** for third-party integrations.\nEnabled efficient project management and agile practices to facilitate development cycles and deliver features on-time, contributing to a **9%** increase in overall team efficiency.\nUtilized version control systems to manage and track changes, ensuring consistency and quality across *3* major production releases per quarter.\nImplemented testing strategies to verify code quality, leading to a **30%** reduction in bug reports post-deployment."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Implemented best practices in **TypeScript** to enhance code quality and maintainability across the web application, ensuring a streamlined developer experience.\nManaged **SDK** integrations and **API integration** for various third-party services, contributing to improved functionality and user engagement through seamless service interactions.\nOptimized **web infrastructure** for high performance and scalability, leveraging cutting-edge **build tooling** to automate development workflows and dependency management.\nCreated comprehensive documentation for APIs and SDKs used in the project, ensuring clear communication and collaboration among developers and stakeholders.\nEnhanced collaboration within cross-functional teams to drive project success, focusing on effective communication and problem-solving to meet deadlines and project milestones.\nEstablished metrics to measure developer experience, leading to a **20%** increase in developer satisfaction and efficiency in the past **6 months**.\nUtilized **gRPC** for efficient inter-service communication, reducing latency in data transfer by up to **30%**, thereby improving overall application performance.\nLed the development of new features utilizing **dependency management** to streamline updates and maintain consistent application performance across releases.\n"
    }
  ],
  "skills": " **Programming Languages:** \n\tPython, TypeScript, JavaScript\n\n **Backend Frameworks:** \n\tFastAPI, Flask, Django\n\n **Frontend Frameworks:** \n\tReact, Vue, Angular\n\n **API Technologies:** \n\tAPI integration, gRPC\n\n **Serverless and Cloud Functions:** \n\tAWS Lambda\n\n **Databases:** \n\tPostgreSQL, MySQL, MongoDB, Redis\n\n **DevOps:** \n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:** \n\tAWS: ECS, RDS, S3, Azure: App Services, Blob Storage, SQL Database\n\n **Other:** \n\tMLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), OAuth2, JWT, Nginx, Let’s Encrypt, Certbot, web infrastructure, dependency management, build tooling, developer experience, documentation, collaboration",
  "apply_company": "Justera Group"
}