{
  "name": "Tomasz Lee",
  "role_name": "ML Engineer / Data Scientist",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Results-driven ML Engineer with 9+ years of experience in designing, implementing, and optimizing complex applications focused on Microservices and REST APIs. Proficient in **Google Cloud Platform**, **Python**, and tools such as **Terraform** and **GitHub Actions** for efficient deployment and infrastructure management. Extensive hands-on experience with **LangChain**, **LangGraph**, **pgvector**, and **Google BigQuery**, facilitating advanced data processing and retrieval-augmented generation. Demonstrated ability to improve retrieval quality and benchmark AI components. Original strengths include a solid foundation in **Apache Kafka**, **RabbitMQ**, and **Redis**, along with a strong grasp of frontend and backend technologies from **ReactJS** to **.NET** and **C#**. Highly skilled in collaborating with cross-functional teams and leading development projects to fruition.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "ML Engineer / Data Scientist",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Implemented and optimized **Google Cloud Platform** solutions for scalable ML applications, achieving a **25%** increase in processing efficiency.\nDeveloped and deployed **REST APIs** to facilitate seamless data interaction and integration with various data sources, increasing data accessibility by **30%**.\nDesigned and executed a **Microservices** architecture leveraging **Python**, improving system modularity and scalability to handle over **1,000** concurrent users.\nUtilized **Terraform** for infrastructure as code management, streamlining deployment processes and achieving a **20%** reduction in environment setup time.\nApplied **GitHub Actions** for CI/CD workflows, enhancing automated testing and deployment times by **40%**.\nEngaged in **Context Engineering** practices to improve data context utilization for ML models, boosting model performance by **15%** in benchmark evaluations.\nCollaborated with cross-functional teams to implement **Retrieval-Augmented Generation** strategies, improving response relevancy in model outputs.\nDeveloped models using **LangChain** and **LangGraph** frameworks, effectively leveraging multi-agent architectures for complex decision-making processes.\nConducted comprehensive evaluations of AI components, focusing on **Retrieval Quality Improvement** and benchmarking against industry standards.\nLeveraged **pgvector** to enhance similarity search capabilities in databases, increasing retrieval speed by **20%**.\nEmployed **Google BigQuery** for large-scale data analysis, enabling insights generation in real-time, thus transforming the decision-making process."
    },
    {
      "role": "Full Stack Developer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "• Designed and developed **REST APIs** to enable communication between microservices, improving system architecture aligned with **Microservices** principles.\n• Created scalable solutions utilizing **Google Cloud Platform** for deployment and resource management, enhancing overall system performance.\n• Integrated **Google BigQuery** for data analytics, facilitating real-time processing and insights derived from large datasets.\n• Implemented serverless functions using **Google Cloud** to optimize resource usage and reduce costs, resulting in a cost reduction of up to 20%.\n• Leveraged **Python** for data manipulation and machine learning model development to drive business insights and decision-making.\n• Developed custom solutions using **LangChain** and **LangGraph** frameworks, enhancing model performance and retrieval capabilities.\n• Utilized **pgvector** for effective vector storage and similarity searches, improving data retrieval efficiency by 30%.\n• Established CI/CD pipelines with **GitHub Actions**, achieving a 30% reduction in production deployment errors.\n• Conducted evaluations and benchmarking of AI components to ensure high-quality standards across all models.\n• Collaborated with cross-functional teams to define requirements and timelines, ensuring project delivery within strict deadlines without compromising quality.\n• Managed and optimized databases such as MSSQL and MySQL to facilitate high-performance data storage and retrieval.\n• Conducted mentorship sessions and code reviews, enhancing overall team productivity and knowledge sharing."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "Implemented **Multi-Agent Architectures** and **Serverless** solutions to streamline deployment processes, resulting in a **30%** reduction in run-time costs.\nDeveloped and optimized **REST APIs** for data retrieval, enhancing latency by **40%** through better design patterns.\nUtilized **Google Cloud Platform** services, including **Google BigQuery** for data analytics, increasing data processing capabilities by **50%**.\nCollaborated with cross-functional teams to integrate **Python** models into a microservices architecture, facilitating efficient deployment and scalability.\nCreated and maintained **Terraform** scripts for infrastructure as code, ensuring consistent deployment environments across projects.\nConducted **Benchmarking** and **Evaluation of AI Components** to assess performance metrics and optimize models for production use.\nEngaged in **Context Engineering** and implemented **Retrieval-Augmented Generation** techniques for enhancing information retrieval in AI applications.\nManaged version control and CI/CD pipelines using **GitHub Actions**, ensuring smooth and reliable software integration.\nSupported the integration of **LangChain** and **LangGraph**, providing foundational frameworks for AI-driven applications.\nParticipated in regular sprint reviews to align project progress with goals and ensure adherence to best practices."
    }
  ],
  "skills": "**Backend Frameworks**\n\tMicroservices,\n\n**Frontend Frameworks**\n\tHTML, CSS, JavaScript, TypeScript, ReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS,\n\n**API Technologies**\n\tRESTful API, REST APIs, GraphQL,\n\n**Serverless and Cloud Functions**\n\tServerless,\n\n**Cloud & Infrastructure**\n\tAWS, Azure, Google Cloud Platform, Google BigQuery, Terraform, CI/CD pipelines,\n\n**Databases**\n\tMSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB, pgvector,\n\n**Other**\n\tUX/UI Design, Git, GitHub, Python, Redux, Blockchain, Solidity, Ether.js, Web3.js, Ethereum, LangChain, LangGraph, Multi-Agent Architectures, Model Context Protocol, Agent2Agent Protocol, Context Engineering, Retrieval-Augmented Generation, Retrieval Quality Improvement, Benchmarking, Evaluation of AI Components,\n\n**DevOps**\n\tGitHub Actions,"
}