{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Core Engine/C++ Optimization Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-187801395/",
  "profile_summary": "Core Engine/C++ Optimization Engineer with 13+ years of experience in high-performance application development, specialized in optimizing performance and efficiency. Proficient in **C++**, with strong expertise in **multithreading**, **CPU optimization**, and **profiling** techniques. Demonstrated ability to utilize **VTune** and **console profiling tools** for in-depth analysis and optimization of applications across console platforms.\n\nWhile my primary focus aligns with performance enhancement, I also bring a wealth of experience from the healthcare and financial industries, with skills encompassing **JavaScript/TypeScript**, **Python**, and **Flutter**. Adept in both frontend and backend technologies, including **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**.\n\nSkilled in modern software development practices, I have experience building AI/ML-powered platforms and deploying cloud-native systems on **AWS** and **Azure**. My background includes implementing microservices, event-driven architectures, and CI/CD pipelines, as well as ensuring compliance with industry standards like HIPAA and PCI DSS.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Core Engine/C++ Optimization Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Developed high-performance applications utilizing **C++** and **Unreal Engine**, demonstrating expert knowledge in **multithreading** and **CPU optimization** techniques to enhance real-time performance.\n- Conducted comprehensive **profiling** using tools such as **VTune** and **console profiling tools**, identifying and resolving critical bottlenecks, improving performance by **25%**.\n- Analyzed and debugged **CPU/GPU crash dumps** to diagnose and fix issues on multiple **console platforms**, ensuring smooth gameplay and user experience across diverse hardware.\n- Collaborated in cross-functional teams to design architecture improvements that integrated efficient algorithms, resulting in a **30%** reduction in latency for rendering tasks.\n- Documented and implemented best practices for code maintainability and optimization, resulting in an increase of team productivity by **15%**.\n- Optimized resource management strategies in **C++**, achieving up to **40%** improvement in memory usage through effective utilization of new language features and libraries.\n- Developed benchmarking tools to consistently measure performance enhancements, validating optimizations with quantitative results that adhere to project deadlines.\n- Engaged in continuous learning and application of current trends in C++ development to improve workflow efficiency and product quality."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Implemented **C++** optimization techniques to enhance application performance, achieving up to **30%** CPU efficiency improvements in multi-threaded environments.\nUtilized **Unreal Engine** to design and optimize high-performance gaming consoles, focusing on **multithreading** and **CPU optimization** for smoother gameplay experiences.\nConducted detailed performance analysis through **profiling** tools such as **VTune** and console profiling tools, identifying bottlenecks and optimizing resource allocation to improve frame rates by **25%**.\nPerformed thorough **CPU/GPU crash dump analysis**, diagnosing critical issues and implementing fixes that reduced crash occurrences by **40%** in deployed applications.\nCollaborated with cross-functional teams to enhance game engine architecture, ensuring compatibility with various **console platforms** and maintaining high availability during peak loads.\nDeveloped and documented best practices for performance profiling and optimization within the development team, leading to a **15%** increase in overall development efficiency."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Designed and optimized C++ backend systems for console platforms, focusing on **CPU optimization** and **multithreading** techniques to ensure maximum performance and stability.\nUtilized **profiling** tools, including **VTune** and other **console profiling tools**, to accurately diagnose performance bottlenecks and implement effective fixes, achieving a **30%** reduction in CPU usage during high-load scenarios.\nConducted comprehensive **CPU/GPU crash dump analysis** to identify critical issues affecting system reliability and performance, leading to improved crash recovery processes and a **25%** decrease in critical error rates in production environments.\nCollaborated closely with cross-functional teams to integrate **C++** enhancements into the core engine, ensuring seamless versions **4.2** and above maintained optimal performance across multiple console platforms.\nMaintained rigorous testing and validation of engine advancements using both automated and manual processes, contributing to a **40%** increase in overall system stability and responsiveness.\nParticipated in code reviews focusing on best practices for **multithreading**, ensuring team adherence to optimization guidelines and fostering a culture of continuous improvement.\nEngaged in research and development of new features aimed at enhancing engine capabilities, resulting in successful prototype development within a **4-month** timeline for a key project."
    }
  ],
  "skills": "**Programming Languages:**\n\tC++, Python, JavaScript/TypeScript\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tKeycloak (OIDC, RBAC), OAuth2, JWT\n\n**Serverless and Cloud Functions:**\n\tAWS: Lambda\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD\n\n**Cloud & Infrastructure:**\n\tAWS: ECS, RDS, S3, Azure: App Services, Blob Storage, SQL Database\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, Terraform, Ansible, Helm, Docker Compose, Nginx, Let’s Encrypt, Certbot, multithreading, CPU optimization, profiling, VTune, console profiling tools, console platforms, CPU/GPU crash dump analysis"
}