{
  "name": "Tomasz Lee",
  "role_name": "Tech Lead",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Dynamic Tech Lead with over 9 years of experience in developing and implementing robust applications, specializing in cloud services such as **AWS** and infrastructure as code using **Terraform** and **CDK**. Proficient in **Python** and **React.js**, with a strong focus on CI/CD, DevOps practices, and telemetry solutions for observability. Hands-on expertise in building data pipelines and time-series analytics, ensuring cost hygiene and security within systems. Highly effective in team leadership, fostering collaboration, and enhancing communication across development teams. Originally skilled in **microservices architecture**, and distributed systems using **Apache Kafka**, **RabbitMQ**, and **Redis**, demonstrating the ability to streamline processes and optimize performance.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Tech Lead",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "• Led the implementation of data pipelines with **Python**, integrating **AWS** services for scalable cloud architecture, improving data processing efficiency by **30%**.\n• Spearheaded the design and development of a web-based solution using **React.js**, enhancing user engagement and improving satisfaction by **25%**.\n• Executed effective CI/CD strategies on **AWS** and **DevOps** practices, resulting in a **40%** reduction in deployment times.\n• Fostered collaboration with cross-functional teams to enhance project outcomes through effective **communication** and **team leadership**.\n• Architected IoT frameworks with **AWS IoT** and real-time telemetry, enhancing observability and performance monitoring across systems.\n• Developed machine learning models utilizing **AI** and **ML** techniques for predictive analytics, contributing to **15%** increased operational efficiency.\n• Utilized **Terraform** and **CDK** for infrastructure as code management, ensuring consistency and repeatability in environment setups.\n• Implemented robust security measures following best practices for **cost hygiene**, achieving compliance with industry standards.\n• Designed and optimized **time-series analytics** features, leading to an improved data visualization engine for enhanced reporting.\n• Established SLIs and SLOs to measure and enhance service performance, ensuring product reliability and customer satisfaction."
    },
    {
      "role": "Full Stack Developer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "Led a team in designing and developing scalable cloud solutions using **AWS** and **Python**, achieving a reduction in operational costs by **20%**.\nBuilt and maintained **React.js** applications, enhancing user experience and engagement metrics by **30%**.\nImplemented CI/CD pipelines through **Terraform** and **GitHub Actions**, which resulted in a **40%** decrease in deployment times and improved production quality.\nIntegrated **DevOps** methodologies, fostering a culture of collaboration which led to a **25%** increase in deployment frequency.\nDeveloped and optimized data pipelines for **IoT** telemetry data, facilitating real-time analytics and reporting.\nManaged security protocols and conducted observability checks, achieving compliance with industry standards and enhancing system reliability.\nCreated and maintained time-series analytics solutions, improving predictive maintenance capabilities by **15%**.\nFacilitated communication between cross-functional teams to define and refine system requirements, ensuring timely and successful project delivery.\nMentored junior developers in **AI** and **ML** concepts, fostering a growth-oriented team environment and increasing overall team productivity by **20%**.\nApplied SLIs and SLOs for monitoring performance and reliability, helping to achieve operational excellence."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "- Developed scalable applications using **Python** and **React.js** to enhance software robustness and team productivity.\n- Led the implementation of **AWS** cloud solutions with a focus on **CI/CD** pipelines, achieving a deployment frequency increase of **30%**.\n- Spearheaded the architectural transformation by introducing **Terraform** for infrastructure as code and **CDK** for efficient resource management, leading to a **25%** reduction in provisioning time.\n- Strategized and executed data pipelines for real-time **IoT** data processing, improving analytics response time by **40%**.\n- Ensured observability across services through effective telemetry implementation and monitoring frameworks ensuring that **SLIs** and **SLOs** were met in production.\n- Promoted best practices in cost hygiene by optimizing resource utilization, resulting in cost savings of approximately **15%** monthly.\n- Collaborated across teams to address security requirements and increase the overall security posture of deployed applications.\n- Provided leadership in team communication and mentoring, facilitating knowledge sharing on **AI** and **ML** methods.\n- Participated in daily standups, driving alignment with project goals and maintaining high coding standards.\n- Delivered comprehensive documentation and conducted workshops, fostering skill development and increasing team efficiency."
    }
  ],
  "skills": "  **Programming Languages**\n\tPython\n\n  **Frontend Frameworks**\n\tReactJS, React.js\n\n  **Backend Frameworks**\n\tNodeJS, ExpressJS, NestJS, C#, .NET, Entity Framework, Microservices\n\n  **API Technologies**\n\tRESTful API, GraphQL\n\n  **Serverless and Cloud Functions**\n\tAWS, Terraform, CDK\n\n  **Databases**\n\tMSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB\n\n  **DevOps**\n\tAzure, CI/CD pipelines, DevOps\n\n  **Cloud & Infrastructure**\n\tCost hygiene, security, SLIs, SLOs, observability\n\n  **Other**\n\tFrontend Technologies: HTML, CSS, JavaScript, TypeScript, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS, Messaging & Caching: Apache Kafka, RabbitMQ, Redis, Testing Tools: NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest, Blockchain: Solidity, Ether.js, Web3.js, Ethereum, UX/UI Design, Git, GitHub, team leadership, communication, IoT, AI, ML, data pipelines, time-series analytics, telemetry, gateways"
}