{
  "name": "Tomasz Lee",
  "role_name": "Senior Field Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Dynamic Senior Field Engineer with 9+ years of proven expertise in **automation** and **troubleshooting** within electro-opto-mechanical systems. Experienced in **robotics** solutions, leveraging **Salesforce** for enhanced customer support and engagement. An effective communicator skilled at collaborating with cross-functional teams to achieve project objectives. Known for delivering innovative strategies that streamline processes and enhance operational efficiency.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Senior Field Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Utilized troubleshooting skills to identify and resolve technical issues in customer installations, ensuring optimal performance of the robotic systems.\nLeveraged communication skills to provide exceptional customer support, resulting in a **20%** increase in client satisfaction ratings.\nImplemented automation strategies for enhanced efficiency in robotic systems, contributing to a **30%** reduction in operational downtime.\nCollaborated with cross-functional teams to integrate electro-opto-mechanical components, enhancing system reliability and functionality.\nProvided training and guidance to junior engineers on robotics and automation techniques, fostering a knowledge-sharing culture.\nEngaged in STEM outreach to promote technology awareness and inspire the next generation of engineers in the field.\nUtilized **Salesforce** for managing customer relationships and support tickets, streamlining the troubleshooting process for clients.\nTraveled to client sites to conduct field installations and maintenance, achieving a **98%** success rate in first-time fixes.\nDocumented technical processes and solutions for future reference, enhancing the team's capabilities and efficiency."
    },
    {
      "role": "Full Stack Developer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "• Troubleshot and maintained **robotics** systems, ensuring maximum uptime and efficiency in operations, leading to a **15%** reduction in system failures.  \n• Automated repetitive tasks using **automation** tools, which significantly decreased manual workload by **25%**.  \n• Collaborated with cross-functional teams to resolve **electro-opto-mechanical** issues efficiently, ensuring seamless production workflows.  \n• Provided exceptional **customer support**, addressing technical challenges promptly and enhancing client satisfaction scores by **30%**.  \n• Trained and mentored junior engineers in **STEM** principles and troubleshooting techniques, fostering a culture of continuous learning and improvement.  \n• Developed relationship management strategies leveraging **Salesforce**, improving client engagement and lifecycle management.  \n• Utilized effective **communication** skills to liaise with clients and stakeholders, ensuring project requirements were met and exceeded expectations."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "• Utilized troubleshooting skills to diagnose and resolve issues in robotic systems, ensuring minimal downtime and high operational efficiency.\n• Implemented automation strategies to streamline processes in electro-opto-mechanical systems, enhancing productivity by **15%**.\n• Provided top-notch customer support by liaising with clients to understand needs, resulting in a **30%** increase in customer satisfaction scores.\n• Conducted training sessions on robotics and automation technologies for clients, enhancing their understanding and engagement with systems.\n• Collaborated with multidisciplinary teams to integrate robotic solutions with existing frameworks, including leveraging **Salesforce** for customer relationship management.\n• Applied STEM principles to develop innovative solutions for complex engineering problems, showcasing the ability to apply theoretical knowledge to practical applications.\n• Actively communicated project updates and technical information to stakeholders, ensuring clarity and alignment on project goals.\n• Used analytical skills to assess system performance and implement enhancements based on data-driven insights.\n• Developed troubleshooting guides and technical documentation for field engineers, improving operational efficiency by **25%**."
    }
  ],
  "skills": "**Programming Languages**\n\tPython, JavaScript, TypeScript, C#, Solidity\n\n**Backend Frameworks**\n\tNodeJS, ExpressJS, NestJS, .NET, Entity Framework, Microservices\n\n**Frontend Frameworks**\n\tHTML, CSS, ReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n**API Technologies**\n\tRESTful API, GraphQL\n\n**Serverless and Cloud Functions**\n\tAWS, Azure\n\n**Databases**\n\tMSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB\n\n**DevOps**\n\tCI/CD pipelines\n\n**Cloud & Infrastructure**\n\tGit, GitHub\n\n**Other**\n\tUX/UI Design, Automation, Robotics, Troubleshooting, Electro-opto-mechanical, Salesforce, Customer Support, STEM, Communication, Testing Tools: NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest",
  "apply_company": "Unchained Labs"
}