{
  "name": "Rei Taro",
  "role_name": "Senior React Native Software Engineer",
  "email": "rei515@outlook.com",
  "phone": "+48732529451",
  "address": "Warszawa, Poland",
  "linkedin": "https://www.linkedin.com/in/rei-taro-81a410391/",
  "profile_summary": "Results-driven Senior React Native Software Engineer with extensive experience in designing and building high-quality mobile applications. Proficient in **React Native**, **JavaScript**, and **TypeScript**, with a solid understanding of **RESTful APIs** and **Git** for version control. Skilled in implementing **CI/CD** processes to streamline deployments and enhance code quality. Strong background in **UI/UX best practices**, ensuring user-centric design in all applications. Equipped with experience in using **Bluetooth Low Energy (BLE)** for communication within IoT solutions. Passionate about smart home technology, energy systems, and EV charging technology, collaborating effectively with cross-functional teams. Previously developed scalable backend systems, high-performing APIs, and automation tools using **Python** frameworks such as **FastAPI**, **Django**, and **Flask**, while leveraging cloud solutions like **AWS** and **Azure**. Proven track record with esteemed companies including VISA, Sii Poland, and Reply Polska, contributing to innovative projects that drive business success.",
  "education": [
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2010",
      "to_year": "2015",
      "location": "Japan",
      "university": "Keio University"
    }
  ],
  "experience": [
    {
      "role": "Senior React Native Software Engineer",
      "company": "Leobit",
      "from_date": "Aug 2022",
      "to_date": "Present",
      "location": "Poland",
      "responsibilities": "Developed mobile applications using **React Native** and **JavaScript** to enhance user experience and streamline workflows for smart home technology.\nImplemented **RESTful APIs** to facilitate robust communication between mobile applications and backend services, ensuring seamless integration.\nUtilized **TypeScript** to enhance code maintainability and reduce runtime errors, leading to a 30% decrease in bug reports.\nIntegrated Bluetooth Low Energy (BLE) functionality to connect and control IoT devices, successfully managing **5+** different devices through mobile interfaces.\nApplied **Git** for version control and **CI/CD** practices, resulting in a **40%** improvement in deployment efficiency and reduced time to market for new features.\nAdhered to **UI/UX best practices** to design user-centric interfaces that improved user engagement by **25%**.\nCollaborated with cross-functional teams to optimize development processes and troubleshoot integration challenges, ensuring timely deliverables and effective communication.\nConducted testing using **Jest** to achieve **98%** code coverage and minimize regressions in mobile applications."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Innovature",
      "from_date": "Nov 2018",
      "to_date": "Jun 2022",
      "location": "Japan",
      "responsibilities": "• Developed and maintained RESTful APIs to enable seamless communication between **React Native** applications and backend services, enhancing user experience.\n• Implemented CI/CD pipelines using **Git** to automate build and deployment processes, resulting in a **30%** reduction in release time.\n• Collaborated with cross-functional teams to design UI/UX solutions that adhere to best practices, optimizing app performance on **smart home technology** and **energy systems**.\n• Integrated **Bluetooth Low Energy (BLE)** libraries into applications for efficient data exchange with IoT devices, improving connectivity by **40%**.\n• Conducted thorough testing using **Jest** to ensure high-quality code and mitigate bugs, achieving a test coverage of **90%**.\n• Led the development of native modules in **JavaScript** and **TypeScript**, expanding the functionality of mobile applications to support **EV charging technology**.\n• Communicated effectively with stakeholders to gather requirements and provide updates, ensuring alignment with business objectives and project milestones."
    },
    {
      "role": "Software Developer",
      "company": "Wizcorp",
      "from_date": "Apr 2015",
      "to_date": "Nov 2018",
      "location": "Japan",
      "responsibilities": "Developed **RESTful APIs** and integrated them with **React Native** to enhance the user experience and enable seamless communication between the backend and frontend.\nCollaborated effectively with cross-functional teams to implement **Git** version control for improved code management and team collaboration across **JavaScript** and **TypeScript** projects.\nDesigned mobile applications utilizing **Bluetooth Low Energy (BLE)** and native modules, contributing to smart home technology advancements by managing devices and energy systems efficiently.\nImplemented CI/CD pipelines to automate testing and deployment processes, ensuring high-quality releases and rapid iteration cycles.\nExecuted unit and integration tests using **Jest**, enhancing software reliability and performance in line with UI/UX best practices.\nParticipated in the development of IoT solutions specifically for **EV charging technology**, providing innovative features to a modern energy system landscape.\nFacilitated effective communication among team members to promote collaboration and share knowledge on emerging technologies and standards."
    }
  ],
  "skills": "Programming Languages:\n\t**Python (3.8+), SQL, Bash, JavaScript, TypeScript**\n\nBackend Frameworks:\n\t**FastAPI, Flask, Django, Celery**\n\nFrontend Frameworks:\n\t**React Native**\n\nAPI Technologies:\n\t**REST/gRPC APIs, RESTful APIs**\n\nServerless and Cloud Functions:\n\t**AWS (EC2, S3, Lambda), Azure**\n\nDatabases:\n\t**PostgreSQL, MySQL, MongoDB, Redis**\n\nDevOps:\n\t**Docker, Kubernetes, GitHub Actions, Azure DevOps, CI/CD, Git**\n\nCloud & Infrastructure:\n\t**AWS (EC2, S3, Lambda), Azure**\n\nOther:\n\t**AI/ML Tools: Pandas, NumPy, scikit-learn, TensorFlow, Airflow, MLflow, Microservices, Kafka, UI/UX best practices, Bluetooth Low Energy (BLE), BLE libraries, native modules, Jest, IoT, smart home technology, energy systems, EV charging technology, collaboration, communication**"
}