{
  "name": "Tomasz Lee",
  "role_name": "Senior ML Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Results-driven Senior ML Engineer with 9+ years of experience in deploying advanced Machine Learning solutions. Proficient in **Python**, **Java**, and **C++** with hands-on expertise in **ML Frameworks** such as **PyTorch**, **MXNet**, **TensorFlow**, and model serving frameworks including **Seldon Core**, **TorchServe**, and **TensorFlow Serving**. Experienced in cloud platforms **AWS**, **Azure**, and **GCP** for scalable deployments, along with strong knowledge of data warehousing solutions like **Amazon Redshift**, **Google BigQuery**, and **Azure SQL Data Warehouse**. Proven track record in implementing MLOps practices to optimize workflows and enhance automated testing strategies. Additionally, I possess a solid foundation in distributed systems and microservices architecture, ensuring the delivery of efficient and high-quality software applications.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Senior ML Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Designed and implemented ML models using **TensorFlow**, **PyTorch**, and **MXNet** to enhance predictive analytics and recommendation systems.\nUtilized **Seldon Core** and **TorchServe** for model serving and deployment, ensuring robust scalability and performance across production environments.\nLeveraged cloud platforms like **AWS**, **Azure**, and **GCP** for deploying machine learning solutions, optimizing resources and reducing infrastructure costs by 30%.\nEmployed **Python** for automating machine learning workflows, enhancing data processing efficiency and reducing processing times by 25%.\nConducted automated testing of ML algorithms to ensure reliability and accuracy, increasing model performance metrics by 15%.\nOptimized data pipelines by integrating **Amazon Redshift** and **Google BigQuery**, improving data retrieval speeds by 20%.\nDeveloped CI/CD pipelines for ML models on **Azure DevOps**, cutting deployment time by 40%.\nCollaborated with data scientists and engineers to refine ML models, improving accuracy rates by 10% through rigorous experimentation and evaluation.\nImplemented security protocols for ML applications, ensuring data integrity and compliance with industry standards.\nMentored junior engineers in best practices for **MLOps**, fostering a collaborative and knowledge-sharing environment."
    },
    {
      "role": "Software Engineer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "• Developed and implemented machine learning models using **TensorFlow** and **PyTorch**, leading to a 20% improvement in predictive accuracy for analytics.\n• Designed and optimized data pipelines for automated model training and serving in deployed applications, leveraging **AWS** and **Azure** services to achieve scalability.\n• Collaborated on developing recommendation systems with **Amazon Redshift** and **Google BigQuery**, optimizing query performance by 35%.\n• Established MLOps practices through the integration of **Seldon Core** and **TorchServe** for model management, reducing model deployment time by 40%.\n• Conducted extensive testing and validation of models with **Automated Testing** frameworks, leading to a 50% decrease in deployment errors.\n• Utilized **MXNet** for training complex models, resulting in a robust system capable of processing 10,000+ requests per minute.\n• Mentored junior developers in best practices for **machine learning** and coding standards, fostering a collaborative team environment.\n• Engaged with stakeholders to understand data requirements and adjusted models accordingly, ensuring alignment with business objectives.\n• Spearheaded the implementation of CI/CD for machine learning projects, decreasing release cycles by 30%.\n• Participated in regular code reviews and knowledge-sharing sessions, enhancing team skills on **Python**, **Java**, and **C++**."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "• Developed and optimized Machine Learning models using **PyTorch**, **TensorFlow**, and **MXNet**, achieving a model accuracy improvement of **15%** over previous versions.\n• Implemented model serving frameworks such as **Seldon Core** and **TorchServe** for scalable deployment, enhancing system responsiveness by **30%** under load.\n• Collaborated with cross-functional teams to integrate Machine Learning solutions with cloud platforms like **AWS**, **Azure**, and **GCP**, ensuring seamless operational workflows.\n• Led the design and deployment of automated testing processes for machine learning pipelines, resulting in a **40%** reduction in deployment errors.\n• Utilized **Python**, **Java**, and **C++** to develop algorithms tailored for recommendation systems, boosting user engagement metrics by **25%**.\n• Engaged in continuous learning and adaptation of new ML frameworks to maintain cutting-edge advancements in capabilities.\n• Managed large datasets within **Amazon Redshift** and **Google BigQuery**, ensuring data integrity and accessibility across systems.\n• Spearheaded MLOps initiatives, streamlining model training and deployment phases with enhanced monitoring and maintenance practices.\n• Participated in agile methodology through daily standups and sprint planning to ensure timely delivery of project objectives.\n• Authored comprehensive documentation and user guides for machine learning implementations, fostering knowledge sharing within teams."
    }
  ],
  "skills": "  **Programming Languages**\n\tPython, Java, C++, JavaScript, TypeScript\n\n  **Backend Frameworks**\n\tNodeJS, ExpressJS, NestJS, C#, .NET, Entity Framework, Microservices\n\n  **Frontend Frameworks**\n\tReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n  **API Technologies**\n\tRESTful API, GraphQL\n\n  **Serverless and Cloud Functions**\n\tAWS, Azure, GCP\n\n  **Databases**\n\tMSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB, Amazon Redshift, Google BigQuery, Azure SQL Data Warehouse\n\n  **DevOps**\n\tCI/CD pipelines\n\n  **Cloud & Infrastructure**\n\tAWS, Azure\n\n  **Other**\n\tUX/UI Design, Git, GitHub, Automated Testing, Machine Learning, ML Frameworks, PyTorch, MXNet, TensorFlow, Model Serving Frameworks, Seldon Core, TorchServe, TensorFlow Serving, MLOps, Recommendation Systems",
  "apply_company": "Scopely"
}