{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Backend Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-187801395/",
  "profile_summary": "Senior Backend Engineer with 13+ years of robust experience in software engineering, specializing in **backend development** within the **FinTech** sector. Proficient in **API design**, **microservices**, and **database management**, ensuring optimal performance and scalability of applications. Demonstrated ability to implement **cloud services** such as AWS and Azure to enhance infrastructure and application deployment.\n\nAdept at delivering high-performance applications through collaboration and strong communication skills. Skilled in languages including **JavaScript/TypeScript**, **Python**, and frameworks like **Node.js**, **FastAPI**, and **Django**. Extensive experience in payment processing systems and integration with compliance standards like PCI DSS. Passionate about leveraging technology to optimize performance and streamline backend processes.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Backend Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Developed robust backend solutions for the **FinTech** industry, ensuring seamless **payment processing** and adherence to industry standards.\n• Engineered microservices architectures utilizing **Docker** and **Kubernetes** for scalable application deployment and maintenance.\n• Designed RESTful APIs integrating with **cloud services** like **AWS Lambda** and **Azure Functions** for efficient data processing and retrieval.\n• Managed databases including **PostgreSQL** and **MongoDB** to optimize data storage and retrieval processes, enhancing overall performance.\n• Collaborated with cross-functional teams to ensure effective communication and integration of services, driving successful project outcomes.\n• Implemented performance optimization strategies to improve application response times by **30%**, enhancing user experience in **FinTech** applications.\n• Developed and maintained CI/CD pipelines leveraging **GitHub Actions** and **CircleCI**, streamlining the software engineering process.\n• Conducted regular code reviews, promoting best practices and fostering a culture of continuous improvement and collaboration within the team.\n• Achieved a **99.9%** uptime for services through proactive monitoring and deployment strategies, ensuring reliability and customer satisfaction.\n• Spearheaded the transition to microservices, resulting in a **40%** reduction in deployment times and increased system agility.\n• Partnered with various teams to refine API design, focusing on scalability and security in backend development, thus improving integration efforts.\n• Defined and executed testing strategies using **Postman** and other testing frameworks, ensuring high-quality deliverables with minimal bugs."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "• Utilized **Node.js** (NestJS/Express) and **Python** (FastAPI, Django) for backend development, modernizing core financial platforms with microservices architecture, resulting in a **30%** improvement in scalability and performance for high-volume transactional systems.\n• Engaged in **FinTech** innovations by driving the development of interactive front-end applications with **React** (18), **Vue 3**, **Next.js**, and **TypeScript**, employing **Redux Toolkit** and **Tailwind CSS** to deliver sleek, responsive interfaces for financial tools and admin panels.\n• Implemented real-time analytics dashboards utilizing **React**, **D3.js**, and **Power BI Embedded**, delivering crucial insights into transactions and anomalies with an operational efficiency increase of **25%**.\n• Designed and deployed a robust event-driven architecture using **Kafka**, **RabbitMQ**, and **Azure Service Bus** to ensure effective asynchronous communication for critical workflows such as payments with a processing speed of **0.5 seconds**.\n• Developed ETL pipelines for ingesting financial data from internal and third-party sources using **Python**, **Apache Airflow**, and **Azure Data Factory**, facilitating both batch and real-time processing with over **100 TB** of data handled monthly.\n• Built and deployed machine learning models for fraud detection employing **scikit-learn**, **XGBoost**, and **Azure ML**, enabling a **40%** increase in proactive detection of suspicious activity based on user behavior and transaction patterns.\n• Created ML pipelines for real-time credit scoring, churn prediction, and transaction classification, leveraging **MLflow** and **Airflow** to integrate model inference into backend services, thereby enhancing overall service response time by **20%**."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "• Developed robust **backend development** solutions for a global e-commerce platform using **Python** (FastAPI, Django) and **Node.js** (NestJS, Express), ensuring high availability and scalability for critical modules like checkout and order fulfillment.\n• Designed and implemented secure **payment processing** workflows integrated with **Stripe**, **PayPal**, and **Razorpay**, ensuring compliance with PCI standards and enhancing transaction security.\n• Managed distributed data storage with **MongoDB**, **PostgreSQL**, and **Redis**, achieving performance optimization for over **1M** daily active users through efficient data access and caching strategies.\n• Collaborated cross-functionally to ensure seamless **API design** and integration, enhancing communication and cooperation across teams for a more streamlined development process.\n• Engineered real-time features leveraging **WebSockets** and event-driven architecture with **Kafka** and **RabbitMQ** for immediate order updates and dynamic inventory tracking, positively impacting user engagement metrics by over **25%**.\n• Implemented and maintained microservices architecture, allowing for independent deployment and scaling of various platform services, which improved deployment speed by **30%**.\n• Applied advanced data management techniques with **Cassandra** to handle high-volume transactions and ensure **99.9%** data availability, contributing to overall platform robustness.\n• Enhanced collaboration through regular communication mechanisms to align backend development efforts with overall business objectives and ensure timely project deliveries.\n• Spearheaded performance optimization initiatives, utilizing **Redis** caching for product metadata, improving page load times by **50%** and enhancing user experience.\n• Integrated cloud services to optimize infrastructure, ensuring scalability and reliability for both backend and frontend applications, adaptable to traffic spikes of up to **3X**.\n"
    }
  ],
  "skills": "**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Programming Languages:**\n\tPython, JavaScript, TypeScript\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tAPI design\n\n**Serverless and Cloud Functions:**\n\tAWS: Lambda, ECS; Azure: App Services\n\n**Cloud & Infrastructure:**\n\tDocker, Kubernetes, Terraform, Ansible, Helm, Docker Compose\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**DevOps:**\n\tGitHub Actions, GitLab CI/CD\n\n**Other:**\n\tArtificial Intelligence: MLflow, Airflow, Kubeflow\n\tAuthentication & Security: Keycloak (OIDC, RBAC), OAuth2, JWT\n\tNginx, Let’s Encrypt, Certbot\n\tCollaboration, Communication, Performance optimization, Microservices, Software engineering, Database management, Payment processing, Cloud services, FinTech"
}