{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior MES Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "Focused on delivering top-notch Manufacturing Execution Systems (MES) solutions, I am a seasoned Full Stack Developer with 8 years of experience in high-performance applications, particularly in the healthcare and financial sectors. My technical expertise includes proficiency in **JavaScript**, **TypeScript**, **Python**, and **Flutter**, complemented by a robust development background in **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**. I leverage deep cloud experience across **Azure** and **AWS** to create highly efficient systems.\n\nMy skills extend to a microservices architecture, event-driven systems, and CI/CD automation, ensuring the applications I develop are secure, compliant with regulations such as FDA, GMP, and CSV, and cater to industry standards. Additionally, I have successfully integrated AI/ML capabilities into enterprise systems for predictive analytics and data processing, with hands-on experience in tools such as **MLflow**, **Airflow**, and **Kubeflow**. I am committed to fostering collaboration and communication within teams to deliver optimal results.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior MES Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Demonstrated expertise in **MES** (Manufacturing Execution Systems) and compliance with **FDA** and **GMP** standards through the design and implementation of efficient systems for pharma manufacturing environments.\n- Collaborated effectively with cross-functional teams, enhancing communication and collaboration to drive project success and improve overall operational efficiency.\n- Developed and optimized system implementations for **Opcenter**, **POMS**, and **PharmaSuite**, ensuring a scalable and robust manufacturing process and data integrity.\n- Enhanced production monitoring and reporting by integrating **Camstar** solutions, providing real-time insights and compliance through automated data collection.\n- Led initiatives focusing on **CSV** (Computer System Validation) to ensure compliance with regulatory requirements, resulting in a reduction of audit findings by **25%**.\n- Spearheaded the implementation of advanced features in **XFP** systems, ensuring efficient workflow through meticulous process mapping and analysis.\n- Ensured successful project execution by applying strong project management skills, achieving **95%** on-time delivery rate across all projects.\n- Conducted training sessions to educate staff on new technologies and processes, resulting in improved operational performance and team cohesion.\n- Actively participated in system validation and testing phases, establishing strong documentation practices that led to a **30%** increase in user acceptance testing success rates.\n- Established key performance indicators (KPIs) for MES performance, driving continuous improvement initiatives that improved production efficiency by **15%** year-over-year."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "- Leveraged **Opcenter** and **PharmaSuite** to enhance manufacturing execution systems, ensuring compliance with **FDA** regulations and **GMP** standards, resulting in 20% improvement in operational efficiency.\n- Collaborated with cross-functional teams to integrate **XFP** and **POMS** solutions, facilitating seamless data exchange and traceability across production lines, achieving 95% accuracy in production reports.\n- Developed and maintained **Camstar** configurations, optimizing MES functionalities and reducing downtime by 15% through proactive monitoring and adjustments.\n- Spearheaded initiatives for CSV compliance in MES implementations, ensuring that processes met rigorous regulatory requirements and enhancing validation timelines by 25%.\n- Fostered a culture of collaboration and communication within teams, organizing bi-weekly meetings that improved project visibility and led to a 30% faster decision-making process.\n- Engaged in continuous improvement projects utilizing lean methodologies within MES setups, achieving a reduction in cycle time by 10%.\n- Provided training and support for MES users, ensuring 100% of personnel were proficient in the systems, which contributed to a smoother transition during upgrades and changes."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Utilized **MES** systems to design and optimize production workflows, ensuring compliance with **GMP** and **FDA** regulations in pharmaceutical manufacturing environments.\nCollaborated with cross-functional teams to implement **PharmaSuite**, **Opcenter**, and **POMS** software solutions, enhancing operational efficiency and data integrity across manufacturing processes.\nDeveloped **XFP** functionalities to automate quality management processes, streamline documentation, and support **CSV** (Computer System Validation) activities to comply with regulatory standards.\nEngaged in regular **communication** with stakeholders to gather requirements and provide updates, ensuring alignment and transparency throughout the project lifecycle.\nApplied **Camstar** techniques to monitor real-time production data, facilitating rapid response to process deviations and enhancing overall product quality.\nChampioning collaboration within multidisciplinary teams to drive adoption of best practices in **PAS|X**, promoting an agile approach to project execution and continuous improvements.\nConducted training sessions on **MES** applications, fostering a culture of knowledge sharing and enhancing team competency in operational technologies.\nImplemented rigorous testing methodologies to validate system capabilities and performance, ensuring consistent adherence to regulatory and corporate standards throughout software deployment.\nLeveraged analytics tools to assess production metrics, resulting in a **15%** increase in throughput and a **25%** reduction of downtime across key operations.\nExecuted project milestones efficiently, consistently meeting deadlines and exceeding stakeholder expectations in a complex regulatory environment."
    }
  ],
  "skills": " **API Technologies:**\n\tFDA, CSV\n\n **Other:**\n\tMES, PAS|X, Opcenter, PharmaSuite, XFP, POMS, Camstar, GMP, collaboration, communication\n\n **Programming Languages:**\n\tPython(FastAPI, Flask, Django), JavaScript/TypeScript (React, Vue, Angular)\n\n **Artificial Intelligence & Machine Learning:**\n\tMLflow, Airflow, Kubeflow\n\n **DevOps & Cloud:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, AWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n **Authentication & Security:**\n\tKeycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot\n\n **Databases & Caching:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n **CI/CD & Infrastructure as Code:**\n\tTerraform, Ansible, Helm, Docker Compose",
  "apply_company": "Accenture"
}