{
  "name": "Tomasz Lee",
  "role_name": "Senior Analytics Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Results-driven Senior Analytics Engineer with 9+ years of experience in data analytics and engineering. Proficient in **SQL**, **dbt**, **Airflow**, **Azure Data Factory**, and **Snowflake**, enhancing data processing workflows and analytics capabilities. Adept in **BigQuery**, **Looker**, and **Power BI** for effective data visualization and dashboard design, translating complex datasets into actionable insights. Strong expertise in **Python** and **R** for data manipulation and statistical analysis. Proven track record in KPI development and stakeholder management, ensuring project ownership and assertiveness in delivering high-quality analytics solutions. Highly effective communicator with a collaborative approach to leading analytics projects to success.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Senior Analytics Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Utilized **SQL** and **Python** to analyze and structure data sets, ensuring accuracy and high performance in analytics.\nDeveloped and maintained ETL processes using **dbt** and **Airflow** to streamline data transformation workflows, resulting in a 30% increase in efficiency.\nDesigned and implemented dashboards and data visualizations using **Looker** and **Power BI**, enhancing decision-making capabilities and allowing stakeholders to easily track **KPI** metrics.\nCollaborated with cross-functional teams to gather requirements and deliver insights that drive strategic business outcomes, promoting effective **stakeholder management**.\nLed the migration of data workflows to **Azure Data Factory**, ensuring seamless integration with existing systems and boosting system reliability.\nExecuted data extraction and analysis in multiple environments including **Snowflake** and **BigQuery**, optimizing data retrieval processes by 25%.\nEstablished a data governance framework to maintain data integrity and compliance while enhancing ownership for analytics processes.\nDeveloped automated reporting protocols utilizing **n8n** to simplify and optimize regular analytics tasks, decreasing time spent on manual reports by **50%**.\nCommunicated analytical insights effectively to executive stakeholders, demonstrating strong **communication** and **assertiveness** skills throughout all levels of the organization.\n"
    },
    {
      "role": "Full Stack Developer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "Utilized **SQL** to develop and optimize complex queries for data retrieval across **Snowflake** and **BigQuery**, ensuring seamless data flow and access with a **30%** reduction in query execution time.\nImplemented data integration workflows using **dbt** and **Airflow** to automate ETL processes, reducing manual intervention by **40%**.\nDesigned interactive dashboards and reports using **Looker** and **Power BI**, leading to a **25%** increase in stakeholder engagement through improved data visualization.\nDeveloped and maintained data pipelines on **Azure Data Factory**, enhancing data availability and consistency for reporting.\nCollaborated with cross-functional teams to define key performance indicators (KPIs) and reporting requirements, ensuring alignment with business objectives and stakeholder expectations.\nConducted thorough data analysis using **Python** and **R**, providing actionable insights that informed strategic decision-making.\nFostered strong communication with stakeholders, leading to enhanced ownership and assertiveness in project execution.\nLed initiatives on data quality assessment and improvement, establishing robust frameworks that elevated reporting accuracy.\nMentored junior analysts in data visualization techniques and the use of various tools, improving their skills and productivity within the team.\nCreated visually compelling data visualizations and custom KPI dashboards, allowing for real-time monitoring of critical metrics."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "• Developed and optimized **SQL** queries for increased efficiency in data retrieval, enhancing user experience by **30%**.\n• Utilized **dbt** for data transformation processes, streamlining the workflow and reducing processing time by **25%**.\n• Implemented **Airflow** for workflow management, ensuring timely and reliable data processing across various projects.\n• Leveraged **Azure Data Factory** for seamless data integration and movement, improving data pipeline performance by **40%**.\n• Designed and developed reports and dashboards using **Looker** and **Power BI**, enabling stakeholders to visualize critical KPIs efficiently.\n• Collaborated with cross-functional teams to gather requirements and enhance project outputs through effective **communication**.\n• Oversaw data integration with **Snowflake** and **BigQuery**, ensuring data accuracy and accessibility for analytics.\n• Developed data pipelines using **Talend** and **n8n**, automating repetitive tasks and increasing data availability.\n• Conducted thorough analysis in **Python** and **R**, providing actionable insights that drove business decisions.\n• Engaged in stakeholder management to align analytics strategies with business objectives, fostering ownership and assertiveness within the team.\n• Created and presented detailed reports to stakeholders, enhancing data-driven decision making and transparency."
    }
  ],
  "skills": "**Programming Languages**\n\tPython, SQL, R\n\n**Backend Frameworks**\n\tNodeJS, ExpressJS, NestJS, C#, .NET, Entity Framework, Microservices\n\n**Frontend Frameworks**\n\tHTML, CSS, JavaScript, TypeScript, ReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n**API Technologies**\n\tRESTful API, GraphQL\n\n**Serverless and Cloud Functions**\n\tAWS, Azure\n\n**Databases**\n\tMSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB, Snowflake, BigQuery\n\n**DevOps**\n\tCI/CD pipelines\n\n**Cloud & Infrastructure**\n\tAzure Data Factory, Talend, Airflow, dbt, n8n\n\n**Other**\n\tUX/UI Design, Git, GitHub, Redux, Blockchain: Solidity, Ether.js, Web3.js, Ethereum, Apache Kafka, RabbitMQ, Redis, data visualization, dashboard design, KPI, communication, stakeholder management, ownership, assertiveness",
  "apply_company": "Contabo"
}