{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Cloud Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-152840397/",
  "profile_summary": "As a skilled Senior Cloud Engineer with 8 years of experience, I bring a deep understanding of **Cloud** services, including **IaaS**, **PaaS**, and **AIaaS**. Proficient in leveraging **VMware**, **OpenStack**, and **GPU** technologies, I excel at building and optimizing high-performance cloud solutions tailored for both the healthcare and financial sectors. My extensive background in **Networking** complements my abilities to design and implement secure infrastructures that meet rigorous compliance standards such as HIPAA and PCI DSS.\n\nIn addition to my cloud expertise, I have a strong foundation in full-stack development using **JavaScript/TypeScript**, **Python**, and **Flutter**, with hands-on experience utilizing frameworks such as **React**, **Next.js**, **Node.js**, and **FastAPI**. I have successfully led the development of enterprise-grade platforms that integrate AI/ML capabilities, enhancing functionalities through predictive analytics and intelligent automation.\n\nMy commitment to best practices in CI/CD automation and microservices architecture ensures robust and scalable applications. I also possess notable experience in developing machine learning pipelines and implementing MLOps workflows using tools like **MLflow**, **Airflow**, and **Kubeflow**. Adept at communication and presentation, I effectively bridge technical concepts and stakeholder requirements.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Cloud Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Utilized **Cloud** technologies to architect and develop scalable, full-stack healthcare and financial platforms ensuring compliance with HIPAA, FHIR, and other critical regulations.\nDesigned and implemented **IaaS** solutions with support for **VMware** and **OpenStack**, enhancing infrastructure flexibility for applications.\nLeveraged **AIaaS** features to integrate AI-based functionalities into applications, delivering personalized health recommendations and smart financial dashboards, powered by trained models hosted on **Azure ML** and **AWS**.\nImplemented and maintained **PaaS** solutions to streamline application deployment processes, focusing on scalability and reliability for both clientele and backend services.\nCollaborated across teams for effective **Networking** strategies, ensuring seamless communication between services and optimal network performance.\nConducted advanced presentations to stakeholders on **Bare Metal** deployment benefits for high-performance applications, emphasizing cost effectiveness and resource optimization.\nUtilized effective **Communication** channels to streamline project updates and foster collaboration among diverse teams, ensuring project milestones were met efficiently.\nDesigned and delivered training sessions on cloud technologies and services including **Salesforce** and **HubSpot**, enhancing team knowledge and productivity.\nOversaw the deployment of complex data visualization tools using **D3.js**, **Chart.js**, and **Power BI Embedded**, providing actionable insights on transaction trends, achieving a 25% improvement in operational KPIs.\nImplemented enterprise-level DevOps pipelines using **GitHub Actions** and **Azure DevOps**, improving deployment frequency by 30% while integrating security scans and linting into development workflows.\nOptimized machine learning model deployment with **MLflow**, **DVC**, and **Apache Airflow**, enhancing model training and validation durations by 40% across production environments."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "- Managed cloud services and infrastructure to enhance scalability and performance for financial platforms, leveraging **IaaS** and **PaaS** solutions.\n- Enhanced the architecture of high-volume transaction systems through infrastructure modernization, focusing on **Cloud** technologies and strategies.\n- Unified AIaaS solutions to integrate and deploy AI-driven applications, ensuring robust machine learning processes and scalability in production.\n- Established and maintained efficient networking protocols and **VMware** environments to support seamless cloud deployment and operations.\n- Effectively communicated technical concepts and project updates to stakeholders to foster transparency and understanding throughout engagement phases.\n- Led presentations on the importance of leveraging **OpenStack** for cloud management and **Salesforce** integration to optimize financial operations.\n- Demonstrated strong collaboration and communication skills while working in cross-functional teams to align cloud technologies with business goals.\n- Highlighted the business impact driven by data-driven decision-making, including addressing client needs through **HubSpot** optimization and integration.\n- Contributed to the ongoing training and development of team members in the areas of cloud strategies and architecture, emphasizing hands-on engagement with **GPU** capabilities and bare metal deployment."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Utilized **Cloud** solutions to design and optimize backend services, ensuring high availability and scalability across various infrastructure types including **IaaS**, **PaaS**, and **Bare Metal** deployments for a global e-commerce platform.\nImplemented AI/ML-based recommendation strategies using **AIaaS** to enhance product offerings, utilizing tools like **TensorFlow** and **scikit-learn** for real-time behavioral analysis, improving conversion rates by **20%**.\nDemonstrated strong **communication** and **presentation** skills through collaboration with cross-functional teams to drive project success and deliver innovative solutions within tight deadlines.\nEngineered responsive cloud-native applications with a focus on distributed data storage leveraging **VMware**, **OpenStack**, and databases like **MongoDB** and **PostgreSQL**, ensuring fault tolerance and performance under high-traffic conditions.\nManaged cloud infrastructure with a focus on **Networking** best practices, maintaining a secure environment for customer data access through role-based access control (RBAC).\nOptimized deployment workflows by implementing feature flags and blue-green deployments using leading orchestrators, allowing for a **30%** reduction in rollback incidents during major updates.\nCreated cloud-based solutions for real-time data handling and customer engagements, integrating both **Salesforce** and **HubSpot** to streamline customer interactions while ensuring compliance with **GDPR** regulations.\nCollaborated on interdepartmental projects combining e-commerce solutions with the cloud to enhance business productivity by implementing automated workflows and improving legacy systems."
    }
  ],
  "skills": "**Cloud & Infrastructure**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL), IaaS, PaaS, AIaaS, GPU, Bare Metal, VMware, OpenStack\n\n**Programming Languages**\n\tPython (FastAPI, Flask, Django), JavaScript/TypeScript (React, Vue, Angular)\n\n**Backend Frameworks**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks**\n\tReact, Vue, Angular\n\n**API Technologies**\n\tKeycloak (OIDC, RBAC), JWT, OAuth2\n\n**Databases**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**DevOps**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Other**\n\tMLflow, Airflow, Kubeflow, Nginx, Certbot, Communication, Presentation, Salesforce, HubSpot",
  "apply_company": "Gcore"
}