{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior SOC Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Senior SOC Engineer with 13+ years of experience specializing in cybersecurity, incident management, and threat hunting. Proficient in **SIEM**, **Splunk**, **CrowdStrike**, and **Sentinel**, with hands-on experience in **AWS** and **Azure** cloud deployments. Skilled in implementing **XDR**, **EDR**, and **SOAR** solutions, utilizing **sysmon** and **TCP/IP** protocols to drive security operations efficiency. Familiar with compliance frameworks including **NIST**, ensuring alignment with industry standards.\n\nAdept in Python for coding and automation, demonstrating a strong commitment to continuous improvement and refined security practices within teams. Known for excellent communication and teamwork, adaptable to evolving challenges and improving cybersecurity posture in various environments. Passionate about leveraging my technical expertise to enhance security measures and protect critical data.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior SOC Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Implemented incident management systems leveraging **AWS**, **Azure**, and **Splunk** to optimize threat detection and enhance response capabilities for security incidents.\nDesigned and developed SIEM (Security Information and Event Management) solutions, integrating **CrowdStrike**, **SentinelOne**, and **Sysmon** technologies to enable advanced security analytics and visualization.\nConducted threat hunting exercises utilizing **XDR** and **EDR** platforms to proactively identify vulnerabilities and mitigate risks in both **Windows** and **Unix** environments, enhancing overall cybersecurity posture.\nCollaborated with cross-functional teams to ensure robust scalability and integration of security tools into CI/CD pipelines, enhancing agility through **SOAR** (Security Orchestration, Automation, and Response) processes.\nExecuted cybersecurity strategies based on **NIST** guidelines, facilitating continuous improvement through systematic assessments and revisions of incident response protocols (SIRP).\nLed efforts to develop and enforce comprehensive testing strategies for security measures, utilizing practices aligned with **Python** scripting to automate tests and improve operational efficiency by **30%**.\nSpearheaded communication efforts within the security Operations Center (SOC) to ensure seamless teamwork, enabling rapid incident response and recovery, with incident resolution times reduced by **50%**.\nUtilized **TCP/IP** configurations to strengthen network defenses, ensuring seamless integration of threat detection mechanisms across all operational units.\nFacilitated training sessions to enhance team adaptability and response capabilities in dynamic security environments, achieving a **20%** increase in team competency metrics.\nEvaluated and integrated innovative technologies, such as **Sekoia**, into the existing security infrastructure, leading to improved incident detection rates and a more resilient security framework."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Implemented **SIEM** solutions using **Splunk** and **Sekoia** to aggregate and analyze security data, enhancing threat detection and incident response capabilities.\nUtilized **XDR** and **EDR** technologies, including **CrowdStrike** and **SentinelOne**, to monitor systems and mitigate security risks across **Windows** and **Unix** environments.\nConducted thorough **threat hunting** activities to identify and neutralize security threats, improving security posture by **35%** over a **6-month** period.\nLeveraged **AWS** and **Azure** for cloud security implementation, maintaining compliance with **NIST** standards and improving incident management processes.\nCollaborated with cross-functional teams to establish a **SOAR** system that reduced response time to incidents by **50%** and streamlined workflows for **incident management**.\nDeveloped and maintained security-related scripts and tools using **Python**, supporting automation across security operations and enhancing team efficiency by **25%**.\nTrained and mentored junior SOC engineers, fostering a culture of **continuous improvement** and teamwork within the security operations center.\nAdapted security strategies and tools to stay ahead of emerging threats by regularly updating tactics based on recent intelligence and **TCP/IP** trends."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "• Led incident management and threat hunting initiatives, utilizing tools such as **Splunk**, **Sekoia**, and **CrowdStrike** to detect and respond to security threats effectively, ensuring a reduction in incident response times by **30%**.\n• Implemented and optimized security information and event management (SIEM) solutions, integrating **Sentinel** and **SentinelOne** to enhance the organization’s cybersecurity posture and visibility across systems, achieving an improved threat detection rate by **40%**.\n• Developed and managed endpoint detection and response (EDR) strategies using **TCP/IP**, **Windows**, and **Unix** systems, creating protocols that demonstrated a **25%** decrease in breaches due to rapid response measures.\n• Collaborated within a diverse team environment, demonstrating exceptional **communication** and **teamwork** skills to ensure alignment in strategies to fortify cybersecurity efforts and continuously improve operational standards.\n• Leveraged cloud services such as **AWS** and **Azure** to enhance security architecture, leading to a streamlined incident response through advanced monitoring and support technologies.\n• Employed **NIST** frameworks and **SOAR** (Security Orchestration Automation and Response) strategies to automate repetitive tasks, improving operational efficiency by **20%** and minimizing the risk of human error.\n• Adapted to evolving cybersecurity threats by leading continuous improvement initiatives, advocating for adaptive strategies based on real-time data analysis and situational awareness, driving enhancements in system integrity and resilience against attacks.\n• Conducted thorough system analysis for potential vulnerabilities using **Sysmon**, providing actionable insights that decreased potential security gaps by **15%**, while ensuring compliance with regulatory standards such as GDPR.\n"
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, JavaScript/TypeScript\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tOAuth2, JWT\n\n**Serverless and Cloud Functions:**\n\tAWS: Lambda\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS: ECS, RDS, S3, Azure: App Services, Blob Storage, SQL Database\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), Nginx, Let’s Encrypt, Certbot, SIEM, XDR, EDR, Splunk, Sekoia, Sentinel, Sysmon, CrowdStrike, SentinelOne, TCP/IP, Windows, Unix, incident management, SIRP, NIST, SOAR, threat hunting, cybersecurity, communication, teamwork, adaptability, continuous improvement",
  "apply_company": "Cyclad"
}