{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Full Stack Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "Results-driven Senior Full Stack Engineer with 8 years of experience, specializing in high-performance web applications utilizing **React**, **JavaScript**, **TypeScript**, **PHP**, **HTML5**, and **CSS**. Proven ability to leverage **MySQL** databases for efficient data management while employing modern development practices such as TDD and CI/CD to ensure quality and rapid delivery.\nDemonstrated leadership skills with a focus on mentoring junior developers and fostering a collaborative team environment. Well-versed in deployment using **Docker** and **Kubernetes**, ensuring scalable and robust solutions. Strong communication skills enhance cross-functional collaboration, driving successful project outcomes.\nAdditionally, I bring extensive knowledge of cloud technologies and microservices architecture, having developed enterprise-grade platforms that adhere to compliance standards such as HIPAA and PCI DSS. Passionate about integrating innovative technologies to build solutions that solve complex challenges.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Full Stack Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Developed scalable, full-stack applications using **React** and **JavaScript** alongside **TypeScript** for enhanced type safety, ensuring high performance and scalability.\nUtilized **Laravel** for robust backend development and API integration, while adhering to best programming practices and standards.\nArchitected modern web applications with responsive designs employing **HTML5** and **CSS**, delivering user-friendly interfaces.\nImplemented **MySQL** for reliable data storage and management, optimizing queries for performance.\nLed the establishment of **Kubernetes** and **Docker** for containerization and orchestration, enabling efficient deployment and scaling.\nPromoted Test-Driven Development (**TDD**) practices across teams, ensuring high code quality and reducing bug rates by up to **30%**.\nEstablished CI/CD pipelines with tools like Jenkins and GitHub Actions to automate testing and deployment, reducing time-to-production by **40%**.\nMentored junior developers, fostering a culture of learning and collaboration, improving team productivity metrics by **25%**.\nFacilitated effective communication across cross-functional teams, ensuring alignment on project goals and timelines.\n"
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Demonstrated strong **JavaScript** and **TypeScript** skills by building dynamic, user-focused front-end applications using **React (18)**, **Vue 3**, and **Next.js**, ensuring scalable and maintainable code through effective state management with **Redux Toolkit** and UI design with **Tailwind CSS**.\nApplied **PHP** and **MySQL** to support back-end services, optimizing database queries for high performance and robust data handling in **Laravel** applications.\nLed cross-functional teams, enhancing **communication** and implementing **CI/CD** practices for continuous integration and delivery, resulting in a 30% reduction in release cycles.\nMentored junior developers, fostering a collaborative team environment to share knowledge on **Kubernetes** and **Docker** for containerization and orchestration strategies, contributing to a 25% increase in team efficiency.\nEmphasized test-driven development (**TDD**) methodologies to improve code quality, achieving 95% test coverage across critical application components.\nUtilized **HTML5** and **CSS** to ensure responsive design and compatibility across devices, enhancing user experience significantly.\nProactively engaged in leadership activities to drive project success and align team goals with organizational objectives."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Leveraged **React (18)**, **JavaScript**, **TypeScript**, and **HTML5/CSS3** to design and develop responsive, high-performing web applications, pushing continuous improvement with **TDD** practices and **CI/CD** integration for seamless deployment.\nDemonstrated strong leadership by mentoring junior developers, fostering a collaborative team environment and enhancing team productivity through effective communication.\nUtilized **Laravel** for server-side logic and **MySQL** for managing structured data, ensuring high data integrity and reliability across web applications.\nImplemented containerization with **Docker** and orchestration with **Kubernetes** to streamline application deployment and enhance scalability, facilitating controlled rollouts and agile development workflows.\nCreated seamless user experiences through responsive design principles and accessibility standards, improving user engagement by **30%** across platforms.\nOversaw code quality and efficiency, championing best practices and conducting regular code reviews to maintain project integrity and team knowledge sharing.\nDesigned and maintained robust databases with **MySQL** and implemented efficient queries to support complex data requirements, achieving performance enhancements of up to **25%**.\nFacilitated cross-functional communications between development, design, and operations teams, ensuring alignment on project goals, timelines, and deliverables.\nProduced comprehensive documentation for system architectures and workflows, accelerating onboarding processes for new team members by **50%**."
    }
  ],
  "skills": "**Backend Frameworks:**\n\tLaravel\n\n**Frontend Frameworks:**\n\tReact, JavaScript, TypeScript, HTML5, CSS\n\n**API Technologies:**\n\t\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, TDD, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, Communication, Mentoring, Leadership",
  "apply_company": "Workwize"
}