{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Field Service Equipment Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-623a26390/",
  "profile_summary": "Detail-oriented Field Service Equipment Engineer with substantial experience in troubleshooting and automation within mechanical and electrical engineering domains. Proven expertise in problem solving and project management, ensuring efficient resolution of technical issues on-site. Adept at fostering strong interpersonal communication, enabling effective collaborations with team members and clients. Highly organized with exceptional time management skills, capable of prioritizing and executing multiple tasks successfully. Committed to continual learning and adaptation in fast-paced environments.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Field Service Equipment Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Conducted thorough **troubleshooting** and **fault finding** for mechanical and electrical systems in field service equipment, improving overall efficiency by **15%**.\n- Collaborated with cross-functional teams utilizing **project management** skills to oversee equipment installations, leading to successful project completions within **3 weeks** of project initiation.\n- Leveraged **automation** technologies to optimize operational workflows, resulting in a **25% reduction** in manual intervention time.\n- Applied strong **problem-solving** capabilities to address on-site issues, ensuring minimal downtime and maintaining service levels above **95%**.\n- Utilized excellent **communication skills** to engage with clients and stakeholders, effectively conveying technical information and resolving inquiries.\n- Employed effective **time management** techniques to prioritize tasks and deliver services within **scheduled timelines**, contributing to an improved customer experience.\n- Demonstrated advanced **computer literacy** by utilizing various software tools for documentation and reporting, enhancing data accuracy across **100+** service requests.\n- Provided on-the-job training and support to junior engineers, fostering a collaborative work environment and enhancing team performance through strong **interpersonal skills**.\n- Maintained a valid **driving license**, ensuring the timely transportation between client sites for prompt service execution."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Utilized strong **problem-solving** skills to troubleshoot and optimize field service equipment, ensuring efficient operation across various mechanical and electrical systems.\nManaged projects with effective **project management** techniques to upgrade and automate equipment, leading to a **20%** increase in operational efficiency.\nApplied **automation** strategies to enhance equipment performance, reducing manual intervention by **30%** through the implementation of **PLC** systems across diverse installations.\nExercised **communication** skills to collaborate with cross-functional teams, ensuring alignment and understanding of engineering priorities and issues.\nDemonstrated exceptional **time management** by prioritizing multiple service calls and maintenance schedules, achieving over **95%** on-time completion rates.\nLeveraged **computer literacy** to analyze equipment data and generate insightful reports for stakeholders, facilitating informed decision-making.\nConducted **interpersonal skills** to train staff and clients on equipment handling, fostering a knowledgeable user community and improving safety protocols.\nSuccessfully resolved **PLC fault finding** issues by implementing diagnostic tools and testing methods, leading to an improved response time for equipment repairs.\nAdapted to various technical environments, using **automation** technology and engineering practices, further enhancing the reliability and uptime of field-service machinery."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Utilized **problem-solving** skills to diagnose and troubleshoot mechanical and electrical issues in field equipment, ensuring operational efficiency and minimizing downtime by **20%**.\nEmployed **project management** techniques to oversee multiple field service tasks simultaneously, completing projects on schedule **95%** of the time, which enhanced client satisfaction and trust.\nApplied **automation** strategies to optimize service workflows, increasing response times to service requests by **30%** through streamlined processes and effective **time management**.\nCommunicated effectively with clients and team members, utilizing **interpersonal skills** to foster strong relationships and ensure clarity in service expectations and deliverables.\nLeveraged **computer literacy** to manage service documentation and reports, employing software tools for tracking equipment performance and service history.\nDemonstrated expertise in **PLC fault finding** and troubleshooting to resolve complex issues, which improved system reliability and reduced operational disruptions by **15%**.\nConducted training for junior technicians on best practices for equipment maintenance and effective **communication skills** for improved field service delivery.\nMaintained a valid **driving license** to ensure punctual site visits and service calls across a range of locations, contributing to a **98%** on-time service rate."
    }
  ],
  "skills": "**Other**\n\tMechanical Engineering, Electrical Engineering, PLC Fault Finding, Automation, Project Management, Problem Solving, Troubleshooting, Time Management, Communication Skills, Interpersonal Skills, Computer Literacy, Driving License\n\n**Programming Languages**\n\tPython, JavaScript/TypeScript\n\n**Backend Frameworks**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks**\n\tReact, Vue, Angular\n\n**API Technologies**\n\t\n\n**Serverless and Cloud Functions**\n\tAWS: Lambda, ECS\n\n**Databases**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure**\n\tAWS: RDS, S3; Azure: App Services, Blob Storage, SQL Database\n\n**Authentication & Security**\n\tKeycloak (OIDC, RBAC), OAuth2, JWT, Nginx, Let’s Encrypt, Certbot"
}