{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Frontend Developer (Angular)",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-kotlinski-08ba40390/",
  "profile_summary": "As a dedicated Frontend Developer with 8 years of experience, I possess specialized skills in **Angular**, **TypeScript**, **HTML5**, **SCSS**, and **RxJS** to deliver high-performance user interfaces. Proficient in **ReactiveForms**, I leverage advanced techniques like **Monorepos**, **Microfrontends**, and **Module Federation** to architect scalable and maintainable applications. Additionally, I have experience with Backend for Frontend (BFF) strategies for effective integration between front-end and back-end services.\nMy expertise also includes using **Git**, **GitHub**, and **GitLab** for version control and collaboration, as well as implementing CI/CD pipelines for streamlined deployments. I am well-versed in project management tools like **Confluence** and manage workflows using **Kanban** methodology. \nIn previous roles, I’ve successfully contributed to enterprise-grade applications, ensuring compliance with industry standards and focusing on delivering exceptional user experiences.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Frontend Developer (Angular)",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Utilized **Angular**, **TypeScript**, **HTML5**, and **SCSS** to develop and maintain dynamic single-page applications (SPAs), ensuring a seamless user experience and adherence to industry standards.\nImplemented robust component architectures using **RxJS** and **ReactiveForms**, enhancing form handling and reactive programming capabilities across applications.\nLed the adoption of microfrontend architectures, integrating various application modules seamlessly through **Module Federation**, facilitating efficient scaling and deployment processes.\nCollaborated with cross-functional teams using tools like **Git**, **GitHub**, and **GitLab** to ensure version control and effective project management, resulting in increased code quality and team productivity.\nDesigned and optimized CI/CD pipelines leveraging modern practices and tools, such as **GitHub Actions**, to automate build, testing, and deployment processes, reducing release times by **30%**.\nAdopted a Kanban methodology to manage project workflows, improving task visibility and ensuring timely delivery of features.\nParticipated in documentation efforts using **Confluence** to maintain clear communication and knowledge transfer within the team.\nEngaged in the development of custom CMS solutions, ensuring content updates are efficiently handled and reflect on the front end in real-time.\nPlayed a key role in mentoring junior developers, fostering an environment of skill development and knowledge sharing, which resulted in a **50%** reduction in onboarding time for new team members.\nActively researched and implemented best practices for accessibility and performance optimization, achieving a **90%** score on Lighthouse audits for web applications."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Developed interactive single-page applications (SPA) using **Angular**, **TypeScript**, and **HTML5**, ensuring optimal performance and seamless user experiences across various financial platforms.\nImplemented state management techniques with **RxJS** and **ReactiveForms**, enhancing form handling and reactive programming capabilities for complex user interfaces.\nCollaborated in a **Monorepo** setup to manage code efficiently among multiple projects, promoting consistency and simplifying dependency management.\nEmployed **Module Federation** for **Microfrontends** architecture, facilitating independent development and deployment of frontend components, improving team collaboration and time-to-market.\nUtilized **SCSS** for styling and responsive design, delivering aesthetically pleasing and user-friendly interfaces in compliance with banking standards.\nVersion-controlled project management using **Git**, and maintained project documentation in **Confluence**, streamlining team collaboration and information sharing.\nLed the integration of CI/CD pipelines to automate build processes and deployment, reducing the release cycles from **two weeks** to **one week**, enhancing development efficiency.\nConducted regular Agile ceremonies, utilizing **Kanban** methodologies to prioritize tasks and ensure effective delivery of features and updates, leading to a **30%** improvement in sprint completion rates."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Developed dynamic single-page applications (SPAs) utilizing **Angular** and **TypeScript** to deliver high-performance user interfaces, focusing on mobile-first and responsive design.\nImplemented reusable components using **HTML5** and **SCSS**, while integrating **RxJS** for reactive programming, resulting in applications that are modular, maintainable, and scalable.\nExecuted CI/CD pipelines with tools such as **Git**, **GitHub**, and **GitLab** to streamline development workflows, achieving a deployment frequency of **3 times per week**.\nCollaborated with cross-functional teams using **Confluence** to ensure alignment on project goals and specifications, adhering to **Kanban** methodologies for efficient task management.\nEmployed **Monorepos** for codebase organization, enhancing reuse and scalability across multiple projects, resulting in development time reduction of **25%**.\nLed the transition to **Microfrontends** architecture where appropriate, promoting independent deployment and development of frontend modules within the application.\nUtilized **Module Federation** to share code across applications seamlessly, reducing bundle sizes and improving load times by up to **40%**.\nDeveloped backend-for-frontend (BFF) solutions to optimize API interactions tailored for specific frontend needs, enhancing overall system performance and responsiveness.\nParticipated in daily stand-ups and sprint planning meetings, driving discussions on feature development and prioritization within a **Kanban** framework.\nProvided mentorship and support to junior developers on best practices with **Angular** and effective use of **ReactiveForms**, contributing to a stronger development team."
    }
  ],
  "skills": "**Frontend Frameworks:**\n\tAngular, HTML5, SCSS, TypeScript, JavaScript/TypeScript (React, Vue), RxJS, ReactiveForms, Monorepos, Microfrontends, Module Federation, BFF, SPA\n\n**Backend Frameworks:**\n\tPython(FastAPI, Flask, Django)\n\n**API Technologies:**\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, CI/CD pipelines\n\n**Cloud & Infrastructure:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL), Terraform, Ansible, Helm, Docker Compose\n\n**Authentication & Security:**\n\tKeycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot\n\n**Other:**\n\tConfluence, Kanban, MLflow, Airflow, Kubeflow"
}