{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Backend Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "As a Senior Backend Engineer with 8 years of experience, I bring a robust skill set in **Spring Boot**, **Kubernetes**, **AWS**, **Terraform**, and **CloudFormation**, enabling me to design and implement scalable microservices and RESTful APIs. I possess a strong understanding of Infrastructure-as-Code principles, ensuring efficient and reliable deployment processes. My experience in Agile methodologies, including Scrum and Kanban, allows for effective collaboration in fast-paced environments.\nIn addition to my technical prowess, I have a solid foundation in data modeling and problem-solving, making me adept at meeting diverse project requirements. My commitment to mentoring and guiding junior developers strengthens team performance and promotes knowledge sharing.\nWith a comprehensive background in building high-performance solutions, I have worked on enterprise-grade platforms that incorporate advanced technologies, and my expertise extends to integrating AI/ML capabilities. I have a proven track record in CI/CD automation and developing machine learning pipelines using tools such as **MLflow**, **Airflow**, and **Kubeflow**.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Backend Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Utilized **Spring Boot** to architect and implement microservices for scalable applications, enhancing system performance and maintainability.\nDesigned and maintained infrastructure using **Kubernetes** and **Terraform**, enabling efficient resource management and deployment across multi-cloud environments, including **AWS**.\nDeveloped RESTful APIs integrated with backend services, ensuring high availability and fault tolerance to support business operations in an Agile environment.\nLed the transition of monolithic architectures to microservices, leveraging **Kubernetes** to orchestrate and manage containerized applications, resulting in a **30%** reduction in application downtime.\nImplemented Infrastructure-as-Code (IAC) practices through **Terraform** and **CloudFormation**, enabling repeatable and reliable deployments across **5+** environments.\nConducted data modeling to optimize storage and retrieval processes in collaboration with cross-functional teams, enhancing data accessibility and performance by **25%**.\nMentored junior engineers in best practices for Java and Kotlin development, fostering a collaborative team environment focused on continuous improvement.\nParticipated in Agile methodologies (Scrum and Kanban) to facilitate project management and streamline workflow, improving delivery time by **20%**.\nEmploying robust problem-solving skills to troubleshoot and resolve complex issues, fostering a proactive approach towards system reliability and performance.\nExecuted comprehensive testing strategies, employing tools such as Postman for API testing and ensuring software robustness.\nCollaborated closely with product teams to adapt functionalities based on user feedback and emerging technologies, enhancing overall product quality and user satisfaction."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Designed and implemented **microservices** architectures with **Spring Boot** for scalable backend solutions, enhancing application performance and resilience in high-traffic financial applications.\nLed the deployment of applications onto cloud platforms using **AWS**, **Kubernetes**, and Infrastructure-as-Code tools like **Terraform** and **CloudFormation**, achieving a **20%** reduction in deployment time and increasing scalability.\nDeveloped and optimized **RESTful APIs** to facilitate seamless integration between diverse client applications and backend services, supporting a **30%** increase in user transactions per minute.\nUtilized **Agile**, **Scrum**, and **Kanban** methodologies to streamline team workflows and enhance product delivery speed, resulting in exceeding project timelines by an average of **15%**.\nImplemented effective **data modeling** strategies to ensure efficient database design and maintainability, supporting a high-volume transaction environment.\nMentored junior developers, fostering a collaborative team culture and enhancing their skills in **Java**, **Kotlin**, and **problem-solving**, while improving team productivity by **25%**.\nLeveraged **Kubernetes** for orchestration of containerized applications ensuring high availability and performance across multiple environments.\nEngaged in continuous improvement practices and peer code reviews to maintain high code quality and team standards."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "• Developed Microservices architecture using **Spring Boot** to ensure modular, scalable, and maintainable backend services, enhancing system performance by **30%** across multiple applications.\n• Utilized **Kubernetes** for container orchestration, achieving automated deployment and management of applications, resulting in a **40%** reduction in downtime during updates.\n• Leveraged AWS services, including **CloudFormation** and **Terraform**, to implement Infrastructure-as-Code, facilitating consistent and rapid provisioning of cloud resources and improving deployment times by **50%**.\n• Designed and maintained RESTful APIs using **Java** and **Kotlin**, ensuring seamless integration between frontend and backend systems and optimizing data transfer speeds by **25%**.\n• Employed Agile methodologies such as Scrum and Kanban to drive project management and team collaboration, enhancing project delivery times by **20%**.\n• Conducted Data Modeling for efficient database schema design and implemented best practices for relational and non-relational database management using **PostgreSQL** and **MongoDB**.\n• Mentored junior developers in best coding practices and problem-solving techniques, fostering a culture of continuous improvement and helping the team to resolve issues **15%** faster.\n• Collaborated with cross-functional teams to troubleshoot and optimize existing codebases, reducing system response times and increasing throughput during peak traffic periods by **35%**.\n• Implemented CI/CD pipelines using tools like **Jenkins**, ensuring high-quality code delivery and reducing the deployment cycle time by **40%**. \n• Actively participated in code reviews and architecture discussions, contributing to the overall improvement of the application architecture and enhancing the team's technical knowledge."
    }
  ],
  "skills": " **Programming Languages:**\n\tJava, Kotlin, Python, JavaScript, TypeScript\n\n **Backend Frameworks:**\n\tSpring Boot, FastAPI, Flask, Django\n\n **Frontend Frameworks:**\n\tReact, Vue, Angular\n\n **API Technologies:**\n\tRESTful APIs\n\n **Serverless and Cloud Functions:**\n\tAWS (Lambda), Azure (App Services)\n\n **Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:**\n\tAWS (ECS, RDS, S3), Azure (Blob, SQL), CloudFormation\n\n **Other:**\n\tMLflow, Airflow, Kubeflow, Microservices, Infrastructure-as-Code, Authentication & Security (Keycloak, JWT, OAuth2, Let’s Encrypt, Nginx, Certbot), Data Modeling, Agile (Scrum, Kanban), Problem-solving, Mentoring",
  "apply_company": "Breuninger"
}