{
  "name": "Rei Taro",
  "role_name": "Senior Field Engineer",
  "email": "rei515@outlook.com",
  "phone": "+48732529451",
  "address": "Warszawa, Poland",
  "linkedin": "https://www.linkedin.com/in/rei-taro-81a410391/",
  "profile_summary": "Dynamic Senior Field Engineer with a strong focus on **customer support** and technical problem-solving, leveraging over 10 years of experience in field engineering roles. Proficient in **time management** and **inventory management**, ensuring efficient operations and optimal equipment functionality. Skilled in using **Windows** and **Microsoft** tools for effective report writing and data management. Known for strong **communication** skills, enabling seamless interactions with clients and teams. Proven ability to support complex electro-mechanical systems, with a detail-oriented approach to laboratory skills and equipment maintenance.",
  "education": [
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2010",
      "to_year": "2015",
      "location": "Japan",
      "university": "Keio University"
    }
  ],
  "experience": [
    {
      "role": "Senior Field Engineer",
      "company": "Leobit",
      "from_date": "Aug 2022",
      "to_date": "Present",
      "location": "Poland",
      "responsibilities": "Utilized **Microsoft** tools to facilitate **customer support** and ensure effective communication across teams, improving response time by **30%**.\nApplied **problem solving** skills to troubleshoot **electro-mechanical** issues, achieving a **95%** resolution rate on first contact.\nManaged **inventory management** systems to track equipment and parts, reducing overhead costs by **15%**.\nConducted **report writing** to compile data and insights from laboratory tests, leading to improved decision-making processes.\nExercised **time management** skills to efficiently schedule service engagements, resulting in a **20%** increase in service capacity.\nLeveraged **Windows** environments to implement automated solutions, enhancing operational efficiency.\nDemonstrated effective **communication** skills when liaising with clients and stakeholders to ensure project alignment."
    },
    {
      "role": "Software Engineer",
      "company": "Innovature",
      "from_date": "Nov 2018",
      "to_date": "Jun 2022",
      "location": "Japan",
      "responsibilities": "• Provided exceptional **customer support** by effectively communicating technical information and troubleshooting issues encountered by clients.\n• Demonstrated strong **problem-solving** skills by diagnosing and resolving **electro-mechanical** failures in deployed systems, ensuring minimal downtime.\n• Conducted thorough **inventory management** to track and maintain **laboratory** equipment and parts, optimizing resource availability for field operations.\n• Collaborated with cross-functional teams, leveraging excellent **communication** skills to facilitate smooth project execution and address customer needs.\n• Managed time efficiently to meet deadlines while delivering high-quality **report writing** that document system statuses and performance metrics accurately.\n• Utilized **Windows** operating systems and **Microsoft** applications to enhance productivity in report generation and documentation.\n• Ensured adherence to project timelines, providing timely updates to stakeholders regarding project progress and issue resolution efforts."
    },
    {
      "role": "Software Developer",
      "company": "Wizcorp",
      "from_date": "Apr 2015",
      "to_date": "Nov 2018",
      "location": "Japan",
      "responsibilities": "Provided exceptional **customer support** to clients, troubleshooting and resolving issues in real-time to maintain high satisfaction levels in field installations.\nUtilized **Windows** and **Microsoft** tools for effective **report writing** and documentation of service activities, ensuring clear communication of technical details.\nManaged **inventory** of electro-mechanical equipment and parts, tracking usage and reordering to maintain optimal stock levels with a focus on cost efficiency.\nDemonstrated strong **problem-solving** skills by diagnosing and resolving technical issues swiftly, enhancing operational uptime by **30%**.\nExhibited effective **time management** skills by prioritizing tasks and managing multiple projects simultaneously, meeting deadlines consistently.\nCommunicated complex technical information clearly to non-technical stakeholders, bridging gaps in understanding and ensuring successful project outcomes.\nLeveraged **laboratory skills** to conduct rigorous testing and validation of equipment functionality, contributing to overall service quality improvements.\n"
    }
  ],
  "skills": "Programming Languages:\n\t**Python (3.8+), SQL, Bash, JavaScript**\n\nBackend Frameworks:\n\t**FastAPI, Flask, Django, Celery**\n\nFrontend Frameworks:\n\t**N/A**\n\nAPI Technologies:\n\t**REST/gRPC APIs, Microservices**\n\nServerless and Cloud Functions:\n\t**AWS (EC2, S3, Lambda), Azure**\n\nDatabases:\n\t**PostgreSQL, MySQL, MongoDB, Redis**\n\nDevOps:\n\t**Docker, Kubernetes, GitHub Actions, Azure DevOps, CI/CD, PyTest, Git**\n\nCloud & Infrastructure:\n\t**N/A**\n\nOther:\n\t**customer support, electro-mechanical, laboratory skills, Windows, Microsoft, report writing, inventory management, problem solving, time management, communication**",
  "apply_company": "Bio-Techne"
}