{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Tech Lead",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-karol-kotlinski-bb2520397/",
  "profile_summary": "As an accomplished Tech Lead with 8 years of experience, I excel in **backend development** and **frontend development**, utilizing a robust technical stack including **JavaScript**, **TypeScript**, **Python**, and **Flutter**. My proficiency encompasses the entire development lifecycle, backed by a strong foundation in **DevOps** practices and **project coordination**. I am adept at implementing **RBAC**, **ABAC**, and **ReBAC** in projects to enhance security and access control.\n\nI have successfully contributed to high-performance solutions in the healthcare and financial sectors by leveraging frameworks such as **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**. I also possess deep cloud experience with **Azure** and **AWS**, ensuring scalable and compliant applications that meet standards like HIPAA, FHIR, PCI DSS, and SOC 2.\n\nIn addition to my technical acumen, I bring strong **communication** and **organizational skills**, allowing me to work autonomously and effectively manage system documentation and internal tooling initiatives. Fluent in both **Italian** and **English**, I am dedicated to driving project success while building collaborative team environments.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Tech Lead",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Led backend development initiatives, particularly focusing on implementing **Role-Based Access Control (RBAC)**, **Attribute-Based Access Control (ABAC)**, and **Relationship-Based Access Control (ReBAC)** strategies.\n• Spearheaded frontend development with responsive design principles, leveraging modern frameworks such as React (17-18) and Vue (3.x) to ensure intuitive user experiences.\n• Established robust **DevOps** practices to streamline CI/CD processes and improve code deployment efficiency, utilizing tools such as GitHub Actions and Azure DevOps.\n• Created comprehensive system documentation to facilitate project coordination and knowledge sharing among team members, enhancing communication and collaboration.\n• Developed internal tooling to support engineering teams, greatly improving operational efficiency and productivity.\n• Managed project coordination across cross-functional teams, ensuring alignment on deliverables and timelines, while fostering a culture of autonomy and accountability.\n• Delivered solutions in a bilingual environment, demonstrating fluency in both Italian and English in technical discussions and documentation, thereby enhancing international collaboration.\n• Architected and developed scalable, full-stack healthcare and financial platforms using **TypeScript**, **Python** (FastAPI), **Node.js**, and modern front-end frameworks including **React** (17-18), **Next.js**, and **Vue** (3.x), while ensuring compliance with HIPAA, FHIR, GDPR, and financial regulatory standards (e.g., PCI DSS, SOX).\n• Developed and deployed cross-platform mobile applications using **Flutter** and **React Native**, delivering seamless healthcare and fintech user experiences across **iOS** and **Android** platforms.\n• Implemented CI/CD pipelines using **Fastlane** and **App Center**, with automated testing and release management, enhancing deployment frequency by **40%**.\n• Led the re-architecture of monolithic applications into microservices-based ecosystems using **Docker** and **Kubernetes** (AKS/EKS), resulting in **99.9%** uptime.\n• Designed aspects of cloud-native data architecture using **PostgreSQL**, **MongoDB**, **Redis**, and **GraphQL** to optimize for large-scale data ingestion and querying processes.\n• Built MLOps pipelines using **MLflow**, **DVC**, and **Apache Airflow**, streamlining continuous training and deployment of models across environments with efficiency gains of **30%**.\n• Integrated AI-based features into client applications powered by **Azure ML** and **AWS Sagemaker** to enhance user engagement and insights.\n• Established test strategies utilizing **Jest**, **Cypress**, **PyTest**, and **Postman**, ensuring robust application functionality through comprehensive testing suites, covering test cases by **90%** across services.\n• Integrated **Azure Cognitive Search** and **ElasticSearch** to empower advanced search capabilities across millions of records, enhancing data retrieval speed by **50%**."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Oversaw project coordination and communication among teams to ensure the implementation of Role-Based Access Control (**RBAC**) and Attribute-Based Access Control (**ABAC**) in the financial platforms, enhancing security and access management.\nDrove backend development efforts using **Node.js (NestJS/Express)** and **Python (FastAPI, Django)** for financial systems, achieving a **30% increase** in scalability and maintainability through microservices architecture.\nLed frontend development, creating dynamic applications with **React (18)**, **Vue 3**, and **Next.js**, leveraging **TypeScript** and **Tailwind CSS** to deliver responsive user interfaces that improved user satisfaction ratings by **25%** for financial dashboards and admin portals.\nImplemented system documentation practices to maintain clear guidelines and support organizational knowledge sharing, facilitating efficient onboarding and reference for current projects.\nEnsured the integration of asynchronous communication through **Kafka**, **RabbitMQ**, and **Azure Service Bus**, contributing to a robust event-driven architecture that improved transaction processing capabilities by **40%**.\nCoordinated the building and orchestration of ETL pipelines using **Apache Airflow** and **Azure Data Factory** for effective data ingestion, resulting in a **50% reduction** in data processing time from various sources.\nChampioned the development of AI/ML-powered fraud detection systems utilizing **scikit-learn**, **XGBoost**, and **Azure Machine Learning**, which proactively identified **80%** of fraudulent activities based on transaction patterns.\nDirected the creation of ML pipelines for credit scoring and transaction classification using **MLflow** and **Airflow**, enhancing real-time decision-making capabilities in banking systems.\nFostered an autonomous work environment while exercising strong organizational skills to balance multiple projects and deliver results in a timely manner."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "• Led backend development initiatives utilizing **Python** (FastAPI, Django) and **Node.js** (NestJS, Express) to create scalable services for a global e-commerce platform.\n• Oversaw frontend development utilizing **React** (18), **Vue 3**, and **Angular**, employing **TypeScript** and **Redux Toolkit** to ensure a responsive user experience across web and mobile.\n• Directed project coordination efforts by implementing effective communication strategies, ensuring alignment among team members and stakeholders with a focus on organizational skills.\n• Established DevOps practices for automated deployment and monitoring, enhancing the efficiency of our delivery pipelines.\n• Developed internal tooling and documentation, ensuring smooth knowledge transfer and effective system documentation for future enhancements.\n• Integrated **RBAC** (role-based access control) and ensured compliance with GDPR, securing user data across all platforms.\n• Conducted regular project reviews, promoting autonomy and encouraging team members to take initiative in their tasks and challenges.\n• Successfully implemented caching strategies, utilizing **Redis** for optimizing performance by reducing database read pressure by **30%**.\n• Facilitated multilingual communication by leveraging fluency in **Italian** and **English**, fostering a collaborative environment across diverse teams.\n• Coached team members on effective system documentation best practices, resulting in a **40%** reduction in onboarding time for new hires."
    }
  ],
  "skills": "Programming Languages:\n\tPython(FastAPI, Flask, Django), JavaScript/TypeScript (React, Vue, Angular)\n\n**Backend Frameworks:**\n\tDjango, FastAPI, Flask\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tKeycloak (OIDC, RBAC), JWT, OAuth2\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda), Azure (App Services)\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS (RDS, S3), Azure (Blob, SQL)\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, system documentation, internal tooling, project coordination, communication, autonomy, organizational skills, fluency in Italian, fluency in English"
}