{
  "name": "Patryk Zaslawski",
  "role_name": "Senior Cloud Engineer",
  "email": "patrykzas0428@outlook.com",
  "phone": "+48669862402",
  "address": "Gdanski, Poland",
  "linkedin": "https://www.linkedin.com/in/patryk-z-107978395/",
  "profile_summary": "As a Senior Cloud Engineer with 8+ years of extensive experience in software engineering, I excel in implementing secure cloud solutions within diverse regulatory frameworks including PCI-DSS, ISO 27001, NIST, GDPR, and LGPD. I am proficient in a wide array of technologies, including **AWS** (IAM, KMS, GuardDuty, Security Hub, CloudTrail), **Terraform**, **AWS CloudFormation**, and CI/CD practices, ensuring seamless deployment and security of applications. My strong background in Python (FastAPI, Django, Flask) enables me to build exceptional backend services, while my skills in **API Security**, **Threat Detection**, and **Mobile Security** enhance system integrity. I am adept at integrating tools such as Salesforce and HubSpot into cloud solutions, combining my technical prowess with compliance strategies to deliver enterprise-level systems that meet business objectives.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2014",
      "to_year": "2017",
      "location": "United Kingdom",
      "university": "The University of Manchester"
    }
  ],
  "experience": [
    {
      "role": "Senior Cloud Engineer",
      "company": "Binary Studio",
      "from_date": "Aug 2023",
      "to_date": "Present",
      "location": "United Kingdom (Remote)",
      "responsibilities": "• Designed, developed, and maintained secure, **cloud-native** healthcare solutions leveraging **AWS** services (including **Lambda**, **RDS**, and **S3**) while ensuring **PCI-DSS**, **ISO 27001**, and **GDPR** compliance.\n• Implemented **CI/CD** pipelines using **Terraform**, **AWS CloudFormation**, and **GitHub Actions** to automate testing, deployment, and monitoring of microservices in **Python**.\n• Ensured data security and compliance by integrating **IAM**, **KMS**, **GuardDuty**, **Security Hub**, and **CloudTrail** in **Python**-based applications for robust **API Security**.\n• Developed comprehensive threat detection and response strategies within the **AWS** cloud environment, aligning with **NIST** standards for enhanced security posture.\n• Spearheaded the implementation of robust access management and identity protocols, ensuring mobile security and compliance with global regulations like **GDPR** and **LGPD**.\n• Led the architecture and maintenance of logging and monitoring solutions, integrating **PowerShell** and **Bash** scripts with **SIEM** systems for proactive threat detection.\n• Championed **DevSecOps** practices by embedding security into every phase of development, particularly for projects processing sensitive healthcare data, adhering to **PCI-DSS** standards.\n• Mentored a team of engineers in adopting best practices in **Python**, **Terraform**, and **AWS** cloud services, fostering a culture of continuous improvement and security awareness.\n• Automated compliance workflows using cloud services, significantly reducing manual efforts and error rates by **70%**, while ensuring real-time regulatory adherence and reporting.\n• Collaborated on projects with external teams utilizing platforms like **Salesforce** and **HubSpot**, ensuring seamless data integration within healthcare applications.\n• Improved system performance and response times by optimizing **Python** code, utilizing best practices including asynchronous programming and effective memory management.\n• Integrated monitoring solutions such as **AWS CloudWatch** and **ELK stack** with existing infrastructure, leading to a **50%** reduction in response times for incident reporting.\n• Conducted risk assessments and security audits, reinforcing the organization's culture of compliance and risk management across all **cloud-based** projects."
    },
    {
      "role": "Software Engineer",
      "company": "Ardigen",
      "from_date": "Mar 2020",
      "to_date": "Aug 2023",
      "location": "Poland",
      "responsibilities": "Implemented **CI/CD** pipelines using **AWS CloudFormation** and **Terraform**, automating deployment processes and improving release cycles by **30%** while ensuring compliance with **PCI-DSS** and **ISO 27001** standards.\nDesigned and enforced security policies for cloud infrastructures, leveraging tools such as **AWS IAM**, **KMS**, **GuardDuty**, and **Security Hub** to protect sensitive data and maintain a secure operational environment.\nDeveloped monitoring and threat detection systems utilizing **CloudTrail** and **SIEM** solutions to enhance system visibility and react promptly to potential security incidents, achieving a **40%** improvement in incident response times.\nConducted vulnerability assessments and compliance audits in accordance with **NIST**, **GDPR**, and **LGPD** frameworks, ensuring adherence to international security standards across all operations.\nCreated and maintained documentation for internal and external audits, ensuring clarity in processes and security measures implemented, reducing audit response time by **25%**.\nManaged integration of third-party solutions such as **Salesforce** and **HubSpot** into cloud environments, ensuring interconnectivity and data flow while maintaining stringent security protocols.\nCollaborated with development teams to instill **DevSecOps** principles, integrating security practices within Agile workflows and enhancing collaboration between development and security teams.\nDeveloped automation scripts in **Python**, **Bash**, and **PowerShell** to streamline operations and reduce manual tasks, increasing operational efficiency by **20%**.\nEnsured mobile security through robust API security measures and mobile application assessment methodologies, establishing secure communication protocols between client applications and cloud services.\nDesigned and executed comprehensive training programs on compliance and security practices for team members, boosting security awareness among staff and adherence to best practices."
    },
    {
      "role": "Software Engineer",
      "company": "Altum Software",
      "from_date": "Oct 2017",
      "to_date": "Feb 2020",
      "location": "United Kingdom",
      "responsibilities": "Designed and implemented CI/CD pipelines using **GitHub Actions** and **Azure DevOps** to enhance deployment efficiency, ensuring compliance with **PCI-DSS** and **ISO 27001** standards.\nManaged AWS infrastructure, including **IAM**, **KMS**, and **GuardDuty**, to secure environments while upholding best practices in **Threat Detection** and **API Security**.\nAutomated infrastructure provisioning and management through **Terraform** and **AWS CloudFormation**, achieving a deployment time reduction of up to **40%**.\nConducted risk assessments and ensured compliance with **GDPR** and **LGPD** regulations, documenting policies and procedures to support **Compliance** initiatives.\nDeveloped and enforced security policies using **Security Hub** and **CloudTrail** to monitor system activity, detecting anomalies and responding to incidents in real-time.\nIncorporated **Powershell** and **Bash** scripts to automate systems management tasks, leading to a **30%** reduction in manual intervention.\nImplemented logging and monitoring solutions using **SIEM** tools for enhanced **Incident Detection** and system health monitoring.\nCollaborated with cross-functional teams to integrate security concepts into the software development lifecycle, aligning DevSecOps practices across projects.\nDesigned security protocols to ensure customer data protection and integrity in compliance with industry standards.\nParticipated in the migration of legacy systems to cloud-native architectures, optimizing resources and enhancing scalability and performance."
    }
  ],
  "skills": "Programming Languages:\n\t**Python**, Bash, PowerShell\n\n**Backend Frameworks:**\n\tFastAPI, Django, Flask, Spring Boot\n\n**Frontend Frameworks:**\n\tAngular (1–16), React (15–18), Next.js, Vue.js (2/3), Blazor\n\n**API Technologies:**\n\tREST & gRPC APIs, API Security\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, CI/CD, Terraform, AWS CloudFormation\n\n**Cloud & Infrastructure:**\n\tIAM, KMS, GuardDuty, Security Hub, CloudTrail, Compliance, PCI-DSS, ISO 27001, NIST, GDPR, LGPD\n\n**Other:**\n\tSQLAlchemy, Pydantic, Celery, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, Salesforce, HubSpot, Threat Detection, Mobile Security, DevSecOps, SIEM",
  "apply_company": "Qualysoft Group"
}