{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Build Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "As a Senior Build Engineer with 8 years of experience, I am adept in project management and risk management, ensuring SHEQ compliance and effective budget management while coordinating with local authorities. My expertise includes site audits and network activation, enabling me to implement robust quality and safety standards across all project phases. I excel in documentation management and proactive problem solving, fostering continuous improvement through team collaboration.\nIn my previous roles, I have leveraged my technical background in **JavaScript**, **TypeScript**, **Python**, **Flutter**, **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, **Django**, **Azure**, and **AWS** to develop high-performance solutions that align with compliance standards and integrate advanced capabilities like AI/ML for predictive analytics. With a solid foundation in microservices architecture and event-driven systems, I am committed to delivering secure and efficient applications.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Build Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Led **project management** efforts to ensure successful integration of healthcare and financial solutions, ensuring compliance with regulatory standards and protocols.\n- Conducted **site audits** and **risk management** assessments for every phase of project deployment, ensuring adherence to **SHEQ compliance** and local authorities regulations.\n- Enhanced **network activation** efficiency by optimizing **cabling** processes, contributing to a streamlined deployment with a 30% reduction in setup time.\n- Collaborated with cross-functional teams to implement **documentation management** strategies, facilitating better communication and coordination across projects.\n- Established **Traffic Management** protocols to ensure minimal disruption during installations and audits, improving operational efficiency by 25%.\n- Implemented **health and safety** guidelines and best practices, resulting in zero reported incidents during major deployments last year.\n- Spearheaded initiatives for **continuous improvement**, leading to a 15% cost reduction in project budgeting through better resource allocation and management.\n- Fostered **team collaboration** on complex projects, ensuring proactive problem-solving and innovation across all levels of the development process.\n- Coordinated with local authorities to manage and mitigate risks, ensuring that all projects were completed within budget and timeline constraints."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Managed project and budget management for the development and improvement of cabling and network activation, ensuring compliance with **NRSWA** standards across multiple sites.\nConducted thorough site audits and implemented **risk management** strategies to enhance **health and safety** practices, achieving a **100% compliance** rate with SHEQ requirements.\nCoordinated with local authorities and stakeholders, ensuring effective communication and collaboration for traffic management, resulting in optimized project timelines and reduced delays by **20%**.\nLed team collaboration initiatives, fostering proactive problem solving and continuous improvement within the engineering team, which increased project efficiency by **15%**.\nDocumented technical specifications and engineering processes meticulously to ensure comprehensive **documentation management** and adherence to industry best practices.\nImplemented monitoring procedures for site compliance that enhanced overall project quality and safety standards, ensuring alignment with organizational and legislative requirements."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Managed and coordinated project timelines and budgets to ensure the successful delivery of site activation projects, achieving a **100% on-time** project completion rate.\nConducted site audits and documentation management to ensure compliance with SHEQ regulations, maintaining a **zero-incident** safety record across all site operations.\nImplemented risk management strategies to identify and mitigate potential issues before they escalated, resulting in a **15% decrease** in project-related complications.\nLed proactive problem-solving initiatives in collaboration with local authorities, ensuring seamless traffic management and minimizing disruptions during build processes.\nFacilitated effective team collaboration through regular meetings, driving continuous improvement efforts which resulted in improved site safety protocols and enhanced operational efficiencies.\nOversaw the management of fibre cabling installations and maintenance, adhering to NRSWA standards to guarantee compliance and operational effectiveness within network activations.\nDeveloped and maintained comprehensive budgets for all projects, achieving an average cost-saving of **10%** through efficient resource allocation and waste reduction strategies.\nEnsured adherence to health and safety practices, thereby enhancing local authorities coordination while promoting a culture of safety across job sites and among team members.\nEvaluated and improved existing protocols for documentation management, leading to more streamlined project workflows and enhanced retrieval processes."
    }
  ],
  "skills": "**Programming Languages:**\n\tPython (FastAPI, Flask, Django), JavaScript/TypeScript (React, Vue, Angular)\n\n**Backend Frameworks:**\n\t\n\n**Frontend Frameworks:**\n\t\n\n**API Technologies:**\n\t\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\t\n\n**Other:**\n\tfibre, health and safety, risk management, project management, budget management, NRSWA, cabling, network activation, site audits, SHEQ compliance, Traffic Management, local authorities coordination, documentation management, proactive problem solving, team collaboration, continuous improvement",
  "apply_company": "GoFibre"
}