{
  "name": "Rei Taro",
  "role_name": "Software / Application Developer",
  "email": "rei515@outlook.com",
  "phone": "+48732529451",
  "address": "Warszawa, Poland",
  "linkedin": "https://www.linkedin.com/in/rei-taro-81a410391/",
  "profile_summary": "Results-driven Software/Application Developer with over 10 years of experience in creating robust backend systems and applications, with a strong focus on **C#**, **.NET**, and **SQL**. Proficient in designing and developing **RESTful APIs**, and leveraging **Microsoft Azure** for cloud solutions. Proven expertise in **Agile** methodologies, ensuring consistent delivery of quality software while enhancing team communication and collaboration. In previous roles, successfully contributed to accelerated project timelines and improved application performance at major organizations such as VISA, Sii Poland, and Reply Polska. A skilled troubleshooter with a deep understanding of **PowerShell** and **Power Apps**, committed to delivering innovative solutions that meet business needs.",
  "education": [
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2010",
      "to_year": "2015",
      "location": "Japan",
      "university": "Keio University"
    }
  ],
  "experience": [
    {
      "role": "Software / Application Developer",
      "company": "Leobit",
      "from_date": "Aug 2022",
      "to_date": "Present",
      "location": "Poland",
      "responsibilities": "Engineered backend services in **C#** and **.NET** to streamline document automation, user onboarding, and reporting workflows.\n\n- Developed asynchronous solutions using **RESTful APIs** and **Azure** services to manage financial transaction requests.\n- Deployed microservices on **Microsoft Azure** and utilized **PowerShell** for infrastructure management, ensuring seamless cloud operations.\n- Created and maintained data persistence solutions with **SQL** to support regulatory data handling and operational reporting, achieving **99.9%** uptime.\n- Implemented Agile methodologies to enhance team collaboration and ensure timely project delivery within **2-week sprints**.\n- Led troubleshooting efforts and integrated **Azure AD B2C** for secure authentication mechanisms, enhancing system security by **40%**.\n- Collaborated with cross-functional teams to resolve system integration challenges, ensure compliance, and supervise release strategies for over **5 major deployments**."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Innovature",
      "from_date": "Nov 2018",
      "to_date": "Jun 2022",
      "location": "Japan",
      "responsibilities": "Developed robust backend systems utilizing **C#** and **.NET** frameworks to automate document workflows, enhance user onboarding, and efficiently manage complex reporting processes.\nCreated RESTful APIs for seamless interaction between frontend applications and backend services, ensuring optimal performance and scalability.\nLeveraged **Microsoft Azure** to deploy microservices, utilizing **Terraform (v1.0)** to facilitate infrastructure automation and maintain consistent, scalable environments.\nImplemented SQL databases for efficient data management, ensuring smooth secure exchanges of regulatory data through optimized queries.\nUtilized **PowerShell** and **Agile** methodologies to troubleshoot issues promptly and improve operational efficiency.\nConducted thorough security audits to ensure compliance with industry standards, integrating OAuth2 for secure user authentication.\nEngaged in effective communication with cross-functional teams to facilitate smooth system integration and successful release management, contributing to 100% project delivery on schedule."
    },
    {
      "role": "Software Developer",
      "company": "Wizcorp",
      "from_date": "Apr 2015",
      "to_date": "Nov 2018",
      "location": "Japan",
      "responsibilities": "Developed and maintained **RESTful APIs** to ensure seamless interaction between backend services and frontend applications using **C#** and **.NET** framework, enhancing system performance.\nUtilized **SQL** for database management and queries to improve data retrieval efficiency by **30%** across applications.\nImplemented solutions within **Microsoft Azure** to enable cloud-based functionalities, streamlining deployment processes by **40%** and facilitating better resource management.\nEngaged in Agile methodologies to enhance team collaboration and project delivery, achieving **95%** sprint completion rate.\nConducted troubleshooting and debugging of applications to identify and resolve issues promptly, ensuring system reliability and user satisfaction.\nDeveloped and deployed automation scripts using **PowerShell** to improve operational efficiency, reducing manual tasks by **50%**.\nParticipated in the design and execution of **Power Apps** solutions to optimize user workflows, resulting in a **25%** improvement in process completion time.\nCollaborated with cross-functional teams to ensure effective communication of project requirements and updates, fostering a transparent development environment."
    }
  ],
  "skills": " **Programming Languages** \n\t C#, Python (3.8+), SQL, Bash, JavaScript \n\n **Backend Frameworks** \n\t .NET, FastAPI, Flask, Django, Celery \n\n **Frontend Frameworks** \n\t  \n\n **API Technologies** \n\t RESTful APIs, REST/gRPC APIs, Microservices \n\n **Serverless and Cloud Functions** \n\t AWS (EC2, S3, Lambda), Microsoft Azure, Azure DevOps \n\n **Databases** \n\t PostgreSQL, MySQL, MongoDB, Redis \n\n **DevOps** \n\t Docker, Kubernetes, GitHub Actions, CI/CD, PyTest, Git, Agile, troubleshooting \n\n **Cloud & Infrastructure** \n\t Azure \n\n **Other** \n\t PowerShell, Power Apps, communication, Kafka"
}