{
  "name": "Mariusz Jan Skobel",
  "role_name": "Senior QA Engineer",
  "email": "mariuszskobel15@outlook.com",
  "phone": "+48 735 343 548",
  "address": "Katowice, Poland",
  "linkedin": "https://www.linkedin.com/in/mariusz-skobel-927764397/",
  "profile_summary": "Senior QA Engineer with 10+ years of experience excelling in **test automation** and driving **CI/CD** processes. Proficient in utilizing **Gitflow** for streamlined collaboration and ensuring code quality. Experienced in implementing **visual test automation** and utilizing advanced **AI test tools**. Demonstrated aptitude in **mentoring** teams to enhance skills in **automation frameworks** and effective collaboration methods.\n\nAdditionally, I bring a strong background in full stack development with expertise in **JavaScript/TypeScript**, **Python**, and **Flutter**, complemented by hands-on experience with **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**. My technical proficiency extends to building and deploying cloud-native applications on **Azure** and **AWS**, integrating **microservices architecture**, and developing real-time analytics solutions with embedded AI/ML capabilities. With a commitment to delivering high-quality software and ensuring compliance with standards such as HIPAA and PCI DSS, I am passionate about creating impactful systems that meet both technical excellence and user needs.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2012",
      "to_year": "2015",
      "location": "UK",
      "university": "University of Bristol"
    }
  ],
  "experience": [
    {
      "role": "Senior QA Engineer",
      "company": "EitBiz",
      "from_date": "Oct 2022",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Developed and executed robust **test automation** strategies using **Cypress** and **Playwright**, ensuring reliable and efficient test coverage for both web and API services.\n• Implemented **CI/CD** pipelines streamlining deployment processes and enhancing code quality through automated testing and **Gitflow** practices, facilitating integration and deployment across environments.\n• Mentored junior QA engineers, fostering a culture of continuous learning and skill advancement in **test automation** techniques and frameworks.\n• Collaborated with cross-functional teams to enhance collaboration on testing processes, ensuring alignment with development workflows and project timelines.\n• Integrated **AI test tools** into the QA suite to improve testing efficiency and accuracy, leveraging data-driven insights for better test scenarios and coverage.\n• Designed and maintained visual test automation frameworks, utilizing modern libraries to ensure that UI components perform as expected, thereby improving user experience.\n• Established robust testing strategies utilizing **Cypress** for end-to-end testing and **Playwright** for cross-browser testing, gauging performance across multiple platforms.\n• Contributed significantly to the testing of large-scale applications with high user traffic, measuring performance metrics and optimizing for high availability across **99.9%** SLA standards.\n• Enhanced test case documentation and reporting with automated tools, achieving a **30%** reduction in manual testing time, leading to increased team efficiency."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Tvn S.A.",
      "from_date": "Oct 2019",
      "to_date": "Sep 2022",
      "location": "Poland",
      "responsibilities": "Implemented test automation strategies using **Cypress** and **Playwright** to ensure robust testing for financial platform features, reducing manual testing efforts by **40%**.\nDeveloped and maintained automation frameworks leveraging **Gitflow** for version control, enhancing team collaboration and integration into CI/CD pipelines, leading to a **30%** improvement in release cycle times.\nCollaborated with cross-functional teams to integrate **AI test tools** into the testing processes, enabling smarter testing approaches that increased defect detection rates by **25%**.\nMentored junior QA engineers in best practices for test automation, fostering a culture of continuous learning and collaboration within the team.\nDesigned and executed visual test automation using advanced techniques, ensuring high-quality user experiences for financial dashboards and admin portals.\nConducted performance testing for transaction systems, identifying critical bottlenecks and reducing regression test cycles by **15%**.\nLeveraged automation frameworks to create end-to-end test scenarios for real-time transaction monitoring, ensuring operational reliability and enhanced user trust.\n"
    },
    {
      "role": "Software Engineer",
      "company": "Timspark",
      "from_date": "Sep 2015",
      "to_date": "Aug 2019",
      "location": "UK",
      "responsibilities": "Implemented test automation frameworks using **Playwright** and **Cypress** for end-to-end testing, ensuring high-quality releases through comprehensive testing strategies across multiple modules.\nCollaborated with cross-functional teams to integrate **CI/CD** pipelines, enhancing deployment processes and ensuring seamless integration of automated tests into the workflow.\nMentored junior QA engineers on best practices in test automation and visual test automation techniques, fostering a culture of continuous improvement and knowledge sharing within the team.\nDeveloped and maintained AI-driven testing tools to enhance test coverage and efficiency, leveraging insights from behavioral data to optimize test scenarios and execution.\nUtilized **Gitflow** for version control, ensuring a streamlined process for managing code changes and facilitating collaboration among team members on project developments.\nConducted peer reviews and collaborated with development teams to refine test cases and align on project requirements, leading to improved product quality and reduced defect rates by **30%** over **6 months**.\nImplemented and monitored automation testing metrics, providing analytical insights that drove improvements in both product and testing processes, with a focus on optimizing performance outcomes and reducing manual testing efforts by **50%**.\nEngaged in strategic planning sessions for test strategy that included discussions on automating regression tests for major features, resulting in reduced release cycle time by **20%**.\nCoordinated with project managers to prioritize testing efforts based on risk assessment, ensuring critical features received thorough testing and validation prior to deployment."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, JavaScript, TypeScript\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\t\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose, CI/CD\n\n**Cloud & Infrastructure:**\n\tAWS, Azure\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, Keycloak, JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, Gitflow, test automation, visual test automation, automation frameworks, mentoring, collaboration, AI test tools, Cypress, Playwright",
  "apply_company": "Not Specified"
}