{
  "name": "Rei Taro",
  "role_name": "Senior Security Engineer",
  "email": "rei515@outlook.com",
  "phone": "+48732529451",
  "address": "Warszawa, Poland",
  "linkedin": "https://www.linkedin.com/in/rei-taro-81a410391/",
  "profile_summary": "Results-driven Senior Security Engineer with over 10 years of experience in cloud security, SOC operations, and threat hunting. Proficient in utilizing **AWS**, **Azure**, **Splunk**, **Rapid7**, **DLP**, **EDR**, and **CSPM** for proactive security measures and incident response. Strong expertise in scripting using **Python** and **PowerShell** to automate security processes and improve operational efficiency. Skilled in deploying and managing SIEM systems to enhance threat detection and analysis capabilities. Recognized for exceptional communication and collaboration skills in multicultural environments, fluent in English and Spanish. Proven ability to contribute to high-impact projects at prestigious organizations, fostering a culture of security excellence.",
  "education": [
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2010",
      "to_year": "2015",
      "location": "Japan",
      "university": "Keio University"
    }
  ],
  "experience": [
    {
      "role": "Senior Security Engineer",
      "company": "Leobit",
      "from_date": "Aug 2022",
      "to_date": "Present",
      "location": "Poland",
      "responsibilities": "Implemented **cloud security** measures by deploying microservices on **Azure** App Services, ensuring robust protection for sensitive data.\nConducted thorough **SOC operations** and performed **threat hunting** to identify potential vulnerabilities and mitigate risks in backend services built with **Python** and **FastAPI**.\nUtilized **SIEM** tools like **Splunk** for monitoring and analyzing security incidents, enhancing overall system integrity.\nIntegrated **EDR** and **DLP** technologies to safeguard user information and streamline regulatory compliance for document automation workflows.\nFocused on collaborative problem-solving with cross-functional teams, leveraging strong **communication** skills in both English and Spanish to enhance workflow efficiency.\nDeveloped asynchronous processing solutions using **Celery** and **Redis**, improving the performance of financial transaction requests by **30%**.\nCreated and maintained data pipelines for regulatory data exchange using **Apache Airflow** and **Azure Functions**, ensuring timely operational data flow with a **99.9%** success rate.\nUtilized **PowerShell** scripting for automating repetitive tasks, reducing manual workload by **40%** and improving team efficiency."
    },
    {
      "role": "Software Engineer",
      "company": "Innovature",
      "from_date": "Nov 2018",
      "to_date": "Jun 2022",
      "location": "Japan",
      "responsibilities": "Implemented **cloud security** measures and protocols to enhance the safety and integrity of backend systems developed in **Python** and **FastAPI**.\nConducted **SOC operations** by creating event-driven microservices using **Celery** and **Redis**, enabling efficient processing of sensitive financial data.\nLeveraged **Azure** for the deployment of microservices on **Azure App Services**, utilizing **Terraform** for infrastructure automation to maintain scalable environments with a **99.9% uptime** rate.\nEngineered data pipelines using **Apache Airflow** and **Azure Functions** to secure the exchange of regulatory data, increasing data flow efficiency by **30%**.\nPerformed security audits and threat assessments, ensuring compliance with industry standards, while integrating **OAuth2** and **Azure AD B2C** for enhanced access control measures.\nPerformed **threat hunting** and incident response activities using **SIEM** tools like **Splunk** and **Rapid7**, to proactively detect and mitigate security threats.\nMaintained clear and effective communication across cross-functional teams to ensure smooth system integration and regulatory compliance, enhancing collaboration by **25%**."
    },
    {
      "role": "Software Developer",
      "company": "Wizcorp",
      "from_date": "Apr 2015",
      "to_date": "Nov 2018",
      "location": "Japan",
      "responsibilities": "• Leveraged cloud security practices and tools, specifically **Azure** and **AWS**, to enhance resilience against potential threats in trading operations.\n• Conducted SOC operations and threat hunting procedures to proactively identify security vulnerabilities in backend services developed using **Python**, ensuring platforms remain robust and secure.\n• Utilized **SIEM** tools like **Splunk** and **Rapid7** to monitor trade execution, portfolio management, and account tracking systems, ensuring compliance with regulatory requirements such as MiFID II and GDPR.\n• Collaborated effectively with cross-functional teams, enhancing communication in both **English** and **Spanish**, to ensure smooth integration of backend with frontend services.\n• Implemented security measures and monitoring solutions with **EDR** and **DLP** technologies, managing security incidents efficiently across a high-frequency trading environment.\n• Developed scripting solutions in **Python** and **PowerShell** to automate security tasks and streamline operations, contributing to enhanced performance measures and faster incident response times.\n• Designed and tested comprehensive security architectures in alignment with best practices, facilitating a 30% reduction in response time to security incidents over a 6-month period.\n• Enhanced platform monitoring capabilities by integrating cloud-native security monitoring and compliance frameworks, leading to a measurable increase in secure deployment instances by 25%."
    }
  ],
  "skills": "**Cloud & Infrastructure**\n\tAWS, Azure, cloud security, SOC operations, threat hunting, SIEM, EDR, DLP, sentinel, Splunk, Rapid7, CSPM\n\n**Programming Languages**\n\tPython (3.8+), SQL, Bash, JavaScript, PowerShell, scripting\n\n**Backend Frameworks**\n\tFastAPI, Flask, Django, Celery\n\n**DevOps**\n\tDocker, Kubernetes, GitHub Actions, Azure DevOps, CI/CD\n\n**Databases**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**API Technologies**\n\tREST/gRPC APIs, Microservices\n\n**AI/ML Tools**\n\tPandas, NumPy, scikit-learn, TensorFlow, Airflow, MLflow\n\n**Other**\n\tcommunication, collaboration, English, Spanish, PyTest, Git",
  "apply_company": "Novanta Inc."
}