{
  "name": "Rei Taro",
  "role_name": "Senior Elixir Fullstack Engineer",
  "email": "rei515@outlook.com",
  "phone": "+48732529451",
  "address": "Warszawa, Poland",
  "linkedin": "https://www.linkedin.com/in/rei-taro-28639a395/",
  "profile_summary": "Results-driven Senior Elixir Fullstack Engineer with 10+ years of experience in agile software development and team collaboration. Proficient in **Elixir**, **Phoenix**, **LiveView**, and **TailwindCSS**, with a focus on building scalable applications that meet GDPR compliance and data privacy standards. Skilled in employing best practices for code quality and encryption, and experienced in **DevOps** methodologies and **Shape Up** frameworks for enhanced workflow efficiency. Proven ability to design and deliver impactful systems, leveraging insights gained from past roles at leading organizations. My strong problem-solving skills, curiosity, and effective communication ensure successful project completion and a collaborative team environment.",
  "education": [
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2010",
      "to_year": "2015",
      "location": "Japan",
      "university": "Keio University"
    }
  ],
  "experience": [
    {
      "role": "Senior Elixir Fullstack Engineer",
      "company": "Leobit",
      "from_date": "Aug 2022",
      "to_date": "Present",
      "location": "Poland",
      "responsibilities": "Engineered fullstack applications using **Elixir** and **Phoenix** to deliver scalable solutions for document automation and user onboarding processes.\nDeveloped interactive user interfaces with **LiveView** and styled applications using **TailwindCSS** and **daisyUI** to enhance user experience and engagement.\nImplemented GDPR compliance measures and integrated data privacy strategies, ensuring adherence to legal frameworks while managing sensitive information.\nLed efforts in encryption and data security, improving overall system integrity and user trust by **30%**.\nAdopted **DevOps** practices to streamline deployment processes, achieving a **40%** reduction in release cycle times.\nFacilitated team collaboration through **agile software development** methodologies, enhancing productivity and project visibility across cross-functional teams.\nContributed to code quality standards, conducting regular code reviews that improved the maintainability of codebases by **25%**.\nActively participated in team meetings and discussions, utilizing professional-level English communication to foster an open environment for problem-solving and reflection."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Innovature",
      "from_date": "Nov 2018",
      "to_date": "Jun 2022",
      "location": "Japan",
      "responsibilities": "Utilized **Elixir** and **Phoenix** frameworks to develop and enhance full-stack applications, ensuring high performance and responsiveness.\nImplemented **LiveView** and **TailwindCSS** for crafting interactive user interfaces, resulting in a **30%** increase in user engagement and streamlined navigation.\nEnsured **GDPR compliance** and integrated **encryption** techniques to uphold data privacy standards, reducing security vulnerabilities by **40%**.\nAdopted **DevOps** practices, utilizing continuous integration and delivery to enhance deployment efficiency, achieving a **25%** quicker release cycle.\nApplied **Shape Up** methodology to manage project timelines and improve team collaboration, leading to a **15%** boost in overall productivity.\nConducted regular code quality reviews and peer assessments, fostering a culture of excellence in coding practices.\nFacilitated agile software development processes, ensuring iterative delivery and continuous feedback through effective communication and reflection with team members."
    },
    {
      "role": "Software Developer",
      "company": "Wizcorp",
      "from_date": "Apr 2015",
      "to_date": "Nov 2018",
      "location": "Japan",
      "responsibilities": "Utilized **Elixir** and **Phoenix** frameworks to develop robust backend services ensuring high code quality and maintainability for trading applications.\nDesigned interactive frontend components using **LiveView**, **TailwindCSS**, and **daisyUI** to enhance user experience with a focus on responsiveness and design.\nEnsured compliance with **GDPR** while implementing necessary encryption protocols, enhancing data privacy and security measures across the application.\nCollaborated in an **Agile** development environment, employing **Shape Up** methodologies to facilitate team collaboration and efficient problem-solving strategies.\nParticipated in code reviews and testing processes, maintaining high standards of **code quality** and managing dependencies effectively with **Ruby**.\nCommunicated effectively in **professional-level English**, fostering teamwork and enhancing group dynamics in project executions.\nConsistently reflected on development processes, demonstrating curiosity and an eagerness to adopt best practices for continual improvement.\nImplemented continuous integration processes aligning with **DevOps** principles, optimizing deployment cycles and increasing operational efficiency by **30%**."
    }
  ],
  "skills": "**Programming Languages**\n\tElixir, Ruby, Python (3.8+), SQL, Bash, JavaScript\n\n**Backend Frameworks**\n\tFastAPI, Flask, Django, Celery, Phoenix\n\n**Frontend Frameworks**\n\tTailwindCSS, LiveView, daisyUI\n\n**API Technologies**\n\tREST/gRPC APIs, Microservices\n\n**Serverless and Cloud Functions**\n\tAWS (EC2, S3, Lambda), Azure\n\n**Databases**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps**\n\tDocker, Kubernetes, GitHub Actions, Azure DevOps, CI/CD\n\n**Cloud & Infrastructure**\n\tAWS (EC2, S3, Lambda), Azure\n\n**Other**\n\tAI/ML Tools: Pandas, NumPy, scikit-learn, TensorFlow, Airflow, MLflow, GDPR compliance, encryption, data privacy, Shape Up, code quality, agile software development, professional-level English, team collaboration, problem solving, curiosity, reflection, communication"
}