{
  "name": "Tomasz Lee",
  "role_name": "Senior Software Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Results-driven Senior Software Engineer with 9+ years of extensive experience in data ingestion, processing, and visualization. Proficient in **JavaScript**, **TypeScript**, and **Go** with a solid grasp of observability practices. Demonstrated expertise in **frontend** development and collaborating across teams to achieve project goals efficiently. Proven track record of leveraging open-source technologies to enhance application performance and ensure seamless data workflows. Originally specialized as a .NET Full Stack Developer, skilled in **ReactJS**, **NextJS**, **.NET**, **C#**, and incorporating cloud services, with additional hands-on experience in **Apache Kafka**, **RabbitMQ**, and **Redis**.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Senior Software Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "• Developed and maintained frontend components using **JavaScript** and **TypeScript**, enhancing the user interface for improved user engagement and satisfaction by **25%**.\n• Spearheaded the integration of **data ingestion** processes, leveraging tools like **Clickhouse** and **Tinybird**, resulting in a scalable architecture for real-time data processing.\n• Created visualization tools with **D3.js** for interactive data representation, driving data clarity and user interaction.\n• Ensured **observability** within applications through strategic implementation of monitoring tools, enhancing system reliability and continuous improvement.\n• Fostered open-source collaboration by contributing to community projects and integrating innovations into the development workflow.\n• Facilitated effective communication among cross-functional teams, streamlining project timelines and increasing team productivity.\n• Optimized data processing pipelines, significantly reducing load times and improving system responsiveness by **40%**.\n• Engaged in continuous improvement practices, implementing CI/CD strategies that decreased deployment times by **40%** and enhanced overall operational efficiency.\n• Collaborated closely with UX/UI designers, resulting in enhanced user experience and interface designs that cater to user needs effectively."
    },
    {
      "role": "Full Stack Developer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "Utilized **JavaScript** and **TypeScript** to design and develop user-friendly frontend components, enhancing user experience and engagement by **25%**.\nLed data ingestion and processing efforts using **Go** and **Clickhouse** for efficient data management and retrieval, significantly improving performance metrics.\nImplemented robust observability practices to monitor application performance and resolve issues proactively, contributing to reduced downtime by **15%**.\nDeveloped and optimized data visualization solutions using interactive charts and graphs to improve project tracking and reporting for stakeholders.\nFostered collaboration and communication across teams to clarify system requirements and ensure alignment with project goals, resulting in timely delivery of software solutions.\nEmployed **Tinybird** for real-time data processing tasks, enhancing overall system responsiveness and efficiency.\nConducted regular code reviews and provided mentorship to junior developers, leading to a **30%** increase in team productivity and skill development.\nIntegrated open-source libraries for enhanced functionality, promoting best practices within the development team."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "• Developed and optimized **Clickhouse** and **Tinybird** solutions for data ingestion and processing, enhancing data retrieval speeds by **25%**.\n• Utilized **JavaScript** and **TypeScript** frameworks to create efficient and scalable frontend applications, increasing user engagement by **30%**.\n• Led initiatives for observability enhancements within applications, implementing monitoring tools that reduced downtime by **15%**.\n• Collaborated effectively across teams to drive open source contributions, fostering community engagement and improving project visibility.\n• Participated in daily standups and code reviews, enhancing team collaboration and ensuring alignment with project objectives.\n• Delivered impactful technical documentation and user guides that streamlined the onboarding process for new team members and improved communication.\n• Assisted in integrating advanced visualization tools to represent data insights, simplifying complex data processing tasks.\n• Actively engaged in continuous learning and knowledge sharing within the team, contributing to a culture of innovation and development excellence."
    }
  ],
  "skills": " **Programming Languages** \n\t JavaScript, TypeScript, Go, Python \n\n **Backend Frameworks** \n\t NodeJS, ExpressJS, NestJS, C#, .NET, Entity Framework, Microservices \n\n **Frontend Frameworks** \n\t HTML, CSS, ReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS \n\n **API Technologies** \n\t RESTful API, GraphQL \n\n **Serverless and Cloud Functions** \n\t \n\n **Databases** \n\t MSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB, Clickhouse, Tinybird \n\n **DevOps** \n\t AWS, Azure, CI/CD pipelines \n\n **Cloud & Infrastructure** \n\t \n\n **Other** \n\t UX/UI Design, Git, GitHub, Redux, Blockchain, Solidity, Ether.js, Web3.js, Ethereum, Messaging & Caching: Apache Kafka, RabbitMQ, Redis, Observability, Data ingestion, Data processing, Visualization, Open source, Collaboration, Communication, Testing Tools: NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest",
  "apply_company": "Vercel"
}