{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Modern C++ Software Developer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-karol-kotlinski-bb2520397/",
  "profile_summary": "As a Modern C++ Software Developer with 8 years of experience, I possess a strong expertise in **C++ 20**, **Boost.Asio**, and object-oriented programming, underscoring my ability to build high-performance solutions. My technical proficiency includes asynchronous programming and unit testing, which I leverage to ensure robust software delivery. I am well-versed in the **FIX protocol** and **MetaTrader API**, enabling seamless financial data integration.\nIn addition to my core technical skills, my background in **JavaScript/TypeScript**, **Python**, and **Flutter** technologies allows me to bring a multi-faceted approach to development. I have developed enterprise-grade platforms aligned with compliance standards like HIPAA and PCI DSS. I excel in problem-solving and possess excellent communication and interpersonal skills, allowing me to collaborate effectively with teams and stakeholders. I am a self-starter, consistently driving projects forward and fostering innovative solutions.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Modern C++ Software Developer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Engineered high-performance applications using **C++ 20** and **Boost.Asio**, emphasizing **asynchronous programming** to enhance throughput and responsiveness.\n- Applied **object-oriented programming** principles in the design and implementation of complex systems, ensuring modularity and maintainability.\n- Developed and executed comprehensive **unit testing** strategies to guarantee software reliability and robustness, achieving over **90% test coverage** across projects.\n- Integrated the **FIX protocol** and **MetaTrader API** to facilitate real-time financial transactions and streamline trading processes.\n- Designed and implemented detailed system diagrams following **UML design** standards, improving clarity and communication among cross-functional teams.\n- Leveraged profiling tools to optimize performance, resulting in a **30% reduction** in latency for key processes.\n- Demonstrated strong **problem-solving** capabilities by troubleshooting complex issues and delivering innovative solutions that enhance user experience.\n- Fostered effective **communication** and **interpersonal skills** while collaborating with diverse teams, promoting a culture of continuous learning and improvement.\n- Acted as a **self-starter**, independently managing multiple projects and adapting to evolving requirements and technologies.\n- Contributed to the development of comprehensive documentation to support onboarding and maintain knowledge transfer across teams."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "- Utilized **C++ 20** and **Boost.Asio** to develop high-performance, scalable financial applications, enhancing throughput and efficiency in transaction processing.\n- Applied **object-oriented programming** principles to design modular and maintainable software architecture, ensuring code quality and ease of extensions.\n- Implemented **unit testing** protocols to maintain software integrity, achieving a test coverage of over **85%** and reducing defect rates in production by **30%**.\n- Leveraged **asynchronous programming** to improve application responsiveness, facilitating real-time data processing and user interactions within financial platforms.\n- Integrated **FIX protocol** and **MetaTrader API** for seamless communication with third-party trading platforms, enabling swift transaction management and data synchronization.\n- Employed **UML design** methodologies to outline system architecture, which streamlined communication among stakeholders and improved project timelines by **20%**.\n- Focused on **profiling** and optimizing application performance, resulting in a **25%** reduction in execution times for core financial algorithms.\n- Engaged in proactive **problem-solving** to identify and address arising issues in software deployment, fostering a resilient operational environment.\n- Demonstrated strong **communication** and **interpersonal skills** while collaborating with cross-functional teams, resulting in improved project delivery and team dynamics.\n- Acted as a **self-starter**, taking initiative to lead projects and drive process improvements without direct supervision, enhancing team productivity."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Utilized **C++ 20** for designing and implementing robust backend systems, emphasizing **object-oriented programming** principles to achieve modularity and reusability across codebases.\nImplemented asynchronous programming techniques with **Boost.Asio** to enhance system performance and responsiveness, catering to high-demand trading environments.\nConducted comprehensive unit testing to validate functionality and ensure code quality, fostering a culture of reliability and maintainability in software development.\nDeveloped and integrated with financial trading systems using the **FIX protocol** and **MetaTrader API**, demonstrating a deep understanding of trading strategies and automated trading systems.\nEmployed **UML design** methodologies to architect scalable and efficient software solutions, enhancing team communication and project clarity.\nFocused on performance profiling of applications to identify bottlenecks, utilize problem-solving skills for optimization, and improve overall application efficiency by at least **30%**.\nFacilitated a collaborative work environment by leveraging strong communication and interpersonal skills, effectively articulating technical concepts to non-technical stakeholders.\nExhibited self-starter attributes by initiating and leading project improvements which resulted in a **20%** increase in team productivity and streamlined workflows throughout project lifecycles."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, JavaScript, TypeScript, C++ 20\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n **Frontend Frameworks:**\n\tReact, Vue, Angular\n\n **API Technologies:**\n\tMetaTrader API, FIX protocol\n\n **Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n **Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:**\n\tAWS, Azure\n\n **Other:**\n\tMLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, unit testing, object-oriented programming, asynchronous programming, profiling, problem-solving, UML design, communication, interpersonal skills, self-starter"
}