{
  "name": "Mariusz Jan Skobel",
  "role_name": "Senior Software Engineer",
  "email": "mariuszskobel15@outlook.com",
  "phone": "+48 735 343 548",
  "address": "Katowice, Poland",
  "linkedin": "https://www.linkedin.com/in/mariusz-skobel-789557397/",
  "profile_summary": "Senior Software Engineer with over 10 years of experience in designing and implementing high-performance software solutions. Proficient in **Java**, **TypeScript**, **JavaScript**, and **RESTful APIs**, with solid expertise in building **GraphQL** and message-driven APIs. Skilled in containerization technologies like **Docker** and adept in **Serverless** architecture, ensuring efficient deployment and scalability. Experienced in **Continuous Delivery** practices and **Test-Driven Development (TDD)** to foster high-quality code. Strong background in **Model-View-Controller (MVC)** design, **Object-Relational Mapping (ORM)**, and working with both **Relational** and **NoSQL** databases, showcasing a versatile approach to data management.\n \nDemonstrated success in agile frameworks such as **Scrum**, complemented by excellent problem-solving skills and a collaborative mindset that enhances **cross-team collaboration**. Known for conducting meticulous **code reviews** to elevate code quality and adherence to best practices. Additionally, I bring extensive experience in full-stack development using modern frameworks including **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**. I am committed to building secure, maintainable solutions that meet compliance standards while delivering impactful applications.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2012",
      "to_year": "2015",
      "location": "UK",
      "university": "University of Bristol"
    }
  ],
  "experience": [
    {
      "role": "Senior Software Engineer",
      "company": "EitBiz",
      "from_date": "Oct 2022",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "•    Developed RESTful APIs and message-driven APIs using **TypeScript** and **Java** to create efficient service-oriented architectures, ensuring seamless integration across multiple systems.\n•    Designed and implemented scalable microservices architecture utilizing **Docker** and serverless technologies, enabling high availability and optimized resource allocation.\n•    Enhanced software reliability and maintainability by applying Test-Driven Development (TDD) principles, establishing robust testing frameworks with **Jest**, **Cypress**, and **PyTest**.\n•    Collaborated with cross-functional teams utilizing Scrum methodologies to deliver software iterations that meet business requirements, including providing code reviews for best practices.\n•    Employed **Object-Relational Mapping (ORM)** techniques with **PostgreSQL** and **MongoDB** to facilitate efficient database interactions and enhance data integrity.\n•    Integrated GraphQL for data querying in applications, allowing for optimized and flexible data retrieval from diverse sources.\n•    Delivered projects within **3-month** timeframes, utilizing Agile methodologies to adapt to changing requirements and ensure timely releases.\n•    Participated in the establishment of Continuous Delivery pipelines with **Azure DevOps** and **CircleCI**, streamlining deployment processes across environments.\n•    Applied problem-solving skills to troubleshoot critical issues in production, enhancing system performance and reliability by **20%**.\n•    Fostered cross-team collaboration to enhance project visibility and stakeholder engagement, contributing to successful project outcomes."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Tvn S.A.",
      "from_date": "Oct 2019",
      "to_date": "Sep 2022",
      "location": "Poland",
      "responsibilities": "• Developed and integrated **RESTful APIs** and **GraphQL** services using **Node.js** and **Java** for seamless communication between microservices, enhancing modularity and reducing downtime by **30%**.\n• Executed continuous delivery practices and implemented **Docker** for containerization, streamlining deployment processes and facilitating version control across environments.\n• Employed **Test-Driven Development (TDD)** methodologies to ensure code quality and reliability, resulting in a **25%** reduction in post-deployment bugs and issues.\n• Collaborated with cross-functional teams to design and implement **message-driven APIs** using **RabbitMQ** and **Kafka**, significantly improving system responsiveness for transaction processing by **40%**.\n• Architected and maintained scalable **NoSQL** and **Relational Databases** to support data storage for **high-volume transactions**, ensuring data integrity and performance.\n• Championed agile methodologies including **Scrum** to facilitate rapid development cycles and fostered a culture of continuous improvement through regular code reviews and collaborative problem-solving.\n• Optimized serverless infrastructure on **Azure** to reduce operational overhead and improve deployment speed by **50%**, enhancing the overall efficiency of the development lifecycle.\n• Mentored junior developers on best practices in **Model-View-Controller (MVC)** architecture and **Object-Relational Mapping (ORM)**, cultivating technical skills and improving team productivity.\n"
    },
    {
      "role": "Software Engineer",
      "company": "Timspark",
      "from_date": "Sep 2015",
      "to_date": "Aug 2019",
      "location": "UK",
      "responsibilities": "• Engineered robust and high-performance **RESTful APIs** and **GraphQL** services in **Java**, ensuring seamless communication across various platform components, enhancing development velocity by **30%**.\n• Developed and implemented a structured approach to **Test-Driven Development (TDD)**, leading to a **25%** reduction in defect rates during production rollouts and improving code quality.\n• Facilitated continuous delivery pipelines using **Docker** and serverless architectures, streamlining deployment processes and enabling on-demand scaling for high-load scenarios.\n• Collaborated with cross-functional teams to design and optimize **Message-driven APIs** that support real-time messaging and event-driven interactions, utilizing tools such as Kafka and RabbitMQ.\n• Participated in regular **code reviews** to maintain coding standards and foster collaborative problem-solving, resulting in a **15%** decrease in code complexity.\n• Successfully navigated complex database interactions using **Object-Relational Mapping (ORM)** strategies for **Relational Databases** and optimized data handling with **NoSQL Databases**, ensuring efficient data retrieval and storage.\n• Actively engaged in **Scrum** practices to enhance project planning and execution, contributing to improved product delivery timelines by **20%**.\n• Designed scalable applications following the **Model-View-Controller (MVC)** paradigm, promoting modularity and facilitating easier maintenance.\n• Led initiatives to improve code quality through rigorous testing and adherence to software engineering best practices, boosting overall team performance.\n• Emphasized cross-team collaboration to align development efforts with business goals, maximizing user satisfaction and driving project success."
    }
  ],
  "skills": " **Programming Languages:**\n\tJava, Python, TypeScript, JavaScript\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n **Frontend Frameworks:**\n\tReact, Vue, Angular\n\n **API Technologies:**\n\tRESTful APIs, Message-driven APIs, GraphQL\n\n **Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL), Serverless\n\n **Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis, Relational Databases, NoSQL Databases\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose, Continuous Delivery\n\n **Cloud & Infrastructure:**\n\tAWS, Azure\n\n **Other:**\n\tMachine Learning, AI, MLflow, Airflow, Kubeflow, Authentication & Security (Keycloak, JWT, OAuth2, Let’s Encrypt, Nginx, Certbot), Test-Driven Development (TDD), Model-View-Controller (MVC), Object-Relational Mapping (ORM), Scrum, Problem-solving, Code Reviews, Cross-team Collaboration"
}