{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Full Stack Software Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-623a26390/",
  "profile_summary": "Senior Full Stack Software Engineer with 13+ years of experience in delivering high-performance applications. Proficient in **TypeScript**, **ReactJS**, **Node.js**, and **AWS**, with hands-on expertise in backend development using **NestJS** and building **RESTful APIs**. Experienced in frontend technologies such as **AG Grid** and **Apache Echarts**. \nSkilled in deploying scalable systems on **AWS**, **Azure**, and **Google Cloud**, and implementing robust **CI/CD** pipelines within Agile environments. Demonstrated ability to solve complex problems with effective communication skills. Strong knowledge of **PostgreSQL** and version control using **Git**. Adept at building AI/ML-powered platforms and familiar with microservices and event-driven architectures.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Full Stack Software Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Developed robust, scalable full-stack applications utilizing **TypeScript**, **Node.js**, and **ReactJS** (versions 17-18), ensuring adherence to **RESTful API** standards and employing Agile methodologies for efficient project management.\n• Designed and implemented CI/CD pipelines leveraging tools like **Git** and **CircleCI**, achieving rapid deployment cycles with automated testing and security checks across diverse projects.\n• Delivered high-performance databases solutions using **PostgreSQL**, integrated via **Koa.js** for seamless data management and retrieval, supporting significant data operations with a focus on optimization.\n• Collaborated with cross-functional teams to define project requirements and improve communication channels, resulting in a **30%** increase in project delivery efficiency.\n• Enhanced application performance through effective problem-solving techniques, leading to a **25%** reduction in load times and improved user satisfaction scores.\n• Developed secure, multi-environment deployment strategies that increased application reliability and reduced downtime rates by **15%**.\n• Conducted code reviews and mentored junior developers in using best practices, ensuring code quality and promoting a culture of continuous learning and improvement within the engineering team.\n• Facilitated stakeholder meetings to discuss project progress, challenges, and innovations, leading to improved client relationships and satisfaction.\n• Contributed to the strategic planning and execution of project roadmaps, aligning technology solutions with business goals, and resulting in successful delivery of key initiatives."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "• Developed web applications utilizing **TypeScript**, **ReactJS** (version **18**), and **Node.js** with **NestJS**, implementing **RESTful APIs** for seamless communication between back-end and front-end systems.\n• Implemented agile methodologies to ensure efficient project delivery and foster team collaboration, enhancing productivity by managing tasks in **Git** and conducting code reviews.\n• Designed and maintained scalable databases using **PostgreSQL**, optimizing queries for performance on high-traffic applications handling over **100,000** transactions daily.\n• Built interactive front-end applications using **ReactJS**, utilizing state management with Redux Toolkit and responsive design through **Tailwind CSS** to enhance user engagement.\n• Established CI/CD pipelines for automating deployment processes, facilitating rapid development cycles and minimizing downtime across multiple environments.\n• Deployed cloud solutions on **AWS**, **Azure**, and **Google Cloud**, taking advantage of various services to enhance system resilience and availability.\n• Resolved complex technical problems and implemented innovative solutions to improve system efficiency and user experience, focusing on effective communication among cross-functional teams.\n• Collaborated on the development of project requirements and technical specifications, ensuring alignment with business objectives and user needs."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "• Led the design and development of scalable **RESTful APIs** using **Node.js** (specifically **NestJS**) and **TypeScript**, enhancing overall system performance for a global e-commerce platform and achieving a **25% reduction in latency**.\n• Engineered frontend user interfaces utilizing **ReactJS** and **TypeScript**, resulting in a **30% improvement** in user engagement metrics and seamless interaction across devices.\n• Managed and optimized database structures with **PostgreSQL**, ensuring high availability and achieving over **99.9% uptime** for critical transaction workloads.\n• Implemented version control using **Git** and enforced CI/CD processes which accelerated deployment frequency by **40%**, enhancing the agility of the development cycle.\n• Participated in Agile methodologies to facilitate team collaboration and communication, boosting project transparency and delivery speed by **15%**.\n• Leveraged cloud services such as **AWS**, **Azure**, and **Google Cloud** to host applications, optimize resource usage, and manage infrastructure efficiently with a focus on cost-reduction, achieving a **20% decrease in operational costs**.\n• Applied problem-solving techniques to troubleshoot and resolve complex issues in both backend and frontend systems, maintaining responsiveness and reliability under high traffic.\n• Integrated cutting-edge libraries such as **Koa.js** and visual data representations with **Apache Echarts**, advancing analytics capabilities and real-time data insights within applications.\n• Conducted code reviews and mentoring sessions within the team, resulting in improved code quality and a stronger development culture focused on best practices.\n• Enhanced application performance by optimizing build processes and utilizing libraries like **AG Grid** for improved data management on the frontend."
    }
  ],
  "skills": "**Programming Languages:**\n\tPython, TypeScript, JavaScript\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django, NodeJS, NestJS, Koa.js\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular, AG Grid, Apache Echarts\n\n**API Technologies:**\n\tRESTful API\n\n**Serverless and Cloud Functions:**\n\tAWS ECS, AWS Lambda, Azure App Services\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD\n\n**Cloud & Infrastructure:**\n\tAWS RDS, AWS S3, Azure Blob Storage, Azure SQL Database, Terraform, Ansible, Helm, Docker Compose\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, Git, CI/CD, Agile, problem-solving, communication, Keycloak (OIDC, RBAC), OAuth2, JWT, Nginx, Let’s Encrypt, Certbot"
}