{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior UX Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Senior UX Engineer with 13+ years of experience specializing in creating user-centered designs that prioritize usability and visual appeal. Proficient in **Figma**, **Sketch**, and **Adobe** for wireframing, prototyping, and developing intuitive user interfaces. Skilled in **HTML5** and **CSS** to ensure responsive design across various platforms while enhancing user engagement through effective data visualization strategies. \n\nExpert communicator with strong collaboration skills, adept at managing stakeholders to gather requirements and deliver high-performance applications aligned with business goals. Additionally, bring extensive development experience as a Full Stack Developer, incorporating advanced tech stacks such as **JavaScript/TypeScript**, **Python**, **React**, **Node.js**, and deploying cloud-native solutions on **AWS** and **Azure**. Knowledgeable in compliance-driven development and MLOps, adding a unique perspective to UX design by integrating predictive analytics and automation seamlessly into user experiences.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior UX Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Collaborated with stakeholders to define user experience strategies, ensuring impactful **UI/UX** solutions using **Figma**, **Sketch**, and **Adobe**.\n• Designed and prototyped high-fidelity interfaces employing **HTML5**, **CSS**, and responsive design principles for seamless interaction across devices.\n• Conducted usability testing and data visualization initiatives to enhance user engagement and streamline workflows, focusing on robust analysis and iterative design.\n• Led wireframing sessions to create interactive prototypes that improved stakeholder feedback cycles, enhancing overall product design processes.\n• Developed responsive and visually appealing designs adhering to best practices in **visual design**, ensuring consistency and brand alignment across all platforms.\n• Managed team communications throughout project lifecycle, promoting collaboration and maintaining alignment with project objectives and deliverables.\n• Provided guidance on data visualization techniques utilizing tools such as **D3.js** and **Power BI Embedded** to convey complex concepts through clear visual components.\n• Ensured accessibility standards were met by integrating usability principles, allowing for optimized experiences for all user demographics.\n• Engaged in cross-functional collaboration to refine designs based on analytical insights, improving design effectiveness and user satisfaction metrics.\n• Created a design system that unified various projects, promoting efficient design practices and fostering a consistent user experience across multiple applications.\n• Facilitated stakeholder management processes, maintaining open lines of communication and securing necessary feedback to inform design iterations and enhancements."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Designed and implemented user-centric interfaces with a focus on **UX**, **UI**, and **Responsive Design**, collaborating closely with stakeholders to gather requirements and produce wireframes and prototypes using **Figma** and **Sketch**.\nUtilized **HTML5** and **CSS** to create visually appealing web applications, ensuring adherence to best practices in **Visual Design** and **Usability** for optimal user experience.\nConducted user testing and applied insights to refine interactive designs, resulting in increased user satisfaction scores by **20%** over a **6-month** period.\nDeveloped interactive dashboards with real-time data visualization using React and **D3.js**, enhancing stakeholders' ability to access and analyze **KPIs** and user data effectively.\nCollaborated in multi-disciplinary teams to facilitate communication and ensure alignment on project goals, reducing project feedback loops by achieving an **80%** approval rate on initial design concepts.\nCreated detailed documentation of design processes and user journeys, enhancing team collaboration and ensuring consistent project execution throughout the development cycle."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Designed intuitive UI/UX for e-commerce applications, ensuring enhanced user experience through collaboration with stakeholders and using tools like **Figma** and **Sketch**.\nCreated high-fidelity prototypes and wireframes that drive usability testing, leading to a **30%** increase in customer satisfaction based on usability metrics.\nConducted extensive usability research and data visualization to inform design decisions, focusing on responsive design principles optimized for both web and mobile platforms.\nCollaborated with cross-functional teams to elicit feedback and integrate visual design elements aligned with brand guidelines, utilizing **Adobe** for graphics and design assets.\nImplemented responsive design strategies using **HTML5** and **CSS**, ensuring compliance with accessibility standards (WCAG 2.1) and improving mobile-first engagement by **40%**.\nProvided expert insights in stakeholder management, leading design reviews that influenced product direction and prioritization.\nFacilitated workshops and brainstorming sessions, promoting effective communication and collaboration among developers, product managers, and designers.\nUtilized advanced prototyping techniques to simulate user interactions, achieving rapid iterations and enhanced team alignment on design goals.\nRefined visual design elements to elevate brand experience and adhere to best practices in UI composition and layout, resulting in improved visual consistency across platforms.\nEngaged in continuous learning and adaptation of new design trends, ensuring the application of the latest UX methodologies in the development process."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython: FastAPI, Flask, Django,\n\tJavaScript/TypeScript: React, Vue, Angular,\n\n **Frontend Frameworks:**\n\tHTML5,\n\tCSS,\n\tFigma,\n\tSketch,\n\n **Backend Frameworks:**\n\tFastAPI,\n\tFlask,\n\tDjango,\n\n **API Technologies:**\n\tOAuth2,\n\tJWT,\n\tKeycloak (OIDC, RBAC),\n\n **Serverless and Cloud Functions:**\n\tAWS: ECS, Lambda,\n\n **Databases:**\n\tPostgreSQL (Fintech),\n\tMySQL (Healthcare),\n\tMongoDB (Gaming),\n\tRedis,\n\n **DevOps:**\n\tDocker,\n\tKubernetes,\n\tGitHub Actions,\n\tGitLab CI/CD,\n\n **Cloud & Infrastructure:**\n\tAWS: RDS,\n\tAzure: App Services,\n\tAzure: Blob Storage,\n\tAzure: SQL Database,\n\n **Other:**\n\tUsability,\n\tVisual Design,\n\tData Visualization,\n\tResponsive Design,\n\tCollaboration,\n\tCommunication,\n\tStakeholder Management,\n\tPrototyping,\n\tWireframing,\n",
  "apply_company": "GlobalLogic"
}