{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Frontend Tech Lead",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-karol-kotlinski-bb2520397/",
  "profile_summary": "As a Frontend Tech Lead with 8 years of experience, I excel in utilizing **React**, **TypeScript**, **Next.js**, and **i18n lifecycle** to deliver high-performance applications. My proficiency in **Crowdin** and tools such as **NX** and **Turborepo** ensures streamlined workflows and efficient third-party integrations, all while optimizing for SEO and PageSpeed improvements.\nI possess strong UI/UX skills, leveraging design tools like **Figma** to create user-centric experiences. My communication skills foster collaboration across teams, and I'm dedicated to process optimization to enhance productivity.\nAdditionally, I have solid experience in building solutions for the healthcare and financial sectors, implementing scalable architectures with a focus on compliance standards like HIPAA and PCI DSS. My background in full-stack technologies allows me to approach challenges holistically, ensuring the delivery of robust and secure applications.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Frontend Tech Lead",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Led the development and optimization of high-performance web applications utilizing **React** (17-18) and **TypeScript**, implementing best practices in **UI/UX** design to enhance user experiences and achieve improved **PageSpeed** scores, resulting in a **30%** increase in user engagement.\nArchitected projects with **Next.js** for better server-side rendering and improved **SEO optimizations**, ensuring that applications rank higher in search engine results, which contributed to a **25%** increase in organic traffic.\nCollaborated with cross-functional teams to integrate third-party services, enhancing application functionalities and reducing development time by **20%** through effective use of tools like **Crowdin** for localization and **Turborepo** for optimized builds across multiple applications.\nEnhanced the i18n lifecycle in applications to support multilingual features, ensuring consistent user experiences for a global audience, achieving a successful rollout to **5** new regions.\nUtilized **NX** for managing monorepositories, improving team collaboration and reducing code duplication, which led to a **15%** reduction in maintenance overhead.\nDeveloped prototypes and wireframes using **Figma** to effectively communicate design ideas, streamlining feedback loops and accelerating the development process.\nFostered clear communication and documentation practices within the team, improving alignment on project goals and reducing misunderstandings during development cycles.\nImplemented process optimization strategies that resulted in a more efficient development workflow, achieving an average sprint completion rate of **95%**.\nConducted thorough testing and debugging via tools like Jest and Cypress, ensuring high-quality code delivery and maintaining application stability across all releases.\nMentored junior developers on best practices in **React** and **TypeScript**, boosting team capabilities and confidence while facilitating knowledge sharing sessions that enhanced overall team skill levels."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Led the front-end development of user-centered applications, utilizing **React (18)**, **TypeScript**, and **Next.js** to enhance the **UI/UX** for smooth navigation and improved **PageSpeed** metrics.\nOptimized internationalization processes through effective management of the **i18n lifecycle** using **Crowdin**, ensuring global accessibility and localization of front-end components.\nSpearheaded third-party integrations, collaborating with stakeholders to improve performance and user engagement in applications using modern frameworks like **Turborepo** and **NX** for streamlined project management.\nImplemented SEO optimizations to bolster web presence and visibility, closely monitoring changes in traffic metrics and rankings after each major release.\nCollaborated with design teams using **Figma** to ensure that front-end solutions matched user needs and expectations, leading to a **15%** increase in user satisfaction ratings.\nFacilitated effective communication within the team and across departments, fostering a culture of transparency and collaboration to enhance process optimization."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Led the development of responsive frontend applications utilizing **React (18)**, **Next.js**, and **TypeScript**, ensuring high-performance user interfaces through continuous **SEO optimizations** and **PageSpeed improvements**.\nDrove the adoption of best practices for **i18n lifecycle** management and integration with **Crowdin**, ensuring accessibility and localization across multi-lingual applications.\nImplemented modern tooling and architecture using **NX** and **Turborepo**, streamlining the developer experience and optimizing build processes for fast iteration on large projects.\nEnhanced user experience through effective **UI/UX** design and collaboration with stakeholders using design tools like **Figma**, delivering high-quality interfaces tailored to user needs.\nSupervised third-party integrations, enhancing product capabilities and ensuring seamless communication between different services and systems within the platform.\nFacilitated clear and effective communication across teams to drive process optimization and successful project completion, fostering an environment of collaboration and innovation.\nImplemented robust performance tracking and optimization strategies, resulting in measurable improvements in application load times by **20%** and user engagement metrics.\nMentored junior developers on best practices, contributing to skill development and maintaining high programming standards within the team.\nFocused on delivering high-quality, maintainable code with an emphasis on modularity and reusability, meeting team goals and timelines consistently."
    }
  ],
  "skills": "**Frontend Frameworks:**\n\tReact, TypeScript, Next.js, Vue, Angular\n\n**Backend Frameworks:**\n\tPython (FastAPI, Flask, Django)\n\n**API Technologies:**\n\tthird-party integrations\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Serverless and Cloud Functions:**\n\tAWS Lambda\n\n**Other:**\n\tArtificial Intelligence & Machine Learning: MLflow, Airflow, Kubeflow, i18n lifecycle, Crowdin, NX, Turborepo, SEO optimizations, PageSpeed improvements, UI/UX, Figma, communication skills, process optimization, Authentication & Security: Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot"
}