{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Software Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Senior Software Engineer with 13+ years of experience in delivering high-performance applications, specializing in **React**, **TypeScript**, **Next.js**, **Node.js**, and **PostgreSQL**. Adept at developing both frontend and backend solutions while applying **Agile** methodologies and **DevOps** practices to enhance delivery efficiency. Proven expertise in implementing **CI/CD** pipelines and utilizing **Software Design Patterns** for optimal code architecture. \n\nSkilled in building innovative applications with **AWS** for cloud-native deployments and supporting distributed computing environments. Experienced in constructing AI/ML platforms that leverage predictive analytics and automation, with a robust background in MLOps utilizing tools like MLflow and Airflow. Committed to compliance-driven development aligning with standards such as HIPAA, FHIR, PCI DSS, and SOC 2.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Software Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Developed high-performance web applications using **React** (17–18), **TypeScript**, and **Node.js**, emphasizing software design patterns and distributed computing for optimal efficiency.\n• Implemented CI/CD practices within an **AWS** cloud environment, leveraging **DevOps** tools to automate workflows and enhance deployment processes.\n• Participated in Agile development methodologies to facilitate rapid iteration and collaborative software design, ensuring timely project delivery.\n• Built and maintained robust data management systems with **PostgreSQL** to support efficient data handling and storage.\n• Collaborated in transforming legacy systems by integrating modern frameworks like **Next.js**, enabling enhanced frontend experiences and improved scalability.\n• Designed and executed testing strategies utilizing frameworks such as Jest and Cypress for comprehensive coverage across unit, integration, and E2E tests.\n• Played a key role in the development of distributed systems adhering to best practices in software engineering and architecture.\n• Enhanced application performance and security by integrating various third-party tools and frameworks for monitoring and analytics."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "- Developed and maintained scalable applications using **React (18)**, **TypeScript**, and **Next.js**, ensuring robust front-end solutions for a seamless user experience in financial applications.\n- Utilized **Node.js** with **PostgreSQL** as the primary backend technology to construct highly efficient and maintainable RESTful APIs, enhancing performance and reducing latency by **40%**.\n- Implemented Agile methodologies within the team, resulting in a **25%** increase in sprint efficiency and improved delivery timelines.\n- Spearheaded CI/CD practices using **AWS** tools, successfully automating deployment processes and reducing release times by **50%**.\n- Applied Software Design Patterns to create modular and reusable code, improving code maintainability and reducing overall technical debt.\n- Contributed to distributed computing projects that handled processing needs for high-volume transactional systems, achieving a throughput of **1,000+** transactions per second.\n- Collaborated in cross-functional teams utilizing **DevOps** strategies to integrate continuous testing and delivery, shortening the development lifecycle and enhancing product quality.\n- Engaged in code reviews and mentorship, fostering a culture of collaboration and continuous improvement among junior developers within the team."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "• Developed robust web applications leveraging **React (18)** and **TypeScript**, ensuring adherence to **Agile** methodologies for efficient and timely delivery.\n• Created scalable backend services using **Node.js** (including **NestJS** and **Express**) to support high-throughput e-commerce transactions, achieving a latency reduction of **30%**.\n• Designed CI/CD pipelines with automation tools, enhancing deployment speed by **40%** and promoting continuous integration and delivery practices across development teams.\n• Optimized databases with **PostgreSQL** ensuring data integrity and high availability; reduced query response time by **25%** through indexing and performance tuning.\n• Engaged in distributed computing strategies to facilitate load balancing and efficient resource utilization across all application tiers, supporting up to **100,000** concurrent users.\n• Utilized **Next.js** for server-side rendering and improved SEO performance of web applications, resulting in a **50%** increase in organic traffic.\n• Collaborated in a DevOps culture, implementing best practices and tools for infrastructure as code, resulting in reduced downtime during deployments to less than **1 hour**.\n• Contributed to software design patterns, ensuring clean and maintainable code architecture, which improved code reuse and team collaboration.\n• Participated in the development of a scalable solution for data storage and retrieval within AWS, leveraging managed services to reduce overhead and costs by **20%**.\n• Advocated for comprehensive documentation and training on developed features, ensuring effective knowledge transfer within the engineering team."
    }
  ],
  "skills": "**Programming Languages:**\n\tPython, JavaScript/TypeScript\n\n**Frontend Frameworks:**\n\tReact, Next.js, Vue, Angular\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django, Node.js\n\n**API Technologies:**\n\tOAuth2, JWT\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**Cloud & Infrastructure:**\n\tAWS, Azure\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Other:**\n\tAgile, Software Design Patterns, Distributed Computing, MLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), Nginx, Let’s Encrypt, Certbot",
  "apply_company": "Weflow"
}