{
  "name": "Mariusz Jan Skobel",
  "role_name": "Senior Automation Engineer",
  "email": "mariuszskobel15@outlook.com",
  "phone": "+48 735 343 548",
  "address": "Katowice, Poland",
  "linkedin": "https://www.linkedin.com/in/mariusz-skobel-927764397/",
  "profile_summary": "Results-driven Senior Automation Engineer with over 10 years of experience in software development, specializing in **Python**, **pytest**, and automation frameworks. Highly skilled in **Selenium** and **Playwright** for test automation, ensuring optimal performance and reliability of software solutions through robust performance testing using **Locust** and **Allure**. Proven ability to lead projects in Agile environments, focusing on efficient data analytics and integration of **GenAI** technologies to enhance automation processes. Demonstrates exceptional communication skills and a strong understanding of the software development lifecycle to deliver high-quality, compliant solutions. A strategic thinker with a solid background in full stack development using **JavaScript/TypeScript**, **React**, and **Node.js**, dedicated to driving impactful results while fostering collaboration across teams.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2012",
      "to_year": "2015",
      "location": "UK",
      "university": "University of Bristol"
    }
  ],
  "experience": [
    {
      "role": "Senior Automation Engineer",
      "company": "EitBiz",
      "from_date": "Oct 2022",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "•\tUtilized **Python** for automation and scripting tasks, developing robust test cases and test suites using **pytest** to ensure high-quality deliverables in an Agile environment.\n•\tDesigned and executed performance testing strategies leveraging **Locust** to simulate user load and evaluate system behavior under stress, optimizing response times in critical applications.\n•\tImplemented automation frameworks using **Selenium** and **Playwright**, enhancing test coverage and reducing regression testing time by **30%** across various web applications.\n•\tCollaborated with cross-functional teams to gather requirements and effectively communicate testing results, ensuring alignment on project goals and deliverables.\n•\tConducted data analytics on test outcomes, providing insights and reports that drove improvements in software quality and development processes.\n•\tIntegrated **Allure** for generating insightful test reports, improving visibility into testing progress and outcomes for stakeholders.\n•\tIncorporated Generative AI (GenAI) techniques into testing practices to enhance efficiency and effectiveness in test case generation and validation.\n•\tParticipated in Agile ceremonies, contributing to sprint planning and retrospective discussions, fostering continuous improvement within the team.\n•\tExecuted end-to-end (E2E) test scenarios to validate application functionality against business requirements, achieving a test pass rate of over **90%**.\n•\tProvided mentorship and training to junior team members on test automation best practices, fostering a culture of quality and excellence in the engineering team."
    },
    {
      "role": "Software Engineer",
      "company": "Tvn S.A.",
      "from_date": "Oct 2019",
      "to_date": "Sep 2022",
      "location": "Poland",
      "responsibilities": "Utilized **Python** and **pytest** to develop automated test suites, ensuring robust functionality and performance of financial applications.\nImplemented **Agile** methodologies to enhance team collaboration and improve project delivery timelines by **25%**.\nConducted performance testing using **Locust** to simulate user traffic, identifying bottlenecks and optimizing the system's throughput by **30%**.\nDeveloped comprehensive **Data Analytics** reports through various tools, facilitating better decision-making for financial operations and contributing to a **15%** increase in operational efficiency.\nIntegrated **Selenium** and **Playwright** for end-to-end testing, enhancing the reliability of financial transactions and user interfaces, which contributed to improved customer satisfaction.\nProduced visually appealing test reports using **Allure** to communicate results and facilitate discussions among stakeholders, improving transparency in testing processes.\nCollaborated effectively with cross-functional teams to align on testing requirements, enhancing communication and ensuring the successful implementation of new features in an iterative fashion.\nLeveraged **GenAI** techniques to enhance testing procedures and reduce manual intervention, decreasing testing time by **20%**."
    },
    {
      "role": "Software Engineer",
      "company": "Timspark",
      "from_date": "Sep 2015",
      "to_date": "Aug 2019",
      "location": "UK",
      "responsibilities": "Executed comprehensive **Performance Testing** strategies for web and mobile applications using **Locust** and **pytest**, ensuring robust application performance under varying load conditions for a global e-commerce platform.\nLeveraged **Selenium** and **Playwright** for automated testing of user interfaces, achieving a 95% test coverage rate and significantly reducing manual testing efforts by 70%.\nCollaborated in an **Agile** environment to consistently communicate test results and insights, enhancing cross-functional team awareness and driving improvements in application performance.\nConducted in-depth **Data Analytics** to identify performance bottlenecks, utilizing findings to inform development and optimization strategies.\nChampioned the incorporation of **GenAI** techniques to enhance testing workflows, leading to a 30% increase in efficiency for test creation and execution.\nDeveloped detailed test plans and driven execution of automated tests across key modules, achieving stability and reliability in critical workflows like checkout, cart, and order fulfillment.\nAuthored and maintained comprehensive reporting on testing metrics using **Allure**, providing stakeholders with actionable insights and buzzwords around software quality.\nUtilized effective **Communication** skills to advocate for best practices in software testing, ensuring all team members understood and applied performance testing principles to their development work."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, JavaScript/TypeScript\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n **Frontend Frameworks:**\n\tReact, Vue, Angular\n\n **API Technologies:**\n\tKeycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot\n\n **Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda), Azure (App Services)\n\n **Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:**\n\tAWS (RDS, S3)\n\n **Other:**\n\tSelenium, Playwright, pytest, Agile, Performance Testing, Locust, Allure, GenAI, Data Analytics, Communication, MLflow, Airflow, Kubeflow\n",
  "apply_company": "Global Management Consulting Firm"
}