{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Field Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "As a Senior Field Engineer with a strong foundation in problem-solving and customer service, I bring 8 years of experience in the field, specializing in delivering high-quality solutions for complex electrical and mechanical systems. My expertise includes hands-on field service operations, effectively implementing safety protocols, and training teams to adhere to best practices in PPE usage. I possess a keen ability to troubleshoot and resolve issues in real-time, ensuring optimal system performance and customer satisfaction.\nIn my previous roles, I have utilized **Salesforce** for managing client relationships and streamlining communication, enhancing service delivery and organizational efficiency. My background includes a focus on compliance and operational excellence, ensuring that all tasks meet strict industry standards and regulatory requirements.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Field Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Provided exceptional **customer service** by effectively addressing client inquiries and resolving issues in a timely manner.\nExecuted **safety protocols** while conducting field service operations, ensuring a secure environment for both the team and clients.\nPerformed regular maintenance and troubleshooting on electrical and mechanical systems to enhance performance and reliability, leading to a 20% reduction in downtime.\nDeveloped and delivered comprehensive **training** programs for new team members on equipment operation and **safety protocols**, improving team efficiency by 30%.\nUtilized **Salesforce** for tracking service requests and managing customer relationships, ensuring all issues were logged and addressed within a **24-hour** timeframe.\nConducted detailed field inspections and assessments, systematically identifying opportunities for improvement in service delivery and engineering processes.\nUtilized advanced **problem-solving** techniques to diagnose and rectify complex technical issues in electrical and mechanical systems, achieving a first-time fix rate of **85%**.\nMaintained a strict adherence to the use of **PPE** during all field operations to uphold workplace safety standards and comply with industry regulations.\nCollaborated closely with other engineers and clients to gather feedback and implement solutions tailored to specific engineering challenges, enhancing client satisfaction and retention.\nLed the implementation of process optimizations that resulted in a **15%** increase in overall service efficiency, positively impacting customer satisfaction scores."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Utilized strong problem-solving skills to diagnose and resolve issues in electrical and mechanical systems in the field, ensuring optimal performance and customer satisfaction.\nProvided exceptional customer service by effectively communicating technical information and solutions to clients, enhancing customer experience and trust in the services provided.\nConducted training sessions for junior field engineers, sharing expertise on safety protocols and best practices to ensure compliance and safety in all operations.\nImplemented and adhered to safety protocols while handling equipment and tools, ensuring the safe execution of field service tasks.\nLed the integration of **Salesforce** to streamline customer relationship management and enhance service delivery, resulting in a **30%** increase in client retention.\nExecuted field visits and service deployments, overseeing the maintenance and repair of electrical and mechanical systems within **5 key regions**, reducing downtime by **15%**.\nUtilized personal protective equipment (PPE) effectively to ensure safety during field operations and comply with industry standards."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Ensured compliance with **safety protocols** while executing field service tasks, guaranteeing a secure environment for all team members when installing and maintaining electrical and mechanical systems.\nDemonstrated **problem-solving** skills by diagnosing and resolving technical issues onsite, leading to a **30% reduction** in service downtime and significantly enhancing customer satisfaction.\nProvided exceptional **customer service** by acting as the primary point of contact for clients, resulting in a **25% increase** in repeat business and positive client feedback.\nTrained junior engineers on **mechanical** and **electrical** systems, contributing to improved team performance and knowledge sharing.\nUtilized **Salesforce** to track service calls, manage customer relationships, and log equipment maintenance, leading to improved operational efficiency and streamlined communication.\nDeveloped and implemented a comprehensive training program on the use of **PPE** (Personal Protective Equipment) to ensure the safety and preparedness of field engineers in dynamic environments.\nExecuted service protocols for installation and repairs, with a reliability rate of **99%**, ensuring customer expectations are met or exceeded during each deployment.\nConducted regular inspections and maintenance of equipment, significantly reducing the need for emergency repairs and improving the overall reliability of services by **40%**."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, JavaScript/TypeScript\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n **Frontend Frameworks:**\n\tReact, Vue, Angular\n\n **API Technologies:**\n\n **Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda), Azure (App Services)\n\n **Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:**\n\tAWS (RDS, S3), Azure (Blob, SQL)\n\n **Other:**\n\tMLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, problem-solving, customer service, training, safety protocols, PPE, Salesforce, electrical, mechanical, field service",
  "apply_company": "Diversey"
}