{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Developer Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Senior Developer Engineer with a strong focus on object-oriented development and expertise in **C#**, **Java**, and relational database management. Proven ability to implement ERP solutions and leverage **ServiceNow** for process optimization. Demonstrates exceptional analytical skills and customer orientation, ensuring alignment of technology solutions with user needs. Recognized for excellent documentation and communication abilities, fostering effective team collaboration and contributing to a flexible, problem-solving environment. With 13+ years of experience in building high-performance applications within the healthcare and financial sectors, I bring a unique blend of technical proficiency and original strengths including hands-on expertise in **JavaScript/TypeScript**, **Python**, and **Flutter**. Proficient in both frontend and backend development leveraging frameworks such as **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**. Experienced in developing AI/ML-powered platforms for predictive analytics and real-time processing, as well as deploying cloud-native solutions on **AWS** and **Azure** while implementing microservices and CI/CD pipelines.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Developer Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Utilized **C#** and **Java** to develop and maintain ERP solutions, ensuring seamless functionality and user satisfaction in high-demand environments.\nEmployed object-oriented development principles to create scalable and maintainable codebases, contributing to improved software performance and team efficiency.\nDocumented all development processes comprehensively, providing clear guidelines for maintenance and future development, thereby enhancing team collaboration and knowledge sharing.\nDemonstrated strong analytical skills by troubleshooting and debugging complex issues, utilizing relational databases to optimize data access and manipulation.\nCultivated exceptional customer orientation through regular communication and feedback loops, ensuring alignment with client requirements and high-quality deliverables.\nCollaborated effectively with cross-functional teams to ensure flexibility in development processes and to accommodate shifting project scopes and timelines, driving project success.\nImplemented robust problem-solving strategies to navigate technical challenges, contributing to efficient project execution and timely delivery of solutions."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Utilized strong analytical skills to modernize core financial platforms by migrating to microservices architecture using **Node.js (NestJS/Express)** and **Python (FastAPI, Django)**, enhancing scalability and performance for high-volume transactional systems.\nEmployed object-oriented development principles to build interactive front-end applications with **React (18)**, **Vue 3**, **Next.js**, and **TypeScript**, utilizing **Redux Toolkit** and **Tailwind CSS** to create sleek, responsive interfaces for financial tools and admin panels.\nDemonstrated exceptional communication by delivering real-time analytics dashboards with **React**, **D3.js**, and **Power BI Embedded**, providing operations teams with instant insights into transactions and anomalies.\nDesigned and deployed a robust event-driven architecture using **Kafka**, **RabbitMQ**, and **Azure Service Bus**, ensuring asynchronous communication across critical workflows such as payments, alerts, and compliance for over **50,000** daily transactions.\nDeveloped ETL pipelines for ingesting financial data from internal and third-party sources using **Python**, **Apache Airflow**, and **Azure Data Factory**, supporting both batch and real-time processing, effectively handling data from **10+** sources.\nBuilt and deployed machine learning models for fraud detection using **scikit-learn**, **XGBoost**, and **Azure ML**, enabling proactive detection of suspicious activity based on user behavior and transaction patterns, achieving **90%** accuracy in predictions.\nCreated ML pipelines for real-time credit scoring, churn prediction, and transaction classification, leveraging **MLflow** and **Airflow** to integrate model inference into backend services, supporting up to **1,000** concurrent requests."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "- Developed and maintained ERP solutions using **C#** and **Java**, ensuring seamless integration with existing systems and efficient data flow.\n- Collaborated with cross-functional teams to communicate project updates and strategies, demonstrating strong **communication** and **team collaboration** skills.\n- Utilized relational databases to design, optimize, and manage data structures, contributing to improved performance and reliability in application services.\n- Created and maintained comprehensive documentation for system architecture and user guidelines to enhance **customer orientation** and empower end-users.\n- Exemplified **problem-solving** capabilities by addressing complex development challenges and providing effective solutions in a timely manner.\n- Demonstrated **flexibility** in adapting to changing project requirements while maintaining high coding standards and software quality.\n- Engaged in **object-oriented development** practices, fostering code reusability and maintainability for long-term project success.\n- Leveraged analytical skills to evaluate system performance metrics, leading to a **20%** improvement in application response times across critical modules.\n- Actively participated in team brainstorming sessions, utilizing collaborative techniques to enhance project outcomes and innovate on service delivery.\n"
    }
  ],
  "skills": " **Programming Languages:** \n\tC#, Java, ABL, Python, JavaScript, TypeScript \n\n **Backend Frameworks:** \n\tFastAPI, Flask, Django \n\n **Frontend Frameworks:** \n\tReact, Vue, Angular \n\n **API Technologies:** \n\tOAuth2, JWT \n\n **Serverless and Cloud Functions:** \n\tAWS: Lambda, ECS; Azure: App Services \n\n **Databases:** \n\tPostgreSQL, MySQL, MongoDB, Redis \n\n **DevOps:** \n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD \n\n **Cloud & Infrastructure:** \n\tAWS: RDS, S3; Azure: Blob Storage, SQL Database; Terraform, Ansible, Helm, Docker Compose \n\n **Other:** \n\tERP, relational database, object-oriented development, ServiceNow, documentation, communication, analytical skills, customer orientation, team collaboration, flexibility, problem-solving, MLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), Nginx, Let’s Encrypt, Certbot",
  "apply_company": "Proalpha"
}