{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Support Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Senior Support Engineer with 13+ years of experience in delivering high-performance SaaS applications across healthcare and financial sectors. Expert in API integration and data formats like XML and JSON, with a strong command of **C#**, **Python**, **PHP**, **JavaScript**, and **jQuery**. Proficient in web technologies including **HTML**, **CSS**, and HTTP protocols.\nSkilled in troubleshooting and debugging tools such as **Wireshark**, **Fiddler**, and **Charles Proxy**, ensuring seamless application performance and compliance with industry standards. Hands-on experience in cloud-native deployments on **AWS** and **Azure**, implementing microservices, event-driven architectures, and CI/CD pipelines.\nDemonstrated capability in developing AI/ML platforms and utilizing **Salesforce**, **SQL**, and **SharePoint** for enhanced reporting and analytics. Committed to compliance-driven development, aligning solutions with HIPAA, FHIR, PCI DSS, and SOC 2 standards. Strong background in MLOps, encompassing model training, serving, and orchestration using MLflow, Airflow, and Kubeflow.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Support Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Provided expert support for SaaS applications, ensuring API reliability and performance across multiple environments.\nUtilized **Python** and **JavaScript** to troubleshoot and resolve complex issues related to application performance and functionality.\nLeveraged **SQL** for database queries to analyze, diagnose, and resolve data-related problems in real-time, improving overall system performance by **30%**.\nEmployed tools like **Fiddler**, **Wireshark**, and **Dynatrace** to conduct in-depth traffic analysis, enhancing response times by **20%** and identifying bottlenecks in application workflows.\nDeveloped and maintained robust testing procedures, focusing on automation using **Postman** and custom scripts to cover user interface, integration, and end-to-end tests, achieving a **95%** test coverage.\nCollaborated with development teams to integrate and deploy updates seamlessly, utilizing **C#** and **PHP** where necessary to support cross-functional requirements.\nProvided training and documentation to enhance understanding of the API functionality, usage of **XML**, **JSON**, and **HTTP** protocols, reducing support requests by **15%**.\nHandled configuration and troubleshooting of **IIS** environments, ensuring optimal performance and security compliance.\nImplemented identity management solutions using **SAML** and **oAuth** for secure access to applications, ensuring compliance with company policies and security standards.\nMonitored and analyzed system performance metrics, generating reports and recommendations for capacity planning and resource allocation, aligning with scaling requirements for future growth."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Ensured the seamless integration of **API** services for financial platforms by leveraging **Python** and **JavaScript**, resolving **90%** of API-related issues within the first 24 hours.\nMaintained **SaaS** applications by implementing **C#** and **PHP** for backend services, achieving a **30%** reduction in operational downtime.\nManaged data workflows using **SQL** and **XML**, optimizing data retrieval processes that led to a significant improvement in transaction processing times by **15%**.\nUtilized tools like **Dynatrace** and **Wireshark** for monitoring application performance, proactively identifying and addressing bottlenecks, resulting in enhanced user experiences.\nConducted comprehensive troubleshooting for client environments using **HTTP**, **JSON**, and **IIS**, achieving a **98%** resolution rate for client-reported issues.\nImplemented security protocols utilizing **SAML** and **oAuth** to ensure secure user authentication across applications, thus maintaining compliance with industry standards.\nSupported integrations with platforms like **Salesforce** and **SharePoint**, ensuring successful data synchronization and improving cross-functional collaboration by **25%**.\nPerformed root cause analysis on software bugs reported by users, developing patches for issues discovered in code written in **JavaScript**, leading to a reduction of recurring issues by **40%**.\nFacilitated training sessions for users on software functionalities, enhancing their understanding and efficiency with a **90%** satisfaction rating post-training."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Provided top-tier support for SaaS applications, ensuring seamless user experiences by troubleshooting issues and optimizing API performance with tools like **Postman** and **Fiddler**.\nCollaborated with development teams to manage integrations using **RESTful APIs** and **JSON** for effective data interchange and enhanced system interoperability.\nUtilized **C#** and **Python** for developing and maintaining support scripts to automate repetitive tasks, reducing incident resolution time by **30%**.\nLeveraged **SQL** for querying databases to retrieve critical user information, resulting in improved response times for problem-solving by **25%**.\nConducted thorough analysis and monitoring of HTTP traffic using **Wireshark** and **Charles Proxy**, identifying bottlenecks and enhancing performance across various platforms.\nImplemented security protocols such as **SAML** and **OAuth 2.0** for secure authentication processes, ensuring strict adherence to GDPR compliance for user data protection.\nDeveloped detailed documentation and user guides in collaboration with the knowledge management team, improving onboarding processes and reducing new user issues by **15%** within the first month.\nUtilized **Salesforce** for incident tracking and customer relationship management, maintaining high satisfaction rates through prompt issue resolution and feedback incorporation.\nManaged complex troubleshooting scenarios involving **jQuery**, **HTML**, and **CSS**, ensuring front-end interfaces remain user-friendly and responsive, enhancing overall customer satisfaction.\nEmployed **Windows PowerShell** scripting for automation tasks, effectively streamlining operational workflows and improving support team efficiency."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, C#, PHP, JavaScript\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n **Frontend Frameworks:**\n\tReact, Vue, Angular, jQuery, HTML, CSS\n\n **API Technologies:**\n\tAPI, HTTP, JSON, XML, oAuth, SAML\n\n **Serverless and Cloud Functions:**\n\tAWS: Lambda, ECS; Azure: App Services\n\n **Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis, SQL, SOQL\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:**\n\tAWS: RDS, S3; Azure: Blob Storage, SQL Database\n\n **Other:**\n\tSaaS, SharePoint, Windows PowerShell, Wireshark, Fiddler, Charles Proxy, Dynatrace",
  "apply_company": "Docusign"
}