{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Platform Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Senior Platform Engineer with 13+ years of experience in building high-performance applications, specializing in **blockchain** technologies and proficient in Rust, Go, C++, and Solidity. Skilled in developing smart contracts and utilizing **EVM** frameworks, leveraging Foundry and Yul to create robust solutions.\nExperienced in implementing CI/CD pipelines and managing observability to enhance system performance. Strong understanding of algorithms and data structures, coupled with expertise in cryptographic primitives and Merkle trees.\nAdditionally, adept at deploying cloud-native systems on **AWS** and **Azure**, developing microservices, and employing event-driven architectures. Skilled in JavaScript/TypeScript, Python, and Flutter, with hands-on experience in both frontend and backend development using **React**, **Node.js**, **FastAPI**, and **Django**. A proven track record of building AI/ML-powered platforms that incorporate predictive analytics and real-time processing while adhering to compliance standards like HIPAA and PCI DSS.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Platform Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Designed and built secure and scalable full-stack platforms leveraging **blockchain** technologies and smart contracts, applying **Solidity** and **Rust** for robust dApp development.\nImplemented cutting-edge algorithms and data structures in **Go** and **C++** to enhance system performance and functionality.\nDeveloped and maintained CI/CD pipelines using **Foundry** for smart contract development, ensuring optimized release pipelines and environment orchestration.\nLed the deployment and management of decentralized applications with an emphasis on observability, utilizing tools such as **Merkle trees** for data integrity and cryptographic primitives for security.\nCollaborated with cross-functional teams to integrate real-time observability practices into software delivery workflows, enhancing system reliability with metrics, logging, and tracing.\nExecuted advanced testing strategies for smart contracts with a focus on system performance and security, validating business logic and user interactions.\nCreated modular and reusable smart contracts and dApps using **Yul** for optimized bytecode generation, achieving a **30%** reduction in transaction costs.\nAdopted an iterative development approach to improve scalability, reducing response time and enhancing user experience in applications by **40%**.\nContributed to the design of rich user interfaces that interact seamlessly with the blockchain backend, implementing best practices in UI/UX design with a focus on real-time data visualization.\nMentored junior engineers in blockchain technology and smart contract development, fostering a culture of continuous learning and innovation."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "- Designed and implemented **CI/CD** pipelines to facilitate seamless deployment of applications, ensuring high-quality releases and improved observability throughout the development lifecycle.\n- Developed secure and efficient smart contracts using **Solidity** and insights from **Rust**, ensuring system performance and adherence to industry-standard cryptographic primitives.\n- Leveraged **Go** and **C++** to enhance backend services, focusing on high scalability and optimal data structures for financial transactions.\n- Established a blockchain architecture incorporating **EVM** for transaction validation, fostering trust and transparency in financial operations.\n- Utilized **Foundry** and **Yul** for advanced blockchain development, optimizing performance and functionality of decentralized applications.\n- Conducted rigorous analysis of algorithms to ensure effective data processing and enhance system performance, achieving a **20%** faster transaction throughput.\n- Implemented observability solutions to monitor system health and performance metrics, leading to a **15%** reduction in downtime across various services.\n- Trained and mentored junior engineers on blockchain technologies and system design principles, contributing to team growth and increased productivity.\n- Collaborated cross-functionally to optimize release pipelines, resulting in a **30%** improvement in deployment speed and reliability across teams."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Engineered robust blockchain solutions utilizing **Solidity** and **Rust** to develop and deploy **smart contracts** on the **Ethereum Virtual Machine (EVM)**, ensuring high performance and system security.\nDesigned and implemented CI/CD pipelines and **release pipelines** using **Foundry** for automated testing, deployment, and observability of smart contracts across multiple environments.\nLeveraged **Go** and **C++** for developing system-level functions and optimizing algorithms, enhancing overall system performance and resource management.\nApplied advanced data structures and algorithms principles to create efficient and scalable solutions, focusing on **Merkle trees** for data integrity in distributed systems.\nUtilized **Scala** for data processing tasks, ensuring high throughput and an efficient means to handle large datasets relevant to transaction processing.\nDeveloped environment orchestration strategies for managing blockchain application deployments, enabling seamless scaling and integration with existing infrastructures.\nImplemented security measures using cryptographic primitives to safeguard operations, ensuring compliance with regulatory standards such as GDPR.\nCollaborated in designing observability frameworks to provide insight into system performance and fault detection, ensuring high availability and resilience of the platform.\nConducted performance tuning exercises on deployed contracts, achieving improved throughput and reduced latency in transaction processing by up to **20%**.\nMentored junior engineers on core blockchain concepts and best practices, enhancing team capabilities in building and deploying innovative decentralized applications."
    }
  ],
  "skills": "Programming Languages:\n\tRust, Go, C++, Scala, Python, JavaScript/TypeScript\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tKeycloak (OIDC, RBAC), OAuth2, JWT\n\n**Serverless and Cloud Functions:**\n\tAWS: Lambda, ECS, S3; Azure: App Services\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS: RDS, Azure: Blob Storage, SQL Database, environment orchestration\n\n**Other:**\n\tblockchain, EVM, smart contract, Foundry, Yul, Solidity, algorithms, data structures, system performance, cryptographic primitives, Merkle trees, MLflow, Airflow, Kubeflow, observability, release pipelines",
  "apply_company": "Matter Labs"
}