{
  "name": "Patryk Zaslawski",
  "role_name": "Senior Software Engineer",
  "email": "patrykzas0428@outlook.com",
  "phone": "+48669862402",
  "address": "Gdanski, Poland",
  "linkedin": "https://www.linkedin.com/in/patryk-zaslawski-6b04a8397/",
  "profile_summary": "As a Senior Software Engineer with 8+ years in software engineering, I bring a strong proficiency in **Java** and design scalable, high-performance systems utilizing **RESTful APIs**, **message-driven APIs**, and **GraphQL**. My background includes building and optimizing applications with **relational databases** and **NoSQL databases**, ensuring efficient data handling through performance tuning. I am skilled in **TypeScript** and **JavaScript**, along with frameworks like **MVC** for creating robust applications. Committed to applying **Test-Driven Development (TDD)** and maintaining high coding standards for clean and efficient code, I also leverage **continuous delivery** methodologies to enhance project delivery. My strengths in collaboration, communication, and problem-solving help me successfully contribute to teams employing **scrum** practices. Additionally, I have experience with a diverse tech stack, including **Python (FastAPI, Django, Flask, SQLAlchemy)**, **Angular**, **Vue**, **React**, **Next.js**, **AWS**, **Azure**, **PostgreSQL**, **MySQL**, and **MongoDB**, ensuring a comprehensive approach to developing enterprise-grade solutions tailored to business needs.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2014",
      "to_year": "2017",
      "location": "United Kingdom",
      "university": "The University of Manchester"
    }
  ],
  "experience": [
    {
      "role": "Senior Software Engineer",
      "company": "Binary Studio",
      "from_date": "Aug 2023",
      "to_date": "Present",
      "location": "United Kingdom (Remote)",
      "responsibilities": "Developed and maintained robust **RESTful APIs** and **message-driven APIs** using **Java** to ensure seamless data exchange and integration across systems.\nImplemented comprehensive **unit testing** strategies with frameworks to guarantee code quality and adherence to **coding standards** and **clean code** principles.\nDesigned and optimized performance for applications using **relational** and **NoSQL databases**, ensuring efficient data storage and retrieval, achieving up to **30% performance improvement**.\nUtilized **TypeScript** and **JavaScript** in frontend development, creating responsive applications with enhanced user experience and effective data handling.\nChampioned and adhered to **continuous delivery** practices within an Agile **scrum** framework, reducing deployment times by **25%** and increasing team collaboration.\nFostered a culture of **problem-solving** and effective **communication** in team settings, mentoring junior developers and providing support in overcoming technical challenges.\nConducted thorough performance tuning across applications, leading to a significant reduction in latency and improved application responsiveness by **40%**.\nLed architectural discussions around design patterns, focusing on **MVC** and **ORM** approaches for scalable software development.\nIntegrated with third-party tools and services to enhance application capabilities, ensuring robust solutions tailored to business needs.\nPromoted best practices for development using **Java** and applied tools to streamline workflows within the team, ensuring consistent delivery of high-quality software.\nCollaborated with cross-functional teams to align project goals, improve workflows, and enhance overall product quality through effective collaboration techniques."
    },
    {
      "role": "Software Engineer",
      "company": "Ardigen",
      "from_date": "Mar 2020",
      "to_date": "Aug 2023",
      "location": "Poland",
      "responsibilities": "• Developed and maintained **Java**-based applications, ensuring adherence to MVC architecture and coding standards to enhance code maintainability and readability.\n• Designed and implemented **RESTful APIs** and **message-driven APIs** for seamless integration between applications, improving system interoperability and user experience.\n• Utilized **TypeScript** and **JavaScript** to create dynamic frontends, enhancing user engagement through responsive designs using frameworks such as Angular and React.\n• Integrated **GraphQL** for efficient data fetching, optimizing application performance, and enhancing user interactions.\n• Followed **TDD** practices with automated unit testing to ensure code reliability and optimized performance, incorporating best practices into the development cycle.\n• Contributed to **continuous delivery** processes, utilizing tools like Azure DevOps and GitHub Actions for effective CI/CD pipelines, streamlining deployment processes across **10+** microservices.\n• Utilized **ORM** techniques to facilitate data interactions with relational databases enhancing data query efficiency by **30%**.\n• Integrated both **relational** (SQL Server, PostgreSQL) and **NoSQL databases** (MongoDB, DynamoDB), ensuring data integrity and high availability for transactional systems.\n• Collaborated in an Agile **scrum** environment, actively participating in daily stand-ups, sprint planning, and retrospectives to ensure project alignment with business goals.\n• Engaged in performance tuning initiatives which improved application response times by **25%**, enhancing user satisfaction.\n• Employed clean code principles alongside regular code reviews to cultivate a culture of continuous improvement within the development team.\n• Demonstrated strong problem-solving skills through troubleshooting complex issues that arise in production environments, ensuring minimal downtime.\n• Maintained effective communication and collaboration within cross-functional teams, delivering successful projects on time and within budget."
    },
    {
      "role": "Software Engineer",
      "company": "Altum Software",
      "from_date": "Oct 2017",
      "to_date": "Feb 2020",
      "location": "United Kingdom",
      "responsibilities": "- Developed and optimized **RESTful APIs** in **Java** ensuring high throughput and performance, facilitating seamless real-time interactions across frontend and backend systems.\n- Advanced performance tuning techniques for **relational databases** (PostgreSQL, SQL Server, MySQL), improving query performance by **30%** and reducing latency for users during peak hours.\n- Implemented **message-driven APIs** using **RabbitMQ** and **Kafka**, enhancing system responsiveness for order processing and inventory management.\n- Leveraged cutting-edge JavaScript and **TypeScript** frameworks such as **React**, **Next.js**, and **Angular** to build dynamic, responsive frontends that improved user engagement by **25%**.\n- Championed **continuous delivery** practices by automating build, test, and deployment processes with **GitHub Actions** and **Azure DevOps**, reducing release cycles by **40%**.\n- Conducted comprehensive **unit testing** and test-driven development (TDD) using **JUnit** to ensure code quality, achieving a **95%** code coverage rate.\n- Collaborated in a **scrum** environment, driving communication and teamwork among cross-functional teams to deliver high-quality software within tight deadlines.\n- Implemented clean coding standards, focusing on maintainability and readability which enhanced collaboration efforts among development teams.\n- Optimized backend performance for e-commerce workflows (cart, checkout, payments), ensuring minimal latency and achieving up to **99.9%** uptime during peak sales events.\n- Designed robust architecture to support **NoSQL databases** like **MongoDB** and **Redis** providing high availability and efficient handling of unstructured data.\n- Created and managed real-time features within applications, enhancing customer interaction and support through chat functionalities.\n- Ensured security through best practices, incorporating **OAuth 2.0** and role-based access control (RBAC) to protect sensitive customer data.\n- Performed systematic load and stress testing using **Apache JMeter** and **k6**, validating system stability under simulated user traffic, identifying critical bottlenecks, and implementing necessary fixes."
    }
  ],
  "skills": "Programming Languages:\n\tJava, Python, JavaScript, TypeScript\n\n**Backend Frameworks:**\n\tFastAPI, Django, Flask, Spring Boot\n\n**Frontend Frameworks:**\n\tAngular (1–16), React (15–18), Next.js, Vue.js (2/3), Blazor\n\n**API Technologies:**\n\tREST & gRPC APIs, RESTful APIs, message-driven APIs, GraphQL\n\n**Serverless and Cloud Functions:**\n\tAWS (Lambda), Azure (App Services)\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis, SQLAlchemy, ORM, relational databases, NoSQL databases\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, continuous delivery\n\n**Cloud & Infrastructure:**\n\tAWS (ECS, RDS, S3), Azure (Blob, SQL)\n\n**Other:**\n\tPydantic, Celery, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, TDD, MVC, performance tuning, unit testing, coding standards, clean code, problem-solving, communication, collaboration, scrum"
}