{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Software Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Senior Software Engineer with 13+ years of experience specializing in **Golang**, **Node.js**, and **Redis** development within high-performance applications, particularly in the healthcare and financial sectors. Expert in implementing **microservices** architectures and **ETL** processes, ensuring efficient data processing and performance tuning. Proficient in deploying and managing monitoring solutions using **Prometheus** and **Grafana**, and skilled in CI/CD practices with **GitHub Actions**.\nDemonstrated leadership abilities in guiding teams and driving project success, while maintaining compliance with industry standards such as HIPAA and PCI DSS. Adept in leveraging **ClickHouse** for optimized data handling and building AI/ML-powered platforms with **FastAPI** and **Django** for real-time analytics and automation. Strong technical background in both frontend and backend development using **React**, **Next.js**, **Vue**, **Python**, and **Flutter**, with a solid foundation in cloud services, particularly **AWS** and **Azure**.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Software Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Implemented high-performance microservices using **Golang**, ensuring efficient data processing and improved system reliability across the healthcare and fintech domains.\nDesigned, developed, and maintained server-side applications using **Node.js**, enabling seamless integration with front-end systems and supporting real-time data processing.\nOptimized caching mechanisms with **Redis** to enhance application performance, achieving a reduction in average response time by **25%**.\nUtilized **ClickHouse** for analytical queries, enabling rapid data retrieval and insights from large datasets, contributing to a **30%** increase in operational efficiency.\nConfigured and managed applications on **Ubuntu** environments, ensuring security, stability, and performance tuning for enterprise-level applications.\nLed the transition of legacy applications to microservices architecture, improving scalability and reliability in deployment processes.\nDeveloped and deployed ETL pipelines for data extraction, transformation, and loading processes to streamline data processing workflows and improve data accessibility.\nConducted real-time monitoring and alerting of system performance using **Prometheus** and **Grafana**, significantly enhancing system observability and response times.\nIntegrated **GitHub Actions** for CI/CD pipelines, automating testing and deployment processes to improve development cycle efficiency by **40%**.\nWorked collaboratively with cross-functional teams, fostering a culture of innovation and driving team projects to successful completion with an emphasis on leadership and guidance.\nManaged and configured **Nginx** servers for load balancing and reverse proxying to optimize application delivery and enhance end-user experiences.\nEmployed effective performance tuning strategies to maximize application throughput and maintain high availability under various load conditions.\nEngaged directly with clients and stakeholders to gather requirements, translate them into technical specifications, and deliver robust solutions tailored to their needs."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Optimized high-performance applications by leveraging **Golang** and **Node.js** to build scalable microservices, resulting in a **30%** improvement in transaction processing time.\nLed the migration to cloud-native solutions using **Redis** and **ClickHouse**, enhancing data retrieval speeds and enabling support for **10 million+** daily transactions.\nImplemented continuous integration and deployment (CI/CD) pipelines with **GitHub Actions**, ensuring efficient and automated deployment processes while reducing deployment time by **40%**.\nDeployed monitoring tools such as **Prometheus** and **Grafana** to provide real-time performance analytics and alerts, improving system reliability and uptime to **99.9%**.\nSpearheaded team leadership initiatives, fostering collaboration and innovation, which resulted in a **25%** increase in project delivery efficiency.\nDesigned and developed ETL processes utilizing **Node.js** for robust data processing from various internal and external sources, handling batch and real-time data flows effectively.\nConducted performance tuning across applications, achieving maximum optimization and supporting continuous scaling as user demand increased.\nUtilized **Nginx** as a reverse proxy to enhance security and load balancing across services, ensuring smooth communication in high-traffic environments.\nSupported the adoption of **Ubuntu** environments to streamline development and deployment workflows, facilitating easier collaboration among cross-functional teams."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Utilized **Golang** and **Node.js** for building robust microservices architecture, ensuring efficient data processing and scalability, enhancing performance by up to **30%**.\nImplemented performance tuning strategies, leveraging **Redis** for caching and optimizing application speed, resulting in reduced load times by **40%**.\nDesigned and maintained ETL pipelines for data integration and transformation, utilizing tools like **ClickHouse** for real-time analytics, managing datasets exceeding **1 million** records.\nLed a team of developers in implementing key application features and enhancements, fostering a collaborative environment that increased project delivery speed by **25%**.\nMonitored application health and performance using **Prometheus** and **Grafana**, establishing alerting mechanisms that improved issue response times by **50%**.\nConducted code reviews and managed deployment processes via **GitHub Actions**, streamlining CI/CD workflows and improving deployment frequency by **15%**.\nConfiguring **Nginx** for high traffic routing, ensuring zero downtime during updates and maintaining a high availability architecture.\nEngaged in root cause analysis and troubleshooting, utilizing metrics to drive systematic improvements in system performance.\nCollaborated on data processing strategies to enhance ad targeting and campaign optimization in the **AdTech** domain, driving effective marketing outcomes.\nExecuted team leadership initiatives, mentoring junior developers on best coding practices and project methodologies."
    }
  ],
  "skills": "**Programming Languages:**\n\tGolang, Python, JavaScript, TypeScript\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django, Node.js\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tKeycloak (OIDC, RBAC), OAuth2, JWT\n\n**Serverless and Cloud Functions:**\n\tAWS: Lambda, ECS, S3\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis, ClickHouse\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD\n\n**Cloud & Infrastructure:**\n\tAWS: RDS, Azure: App Services, Blob Storage, SQL Database, Terraform, Ansible, Helm, Docker Compose\n\n**Other:**\n\tMicroservices, MLflow, Airflow, Kubeflow, Prometheus, Grafana, Performance tuning, Team leadership, ETL, AdTech, Data processing",
  "apply_company": "Luna Media"
}