{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Field Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Results-driven Senior Field Engineer with a robust skill set in troubleshooting and root cause analysis, ensuring effective maintenance and repair of mechanical systems. Experienced in adhering to HSE standards and delivering exceptional customer service through clear technical reporting and communication. Proven ability to automate engineering processes and enhance systems reliability by leveraging a deep understanding of network configurations and engineering automation strategies. \n\nAdditionally, I bring 13+ years of experience as a Full Stack Developer with expertise in **JavaScript/TypeScript**, **Python**, and **Flutter** across healthcare and financial sectors. Proficient in both frontend and backend development using **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**. Skilled in building AI/ML-powered platforms for predictive analytics and real-time processing, deploying cloud-native systems on **AWS** and **Azure**, and implementing microservices and CI/CD pipelines. Strong background in aligning solutions with compliance standards, including HIPAA and PCI DSS, while proficient in MLOps practices utilizing **MLflow**, **Airflow**, and **Kubeflow**.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Field Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Conducted thorough troubleshooting and root cause analysis on mechanical systems to ensure optimal performance and reliability.\nMaintained and repaired intricate equipment, adhering strictly to HSE standards and protocols to guarantee safety.\nLeveraged strong communication skills to provide exceptional customer service, addressing client concerns and resolving issues promptly, boosting customer satisfaction by **30%**.\nDeveloped and maintained detailed technical reports and documentation, enhancing transparency and information sharing across teams.\nExecuted routine maintenance checks and repairs, resulting in a **20%** reduction in downtime for key machinery through proactive interventions.\nCollaborated effectively with cross-functional teams, ensuring alignment and understanding of technical specifications and project expectations, enhancing team efficiency by **15%**.\nUtilized Microsoft Office Suite for creating comprehensive project presentations and reports, ensuring clarity and accessibility of information.\nImplemented results-driven strategies to improve mechanical systems' performance under varying load conditions, directly contributing to increased output and efficiency.\nPromoted cultural awareness within team initiatives, fostering an inclusive environment that values diverse perspectives and approaches, strengthening team cohesion.\nMaintained meticulous attention to detail in diagnostics and repairs, which led to a **25%** decrease in repeat service calls within the first quarter of implementation.\nEngaged in engine automation processes, enhancing system performance and reliability while reducing manual intervention requirements."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Provided expert **maintenance** and **troubleshooting** for complex mechanical systems, ensuring optimal performance by applying **root cause analysis** techniques to identify and eliminate issues.\nExecuted routine **repair** tasks while adhering to **HSE standards**, enhancing workplace safety and compliance in all engineering operations.\nUtilized **Microsoft Office** for detailed **technical reporting**, documenting all aspects of your assignments with clarity and precision to support internal communication and customer service initiatives.\nDemonstrated strong **communication** and **customer service** skills by collaborating closely with cross-functional teams and clients, ensuring a results-driven approach to project goals and objectives.\nApplied **attention to detail** in all engineering tasks, enhancing the reliability of systems and machinery by closely monitoring performance metrics and implementing necessary adjustments.\nChampioned **engine automation** projects to improve operational efficiency, adopting innovative strategies for ongoing enhancements in field engineering tasks.\nCreated and maintained robust **networking** protocols to ensure seamless communication between various mechanical systems, supporting all related operations and maintenance activities.\nCultivated **cultural awareness** by adapting engineering solutions to diverse project environments, maximizing client satisfaction and project success."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Conducted root cause analysis and troubleshooting of mechanical systems, ensuring adherence to HSE standards and compliance with safety regulations.\nPerformed maintenance and repair activities on various engineering equipment, demonstrating strong attention to detail and results-driven approach.\nEngineered automation solutions to enhance operational efficiency, applying technical skills to improve overall system performance.\nUtilized Microsoft Office for technical reporting and documentation, ensuring effective communication with stakeholders and clients.\nDelivered exemplary customer service by addressing client needs and providing actionable insights, fostering a positive relationship and cultural awareness.\nDeveloped and executed essential training sessions to improve team knowledge on maintenance best practices and system troubleshooting techniques.\nImplemented networking protocols to enhance system connectivity and reliability, promoting seamless communication across platforms.\nFacilitated cross-functional collaboration, bridging the gap between technical teams and client expectations to deliver tailored engineering solutions."
    }
  ],
  "skills": "**Programming Languages:**\n\tPython: FastAPI, Flask, Django\n\tJavaScript/TypeScript: React, Vue, Angular\n\n**Backend Frameworks:**\n\t\n\n**Frontend Frameworks:**\n\t\n\n**API Technologies:**\n\t\n\n**Serverless and Cloud Functions:**\n\tAWS: ECS, Lambda, RDS, S3\n\tAzure: App Services, Blob Storage, SQL Database\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare)\n\tMongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes\n\tGitHub Actions, GitLab CI/CD\n\t\n\n**Cloud & Infrastructure:**\n\tTerraform, Ansible, Helm, Docker Compose\n\n**Other:**\n\tmaintenance, repair, troubleshooting, root cause analysis, engine automation, mechanical systems, HSE standards, Microsoft Office, technical reporting, communication, customer service, attention to detail, networking, cultural awareness, results-driven",
  "apply_company": "Everllence"
}