{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Software Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-karol-kotlinski-bb2520397/",
  "profile_summary": "As a highly skilled Software Engineer with 8 years of experience, I excel in developing high-performance applications using **Python**, **AWS**, **Azure**, **CI/CD**, and **GitHub**. My proficiency in building scalable solutions is complemented by hands-on experience with cloud services, automation strategies, and data processing technologies such as **Airflow**, **dbt**, and **Spark**. With a strong background in SQL and a commitment to delivering robust code, I consistently tackle complex problems with effective solutions and clear communication.\nI specialize in full-stack development utilizing technologies like **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**, with experience leading enterprise-grade projects. My deep understanding of microservices architecture, event-driven systems, and compliance standards, including HIPAA and PCI DSS, enables me to develop secure applications. Additionally, I have implemented machine learning workflows, refining my expertise in automation and collaboration tools to enhance operational efficiency.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Software Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Developed scalable applications using **Python**, ensuring robust data processing and automation workflows.\n- Implemented **SQL** databases for high-performance data storage and querying, optimizing for large-scale analytics and reporting.\n- Designed and maintained **AWS** and **Azure** cloud solutions for secure and efficient deployment of applications.\n- Automated CI/CD pipelines leveraging **GitHub Actions** and **Airflow** for continuous integration and deployment across multiple environments.\n- Utilized **Automation** tools to enhance development workflows, increasing efficiency by **30%**.\n- Employed effective **Problem-solving** strategies to resolve complex application issues, resulting in a **15%** reduction in issue resolution time.\n- Communicated technical concepts and project status effectively with cross-functional teams, ensuring alignment on project goals and objectives.\n- Created and managed data pipelines with **dbt**, enhancing data reliability and availability for analytical needs.\n- Conducted performance tuning and optimization using **Spark**, improving data processing speeds by up to **40%**.\n- Developed and documented scripts in **VBA** for data manipulation and report generation, streamlining reporting processes.\n- Collaborated with stakeholders to ensure applications met business requirements and compliance standards.\n- Provided mentorship and guidance to junior developers, fostering a collaborative team environment."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Utilized **Python** and **SQL** to develop high-performance backend services, ensuring data integrity and efficient data access across financial platforms.\nEmployed **CI/CD** pipelines and **GitHub** for version control and continuous integration, streamlining development processes and reducing deployment times by **30%**.\nArchitected and managed cloud services on **Azure** for scalability, reliability, and performance optimization, enabling handling of over **1 million** transactions monthly.\nAutomated data workflows with **Apache Airflow** and **dbt**, facilitating real-time data processing and analytics, which improved reporting speed by **40%**.\nDeveloped and maintained complex ETL pipelines to ensure efficient data workflows, achieving reduced data latency through advanced automation techniques.\nExecuted innovative problem-solving strategies to enhance system functionalities and user experiences, consistently elevating user satisfaction rates.\nCommunicated effectively with cross-functional teams to gather requirements and deliver solutions in alignment with business goals, fostering a culture of collaboration.\nLeveraged **AWS** tools to enhance infrastructure robustness and deployment speed, ensuring high availability of critical services across the organization."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Utilized **Python** for backend service development within a global e-commerce platform, ensuring a secure and efficient architecture for critical features like checkout and order fulfillment.\nEngineered solutions that leveraged **SQL** for relational database management, enhancing data integrity and optimized queries for high-performance analytics workloads.\nImplemented automation strategies via **VBA** and CI/CD pipelines, streamlining development processes and reducing deployment times by approximately **40%**.\nCollaborated using **GitHub** for version control, ensuring seamless integration between development teams and maintaining robust documentation throughout the project lifecycle.\nApplied **AWS** services for cloud infrastructure to ensure scalability and reliability, including resource optimization that supported peak traffic loads of up to **2 million** users.\nExecuted data orchestration with **Airflow** and transformed data workflows using **dbt**, resulting in reduced data processing times by **30%** and improved accuracy of reporting.\nUtilized **Azure** for managing cloud-based solutions, effectively deploying applications with continuous integration and continuous deployment methodologies.\nContributed to backend performance monitoring and troubleshooting through problem-solving techniques, leading to a **25%** reduction in bug resolution times.\nEngaged in effective communication among cross-functional teams to align on project goals and share insights on potential improvements, fostering a collaborative work environment."
    }
  ],
  "skills": "**Programming Languages:**\n\tPython, VBA, SQL\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tJavaScript/TypeScript (React, Vue, Angular)\n\n**API Technologies:**\n\t\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS, Azure\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, dbt, Spark, Automation, Problem-solving, Communication, Authentication & Security: Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot"
}