{
  "name": "Tomasz Lee",
  "role_name": "Senior Nodejs Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Results-driven Senior Node.js Engineer with 9+ years of experience in designing, developing, and deploying applications using **Node.js**, **JavaScript**, and **Express**. Expertise in **microservices** architecture and building **API** solutions, with strong proficiency in **AWS** for cloud services. Skilled in asynchronous programming and **multithreading**, ensuring optimal performance and seamless user experiences. Proficient in using **MongoDB** and **Redis** for data management, alongside experience with messaging services like **RabbitMQ** and **SQS**. Committed to maintaining high **code quality** and implementing **CI/CD** pipelines for efficient development workflows. Backed by a strong foundation in **Git** and **Linux**, with a proven track record of successful collaboration across teams and delivering robust, scalable applications.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Senior Nodejs Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Leveraged **Node.js** and **JavaScript** to develop high-performance asynchronous applications, ensuring smooth user experience and reducing latency by 30%.\nDesigned and implemented a microservices architecture to enhance scalability and maintainability, resulting in a 25% increase in system reliability.\nUtilized **Express** framework for building RESTful APIs, seamlessly integrating with **MongoDB** and other databases to provide robust data access for various microservices.\nImplemented **AWS** services for deploying applications, achieving a 50% reduction in downtime and ensuring system resilience.\nIntegrated **Redis** for caching, improving data access speeds and reducing server load by 35%.\nAutomated CI/CD processes using tools such as **Git** and **Linux**, decreasing deployment frequency by 40% and enhancing code quality.\nIncorporated message queuing systems like **RabbitMQ** and **SQS** for asynchronous processing, which increased throughput by 20% and minimized latency.\nPerformed code reviews and established coding standards to ensure high-quality, maintainable code across the development team.\nLed the migration of legacy systems to a modern stack using **Node.js**, resulting in a 60% improvement in application performance.\nFacilitated cross-functional collaboration with UX/UI designers to optimize user interfaces, resulting in enhanced user satisfaction scores."
    },
    {
      "role": "Full Stack Developer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "Led the design and development of scalable microservices using **Node.js** and **Express**, resulting in a 20% increase in application speed.\nImplemented asynchronous event processing with **RabbitMQ** and **AWS SQS**, improving system responsiveness by 30%.\nUtilized **Redis** as a caching layer for data retrieval, leading to a 40% reduction in load times across APIs.\nDeveloped and maintained RESTful APIs for seamless integration with various frontend applications, ensuring efficient data exchange.\nEnhanced code quality and performance metrics through regular code reviews and implementation of best practices, leading to a 25% decrease in bug reports.\nManaged **MongoDB** and **MSSQL** databases, optimizing queries which resulted in a 50% improvement in data retrieval times.\nEstablished CI/CD pipelines with **Git** and **Linux** environments, reducing deployment times by 35% and increasing reliability.\nEmployed multithreading techniques in Node.js applications, boosting concurrency handling capabilities by 15%.\nCollaborated with cross-functional teams to gather requirements and deliver projects within designated timelines, maintaining a 95% on-time delivery rate.\nMentored junior developers in best practices for asynchronous programming and code optimization, enhancing overall team performance."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "Developed and maintained scalable microservices using **Node.js** and **Express**, enhancing system efficiency and performance.\nLeveraged **JavaScript** for full-stack development, leading to a 30% increase in application responsiveness.\nImplemented **RabbitMQ** for asynchronous messaging between services, optimizing the processing load and improving response time by 25% during peak hours.\nManaged cloud services on **AWS**, ensuring high availability and scalability for deployed applications across multiple regions.\nUtilized **Redis** for caching strategies, resulting in a 40% reduction in database query load and improved data retrieval times.\nDesigned and built RESTful APIs, enabling seamless integration with third-party services and improving user experience by 35%.\nUtilized **MongoDB** for flexible data storage, enhancing data accessibility and reducing retrieval times by **50%**.\nParticipated in CI/CD processes, utilizing **Git** for version control and **Linux** environments for deployment, significantly speeding up the release cycles.\nMaintained a focus on code quality through rigorous code reviews and adherence to best practices across the development team.\nImplemented **multithreading** techniques to improve application performance, resulting in a more responsive system under high load conditions.\n"
    }
  ],
  "skills": "Programming Languages:\n\tJavaScript, NodeJS, Python\n\n**Backend Frameworks:**\n\tExpressJS, NestJS, .NET, C#\n\n**Frontend Frameworks:**\n\tReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n**API Technologies:**\n\tRESTful API, GraphQL\n\n**Serverless and Cloud Functions:**\n\tAWS, Azure\n\n**Databases:**\n\tMongoDB, MSSQL Server, MySQL, PostgreSQL, DynamoDB, CosmosDB\n\n**DevOps:**\n\tCI/CD pipelines, Git, GitHub, Linux\n\n**Cloud & Infrastructure:**\n\tMicroservices, Redis, RabbitMQ, Apache Kafka, SQS\n\n**Other:**\n\tUX/UI Design, Testing Tools (NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest), Blockchain (Solidity, Ether.js, Web3.js, Ethereum), Asynchronous, Multithreading, Code Quality",
  "apply_company": "Commit"
}