{
  "name": "Patryk Zaslawski",
  "role_name": "Field Service Engineer",
  "email": "patrykzas0428@outlook.com",
  "phone": "+48669862402",
  "address": "Gdanski, Poland",
  "linkedin": "https://www.linkedin.com/in/patryk-zaslawski-6b04a8397/",
  "profile_summary": "As a Field Service Engineer, I bring strong technical expertise and experience in preventive maintenance and the efficient operation of welding and cutting equipment. With exceptional communication skills, I effectively interact with customers to understand their needs and deliver tailored solutions. My proficiency in managing digital platforms and providing remote services enhances customer satisfaction and operational efficiency. I leverage my technical feedback skills to ensure continuous improvement in service delivery. With a solid background in software engineering, I excel in building and optimizing systems, applying my knowledge of high-performance solutions and commitment to industry best practices.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2014",
      "to_year": "2017",
      "location": "United Kingdom",
      "university": "The University of Manchester"
    }
  ],
  "experience": [
    {
      "role": "Field Service Engineer",
      "company": "Binary Studio",
      "from_date": "Aug 2023",
      "to_date": "Present",
      "location": "United Kingdom (Remote)",
      "responsibilities": "Provided **technical expertise** in the operation of welding and cutting equipment, ensuring optimal performance and safety during field operations.\nDelivered exceptional **customer relationship management** by maintaining regular communication with clients, addressing inquiries, and offering tailored solutions based on specific needs.\nConducted **preventive maintenance** on various tools and equipment, implementing **digital platforms** to track service history and upcoming maintenance schedules, improving uptime by **30%**.\nUtilized effective **communication skills** to convey complex technical feedback and solutions to clients and team members, enhancing customer satisfaction and service quality.\nCollaborated with cross-functional teams to develop and refine protocols for remote services, increasing workflow efficiency by **25%**.\nImplemented training sessions for clients on the proper use and maintenance of welding equipment, leading to a reported compliance rate of **95%** with safety practices.\nAssisted in the evaluation and integration of new tools and technologies, providing insights based on field experience and customer feedback.\nLeveraged troubleshooting skills to diagnose and resolve equipment malfunctions, minimizing equipment downtime and ensuring compliance with industry standards.\nMaintained detailed documentation of service reports and client interactions, facilitating seamless operations and service continuity.\nAnalyzed customer feedback to improve service delivery processes, resulting in a **20%** increase in customer retention rates."
    },
    {
      "role": "Software Engineer",
      "company": "Ardigen",
      "from_date": "Mar 2020",
      "to_date": "Aug 2023",
      "location": "Poland",
      "responsibilities": "- Provided technical expertise with **welding equipment** and **cutting equipment**, ensuring optimal performance and reliability in field operations.\n- Conducted preventive maintenance on various equipment to minimize downtime and enhance service continuity, achieving a **95%** first-time fix rate.\n- Enhanced customer relationship management by delivering exceptional service and support, leading to a **30%** increase in customer satisfaction ratings.\n- Communicated effectively with clients to understand their needs and provide tailored solutions, resulting in establishing long-term partnerships.\n- Collaborated with technical teams to deliver **remote services**, troubleshooting issues using **digital platforms**, effectively reducing service intervention times by **40%**.\n- Gathered and incorporated technical feedback to improve product offerings and service efficiencies, supporting product development cycles.\n- Trained clients on the operation and maintenance of **welding** and **cutting equipment**, ensuring proper usage and safety compliance.\n- Implemented rigorous testing and preventive strategies for systems and processes, achieving compliance with industry standards."
    },
    {
      "role": "Software Engineer",
      "company": "Altum Software",
      "from_date": "Oct 2017",
      "to_date": "Feb 2020",
      "location": "United Kingdom",
      "responsibilities": "Provided technical expertise in the operation and maintenance of welding and cutting equipment, ensuring optimal performance and safety standards for field operations.\nConducted preventive maintenance on various equipment, enabling a **99%** uptime for customer operations and reducing unexpected breakdowns.\nLeveraged customer relationship management (CRM) tools to enhance customer interactions and provide timely technical feedback on equipment performance and needs.\nDeveloped and implemented remote service protocols, utilizing digital platforms to provide support and troubleshooting for welding and cutting equipment remotely, improving service response times by **30%**.\nCommunicated effectively with clients to understand their requirements and deliver tailored solutions that enhance operational efficiency and customer satisfaction.\nUtilized strong communication skills to train clients on proper equipment usage, ensuring safe handling and promoting long-term relationships.\nAnalyzed equipment performance data to identify trends and potential issues, contributing to ongoing process improvements and client-assured productivity.\nManaged service schedules and documentation to maintain compliance with industry standards and ensure a streamlined workflow for both clients and internal teams.\nParticipated in workshops and training sessions to stay current on industry trends and equipment advancements, enhancing technical expertise in cutting-edge technologies."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, SQL\n\n**Backend Frameworks:**\n\tFastAPI, Django, Flask, Spring Boot\n\n**Frontend Frameworks:**\n\tAngular (1–16), React (15–18), Next.js, Vue.js (2/3), Blazor\n\n**API Technologies:**\n\tREST & gRPC APIs\n\n**Serverless and Cloud Functions:**\n\tAWS (Lambda), Azure\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis, SQLAlchemy\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD\n\n**Cloud & Infrastructure:**\n\tAWS (ECS, RDS, S3), Azure (App Services, Blob, SQL), Nginx, Certbot\n\n**Other:**\n\tKeycloak (OIDC, RBAC), JWT, OAuth2, Celery, Preventive maintenance, Technical expertise, Customer relationship management, Communication skills, Technical feedback, Digital platforms, Remote services"
}