{
  "name": "Rei Taro",
  "role_name": "Senior Ruby Engineer",
  "email": "rei515@outlook.com",
  "phone": "+48732529451",
  "address": "Warszawa, Poland",
  "linkedin": "https://www.linkedin.com/in/rei-taro-81a410391/",
  "profile_summary": "Seasoned Senior Ruby Engineer with over 10 years of experience in designing and delivering robust backend systems. Proficient in leveraging **AWS**, **Docker**, and **Ruby** to create scalable, high-performance applications tailored to financial platforms and beyond. Proven skills in developing APIs and automation tools, with expertise in integrating **JavaScript** and utilizing configuration management tools like **Chef**. Possesses a solid foundation in analytics with knowledge of **SAS** and **R**, and has successfully contributed to major projects for prominent organizations, including VISA, Sii Poland, and Reply Polska.",
  "education": [
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2010",
      "to_year": "2015",
      "location": "Japan",
      "university": "Keio University"
    }
  ],
  "experience": [
    {
      "role": "Senior Ruby Engineer",
      "company": "Leobit",
      "from_date": "Aug 2022",
      "to_date": "Present",
      "location": "Poland",
      "responsibilities": "Engineered backend services in **Ruby** to streamline document automation, user onboarding, and reporting workflows.\nDeveloped containerized solutions using **Docker** for efficient deployment and environments management across multiple projects.\nUtilized **Ruby on Rails** and associated frameworks to enhance system functionality and improve user experience for financial transaction requests.\nCollaborated with DevOps teams to deploy applications on **AWS** infrastructure, ensuring robust, scalable, and secure environments.\nImplemented automated deployment strategies using **Chef** and CI/CD pipelines to foster rapid and reliable release cycles, achieving deployment times reduced by **30%**.\nCreated and maintained data analytics reports using **SAS** and **R**, improving decision-making processes by providing accurate insights based on collected data.\nLed security assessments to enhance system integrity, implementing best practices and frameworks for compliant and secure applications.\nCollaborated with cross-functional teams to address system integration challenges, ensuring compliance, and overseeing release strategies."
    },
    {
      "role": "Software Engineer",
      "company": "Innovature",
      "from_date": "Nov 2018",
      "to_date": "Jun 2022",
      "location": "Japan",
      "responsibilities": "Utilized **AWS** to optimize cloud-based solutions and enhance system performance for backend development in Ruby.\nDeveloped scalable applications using **Docker** to create reproducible build environments, achieving a **50%** faster deployment time.\nImplemented robust CI/CD pipelines using **Chef**, ensuring consistent integration and delivery of new features with a **30%** reduction in rollout errors.\nLeveraged **JavaScript** for implementing dynamic user interfaces, improving user engagement metrics by **15%** through interactive elements.\nConducted thorough code reviews and debugging sessions, optimizing existing Ruby codebases and achieving a **20%** reduction in technical debt.\nAdvanced collaboration with cross-functional teams to ensure high-quality deliverables and timely product launches, meeting over **90%** of project deadlines.\nTrained junior engineers in best practices for Ruby development and cloud service integrations, fostering team growth and skill development."
    },
    {
      "role": "Software Developer",
      "company": "Wizcorp",
      "from_date": "Apr 2015",
      "to_date": "Nov 2018",
      "location": "Japan",
      "responsibilities": "• Developed backend services leveraging **Ruby** for trade execution, portfolio management, and account tracking, enhancing trading operations and boosting transaction efficiency by **30%**.\n• Engineered robust APIs using **JavaScript** and **WebSocket** protocols to facilitate real-time data interactions, ensuring seamless communication across platforms.\n• Integrated **AWS** for cloud deployment, achieving a reduction in infrastructure costs by **20%** while ensuring scalability and reliability of services.\n• Collaborated with frontend teams to design and implement user-friendly RESTful APIs, improving API response times by **15%**.\n• Managed containerization and orchestration of applications using **Docker**, increasing deployment speed and consistency during integration cycles.\n• Ensured compliance with regulatory standards such as MiFID II and GDPR, maintaining data security through the use of **Chef** for configuration management.\n• Implemented CI/CD processes with tools like **SAS** and **MS 365**, driving rapid release cycles and enhancing collaboration amongst development teams.\n• Automated reporting and data analysis workflows using **R**, facilitating better decision-making through data-driven insights within the trading platform."
    }
  ],
  "skills": " **Programming Languages**\n\t Ruby, JavaScript, Python (3.8+), SQL, Bash\n\n **Backend Frameworks**\n\t FastAPI, Flask, Django, Celery\n\n **Frontend Frameworks**\n\t \n\n **API Technologies**\n\t REST/gRPC APIs, Microservices\n\n **Serverless and Cloud Functions**\n\t AWS (EC2, S3, Lambda)\n\n **Databases**\n\t PostgreSQL, MySQL, MongoDB, Redis\n\n **DevOps**\n\t Docker, GitHub Actions, Azure DevOps, Kubernetes, CI/CD\n\n **Cloud & Infrastructure**\n\t Azure\n\n **Other**\n\t AI/ML Tools: Pandas, NumPy, scikit-learn, TensorFlow, Airflow, MLflow, Chef, SAS, R, MS 365, PyTest, Git, Kafka",
  "apply_company": "pharmtrace"
}