{
  "name": "Tomasz Lee",
  "role_name": "Senior SDET Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Results-driven Senior SDET Engineer with 9+ years of experience in software development and testing, specializing in IT Automation and Cybersecurity. Proficient in **Python**, **C++**, and testing frameworks like **Cucumber** and **pytest**. Experienced in containerization using **Docker** and orchestration with **Kubernetes**, alongside CI/CD pipelines with **Jenkins** and **GitLab CI**. Skilled in infrastructure as code with **Terraform** and configuration management using **Ansible**. Solid understanding of Cloud services including **AWS** and **GCP**. Proven track record of enhancing testing processes, automating workflows, and ensuring high-quality software delivery. Original strengths include a strong background in traditional software development with **.NET**, **C#**, and **microservices** architecture, along with effective cross-team collaboration and project leadership.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Senior SDET Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Utilized **Python**, **Docker**, and **Kubernetes** to automate testing processes, ensuring robust software quality and achieving a 30% increase in testing efficiency.\nImplemented **Cucumber** and **pytest** for behavior-driven testing, enhancing collaboration between development and QA teams, resulting in a 25% reduction in bug reports.\nManaged CI/CD pipelines using **Jenkins** and **GitLab CI**, optimizing deployment processes and reducing release cycles by 50%.\nLeveraged cloud services on **AWS** and **GCP** to enhance test environments, improving scalability and reducing infrastructure costs by 20%.\nDeveloped automation scripts with **Terraform** and **Ansible** for IT automation, streamlining operations and improving deployment speed by 35%.\nExecuted comprehensive cybersecurity measures and testing frameworks to ensure compliance and security of automated solutions.\nCollaborated with cross-functional teams to foster a culture of open-source development practices, promoting knowledge sharing and continuous improvement.\nImplemented monitoring solutions to track application performance and stability, reducing downtime incidents by 15%.\nConducted training sessions on best practices in test automation and modern frameworks to enhance team capabilities.\n"
    },
    {
      "role": "Full Stack Developer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "Developed automated testing frameworks using **Python** and **C++**, enhancing test coverage by 30% across multiple applications.\nImplemented CI/CD pipelines with **Jenkins** and **GitLab CI**, improving deployment frequency by 40% and reducing production failures by 25%.\nCreated containerized applications using **Docker** and orchestrated them with **Kubernetes**, streamlining development workflows and achieving a deployment success rate of 95%.\nDesigned IT automation scripts utilizing **Ansible** and **Terraform**, automating 70% of manual operational tasks and boosting productivity.\nConducted performance testing and security assessments integrating **Cucumber** and **pytest**, identifying critical vulnerabilities and reducing security risks by 20%.\nCollaborated with cross-functional teams to define and document software requirements in cloud environments such as **AWS** and **GCP**, ensuring effective resource utilization and compliance.\nUtilized open-source testing tools to enhance test execution speed, maintaining an average test execution time of under 5 minutes for large test suites.\nParticipated in code reviews and provided mentorship to junior SDET team members, leading to improved overall team test development efficiency.\nEngaged in continuous learning of latest trends in **Cybersecurity** and **IT Automation**, implementing best practices for secure coding and testing methodologies."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "Utilized **Python** and **C++** for automation testing, improving test coverage by **30%**.\nDesigned and executed test cases using **Cucumber** and **pytest**, facilitating the verification of software functionalities with accuracy.\nImplemented **Docker** for containerization of test environments, enabling consistent testing and reducing setup time by **40%**.\nAutomated deployment processes using **Jenkins** and **GitLab CI** to streamline software releases, achieving a **25%** reduction in deployment times.\nDeployed and managed testing infrastructures on **AWS** and **GCP**, leveraging cloud capabilities to enhance scalability and performance.\nDeveloped IT automation scripts using **Terraform** and **Ansible**, optimizing infrastructure management and configuration.\nParticipated in cybersecurity assessments and testing, ensuring adherence to security best practices across all projects.\nLed initiatives for open-source tool integration, contributing to the internal testing toolset improvements and community engagement.\nCollaborated with cross-functional teams during release planning and execution, ensuring alignment on quality objectives and timelines.\nProvided training sessions and technical documentation for automation frameworks and tools, fostering knowledge sharing within the team."
    }
  ],
  "skills": "    **Programming Languages**\n\tPython, C++, JavaScript, TypeScript, C#, Solidity\n\n    **Backend Frameworks**\n\tNodeJS, ExpressJS, NestJS, .NET, Microservices, Entity Framework\n\n    **Frontend Frameworks**\n\tReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n    **API Technologies**\n\tRESTful API, GraphQL\n\n    **Serverless and Cloud Functions**\n\tAWS, GCP\n\n    **Databases**\n\tMSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB\n\n    **DevOps**\n\tDocker, Kubernetes, Jenkins, GitLab CI, Argo, Terraform, Ansible, CI/CD pipelines\n\n    **Cloud & Infrastructure**\n\tAWS, Azure, Cloud\n\n    **Other**\n\tUX/UI Design, Git, GitHub, Apache Kafka, RabbitMQ, Redis, NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest, Cucumber, pytest, Cybersecurity, IT Automation, Open Source, Blockchain",
  "apply_company": "CrowdStrike"
}