{
  "name": "Tomasz Lee",
  "role_name": "Senior Network Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Dynamic Senior Network Engineer with 9+ years of experience in infrastructure technologies and network automation. Proficient in **BGP**, **OSPF**, **MPLS**, **IPv4**, **IPv6**, **Python**, and **Ansible**, with a strong focus on **Cisco**, **Juniper**, and **Arista** systems. Extensive background in **Infrastructure-as-code**, **network telemetry**, **cloud networking**, and **traffic engineering**. Demonstrated expertise in optimizing network performance and driving automation initiatives. Proven collaborative leader with exceptional communication skills, effectively interfacing across departments to ensure the successful execution of projects.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Senior Network Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Implemented Infrastructure-as-Code strategies to automate network configurations, improving deployment consistency by 50%.\nUtilized **Python** and **Ansible** for network automation, reducing manual configuration efforts by **30%**.\nConfigured and managed **BGP**, **OSPF**, and **MPLS** protocols to optimize network traffic flow and enhance redundancy across multiple sites.\nConducted IPv4 and IPv6 addressing strategies, enabling seamless integration of newer technologies and improved addressing schema.\nEmployed **Cisco**, **Juniper**, and **Arista** devices for robust network architecture design, sustaining **99.9%** network uptime.\nAnalyzed network telemetry to identify performance bottlenecks, leading to a **15%** increase in overall network efficiency.\nCollaborated with cross-functional teams to ensure effective communication and successful project delivery, enhancing team performance by **20%**.\nExecuted traffic engineering strategies that minimized latency and improved throughput during peak operational hours.\nDelivered comprehensive documentation and training sessions to promote ongoing knowledge sharing within the team."
    },
    {
      "role": "Full Stack Developer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "• Developed and implemented network automation strategies using **Python** and **Ansible**, increasing deployment efficiency by 40%.\n• Collaborated with cross-functional teams to define and document system requirements, ensuring effective communication and timely project delivery.\n• Configured and optimized **BGP**, **OSPF**, and **MPLS** protocols for enhanced network performance across an **IPv4** and **IPv6** environment.\n• Leveraged **Cisco**, **Juniper**, and **Arista** equipment to establish robust network infrastructures, reducing downtime by **25%**.\n• Designed and executed **Infrastructure-as-code** solutions for scaling cloud networking environments, leading to a **30%** improvement in provisioning times.\n• Employed traffic engineering techniques to optimize network flow and ensure efficient resource usage under varying loads.\n• Utilized network telemetry for real-time monitoring and analytics, resulting in a **20%** decrease in troubleshooting response time.\n• Conducted training sessions and mentorship for junior engineers, fostering a culture of collaboration and knowledge sharing within the team.\n• Maintained documentation of all network configurations and changes, promoting best practices in infrastructure management.\n• Spearheaded improvements in collaboration tools, enhancing team communication and project tracking across the organization."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "Utilized **Python** and **Ansible** for network automation, improving configuration deployment speed by **30%**.\nImplemented **BGP** and **OSPF** protocols, enhancing network routing efficiency across **5** major client sites.\nDesigned and managed **MPLS** architectures to optimize bandwidth utilization, successfully cutting costs by **15%**.\nConfigured and maintained both **IPv4** and **IPv6** networking solutions to support diverse client requirements and future-proofing.\nCollaborated with teams using **Cisco**, **Juniper**, and **Arista** devices, ensuring seamless communication across networks.\nDeveloped and executed traffic engineering strategies, leading to a **25%** reduction in packet loss during peak hours.\nContributed to infrastructure-as-code practices, enabling a smoother and more effective network lifecycle management.\nAssisted in deploying and troubleshooting cloud networking solutions to meet increasing demands.\nEngaged in network telemetry for real-time monitoring and reporting, converting data insights into actionable tasks.\nFacilitated knowledge sharing through collaborative sessions, resulting in improved team communication and project alignment."
    }
  ],
  "skills": "Frontend Technologies: HTML, CSS, JavaScript, TypeScript, ReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\t\n**Backend Frameworks**\n\tBackend Technologies: NodeJS, ExpressJS, NestJS, C#, .NET, Entity Framework, Microservices\n\t\n**API Technologies**\n\tRESTful API, GraphQL\n\t\n**Serverless and Cloud Functions**\n\t\n**Databases**\n\tDatabase Systems: MSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB\n\t\n**Cloud & Infrastructure**\n\tAWS, Azure, Cloud networking, Infrastructure-as-code\n\t\n**DevOps**\n\tCI/CD pipelines, Network automation\n\t\n**Networking**\n\tBGP, OSPF, MPLS, IPv4, IPv6, Cisco, Juniper, Arista, Network telemetry, Traffic engineering\n\t\n**Other**\n\tUX/UI Design, Git, GitHub, Python, Redux, Ansible, Collaboration, Communication, Blockchain: Solidity, Ether.js, Web3.js, Ethereum, Messaging & Caching: Apache Kafka, RabbitMQ, Redis, Testing Tools: NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest",
  "apply_company": "Dropbox"
}