{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Software Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-karol-kotlinski-bb2520397/",
  "profile_summary": "As a Senior Software Engineer with 8 years of experience, I excel in full-stack development utilizing **React**, **Vue**, and **JavaScript**, and I have a solid foundation in **.NET Core** for building high-performance solutions. My expertise in Agile methodologies promotes efficient development processes, while my experience with **CI/CD** pipelines and **DevOps** practices ensures seamless deployment and integration.\n\nI possess strong skills in relational databases using **SQL** and am proficient in modern web technologies such as **HTML** and **CSS**. I've successfully led projects that involved payment processing solutions with **Stripe Payments** and enhanced team collaboration through tools like **Slack** and **JIRA**.\n\nI have a proven track record in developing enterprise-grade platforms, underpinning my projects with a deep understanding of cloud services such as **AWS** and **Azure**. My strengths also include a solid background in microservices architecture and implementing secure applications that adhere to compliance standards such as HIPAA and PCI DSS. Additionally, I am experienced in developing software solutions across diverse sectors, particularly in healthcare and finance.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Software Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Focused on delivering robust software solutions as a Senior Software Engineer by implementing the following key responsibilities:\n\n- Developed scalable, full-stack applications utilizing **.NET Core**, **React**, and **Vue**, adhering to Agile methodologies to enhance team collaboration and delivery efficiency.\n- Integrated payment processing solutions using **Stripe Payments**, enabling seamless transactions within the platforms and ensuring compliance with regulatory standards.\n- Designed and maintained relational database systems with **SQL**, ensuring optimized data storage and retrieval for high-traffic applications.\n- Established CI/CD pipelines leveraging **Docker** and modern DevOps practices, automating deployments and reducing release times by **30%**.\n- Collaborated effectively using tools such as **Slack** and **JIRA** to track project progress and enhance communication within Agile teams.\n- Created user-friendly interfaces with **HTML**, **CSS**, and **JavaScript**, delivering engaging user experiences that improved user satisfaction scores by **40%**.\n- Architected and developed applications with an emphasis on scalable, microservices-oriented structures, improving system resilience and fault tolerance by transitioning from monolithic architectures.\n- Contributed to enterprise-level DevOps processes, incorporating security scans and testing frameworks to ensure software quality and reliability across different environments.\n- Delivered complex visualization features through tools such as **D3.js** and **Chart.js**, resulting in enhanced analytics capabilities for business stakeholders.\n- Engaged in continuous improvement by adopting Agile practices, leading to a **25%** increase in delivery speed and team efficiency."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "• Developed dynamic, user-focused front-end applications using **React (18)** and **Vue 3**, ensuring a cohesive integration with **HTML**, **CSS**, and **JavaScript** for high-performance financial dashboards and admin portals.\n• Utilized **.NET Core** in back-end services to enhance scalability and performance, while implementing **CI/CD** practices for streamlined deployment and integration processes.\n• Participated in Agile development methodologies to facilitate timely project delivery and responsiveness to changes, managing tasks effectively using **JIRA**.\n• Designed and executed efficient database queries using **SQL** to support data-driven decision-making in financial applications, achieving a **30%** increase in query performance.\n• Leveraged **Docker** for containerization, improving the deployment environment for applications and ensuring consistency across all stages of the software development lifecycle.\n• Collaborated cross-functionally using **Slack** and **Microsoft Office**, enhancing team communication and project management efficiency.\n• Integrated payment processing solutions like **Stripe Payments** to facilitate seamless financial transactions, successfully reducing transaction times by **15%**.\n• Continuously improved user interfaces by applying best practices in modern web development, leading to a **25%** increase in user engagement metrics.\n• Mentored junior developers on best practices in coding, system architecture, and Agile methodologies, fostering a culture of continuous learning and improvement within the team."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "- Developed and maintained applications using **React**, **Vue**, and **JavaScript**, adhering to Agile methodologies to deliver features on time while ensuring high-quality code standards.\n- Implemented **.NET Core** for building efficient backend services, achieving a **30% reduction** in response time for core functionalities.\n- Collaborated with cross-functional teams through **Slack** and **JIRA**, optimizing project communication while managing tasks and updates effectively in a fast-paced environment.\n- Designed responsive interfaces with **HTML5**, **CSS3**, and **JavaScript**, achieving a **95%** mobile-friendly score ensuring accessibility compliance with WCAG 2.1 standards.\n- Integrated secure payment gateways such as **Stripe Payments**, handling transactions with a **100% compliance** to PCI standards for secure financial operations.\n- Leveraged SQL and NoSQL databases for efficient data storage and retrieval, ensuring performance scalability during peak load times by optimizing queries and indexing strategies.\n- Applied **CI/CD** practices using **Docker** to streamline deployment processes, enhancing the overall development lifecycle and maintaining smooth rollouts of new features.\n- Utilized **Microsoft Office** and **Google Suite** for documentation, facilitating better project workflows and effective presentations to stakeholders.\n- Experimented with feature flags and comprehensive testing strategies, ensuring a robust deployment pipeline with minimal risk profiles for releases."
    }
  ],
  "skills": " **Programming Languages** \n\tPython, JavaScript, TypeScript \n\n **Backend Frameworks** \n\tFastAPI, Flask, Django, .NET Core \n\n **Frontend Frameworks** \n\tReact, Vue, Angular, HTML, CSS \n\n **API Technologies** \n\tREST, GraphQL, OAuth2, JWT \n\n **Serverless and Cloud Functions** \n\tAWS Lambda, Azure Functions \n\n **Databases** \n\tPostgreSQL, MySQL, MongoDB, Redis, SQL \n\n **DevOps** \n\tDocker, Kubernetes, CI/CD, GitHub Actions, GitLab CI/CD, Terraform, Ansible \n\n **Cloud & Infrastructure** \n\tAWS, Azure, Nginx, Certbot \n\n **Other** \n\tAgile, MLflow, Airflow, Kubeflow, Slack, JIRA, Microsoft Office, Google Suite, Stripe Payments"
}