{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Software Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "As a seasoned Senior Software Engineer with 8 years of experience, I am adept in **Go**, **Java**, **Kotlin**, **Docker**, **Kubernetes**, and CI/CD processes, ensuring efficient software delivery and system reliability. My robust background in microservices architecture, API development, and data processing, including both **SQL** and **NoSQL** databases, enables me to craft scalable and resilient applications. I employ ETL techniques and data modeling strategies to drive insights and enhance performance, all while adhering to clean code principles and test-driven development (TDD).\nBeyond technical acumen, my leadership in agile environments has fostered effective teamwork and communication. I have a proven track record of integrating **Azure DevOps** to streamline workflows and deploying applications that leverage artificial intelligence for innovative solutions. My initiative in driving projects has consistently resulted in high-performance outcomes, particularly in sectors demanding compliance with standards such as HIPAA and PCI DSS.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Software Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Developed and maintained microservices architectures utilizing **Docker** and **Kubernetes**, enhancing scalability and fault tolerance of applications.\n- Implemented CI/CD pipelines using **Azure DevOps**, enabling automated deployment and testing across multiple environments for both web and API services.\n- Created and optimized SQL and NoSQL databases, applying effective **data modeling** techniques for large-scale data processing and storage, ensuring efficient data retrieval and analysis.\n- Championed test-driven development (TDD) practices, establishing testing strategies with frameworks such as Jest and PyTest, ensuring code quality and reliability of software solutions.\n- Collaborated cross-functionally with teams to drive agile methodologies, fostering effective communication and teamwork across diverse projects.\n- Employed **Artificial Intelligence** techniques in application features, contributing to innovations in user experiences and data-driven decision-making.\n- Took initiative in integrating APIs to enhance application functionalities, ensuring seamless interaction with various data sources and external services.\n- Delivered high-quality software solutions by adhering to clean code principles, leading to maintainable and efficient codebases that support continuous improvement.\n- Demonstrated expertise in **data processing** and **ETL** methodologies, providing valuable insights for software enhancements and performance optimizations.\n- Engaged in ongoing professional development, continuously upgrading skills in programming languages such as Go, Kotlin, and Java to align with industry standards."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "• Utilized **Go** and **Kotlin** for developing microservices-based architecture, enhancing scalability and maintainability of financial platforms, resulting in a **30%** increase in system throughput for high-volume transactions.\n• Engineered robust APIs and integrated **Java** services for seamless communication between microservices, improving overall system efficiency by **25%**.\n• Collaborated within an Agile team environment, fostering teamwork and initiative to ensure timely delivery of projects and successful implementation of **CI/CD** pipelines with **Docker** and **Kubernetes**.\n• Developed comprehensive data processing solutions using **SQL** and **NoSQL** databases, ensuring effective data modeling and optimized ETL processes that streamlined financial data ingestion by **40%**.\n• Implemented test-driven development (TDD) practices and maintained clean code principles to achieve a **15%** reduction in defects during code reviews.\n• Leveraged Azure DevOps for continuous integration and deployment efforts, resulting in faster release cycles and improved deployment reliability.\n• Integrated artificial intelligence techniques for fraud detection and transaction monitoring, using real-time data analysis methods that enhanced security measures and compliance workflows.\n• Fostered effective communication across cross-functional teams to ensure alignment on project goals and deliverables, promoting a culture of collaboration and innovation."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "• Developed and optimized **microservices** architecture in **Go** and **Kotlin**, ensuring scalability and maintainability across various services in line with Agile methodologies.\n• Implemented **API** integration and design patterns to enhance communication and functionality across distributed systems, improving performance by **30%**.\n• Leveraged **Docker** and **Kubernetes** for deployment and orchestration, achieving **99.9% uptime** through robust CI/CD pipelines facilitated by **Azure DevOps**.\n• Designed and maintained both **SQL** (*PostgreSQL*) and **NoSQL** (*MongoDB*, *Redis*) databases, ensuring efficient data processing and model structuring, improving query performance by **25%**.\n• Executed TDD principles to deliver clean code, reducing bugs in production by **40%**, and ensuring reliable and efficient software development practices.\n• Fostered a culture of teamwork and communication within development teams, contributing to a **15%** improvement in project delivery time through enhanced collaboration.\n• Initiated and maintained data processing and ETL workflows, enabling real-time analytics and insights for performance monitoring and user engagement.\n• Integrated AI/ML algorithms into core applications, enhancing user personalization features and improving customer satisfaction rates by **20%**.\n• Participated actively in the planning and execution of projects within an Agile framework, displaying initiative in suggesting enhancements and optimizations to existing processes."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, JavaScript/TypeScript, Go, Kotlin, Java\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django, Microservices\n\n **Frontend Frameworks:**\n\tReact, Vue, Angular\n\n **API Technologies:**\n\tAPI\n\n **Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n **Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis, SQL, NoSQL\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Azure DevOps, CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:**\n\tAWS, Azure\n\n **Other:**\n\tMLflow, Airflow, Kubeflow, Data Processing, Data Modeling, ETL, TDD, Clean Code, Artificial Intelligence, Agile, Teamwork, Communication, Initiative, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot",
  "apply_company": "fino"
}