{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Network Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Senior Network Engineer with 13+ years of experience in delivering high-performance network solutions across healthcare and financial sectors. Skilled in Cloud Services including **AWS**, **Azure**, and **OCI**, with proven expertise in network security technologies such as **Firewall**, **VPN**, **Proxies**, and **ISD/IPS**. Proficient in Troubleshooting and Documentation, ensuring compliance and optimization of complex network infrastructures.\nStrong knowledge of TCP/IP, BGP, and industrial security certifications including **CompTIA Security+**, **Cisco CCNP**, and **Palo Alto PCNSA**. Background in managing client relationships and driving solutions to enhance performance while adhering to compliance standards. Additionally experienced in the deployment of microservices, CI/CD pipelines, and AI/ML-powered platforms in a full-stack development environment using **JavaScript/TypeScript**, **Python**, **React**, **Node.js**, and **Django**.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Network Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Implemented comprehensive **firewall** and **VPN** solutions to secure network infrastructures, ensuring compliance with industry standards and best practices.\nManaged and optimized **TCP/IP** and **BGP** protocols, resulting in a 20% improvement in network performance and reliability across the organization.\nConducted thorough troubleshooting and resolution of network issues, leading to a 30% reduction in downtime and enhanced user satisfaction.\nDeveloped detailed documentation for network configurations and protocols, enabling streamlined operations and enhanced client management for future network engineers.\nAdministered **Cisco**, **Palo Alto**, and **Fortinet** devices, ensuring robust security measures were in place against potential threats.\nDeployed **AWS** and **Azure** cloud services to enhance network agility, reducing operational costs by **15%** via efficient resource allocation.\nUtilized advanced network monitoring tools to proactively identify and mitigate threats using **ISD/IPS** systems, improving network security posture by **40%**.\nIntegrated **F5** load balancers to optimize traffic flow and enhance service delivery, achieving a measured increase in application responsiveness by **25%**.\nCollaborated with cross-functional teams to design and implement secure network architectures tailored to specific client needs, enhancing service delivery and client satisfaction.\nMaintained up-to-date industry certifications, including **CompTIA Security+**, **Cisco CCNP**, and **Palo Alto PCNSA**, ensuring the application of best practices in network security."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Ensured network security by deploying **firewall** solutions from **Palo Alto** and **Fortinet**, implementing **VPN** configurations, and managing **proxies** to secure data transmission and enhance client management practices.\nConducted comprehensive network performance tuning using **TCP/IP** and **BGP** protocols, achieving a network uptime of **99.9%** and improved client satisfaction ratings by **30%** through proactive troubleshooting.\nManaged cloud infrastructure and security protocols on **AWS**, **Azure**, and **OCI**, contributing to over **2TB** of secure data transfers per month while maintaining compliance with industry standards like **CompTIA Security+**.\nDesigned and implemented intrusion detection systems (IDS) and prevention systems (IPS), leveraging **Cisco** and **F5** tools, to effectively mitigate security threats and enhance overall network resilience.\nCreated extensive documentation for network architecture and security policies, improving operational clarity and onboarding time for new team members by **40%**.\nLed client management initiatives by collaborating closely with stakeholders to understand their networking requirements and deliver tailored solutions, resulting in a **25%** increase in client retention.\nUtilized **Juniper** routers and switches to optimize network routes, reducing latency by **15%**, resulting in faster service deployment for critical applications."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Utilized **AWS**, **Azure**, and **OCI** to implement and manage secure cloud-based networking solutions, ensuring optimal performance across global infrastructure.\nConfigured and maintained **firewall** systems, including **Palo Alto** and **Fortinet**, to protect against external threats and unauthorized access, applying best practices for **ISD/IPS** integration.\nDeployed and managed **VPN** solutions and **proxies** to ensure secure remote access and enhance client connectivity options, delivering efficient and reliable communication channels.\nMonitored network performance and diagnosed issues using advanced **TCP/IP**, **BGP** protocols, and traffic analysis tools, achieving a **99.9%** uptime and prompt incident resolution.\nDeveloped and maintained comprehensive documentation for network configurations, policies, and troubleshooting protocols to facilitate effective client management and knowledge transfer.\nLed network modernization projects that resulted in a **30%** reduction in latency and improved troubleshooting processes, enhancing overall user experience.\nAchieved CompTIA Security+ and Cisco CCNP certifications to ensure the adoption of the latest networking security metrics and strategies, aligning with industry standards and client requirements.\nCollaborated with cross-functional teams to facilitate seamless implementation of network solutions that support business goals while adhering to security protocols and compliance requirements, consistently delivering projects on-time and within budget."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython: FastAPI, Flask, Django\n\tJavaScript/TypeScript: React, Vue, Angular\n\n **Backend Frameworks:**\n\t\n\n **Frontend Frameworks:**\n\t\n\n **API Technologies:**\n\t\n\n **Serverless and Cloud Functions:**\n\tAWS: ECS, Lambda, RDS, S3\n\tAzure: App Services, Blob Storage, SQL Database\n\n **Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare)\n\tMongoDB (Gaming), Redis\n\n **DevOps:**\n\tDocker, Kubernetes\n\tGitHub Actions, GitLab CI/CD\n\tCI/CD & Infrastructure as Code: Terraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:**\n\tOCI\n\n **Other:**\n\tFirewall\n\tVPN\n\tProxies\n\tISD/IPS\n\tPalo Alto\n\tFortinet\n\tCisco\n\tF5\n\tJuniper\n\tTCP/IP\n\tBGP\n\tCompTIA Security+\n\tCisco CCNP\n\tPalo Alto PCNSA\n\tDocumentation\n\tClient Management\n\tTroubleshooting\n\tAuthentication & Security: Keycloak (OIDC, RBAC), OAuth2, JWT\n\tNginx, Let’s Encrypt, Certbot",
  "apply_company": "SecureOps"
}