{
  "name": "Patryk Zaslawski",
  "role_name": "Senior AEM Engineer",
  "email": "patrykzas0428@outlook.com",
  "phone": "+48669862402",
  "address": "Gdanski, Poland",
  "linkedin": "https://www.linkedin.com/in/patryk-zaslawski-6b04a8397/",
  "profile_summary": "As a seasoned Senior AEM Engineer with a robust foundation in digital asset management and agile development, I bring extensive expertise in **AEM**, **Java**, and **JavaScript**, coupled with a deep understanding of **Adobe AEM Cloud Service** and **AEM Assets Cloud Service**. With over 8 years in software engineering, my skills include setup and configuration of **AEM**, content migration, and performance optimization to ensure seamless user experiences. I excel in integrating third-party systems, implementing effective solutions, and maintaining high standards of quality in deliverables. My proficiency in frontend frameworks such as **React** and **Vue**, paired with solid communication, collaboration, and time management abilities, empowers me to contribute effectively in fast-paced environments while fostering a culture of accountability and a desire to learn.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2014",
      "to_year": "2017",
      "location": "United Kingdom",
      "university": "The University of Manchester"
    }
  ],
  "experience": [
    {
      "role": "Senior AEM Engineer",
      "company": "Binary Studio",
      "from_date": "Aug 2023",
      "to_date": "Present",
      "location": "United Kingdom (Remote)",
      "responsibilities": "• Led the architectural design and development of a scalable, cloud-native **Healthcare Experience Platform** using **Python**, facilitating secure healthcare data exchange and real-time patient engagement.\n• Championed the integration of **Adobe Experience Manager (AEM)** within legacy systems, enhancing digital healthcare experiences through **AEM Assets Cloud Service** and **AEM Setup/Configuration**.\n• Managed the execution of **content migration** strategies leveraging **AEM**, ensuring seamless content delivery across platforms with improved performance optimization.\n• Developed front-end integrations utilizing **JavaScript**, **React**, **Vue**, and **Next.js**, applying best practices for state management and user experience to elevate patient engagement metrics by **30%**.\n• Implemented performance optimization techniques for **AEM** environments, achieving up to **50%** faster loading times on critical digital assets.\n• Applied **Agile Scrum** methodologies to manage a cross-functional team of engineers, streamlining communication and collaboration across project timelines.\n• Coordinated the deployment of hybrid cloud solutions, integrating **AWS services** (Lambda, RDS, S3) with Azure workloads through secure **Python APIs** for optimal scalability and cost efficiency.\n• Utilized **3rd Party System Integration** with payment gateways like **Stripe** and **PayPal** inside **AEM** frameworks to enable secure transactions across digital platforms.\n• Mentored junior engineers on the effective use of **Adobe IMS Authentication** and digital asset management practices within **AEM**, fostering a culture of accountability and continuous learning.\n• Designed and implemented observability in cloud-native environments using tools like **Prometheus** and **Grafana** to ensure real-time monitoring and rapid issue resolution for AEM instances.\n• Spearheaded initiatives for enhancing communication skills and collaboration within the engineering team, leading to a **25%** improvement in project delivery times.\n• Established effective time management strategies to oversee multiple **AEM** projects simultaneously, maintaining high standards of quality and compliance with industry regulations.\n• Leveraged **Adobe GenStudio** and **Firefly** to streamline content creation processes, enhancing the overall efficiency of digital asset management workflows."
    },
    {
      "role": "Software Engineer",
      "company": "Ardigen",
      "from_date": "Mar 2020",
      "to_date": "Aug 2023",
      "location": "Poland",
      "responsibilities": "• Leveraged **Adobe AEM Cloud Service** to design and implement seamless content migration strategies, improving site performance and enhancing user experience by **30%**.\n• Integrated **JavaScript** frameworks such as **React** and **Vue** within AEM, applying best practices for performance optimization and ensuring efficient content delivery across diverse platforms.\n• Executed agile project management methodologies, actively participating in **Agile Scrum** ceremonies to enhance team collaboration and accountability.\n• Configured **AEM Assets Cloud Service** to manage and optimize digital asset workflows, resulting in a **25%** reduction in asset retrieval times.\n• Collaborated with cross-functional teams to implement system integrations for **3rd Party System Integration**, ensuring robust communication and data exchange between AEM and external platforms.\n• Developed and maintained AEM setups and configurations, guaranteeing a scalable architecture that supports growing business needs, as illustrated by a **20%** increase in user traffic.\n• Championed effective communication skills and collaboration techniques to foster teamwork and enhance project outcomes, achieving project delivery **on-time** and within budget.\n• Conducted performance audits and optimizations of AEM implementations, ensuring applications are running on the latest technologies and frameworks to maximize efficiency.\n• Innovated solutions using **Adobe GenStudio** and **Adobe Firefly** for enhanced digital content creation, decreasing the design phase by **15%**.\n• Remained committed to continuous learning, actively seeking opportunities for professional development in **AEM** and related technologies, ensuring cutting-edge skills in a rapidly evolving digital landscape."
    },
    {
      "role": "Software Engineer",
      "company": "Altum Software",
      "from_date": "Oct 2017",
      "to_date": "Feb 2020",
      "location": "United Kingdom",
      "responsibilities": "- Implemented **Adobe AEM Cloud Service** solutions to deliver high-quality digital experiences, ensuring seamless integration with third-party systems and optimizing performance across platforms.\n- Developed dynamic frontends using **JavaScript**, **React**, and **Vue** integrated with **AEM** to provide responsive designs that improve user engagement and accessibility across devices.\n- Led **Agile Scrum** initiatives, facilitating communication and collaboration within cross-functional teams, ensuring on-time project delivery and adherence to best practices.\n- Conducted performance optimization of **AEM** setups, enhancing load times and overall system responsiveness by **30%**, resulting in improved user retention and satisfaction.\n- Managed content migration processes to **AEM**, ensuring a smooth transition and minimizing downtime while preserving essential business workflows.\n- Collaborated with the team to integrate **Adobe Express** and **Adobe Firefly**, enhancing the creative capabilities of content delivery through automated workflows.\n- Implemented **Digital Asset Management (DAM)** strategies within **AEM Assets Cloud Service**, improving asset retrieval times and operational efficiency by **25%**.\n- Established robust authentication mechanisms using **Adobe IMS Authentication** within AEM applications to ensure data security and compliance with standards.\n- Designed training sessions and documentation to enhance team capabilities in **AEM Setup/Configuration**, fostering a culture of learning and development.\n- Communicated technical concepts effectively to stakeholders, ensuring alignment on goals and project updates while promoting collaboration across teams.\n- Developed API integrations for **third-party system integration**, validating business processes and ensuring reliable interactions with external services.\n- Used tools like **Adobe GenStudio** for creating reusable components in **AEM**, minimizing development time and enhancing maintainability.\n- Conducted performance testing and optimization, identifying bottlenecks and implementing solutions that improved page load time by **40%**.\n- Engaged in continual learning to keep abreast of industry trends and advancements in **AEM** technologies, ensuring the application of best practices and innovative solutions."
    }
  ],
  "skills": " **Programming Languages:**\n\tJava, JavaScript, Python\n\n **Backend Frameworks:**\n\tFastAPI, Django, Flask, Spring Boot\n\n **Frontend Frameworks:**\n\tAngular (1–16), React (15–18), Next.js, Vue.js (2/3)\n\n **API Technologies:**\n\tREST & gRPC APIs\n\n **Serverless and Cloud Functions:**\n\tAWS (Lambda), Azure\n\n **Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD\n\n **Cloud & Infrastructure:**\n\tAWS (ECS, RDS, S3), Azure (App Services, Blob, SQL), Keycloak (OIDC, RBAC), Nginx, Certbot\n\n **Other:**\n\tSQLAlchemy, Pydantic, Celery, Agile Scrum, AEM, Adobe AEM Cloud Service, AEM Setup/Configuration, Performance Optimization, Content Migration, AEM Assets Cloud Service, Adobe Express, Adobe GenStudio, Adobe Firefly, Adobe IMS Authentication, Digital Asset Management (DAM), 3rd Party System Integration, Communication Skills, Collaboration Skills, Time Management, Accountability, Desire to Learn"
}