{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "As a Senior Engineer with 8 years of experience, I bring expertise in **Ruby** and **Ruby on Rails**, complemented by a strong understanding of **Postgres** databases. My technical skills include data ingestion and development of reconciliation pipelines, particularly in the context of **Fintech** and **Taxtech** domains, with a keen focus on compliance and innovation in **Open Banking** and **Blockchain** solutions.\n\nMy strengths in async communication ensure cohesive teamwork and effective project execution, while I emphasize code quality and system performance through adherence to software design principles. I am experienced in crafting technical documentation that aids in clear communication and knowledge sharing across teams.\n\nIn my previous roles, I leveraged modern technologies such as **JavaScript/TypeScript**, **Python**, and **Flutter** to build high-performance solutions, while leading the development of enterprise-grade applications utilizing **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**. I possess deep cloud experience with **Azure** and **AWS** and have implemented robust microservices architectures along with CI/CD automation strategies. Furthermore, my exposure to AI/ML pipelines using tools like **MLflow**, **Airflow**, and **Kubeflow** underpins my capacity to drive innovative data-driven solutions.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Implemented and maintained fintech solutions using **Ruby** and **Ruby on Rails** to enhance user experience and ensure code quality across platforms.\nDeveloped and optimized **Postgres** databases for efficient data ingestion and reconciliation pipelines, facilitating seamless transaction processing and financial record management.\nDesigned architecture following software design principles, ensuring system performance scalability and maintainability for high-traffic taxtech applications.\nProvided mentorship to junior developers, fostering a culture of continuous learning and technical excellence through clear communication and technical documentation.\nCollaborated on open banking initiatives, integrating APIs and blockchain technologies to enhance data security and transaction transparency.\nEnsured the implementation of async communication strategies to minimize latency and improve system responsiveness for user requests.\nProduced thorough technical documentation to support software delivery and facilitate knowledge transfer among team members.\nLed efforts to reconcile financial discrepancies by developing robust reconciliation pipelines, improving accuracy and reliability of financial reporting.\nEmphasized code quality through comprehensive testing strategies, ensuring high standards of programming practices and system reliability.\n"
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Adopted **Ruby on Rails** for developing and modernizing fintech applications, effectively utilizing **Postgres** for robust data management and reconciliation pipelines, thus enhancing system performance and reliability.\nLed data ingestion strategies for high-volume transaction systems, ensuring seamless integration with open banking solutions and application of software design principles for maintainable code.\nImplemented asynchronous communication best practices to improve application responsiveness and efficiency, adhering to established code quality standards.\nConducted thorough technical documentation to facilitate clear communication within the team and foster mentorship opportunities, helping to elevate team skill sets in fintech and taxtech domains.\nOptimized financial platform performance with a focus on reconciliation processes, ensuring accuracy and efficiency in transaction handling.\nCollaborated on blockchain technology integration for secure transaction methods, further enhancing the overall system's compliance with regulatory requirements.\nMentored junior developers in best practices for software design and development, reinforcing a culture of ongoing learning and improvement within the engineering team."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Utilized **Ruby** and **Ruby on Rails** to design and optimize fintech applications, ensuring adherence to **software design principles** and high-quality code delivery across multiple modules.\nEngineered **data ingestion** and **reconciliation pipelines** to facilitate seamless, real-time data processing for financial transactions, enhancing system performance and reliability.\nImplemented **async communication** strategies to support real-time updates and improve system responsiveness in a high-traffic environment.\nApplied **Postgres** for efficient data storage and management, ensuring fast access and compliance with data integrity standards for sensitive financial information.\nDeveloped technical documentation to maintain clarity and foster effective **clear communication** within the development team and with stakeholders.\nProvided mentorship to junior developers, promoting best practices in code quality, system performance, and collaborative problem-solving.\nLed initiatives in **blockchain** technology to enhance transaction security and transparency, aligning with industry standards for **fintech** and **taxtech** solutions.\nCollaborated on **open banking** integrations to expand access to banking data, improving user experience through enhanced financial service offerings.\nParticipated in code reviews, enforcing high standards of **code quality** to mitigate risks and ensure maintainable software solutions.\nChampioned process improvements and system enhancements, significantly reducing inefficiencies and improving application performance metrics by **20%**."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, JavaScript, TypeScript, Ruby\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django, Ruby on Rails\n\n **Frontend Frameworks:**\n\tReact, Vue, Angular\n\n **API Technologies:**\n\tOpen Banking, Async Communication\n\n **Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n **Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis, Postgres\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:**\n\tAWS, Azure\n\n **Other:**\n\tMLflow, Airflow, Kubeflow, Keycloak, JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, Data Ingestion, Reconciliation Pipelines, Fintech, Taxtech, Blockchain, Code Quality, System Performance, Software Design Principles, Technical Documentation, Mentorship, Clear Communication",
  "apply_company": "Koinly"
}