{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Backend Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "As a Senior Backend Engineer with 8 years of experience, I possess in-depth expertise in developing robust APIs and software design best practices, focusing on high-performance solutions within cloud environments like **Google Cloud**. My technical skills include proficiency in **Kotlin**, **PostgreSQL**, **ElasticSearch**, and **Kubernetes**, enabling me to build scalable and efficient backend systems.\nMy background in **Python** reinforces my ability to contribute to complex projects while maintaining best practices in software architecture. In past roles, I have successfully mentored junior developers and provided technical leadership, ensuring compliance with industry standards.\nAdditionally, I have hands-on experience with full-stack development and cloud services, having integrated AI/ML capabilities in enterprise-grade applications. I am passionate about fostering innovative solutions and driving process improvements in the development cycle.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Backend Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Designed and developed robust APIs and microservices in **Python** to optimize backend functionality within cloud environments, ensuring high performance and scalability.\nEmployed **PostgreSQL** for efficient data management, ensuring data integrity and performance across multiple applications, handling over **5 million** records consistently.\nUtilized **Kubernetes** for orchestrating containerized applications, achieving seamless deployment and scalability across **3** environments (development, testing, production).\nConducted code reviews and provided technical leadership, mentoring junior developers in **Kotlin** and backend technologies, fostering a collaborative engineering culture.\nIntegrated **ElasticSearch** for advanced search capabilities, enhancing data retrieval processes across various applications, reducing query times by **40%**.\nDesigned and implemented cloud-based solutions leveraging **Google Cloud** services, optimizing resource usage and cost-effectiveness in application deployments.\nLed architectural discussions to improve software design patterns, focusing on clean code practices, modular design, and maintainability for large-scale applications.\nDeveloped documentation and tutorials, enhancing knowledge sharing within the team and contributing to the onboarding process for new hires.\nCollaborated with cross-functional teams to align on technical requirements and deliver high-quality solutions, ensuring that **APIs** exceed service level agreements (SLAs).\nUtilized agile methodologies to manage project timelines effectively, completing **95%** of features on schedule while maintaining high code quality."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Demonstrated **Technical Leadership** in developing scalable backend solutions utilizing **Google Cloud**, fostering a collaborative environment focused on modern software design principles and best practices.\nImplemented and maintained **PostgreSQL** and **ElasticSearch** databases to ensure high performance and reliability for data storage and retrieval in alignment with project requirements.\nMentored junior engineers on **Kotlin** best practices and effective use of **APIs**, enhancing team productivity and code quality within the backend development team.\nLed architecture discussions and design sessions for migrating existing applications to **Kubernetes**, ensuring efficient deployment strategies and improved system reliability.\nDesigned and built robust backend services in **Python** to support frontend applications, using **APIs** for seamless integration with various client platforms.\nDrove the development of applications within **Cloud Environments**, leveraging cloud-native services for improved scalability and reduced operational overheads, achieving a **30%** reduction in deployment times.\nOversaw the re-engineering of existing systems with a focus on modern **software design** patterns, increasing maintainability and system performance by **25%**.\nUtilized mentoring sessions to empower team members in adopting new technologies, fostering an innovative culture and ensuring knowledge transfer across the team."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "• Developed and optimized backend systems in **Python** ensuring robust performance and scalability in a cloud environment, leveraging **PostgreSQL** for effective data management in high-traffic workflows.\n• Designed and led APIs and microservices architectures while fostering best practices in **Software Design** and **Technical Leadership** to enhance application integrity and maintainability.\n• Spearheaded cloud deployment strategies in **Google Cloud**, employing **Kubernetes** for orchestration of containerized applications, facilitating seamless rollout and management of backend services.\n• Implemented advanced search capabilities using **ElasticSearch**, drastically improving data retrieval speed by over **30%**, enhancing user experience and operational efficiency.\n• Mentored junior developers, guiding them in software development processes, best practices, and the intricacies of backend programming in **Kotlin** and **Python** frameworks.\n• Established automated testing and CI/CD pipelines to ensure high-quality code delivery, reducing deployment errors by **40%** through the use of advanced tooling and frameworks.\n• Led collaborative projects demonstrating effective **Technical Leadership** by leveraging agile practices and providing ongoing support and technical guidance to cross-functional teams.\n• Maintained code quality and performance standards, conducting regular reviews, and implementing best practice methodologies to enhance code robustness and reduce technical debt."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, Kotlin\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tJavaScript/TypeScript (React, Vue, Angular)\n\n**API Technologies:**\n\tAPIs\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL), Google Cloud\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis, ElasticSearch\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tCloud Environments\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, Software Design, Mentoring, Technical Leadership",
  "apply_company": "Shop Circle"
}