{
  "name": "Rei Taro",
  "role_name": "Senior Frontend Engineer",
  "email": "rei515@outlook.com",
  "phone": "+48732529451",
  "address": "Warszawa, Poland",
  "linkedin": "https://www.linkedin.com/in/rei-taro-81a410391/",
  "profile_summary": "Results-driven Senior Frontend Engineer with 10+ years of experience in crafting high-performance web applications and user-centric interfaces. Proficient in **JavaScript**, **TypeScript**, **Vue.js**, and **React**, utilizing **RESTful APIs** to ensure seamless integration and functionality. Well-versed in **CI/CD** practices and deployment strategies, adept at enhancing application performance through optimization techniques and component-based architectures. Skilled in frontend testing and implementing responsive, accessible, and usability-focused designs. Known for exceptional communication and organizational skills, successfully managing stakeholder expectations while delivering impactful projects.",
  "education": [
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2010",
      "to_year": "2015",
      "location": "Japan",
      "university": "Keio University"
    }
  ],
  "experience": [
    {
      "role": "Senior Frontend Engineer",
      "company": "Leobit",
      "from_date": "Aug 2022",
      "to_date": "Present",
      "location": "Poland",
      "responsibilities": "Designed and implemented innovative frontend solutions using **JavaScript**, **TypeScript**, **Vue.js**, and **React** to enhance user experience and streamline user onboarding processes.\nDeveloped **RESTful APIs** to facilitate seamless communication between frontend applications and backend services, ensuring efficient data retrieval in **< 200 ms**.\nEmployed best practices in **CI/CD** to automate deployment processes, achieving **95%** reduction in deployment time through optimized workflows.\nConducted frontend testing to enhance performance optimization, accessibility, responsiveness, and usability, achieving a **40%** increase in overall application responsiveness.\nArchitected component-based architectures to promote reusability and scalability within development teams, leading to improved collaboration and faster product iterations.\nSupervised and mentored junior engineers on optimizing frontend performance and enhancing styling practices to ensure adherence to design guidelines and enhance usability metrics.\nEngaged in effective communication and stakeholder management to ensure project alignment and to address system integration challenges swiftly."
    },
    {
      "role": "Software Engineer",
      "company": "Innovature",
      "from_date": "Nov 2018",
      "to_date": "Jun 2022",
      "location": "Japan",
      "responsibilities": "Developed dynamic frontend applications utilizing **JavaScript**, **TypeScript**, **Vue.js**, and **React** to create user-friendly interfaces that enhance usability and accessibility for a diverse user base.\nImplemented **RESTful APIs** to enable seamless communication between frontend applications and backend systems, ensuring efficient data flow and performance optimization.\nDesigned and executed CI/CD pipelines to automate deployment processes, enhancing efficiency by up to **40%** and reducing release times from **2 weeks** to **3 days**.\nConducted comprehensive frontend testing to guarantee high-quality deliverables and maintainable component-based architectures, achieving a test coverage of **85%**.\nOptimized frontend performance by creating scalable styling solutions, improving page load times by **30%** and ensuring responsiveness across various devices.\nCollaborated with stakeholders and cross-functional teams to manage project timelines and ensure alignment with organizational goals, fostering effective communication and organization throughout the development lifecycle.\n"
    },
    {
      "role": "Software Developer",
      "company": "Wizcorp",
      "from_date": "Apr 2015",
      "to_date": "Nov 2018",
      "location": "Japan",
      "responsibilities": "Developed user interfaces and experiences using **JavaScript**, **TypeScript**, **Vue.js**, and **React** to enhance user engagement and satisfaction.\nCollaborated with backend teams to integrate **RESTful APIs** ensuring seamless data exchange and user interaction with the platform.\nImplemented CI/CD practices to streamline deployment processes, enhancing time-to-market by **30%** and increasing code quality with automated testing.\nOptimized frontend performance with advanced techniques and strategies, achieving a **40%** improvement in load times and responsiveness.\nEnsured compliance with accessibility standards (WCAG) and usability metrics, improving user experience for a diverse audience by **50%**.\nConducted thorough frontend testing to guarantee application stability and reliability, resulting in a **20%** reduction in production bugs and issues.\nMaintained organized documentation and communication with stakeholders, enhancing project transparency and alignment across teams."
    }
  ],
  "skills": " **Programming Languages**,\n\tJavaScript, TypeScript, Python (3.8+), SQL, Bash\n\n**Backend Frameworks**,\n\tFastAPI, Flask, Django, Celery\n\n**Frontend Frameworks**,\n\tReact, Vue.js\n\n**API Technologies**,\n\tRESTful APIs, REST/gRPC APIs\n\n**Serverless and Cloud Functions**,\n\tAWS (EC2, S3, Lambda), Azure\n\n**Databases**,\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps**,\n\tDocker, Kubernetes, GitHub Actions, Azure DevOps, CI/CD\n\n**Cloud & Infrastructure**,\n\tAWS (EC2, S3, Lambda), Azure\n\n**Other**,\n\tAI/ML Tools: Pandas, NumPy, scikit-learn, TensorFlow, Airflow, MLflow, Microservices, Kafka, PyTest, Git, Unix, frontend testing, component-based architectures, performance optimization, scalable styling, accessibility, responsiveness, usability, communication, organization, stakeholder management",
  "apply_company": "Storyblok"
}