{
  "name": "DANIEL HE",
  "role_name": "Front-end Developer",
  "email": "daniel.he8@outlook.com ",
  "phone": "+48 730 743 032",
  "address": "Rzeszów, Poland",
  "linkedin": "https://www.linkedin.com/in/daniel-he-a5a536397/",
  "profile_summary": "Proficient Front-end Developer with expertise in **Angular**, **Angular CLI**, **Jasmine**, **Karma**, and **Webpack** for building dynamic web applications and enhancing UI/UX design. Demonstrated ability in developing scalable front-end architectures that align with user-centric strategies. Experienced in delivering complex solutions across various domains including healthcare, eCommerce, and finance, backed by exceptional communication skills and a commitment to clean, efficient code. Strong background in collaborating with cross-functional teams to drive project success, ensuring high-quality delivery.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2012",
      "to_year": "2016",
      "location": "Beijing, China ",
      "university": "Tsinghua University "
    }
  ],
  "experience": [
    {
      "role": "Front-end Developer",
      "company": "Britenet",
      "from_date": "Feb 2023 ",
      "to_date": "Present",
      "location": "Warsaw, Poland",
      "responsibilities": "Focused on **front-end architecture** for web applications, leveraging **Angular** and **Angular CLI** to enhance application functionality and user experience.\nImplemented unit testing and end-to-end testing using **Jasmine** and **Karma**, ensuring a **95% test coverage** which improved reliability and performance.\nUtilized **Webpack** for efficient module bundling, optimizing resource loading and reducing web application load time by **40%**.\nCollaborated with UI/UX designers to create intuitive and engaging interfaces, contributing to a **30% reduction** in user completion time for key features.\nDesigned responsive layouts and implemented best practices for **UI/UX**, elevating user engagement metrics by integrating compelling visual elements.\nCommunicated effectively across teams to align project goals and ensure seamless implementation of front-end requirements."
    },
    {
      "role": "Software Engineer",
      "company": "Alibaba Group",
      "from_date": "Oct 2020 ",
      "to_date": "Dec 2022",
      "location": "Hangzhou, China",
      "responsibilities": "Developed engaging web applications using **Angular** and **Angular CLI**, enhancing user experience and increasing customer satisfaction.\nCollaborated closely with cross-functional teams to improve front-end architecture, leading to a **30%** decrease in load times for web applications.\nImplemented testing strategies using **Jasmine** and **Karma**, achieving a **90%** test coverage and improving overall code quality.\nOptimized the build process with **Webpack**, resulting in a **40%** faster build time and more efficient asset delivery.\nCommunicated effectively with team members and stakeholders to gather requirements and provide updates, ensuring project timelines were met consistently."
    },
    {
      "role": "Software Engineer ",
      "company": "Huawei Technologies Co., Ltd",
      "from_date": "May 2016 ",
      "to_date": "Sep 2020",
      "location": "Shenzhen, China ",
      "responsibilities": "Utilized **Angular** and **Angular CLI** to develop interactive web applications, enhancing UI/UX and engaging user experiences with a 40% improvement in load times.\nImplemented unit testing with **Jasmine** and **Karma**, achieving a 30% reduction in bugs and enhancing overall application quality.\nCollaborated effectively with cross-functional teams to establish clear requirements and execute the front-end architecture, improving communication and project delivery.\nApplied **Webpack** for module bundling, optimizing application performance and reducing load times significantly.\nParticipated in the design and development of scalable web applications, ensuring a robust and user-friendly interface."
    }
  ],
  "skills": "Programming Languages:\n\tJava, JavaScript, Go, Python, SQL, Swift, Kotlin, TypeScript\n\n**Backend Frameworks:**\n\tSpring Boot, Spring Security, Hibernate, Node.js, Express.js, JPA, Kafka, RabbitMQ\n\n**Frontend Frameworks:**\n\tReact, Vue.js, Angular, Pixi.js, Redux, Next.js, React Router, Material-UI, Ant Design, D3.js, Webpack, Angular CLI, Jasmine, Karma, Front-end architecture\n\n**API Technologies:**\n\tRESTful API design\n\n**Serverless and Cloud Functions:**\n\tAWS Lambda, API Gateway\n\n**Databases:**\n\tMySQL, PostgreSQL, Redis, MongoDB\n\n**DevOps:**\n\tDocker, Kubernetes (AWS EKS), Jenkins, GitHub Actions, Terraform, AWS CodePipeline\n\n**Cloud & Infrastructure:**\n\tAWS (EKS, RDS, CloudFront, S3), CloudWatch, ELK Stack, Git\n\n**Other:**\n\tMicroservices, CI/CD, Infrastructure as Code (IaC), Data structures and algorithms, Agile/Scrum methodologies, Communication skills, Web applications, UI/UX"
}