{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Software Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-187801395/",
  "profile_summary": "Software Engineer with a robust background in **C++23**, **Rust**, and **Go**, bringing over 13 years of experience in software development. Proficient in **Linux OS architecture**, **Linux low-level development**, and **Linux kernel development**, with hands-on expertise in **kernel tracing** and **eBPF**. Experienced in working with the **Linux networking subsystem**, as well as leveraging **Docker** and **Kubernetes** for container orchestration.\n\nAdditionally, skilled in **Python** development, with a solid history of creating high-performance applications in the healthcare and financial sectors. Demonstrates a strong understanding of cloud-native system deployment, microservices architecture, and CI/CD practices. Proven ability to align solutions with compliance-driven standards, bringing original strengths in developing AI/ML-powered platforms for predictive analytics and automation.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Software Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Developed and maintained high-performance applications in **C++23**, **Rust**, and **Go**, ensuring adherence to best practices in Linux OS architecture and low-level Linux development.\nEngineered solutions leveraging **Docker** and **Kubernetes** for containerization and orchestration, facilitating scalable and fault-tolerant deployment strategies across environments.\nDesigned and implemented Linux kernel development activities, showcasing expertise in kernel tracing and eBPF for efficient monitoring and debugging of system performance.\nConducted thorough research and development on the **Linux networking subsystem**, optimizing network performance and reliability by integrating advanced protocol handling.\nCollaborated in cross-functional teams for building robust APIs and microservices, enhancing system interoperability and user experience while leading code reviews and fostering best development practices.\nAutomated development workflows using CI/CD techniques, delivering **9+** software releases monthly with a focus on high-quality standards and quick turnaround times.\nUtilized **Python** for scripting and automating various operational tasks, demonstrating versatility across programming languages to enhance development efficiency.\nParticipated in defining, enforcing, and evolving testing strategies for complex systems, leveraging cutting-edge testing tools and methodologies to ensure software reliability and performance."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "- Developed software components using **C++23**, **Rust**, and **Go**, ensuring high-performance and reliable applications in a Linux OS architecture.\n- Engaged in **Linux low-level development** and **kernel development**, contributing technical expertise to improve system stability and performance metrics.\n- Implemented **kernel tracing** techniques to optimize system performance and debug high-impact issues effectively.\n- Designed and executed solutions utilizing **eBPF** for advanced networking monitoring and performance enhancements in the Linux networking subsystem.\n- Created containerized applications using **Docker** and orchestrated them with **Kubernetes**, streamlining deployment processes and managing complex applications at scale.\n- Collaborated with teams to migrate legacy systems to microservices built on **Python**, improving overall code maintainability and scalability.\n- Conducted performance testing on applications, achieving up to **30%** reduction in processing time, thereby enhancing user experience and throughput\n- Utilized Agile methodologies to ensure timely delivery of projects, consistently meeting **100%** of deadlines in past **12 months**."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Leveraged **Python** expertise to design and optimize backend services, ensuring high availability and scalability on global platforms while incorporating **Docker** and **Kubernetes** for container orchestration and deployment.\nDeveloped efficient, low-level systems in **C++23**, **Rust**, and **Go**, focusing on Linux OS architecture and kernel development, achieving **40%** improvement in system performance for critical applications.\nImplemented kernel tracing techniques through **eBPF**, optimizing execution paths and reducing latency in core functionalities by **30%**.\nEngineered network solutions within the **Linux networking subsystem**, providing robust communication channels for distributed applications which improved throughput by **25%**.\nUtilized **Python** to create scalable applications, enhancing server utilization in cloud environments through effective resource management strategies.\nIntegrated **Docker** for streamlined deployment processes, achieving a **50%** reduction in build times and enabling efficient isolation of application dependencies.\nCollaborated with cross-functional teams to establish best practices in Linux low-level development, ensuring adherence to coding standards and fostering knowledge sharing among peers.\nDesigned and implemented features using modern frameworks that promote efficient resource allocation and minimize overhead, enhancing overall application efficiency.\nConducted performance profiling and optimization of existing applications, leading to a **15%** decrease in resource usage while maintaining high service availability and throughput.\nMaintained a strong focus on security by integrating best practices in application design and deployment, enhancing the overall integrity of the software environment."
    }
  ],
  "skills": "**Programming Languages:**\n\tC++23, Rust, Go, Python\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tOAuth2, JWT\n\n**Serverless and Cloud Functions:**\n\tAWS: ECS, Lambda, RDS, S3\n\tAzure: App Services, Blob Storage, SQL Database\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare)\n\tMongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes\n\tGitHub Actions, GitLab CI/CD\n\n**Cloud & Infrastructure:**\n\tTerraform, Ansible, Helm, Docker Compose\n\n**Other:**\n\tMLflow, Airflow, Kubeflow\n\tKeycloak (OIDC, RBAC)\n\tNginx, Let’s Encrypt, Certbot\n\tLinux OS architecture, Linux low-level development, Linux kernel development, kernel tracing, eBPF, Linux networking subsystem"
}