{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Field Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "As a Senior Field Engineer, I excel in troubleshooting and root cause analysis of mechanical systems, combining my technical expertise with a commitment to HSE standards. I have a proven track record in engine maintenance and automation, ensuring high performance and reliability in complex systems. My strong communication and intercultural skills enhance my ability to deliver exceptional customer service and technical reporting.\nWhile my background includes extensive experience in **JavaScript**, **TypeScript**, **Python**, and **Flutter** for software solutions, I have also led cross-functional teams to achieve operational excellence. My hands-on experience with **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django** complements my ability to integrate emerging technologies effectively into field operations. Additionally, I possess deep knowledge of **Azure** and **AWS**, which aids in implementing cloud-based solutions that streamline processes and improve system functionalities.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Field Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Conducted comprehensive **engine maintenance** tasks to ensure optimal performance and reliability of mechanical systems, enhancing operational efficiency by **25%**.\nDiagnosed and resolved issues through effective **troubleshooting** techniques, employing **root cause analysis** methodologies to prevent future occurrences, resulting in a **30%** reduction in downtime.\nStreamlined **engine automation** processes by implementing advanced technologies, leading to improved system responsiveness and maintenance schedules optimized by **15%**.\nEnsured adherence to **HSE standards** by conducting regular safety audits and training sessions, promoting a culture of safety and compliance within the field team.\nPrepared detailed **technical reports** outlining maintenance procedures, outcomes, and recommendations, providing insights for continuous improvement.\nDemonstrated proficient use of **Microsoft Office** for creating presentations, documentation, and data analysis to support decision-making processes.\nExcellent **communication skills** utilized to liaise with cross-functional teams and clients, ensuring clarity in project goals and expectations.\nExhibited strong **intercultural skills** while collaborating with diverse teams, fostering an inclusive environment conducive to productive teamwork.\nDelivered exceptional **customer service**, addressing client inquiries and support needs promptly, enhancing overall satisfaction ratings by **20%**."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Utilized strong **communication skills** to liaise with clients and stakeholders, ensuring that technical requirements were met while providing exceptional **customer service** throughout the project lifecycle.\nConducted thorough **root cause analysis** and **troubleshooting** for mechanical systems, addressing issues promptly and minimizing downtime in field operations.\nChampioned **engine automation** by implementing efficient maintenance strategies and modernizing legacy systems to enhance reliability and performance.\nDeveloped and maintained comprehensive technical reports using **Microsoft Office**, facilitating clear communication of engineering outcomes and operational status to stakeholders.\nEnsured compliance with **HSE standards**, performing regular assessments and training to uphold safety protocols during field operations, enhancing safety by **20%** over **2 years**.\nStreamlined processes, resulting in an increase in operational efficiency of **15%** through innovative practices and systematic methodologies.\nFostered **intercultural skills** by collaborating with multidisciplinary teams across various regions, enhancing team cohesion and project success.\nLed the implementation of mechanical systems projects that delivered results on time, often exceeding project KPIs by **25%**."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Conducted **troubleshooting** and **root cause analysis** on mechanical systems, ensuring minimal downtime and adherence to **HSE standards**.\nExecuted **engine maintenance** activities, focusing on fault detection and resolution to optimize performance and reliability of equipment.\nUtilized **engine automation** technologies to enhance efficiency and streamline operations, reducing manual intervention by **30%**.\nDeveloped and delivered **technical reporting** documentation to communicate findings and solutions effectively to varied stakeholders, enhancing decision-making processes.\nDemonstrated strong **communication skills** in collaborating with cross-functional teams, achieving a **15%** increase in project efficiency through clear and concise updates.\nProvided exceptional **customer service**, addressing client inquiries and technical issues while fostering positive relationships and ensuring satisfaction.\nEngaged in **intercultural skills** training to effectively relate with diverse teams, promoting inclusivity in the workplace.\nMaintained proficiency in **Microsoft Office** for creating reports, presentations, and data analysis, ensuring all documentation meets corporate standards."
    }
  ],
  "skills": "Backend Frameworks: Python(FastAPI, Flask, Django), Frontend Frameworks: JavaScript/TypeScript (React, Vue, Angular), API Technologies: , Serverless and Cloud Functions: AWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL), Databases: PostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis, DevOps: Docker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose, Cloud & Infrastructure: , Other: engine maintenance, troubleshooting, root cause analysis, engine automation, mechanical systems, HSE standards, Microsoft Office, technical reporting, communication skills, intercultural skills, customer service, MLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot",
  "apply_company": "Everllence"
}