{
  "name": "Patryk Zaslawski",
  "role_name": "Tech Lead / Senior Developer (.Net)",
  "email": "patrykzas0428@outlook.com",
  "phone": "+48669862402",
  "address": "Gdanski, Poland",
  "linkedin": "https://www.linkedin.com/in/patryk-z-107978395/",
  "profile_summary": "Skilled in developing robust applications using **.NET**, **ReactJS**, and **Azure**, I bring over 8 years of experience as a Senior Developer. My background in software engineering equips me with the capabilities to lead teams effectively, fostering **collaboration** and promoting **agility** within projects. I have a proven track record of delivering high-performance solutions, encapsulating my expertise in **DevOps** methodologies for streamlined processes and enhanced product delivery. My original strengths in **Python** (FastAPI, Django, Flask, SQLAlchemy), along with a solid foundation in frontend frameworks such as **Angular**, **Vue**, **Next.js**, and database optimization using **PostgreSQL**, **MySQL**, and **MongoDB**, contribute to creating secure and efficient applications tailored to business needs. I am committed to continuous **learning** and mentoring, ensuring that my team remains at the forefront of technology trends while achieving enterprise-grade results.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2014",
      "to_year": "2017",
      "location": "United Kingdom",
      "university": "The University of Manchester"
    }
  ],
  "experience": [
    {
      "role": "Tech Lead / Senior Developer (.Net)",
      "company": "Binary Studio",
      "from_date": "Aug 2023",
      "to_date": "Present",
      "location": "United Kingdom (Remote)",
      "responsibilities": "- Leveraged **.NET** technology to architect and develop cloud-native solutions, enhancing the efficiency of healthcare data management.\n- Championed **DevOps** practices by implementing CI/CD pipelines using Azure DevOps, reducing deployment times by **40%**.\n- Fostered team collaboration by leading a cross-functional team of 10+ engineers, emphasizing communication and teamwork in achieving project milestones.\n- Utilized **Azure** services to deploy scalable applications, ensuring high availability and resilience in cloud environments.\n- Implemented agile methodologies, promoting continuous learning and adaptability within the team.\n- Designed user interfaces using **ReactJS**, improving the user experience and increasing engagement by **30%**.\n- Developed and integrated secure APIs with **.NET**, facilitating seamless communication with third-party systems while ensuring compliance with regulatory standards.\n- Guided the transition towards modern microservices architecture, enhancing system scalability and maintainability.\n- Mentored junior developers in best coding practices, emphasizing the importance of collaboration and agile practices.\n- Collaborated with stakeholders across departments to gather requirements and deliver innovative solutions that meet evolving business needs.\n- Championed knowledge-sharing sessions around **.NET** technologies, fostering a culture of continuous improvement in technical skills."
    },
    {
      "role": "Software Engineer",
      "company": "Ardigen",
      "from_date": "Mar 2020",
      "to_date": "Aug 2023",
      "location": "Poland",
      "responsibilities": "- Utilized **.NET** frameworks to enhance existing applications improving scalability and performance in line with business strategies.\n- Led a team to develop and deploy solutions using **ReactJS** for responsive user interfaces, ensuring seamless user experiences across web applications.\n- Fostered effective **communication** and **collaboration** among team members and external stakeholders to align project objectives and enhance development processes.\n- Championed **agility** in project management practices, leading iterative development cycles to quickly adapt to changing market demands.\n- Ensured continuous **learning** and knowledge sharing within the team, promoting best practices and innovative solutions that led to a **15%** increase in productivity.\n- Mentored junior developers, providing guidance on **DevOps** practices and CI/CD methodologies to strengthen team capabilities and confidence in deployments.\n- Delivered high-quality software solutions by leading automated testing efforts through **.NET** and establishing performance benchmarks that reduced bug count by **30%**.\n- Enhanced team leadership through effective delegation and support, resulting in the successful on-time delivery of **5 major projects** over **12 months**.\n- Maintained strong client relationships, fostering collaboration that contributed to a **20% increase** in project renewal rates due to enhanced service delivery.\n- Spearheaded strategic planning sessions, focusing on aligning technical solutions with business goals, resulting in measurable improvements in customer satisfaction scores."
    },
    {
      "role": "Software Engineer",
      "company": "Altum Software",
      "from_date": "Oct 2017",
      "to_date": "Feb 2020",
      "location": "United Kingdom",
      "responsibilities": "Led a team in developing and optimizing backend services for an e-commerce platform utilizing **.NET** technologies, improving scalability and performance across various modules by **30%**.\nDrove the architecture of robust RESTful APIs in **.NET** for scalable frontend and backend integration, ensuring efficient real-time customer interactions.\nImplemented **Azure** DevOps for CI/CD pipelines to facilitate up to **50 deployments** per week while maintaining consistent code quality and reducing delivery time by **20%**.\nCollaborated cross-functionally with frontend teams using **ReactJS** to build dynamic, responsive interfaces integrated with backend services, enhancing user experience significantly.\nEnhanced team agility through effective communication and collaboration practices, resulting in a **40%** increase in project delivery speed.\nFostered a culture of continuous learning and adaptation within the team, leading to improved coding standards and practices.\nDesigned secure authentication mechanisms using **.NET** for customer access with RBAC and OAuth 2.0, ensuring compliant and secure transaction processing.\nEstablished code quality assessments through peer reviews and automated testing frameworks that reduced bugs by **25%** post-deployment.\nConducted regular knowledge transfer sessions and workshops, uplifting team's proficiency in modern tools and **.NET** frameworks.\nManaged performance testing initiatives with tools like Apache JMeter, identifying and addressing bottlenecks to handle peak traffic loads effectively, achieving up to **1000 concurrent users** support.\nOrchestrated successful migration projects from legacy systems to modern **.NET** architectures, minimizing disruptions and preserving critical workflows."
    }
  ],
  "skills": "Programming Languages:\n\t.NET, PHP, Python, SQL\n\n**Backend Frameworks:**\n\tFastAPI, Django, Flask, Spring Boot\n\n**Frontend Frameworks:**\n\tAngular (1–16), React (15–18), ReactJS, Next.js, Vue.js (2/3), Blazor\n\n**API Technologies:**\n\tREST & gRPC APIs\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD\n\n**Cloud & Infrastructure:**\n\tKeycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot\n\n**Other:**\n\tcommunication, collaboration, agility, learning, team leadership"
}