{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior System Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-152840397/",
  "profile_summary": "As a dedicated Senior System Engineer with 8 years of experience, I bring a wealth of expertise in Linux environments, particularly with **Red Hat**, **Suse**, and **Ubuntu** operating systems. I have a proven track record in high-performance solutions emphasizing service reliability, ensuring compliance with ITIL practices, and managing SLAs effectively. My technical skills encompass **Apache** web services, **MySQL** database management, and network protocols including **FTP**, **SMTP**, and **DNS**. \n\nI excel in scripting for system automation, monitoring service health with **Check_MK** and **Nagios**, and adeptly document processes for efficient team collaboration. My problem-solving capabilities ensure quick resolution of system issues while fostering teamwork to enhance overall productivity. Additionally, I possess strong communication skills in both **German** and **English**, enabling effective interactions with diverse teams. \n\nThroughout my career, I have successfully contributed to enterprise-grade platforms, emphasizing secure application development and aligning with compliance standards. My background in full-stack technologies, including **JavaScript**, **Python**, **React**, **Next.js**, and cloud services like **Azure** and **AWS**, allows me to bridge the gap between systems engineering and software development seamlessly.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior System Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Utilized **Linux** distributions including **Red Hat**, **Suse**, and **Ubuntu** to deploy and manage enterprise applications, ensuring high availability and performance.\n- Implemented monitoring solutions using **Nagios** and **Check_MK** to maintain system health and performance metrics for over **50** servers, establishing effective **SLAs**.\n- Developed and maintained robust **Apache** web server configurations to support application hosting, achieving an **uptime** of **99.9%** across multiple environments.\n- Employed **MySQL** for database management, optimizing queries to enhance data retrieval speeds by **30%** and ensuring compliance with documentation standards.\n- Automated system tasks through **scripting** languages, streamlining daily operations and reducing manual intervention by **40%**.\n- Collaborated with cross-functional teams to troubleshoot and resolve complex system issues, demonstrating exceptional **problem-solving** skills, and fostering **teamwork** to advance project goals.\n- Maintained documentation for system procedures and configurations, facilitating knowledge transfer and adherence to **ITIL** frameworks within the team.\n- Provided technical support for **FTP**, **SMTP**, and **DNS** administration, managing data transfers and ensuring secure communications for all team members.\n- Communicated effectively in both **German** and **English**, supporting diverse client bases and facilitating smoother project execution across multicultural teams."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "• Ensured system stability and reliability by managing Linux environments, specifically **Ubuntu** and **Red Hat**, while implementing ITIL best practices to adhere to SLAs in system uptime and performance for financial platforms.\n• Developed and maintained comprehensive documentation for system configurations and processes, facilitating knowledge sharing and mitigation of operational risks associated with **MySQL** database management and **Apache** web server configurations.\n• Employed scripting languages to automate routine tasks, enhancing operational efficiency and problem-solving capabilities while supporting the DevOps lifecycle.\n• Collaborated effectively within a cross-functional team, facilitating seamless integration and communication across various departments using both **German** and **English** to ensure project success.\n• Monitored system performance using tools like **Check_MK** and **Nagios**, resulting in immediate identification and resolution of issues, maintaining system integrity for high-volume transaction processing environments.\n• Implemented robust security protocols for FTP, SMTP, and DNS services, enhancing data protection and ensuring compliance with industry standards in all operational processes.\n• Established performance metrics and KPIs for system performance and user satisfaction, fostering a culture of continuous improvement within the engineering team."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Managed Linux-based server environments, including **Red Hat**, **SUSE**, and **Ubuntu**, to ensure optimal performance and security for backend services.\nConfigured and maintained **Apache** web servers, managing **FTP**, **SMTP**, and **DNS** protocols for seamless application and data access, achieving **99.9% uptime**.\nDeveloped and implemented monitoring solutions using **Check_MK** and **Nagios**, providing proactive alerting and system health checks, reducing downtime by **30%** through timely interventions.\nScripted automation tasks to enhance operational efficiency, utilizing shell scripting and other languages, which improved task completion times by **40%**.\nLed documentation efforts by creating comprehensive ITIL-aligned reference materials and process documentation, improving team onboarding processes and project transparency.\nCollaborated effectively in a team setting, leveraging **German** and **English** language skills to communicate technical information across diverse groups, facilitating smoother project workflows.\nApplied problem-solving skills to troubleshoot complex system issues, successfully resolving incidents within **SLA** standards to ensure continued service delivery.\n\nExercised strong teamwork in cross-functional projects, maximizing project outcomes while adhering to documentation and SLA requirements."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython(FastAPI, Flask, Django), JavaScript/TypeScript (React, Vue, Angular)\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tJWT, OAuth2, Keycloak (OIDC, RBAC)\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS, Azure\n\n**Other:**\n\tLinux, Red Hat, Suse, Ubuntu, Apache, FTP, SMTP, DNS, Squid, Check_MK, Nagios, Scripting, ITIL, SLA, Documentation, Problem-solving, Teamwork, German, English",
  "apply_company": "Sycor"
}