{
  "name": "Damian Franciszek Pospiech",
  "role_name": "AI Architect",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-187801395/",
  "profile_summary": "AI Architect with over 13 years of experience in cloud computing, specializing in **Azure**, **Azure AI**, and **AI/ML** solutions. Proficient in **C#**, **Python**, **TypeScript**, and MLOps methodologies, including model training and orchestration utilizing **MLflow** and **Airflow**. Expert in developing complex applications with **React**, **Node.js**, and **Django**, while focusing on CI/CD pipelines and Infrastructure as Code (IaC) using **Terraform** and **Bicep**.\nDemonstrated ability to implement data-driven strategies using **LangChain**, **Semantic Kernel**, and **RAG** techniques to enhance predictive analytics and automation workflows. Experienced in the deployment of microservices-based architectures leveraging **Docker** and **AKS** within Azure ecosystems. Exceptional communication and pre-sales skills, ensuring alignment with client requirements and regulatory compliance standards such as HIPAA and PCI DSS. Strong analytical and problem-solving capabilities, enhancing team dynamics and project outcomes.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "AI Architect",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Designed and built AI-driven solutions using **Python**, **C#**, and **TypeScript**, focusing on integrating **Azure AI** and **LLMs** into full-stack platforms.\n• Delivered cloud-based applications that utilize **Azure AI Search**, leveraging **cloud computing** principles for optimized performance and scalability.\n• Developed MLOps workflows with **Terraform**, **Docker**, and **Azure DevOps**, ensuring efficient model training and seamless deployment across different environments.\n• Implemented CI/CD pipelines using **GitHub Actions** and **Azure CLI**, automating testing, deployment, and release processes involving **Azure AI Foundry**.\n• Collaborated closely with cross-functional teams to design strategies for **RAG** and **LangChain**, enhancing application capabilities with intelligent features like semantic understanding.\n• Utilized **AKS** for deploying containerized applications, ensuring optimal resource management and fault tolerance in cloud environments.\n• Integrated advanced search capabilities with **Azure Cognitive Search**, enhancing data retrieval across structured and unstructured datasets by over **30%**.\n• Developed and maintained infrastructure as code (IaC) using **Bicep**, streamlining resource management and provisioning by **25%**.\n• Defined and enforced comprehensive testing strategies across the stack, utilizing **Postman** and automated testing frameworks to ensure application reliability with a coverage of over **90%**.\n• Engaged in pre-sales discussions, articulating technical aspects to clients and translating their needs into actionable specifications, leading to successful project acquisitions."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "- Architected cloud-based solutions leveraging **Azure** services to enhance system scalability and reliability, utilizing technologies such as **Azure AI**, **Terraform**, and **Docker** for infrastructure as code and deployment processes.\n- Designed and implemented machine learning pipelines using **MLOps** principles, integrating **Azure AI Foundry** and **Azure ML** for streamlined model development and deployment.\n- Developed advanced data models with **Python** and **C#**, implementing ETL workflows via **Azure Data Factory** and **Apache Airflow** to ensure seamless data integration and real-time analytics capability.\n- Built and maintained CI/CD pipelines using **GitHub Actions** and **Azure CLI**, ensuring efficient application deployment and continuous integration strategies for improved productivity.\n- Employed state-of-the-art AI techniques including **LangChain** and **RAG** to enhance data processing and decision-making capabilities in enterprise applications.\n- Led workshops and training sessions focusing on the use of semantic technologies and **Azure AI Search**, driving innovation in user experience and data accessibility.\n- Advocated best practices in cloud computing and solution architecture, fostering effective communication among diverse teams to align technological solutions with business goals.\n- Demonstrated expertise in building RESTful APIs with **Python** (FastAPI, Django) and **TypeScript** (Node.js), driving successful integration with external services and third-party tools.\n- Delivered compelling presentations and technology demos, effectively communicating complex concepts and value propositions to stakeholders and clients."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "- Utilized **Azure AI**, **Azure AI Search**, and **LLMs** to design and optimize intelligent backend services that enhance user experiences and leverage AI-driven insights for a leading e-commerce platform.\n- Developed AI/ML-based recommendation engines utilizing **Python** and frameworks like **LangChain** and **Semantic Kernel**, resulting in a **15%** increase in conversion rates through personalized product suggestions.\n- Implemented **MLOps** and CI/CD practices to ensure rapid deployment and integration of machine learning models using **Docker** and **GitHub Actions**, achieving deployment times reduced by **30%**.\n- Employed **Cloud computing** strategies with a focus on **Azure** services to orchestrate scalable and resilient cloud architecture, supporting global user demands and high traffic.\n- Implemented Infrastructure as Code (IaC) using **Terraform** and **Bicep** for efficient resource provisioning in **Azure**, streamlining environments setup by **40%**.\n- Designed and maintained APIs using **Python** (Django, FastAPI) and **C#** for seamless integration between various services and third-party tools like **Postman**, ensuring **99.9%** uptime and performance.\n- Leveraged **Azure CLI** and **PowerShell** for infrastructure automation and monitoring, enhancing operational efficiency and reducing manual errors by **25%**.\n- Collaborated in pre-sales efforts to articulate technical solutions using **GitHub Copilot**, enhancing communication with stakeholders and potential clients regarding intricate AI architectures.\n- Created user-friendly interfaces and applications using **TypeScript**, ensuring adherence to development best practices and significantly improving user engagement.\n- Developed comprehensive documentation and conducted technical workshops to support teams in understanding AI integration, resulting in improved project collaboration and knowledge sharing."
    }
  ],
  "skills": "**Programming Languages:**\n\tPython, C#, TypeScript\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tPostman\n\n**Serverless and Cloud Functions:**\n\tAWS: ECS, Lambda, RDS, S3\n\tAzure: App Services, Blob Storage, SQL Database, Azure AI, Azure AI Foundry, Azure AI Search\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tCloud computing, IaC, Azure CLI, PowerShell, AKS\n\n**Other:**\n\tMLOps, MLflow, Airflow, Kubeflow, GitHub Copilot, Pre-sales skills, Communication, Nginx, Let’s Encrypt, Certbot, Visual Studio, Bicep, RAG, LangChain, Semantic Kernel, CI/CD, Visio"
}