{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Machine Learning Engineer (GraphRAG & Retrieval Tools)",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-karol-kotlinski-bb2520397/",
  "profile_summary": "Results-driven Senior Machine Learning Engineer with 8 years of experience in **Python**, **Pandas**, **PyTorch**, and **scikit-learn**. Specializing in innovative machine learning solutions including **Graph Data Science**, **Graph Neural Networks (GNNs)**, and **Link Prediction** techniques. Proven proficiency in designing and developing **Text-to-Query models** and **Retrieval-Augmented Generation (RAG)** systems. My technical background is complemented by extensive experience with **FastAPI**, **Docker**, and API development, ensuring seamless integration and deployment of models.\n\nI excel in building high-performance applications particularly in the healthcare and financial sectors, adopting best practices in microservices architecture and CI/CD automation. I have a strong customer-centric mindset, with a commitment to compliance with industry standards such as HIPAA and PCI DSS. Additionally, I possess excellent collaboration and communication skills, which enable me to work effectively within cross-functional teams, driving impactful solutions that meet user needs.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Machine Learning Engineer (GraphRAG & Retrieval Tools)",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Designed and deployed machine learning models specifically leveraging **Graph Data Science** techniques, including **Graph Neural Networks (GNNs)**, for tasks such as link prediction and retrieval-augmented generation.\nArchitected and implemented **Retrieval-Augmented Generation (RAG)** systems and **Text-to-Query** models using **Python**, **PyTorch**, and **scikit-learn**, enhancing user interaction and information retrieval across applications.\nDeveloped comprehensive data pipelines to automate querying and processing of complex datasets using **Pandas**, facilitating efficient data management and analysis.\nCollaborated effectively with cross-functional teams, including data scientists, to integrate advanced **NLP models** and machine learning algorithms for healthcare document parsing and financial anomaly detection, ensuring robust application performance.\nLed architectural initiatives employing **FastAPI** to create scalable APIs, providing a robust interface for machine learning models and integrating with upstream and downstream systems.\nUtilized **Docker** for containerization of applications, enhancing deployment flexibility and enabling seamless transition among different environments and cloud services.\nMaintained a customer-centric mindset, focusing on delivering solutions that meet end-user needs and improve overall experience through technical innovation.\nEstablished strong communication skills through regular presentations and documentation of project developments, ensuring alignment and transparency among stakeholders.\nImplemented test strategies using frameworks like Jest and PyTest to ensure quality and reliability across machine learning components, covering unit, integration, and system testing.\nSupported the development of developer-friendly libraries for ease of use and accessibility in machine learning tools, promoting adoption and effective utilization of technology among fellow engineers and data scientists."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Utilized **Python** and **scikit-learn** to develop and integrate AI/ML models in reporting dynamic user analytics, improving insights gathering by **30%**.\nImplemented **Graph Neural Networks (GNNs)** to enhance fraud detection systems, resulting in the accurate identification of suspicious activities with a **25%** reduction in false positives.\nDesigned knowledge graph frameworks for better data representation, incorporating **Cypher** to enable efficient querying and linked data management.\nCollaborated with cross-functional teams to deploy machine learning solutions with an emphasis on a **customer-centric mindset**, ensuring alignment with user needs and operational objectives.\nEngineered dynamic APIs using **FastAPI** to facilitate seamless integration of ML models into existing applications, achieving a **40%** faster response time for client queries.\nLeveraged **Pandas** for data manipulation and preprocessing to improve model training times by **15%**, optimizing overall processing workflows.\nEmployed **PyTorch** to build and refine deep learning models aimed at link prediction and retrieval-augmented generation, driving a data-driven approach to product improvements.\nExecuted containerization strategies using **Docker** to streamline the deployment process of ML tools, enhancing the overall scalability of applications."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Leveraged **Python** and **scikit-learn** to design and develop machine learning models focused on **Graph Neural Networks (GNNs)** for advanced link prediction, optimizing performance to achieve a **95% accuracy** rate.\nUtilized **Pandas** for extensive data analysis and preprocessing, cleaning datasets of up to **1 million rows** to ensure robust training for text-to-query models and retrieval-augmented generation (RAG) methodologies.\nImplemented real-time querying with **APIs** to enhance customer interactions and support seamless communication between machine learning models and frontend applications, leading to a **30% increase** in user engagement metrics.\nEmployed **Docker** for containerization of machine learning applications, resulting in a **40% reduction** in deployment times and simplified management of development environments.\nDeveloped collaborative tools and frameworks that informed team projects and directed focus towards user-centric design, enhancing the overall project efficiency by **25%**.\nEngaged with cross-functional teams to articulate complex machine learning concepts and project outcomes, leveraging strong communication skills to ensure alignment on key objectives and deliverables.\nContributed to customer-centric innovations by integrating retrieval tools that improved the accuracy of search results and recommended products based on behavior, increasing conversion rates by **20%**.\nApplied best practices in automated querying strategies, enhancing workflow efficiency and ensuring user-friendly interactions with complex datasets across various platforms.\nManaged role-based access control (RBAC) and incorporated **OAuth 2.0** for secure user access on machine learning applications, ensuring compliance with modern data protection standards such as **GDPR**."
    }
  ],
  "skills": " **Programming Languages:** \n\tPython, JavaScript/TypeScript \n\n **Backend Frameworks:** \n\tFastAPI, Flask, Django \n\n **Frontend Frameworks:** \n\tReact, Vue, Angular \n\n **API Technologies:** \n\tAPIs \n\n **Serverless and Cloud Functions:** \n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL) \n\n **Databases:** \n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis \n\n **DevOps:** \n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose \n\n **Cloud & Infrastructure:** \n\tAWS, Azure \n\n **Other:** \n\tMachine Learning, Graph Data Science, Knowledge Graphs, Graph Neural Networks (GNNs), Link Prediction, Cypher, Text-to-Query models, Retrieval-Augmented Generation (RAG), Pandas, PyTorch, scikit-learn, MLflow, Airflow, Kubeflow, Authentication & Security (Keycloak, JWT, OAuth2, Let’s Encrypt, Nginx, Certbot), Automated Querying, Collaboration skills, Communication skills, Customer-centric mindset"
}