{
  "name": "Patryk Zaslawski",
  "role_name": "Mobile Engineer",
  "email": "patrykzas0428@outlook.com",
  "phone": "+48669862402",
  "address": "Gdanski, Poland",
  "linkedin": "https://www.linkedin.com/in/patryk-zaslawski-6b04a8397/",
  "profile_summary": "As a Mobile Engineer with a strong background in Agile development methodologies such as Scrum and Kanban, I excel in developing high-performance mobile applications using Swift and Kotlin. I am well-versed in design principles including S.O.L.I.D., D.R.Y., and modular architecture, ensuring scalable and maintainable code. My experience encompasses Test-Driven Development (TDD) and Behavior-Driven Development (BDD), allowing me to deliver robust solutions. I thrive in DevOps environments and promote effective team collaboration through excellent communication skills. My original strengths lie in my extensive software engineering background, where I have applied diverse skill sets and frameworks to create impactful applications.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2014",
      "to_year": "2017",
      "location": "United Kingdom",
      "university": "The University of Manchester"
    }
  ],
  "experience": [
    {
      "role": "Mobile Engineer",
      "company": "Binary Studio",
      "from_date": "Aug 2023",
      "to_date": "Present",
      "location": "United Kingdom (Remote)",
      "responsibilities": "• Developed mobile applications using **Swift** and **Kotlin**, ensuring adherence to **S.O.L.I.D.** principles, resulting in a 30% reduction in code complexity.\n• Implemented design patterns like **MVVM**, **MVP**, and **VIPER** to enhance maintainability and modular architecture, driving a 25% increase in development speed.\n• Champion of **TDD** and **BDD**, establishing a robust testing framework that improved application reliability by 40% through the use of automated test suites.\n• Collaborated in an **agile development** environment, utilizing **Scrum** and **Kanban** methodologies, achieving sprint goals with 95% team satisfaction.\n• Fostered effective communication and team collaboration among cross-functional teams, leading to a 20% increase in overall productivity.\n• Integrated continuous integration and continuous delivery (CI/CD) practices, reducing deployment times by 50% and enhancing version control.\n• Mentored junior developers in mobile development best practices and architectural patterns, resulting in a more skilled and cohesive team.\n• Led code reviews and provided constructive feedback, contributing to the maintenance of high coding standards and a significant reduction in technical debt.\n• Utilized popular libraries and frameworks to streamline development processes, optimizing application performance by incorporating best practices and latest technologies."
    },
    {
      "role": "Software Engineer",
      "company": "Ardigen",
      "from_date": "Mar 2020",
      "to_date": "Aug 2023",
      "location": "Poland",
      "responsibilities": "- Applied **agile development** methodologies such as **Scrum** and **Kanban** to enhance team collaboration and project delivery.\n- Ensured clean code by implementing **S.O.L.I.D.** principles, **D.R.Y.** principles, and choosing **modular architecture** for scalable mobile app development.\n- Led cross-functional teams in the development of mobile applications using **Swift** and **Kotlin**, successfully launching **3** major app updates that improved user engagement by **25%**.\n- Developed and maintained mobile application features adhering to **MVVM**, **MVP**, and **VIPER** architectural patterns, resulting in a **30%** reduction in code complexity.\n- Utilized **TDD** and **BDD** approaches to establish reliable code through automated tests, decreasing bug rates in production by **20%**.\n- Fostered effective communication within teams and across departments, leading to enhanced product quality and timely delivery of **5** projects annually.\n- Collaborated with backend teams to implement APIs that significantly improved data performance and synchronization between mobile apps and servers.\n- Contributed to a culture of continuous improvement by incorporating **DevOps** practices into the development workflow, which streamlined deployment processes.\n- Actively participated in code reviews, enhancing the coding standards and knowledge sharing within the mobile engineering team."
    },
    {
      "role": "Software Engineer",
      "company": "Altum Software",
      "from_date": "Oct 2017",
      "to_date": "Feb 2020",
      "location": "United Kingdom",
      "responsibilities": "- Applied **S.O.L.I.D.** principles and **D.R.Y.** methodology in mobile application development, ensuring clean, maintainable code with a focus on scalability and performance.\n- Developed mobile applications using **Swift** and **Kotlin**, ensuring adherence to **MVVM**, **MVP**, and **VIPER** architectural patterns for improved application structure.\n- Employed **modular architecture** to enhance project organization, enabling efficient collaboration among team members by facilitating independent development and testing of modules.\n- Implemented **TDD** and **BDD** practices to ensure code quality and reliability, resulting in a **30%** reduction in bugs during the production phase.\n- Leveraged **DevOps** tools and practices to automate CI/CD pipelines, significantly increasing deployment frequency by **40%** and reducing lead time for changes.\n- Actively participated in **agile development** methodologies, including **Scrum** and **Kanban**, to improve team workflow and deliver updates in a timely manner.\n- Collaborated with cross-functional teams, demonstrating strong **communication skills** to ensure project goals were met effectively and on schedule.\n- Contributed to team collaboration efforts through code reviews and pair programming sessions, enhancing the skill set of all team members by sharing knowledge and best practices.\n- Utilized version **3.0** of Swift and **4.1** of Kotlin in application development, ensuring the use of modern features and improvements.\n- Mentored junior developers, fostering a culture of continuous learning and exploration of new techniques and technologies in mobile engineering."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, Swift, Kotlin\n\n **Backend Frameworks:**\n\tFastAPI, Django, Flask, Spring Boot\n\n **Frontend Frameworks:**\n\tAngular (1–16), React (15–18), Next.js, Vue.js (2/3), Blazor\n\n **API Technologies:**\n\tREST & gRPC APIs\n\n **Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n **Databases:**\n\tSQLAlchemy, Pydantic, Celery, PostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD\n\n **Cloud & Infrastructure:**\n\tNginx, Certbot, Let’s Encrypt\n\n **Other:**\n\tKeycloak (OIDC, RBAC), JWT, OAuth2, S.O.L.I.D., D.R.Y., MVVM, MVP, VIPER, modular architecture, TDD, BDD, agile development, Scrum, Kanban, communication skills, team collaboration"
}