{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Frontend Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-152840397/",
  "profile_summary": "Results-driven Senior Frontend Engineer with 8 years of extensive experience in creating high-performance web applications using **React**, **TypeScript**, **Next.js**, and **GraphQL**. Proficient in modern frontend technologies including **Contentful**, **Material UI**, **Tailwind**, as well as testing frameworks like **Jest** and **React Testing Library**. Skilled in utilizing **Cypress** for end-to-end testing and optimizing build processes with **Webpack** and **Vite**. I have a solid track record in delivering scalable solutions, utilizing cloud services such as **AWS** and deploying via **Vercel**.\n\nIn addition to my frontend expertise, I have substantial experience in backend technologies, including **FastAPI** and **Django**, which supports my comprehensive understanding of full-stack development. My strong foundation in agile methodologies, including CI/CD processes, allows me to efficiently manage project timelines while ensuring code quality and compliance with industry standards. I am adept at collaborating cross-functionally to build user-centric interfaces that enhance overall user experience.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Frontend Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Developed scalable and high-performance web applications utilizing **React** (17-18), **TypeScript**, and **Next.js**, enhancing user experience and accessibility.\n- Implemented robust testing strategies with **Jest**, **Cypress**, and **React Testing Library** to ensure code quality and application reliability across both front-end and back-end services.\n- Constructed responsive and visually appealing UI components using frameworks such as **Material UI**, **Tailwind**, and **Storybook**, thereby improving overall application aesthetics and user interaction.\n- Integrated **GraphQL** for efficient data fetching and management, optimizing API interactions for enhanced performance and user experience.\n- Collaborated on the deployment of applications using cloud services such as **Vercel** and **AWS**, ensuring high availability and scalability of the applications developed.\n- Utilized **Webpack** and **Vite** for modern module bundling and to streamline development processes, leading to quicker build times and improved developer productivity.\n- Led efforts to incorporate advanced content management systems like **Contentful**, providing flexible and scalable content delivery solutions for web applications.\n- Established comprehensive test plans and automated testing workflows that resulted in a **30%** reduction in deployment issues, enhancing overall efficiency.\n- Mentored junior developers in best practices for front-end development, fostering a culture of continuous improvement and collaboration within the team.\n- Analyzed user feedback and application metrics to iterate on features, leading to a **40%** increase in user engagement and satisfaction scores.\n- Assisted in the migration and refactoring of legacy systems to modern frameworks, achieving a **50%** improvement in application load time and performance."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "• Developed dynamic, user-focused front-end applications using **React (18)**, **Next.js**, and **TypeScript**, ensuring high-performance and responsive design for financial dashboards and admin portals.\n• Implemented thorough unit testing and behavior-driven development using **Jest** and **React Testing Library** to ensure robust application quality and reliability.\n• Utilized **Tailwind CSS** for streamlined styling and **Material UI** for enhanced component implementation, ensuring seamless user experience across all platforms.\n• Integrated **GraphQL** APIs to improve data-fetching efficiency and facilitate better communication with back-end services.\n• Created component libraries using **Storybook** for consistent UI development and documentation to enhance team collaboration and onboarding processes.\n• Executed efficient build processes using **Webpack** and **Vite**, leading to a reduction in overall load times by **20%**.\n• Employed **Cypress** for end-to-end testing workflows, ensuring application stability and performance across various user scenarios.\n• Deployed applications seamlessly to production using **Vercel**, ensuring reliable delivery and scalability under high user demand.\n• Collaborated closely with backend engineers to enhance API structures, facilitating smoother integration and transaction processes within financial applications."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Developed responsive, SEO-friendly frontend applications using **React (18)**, **Next.js**, and **TypeScript**, ensuring compliance with accessibility standards (WCAG 2.1) and achieving a 95% score on performance metrics.\nImplemented robust API integrations using **GraphQL**, vastly improving data fetching efficiency and reducing loading times by 30% on key pages.\nCrafted scalable component libraries with **Storybook**, enhancing UI consistency and accelerating development processes across teams by 40%.\nUtilized **Material UI** and **Tailwind CSS** to design aesthetically pleasing and user-centric interfaces, achieving a 20% increase in user engagement on critical application features.\nEmployed testing frameworks, including **Jest**, **React Testing Library**, and **Cypress**, to ensure 100% test coverage and maintain application quality during continuous integration and deployment cycles.\nConfigured build processes using **Webpack** and **Vite** to optimize application performance, decreasing bundle size and improving load times by 25%.\nLeveraged cloud services like **AWS** and **Vercel** for seamless deployment and hosting, ensuring high availability and quick response times for users across multiple regions.\nCollaborated closely with backend engineers to implement asynchronous data handling and state management using **Redux Toolkit**, resulting in a 15% improvement in application responsiveness and performance.\nInitiated code reviews and design discussions to maintain best practices and elevate code quality, leading to a reduction in production bugs by 50% over two release cycles."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, JavaScript, TypeScript\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django, Next.js\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular, Contentful, Material UI, Tailwind, Storybook\n\n**API Technologies:**\n\tGraphQL, API\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL), Vercel\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, CI/CD & Infrastructure as Code (Terraform, Ansible, Helm, Docker Compose)\n\n**Cloud & Infrastructure:**\n\tAWS, Azure\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, JWT, OIDC, RBAC, OAuth2, Let’s Encrypt, Nginx, Certbot, Jest, React Testing Library, Cypress, Webpack, Vite",
  "apply_company": "Plan A Technologies"
}