{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Sales Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "Results-driven Senior Sales Engineer with 8 years of experience in leveraging **AWS** and **Azure** cloud services to design scalable and secure solutions. Proficient in cloud networking, storage, and security tools, with an extensive background in problem-solving and solution design tailored to meet client needs in the healthcare and financial sectors. \nAs a Full Stack Developer, I possess strong technical skills in **JavaScript/TypeScript**, **Python**, **Flutter**, and frameworks such as **React**, **Next.js**, and **Vue**. My experience in managing enterprise-grade platforms and deep knowledge of compliance standards like HIPAA and PCI DSS enhances my ability to deliver client-focused solutions. Additionally, my background includes building robust architectures with **microservices** and implementing CI/CD automation, further contributing to streamlined development processes. I am equipped to effectively communicate complex technical concepts to stakeholders while driving successful adoption of innovative technologies.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Sales Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Demonstrated expertise in **AWS** and **Azure** cloud services to design and implement scalable cloud solutions, enhancing deployment strategies on both Windows and Linux environments.\nUtilized strong problem-solving skills to identify and resolve customer challenges, delivering tailored solutions that align with specific requirements and industry standards.\nDeveloped comprehensive solution designs for cloud networking, ensuring optimal performance, security, and compliance with organizational protocols.\nImplemented effective IAM strategies to manage user access and identity, fortifying the security perimeter of client infrastructure.\nProvided backup and disaster recovery consultative services, ensuring business continuity and mitigating risks associated with data loss.\nEngaged with clients to gather requirements, presenting customized demonstrations showcasing the capabilities of cloud and cybersecurity solutions.\nCollaborated with cross-functional teams to integrate various security tools, enhancing the overall defense mechanism against potential cyber threats.\nConducted impactful client training sessions on operating systems overlay and cloud technologies, effectively increasing team proficiency and confidence.\nLeveraged industry best practices to contribute to pre-sales solutions architecture, ensuring scalability and performance meet client expectations.\nConsistently monitored emerging technologies and trends, advising clients on innovative solutions to future-proof their systems.\nReported on project statuses, development milestones, and compliance with project timelines, ensuring transparent communication with stakeholders."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "- Designed and implemented innovative solutions leveraging **AWS** and **Azure** cloud services, ensuring optimal cloud networking and security for client operations.\n- Developed robust disaster recovery (DR) strategies and backup solutions using **cloud services**, enhancing business continuity and reliability for customer systems.\n- Utilized extensive knowledge of **Windows** and **Linux** environments to troubleshoot and resolve complex technical issues while providing strategic solutions for clients.\n- Conducted comprehensive assessments to implement IAM (Identity and Access Management) protocols, ensuring secure access to cloud resources across various platforms, improving security tools integration.\n- Solved critical problem-solving challenges by designing tailored solutions for diverse client needs, ultimately increasing customer satisfaction and retention rates.\n- Led technical presentations and solution design discussions, showcasing the benefits of cloud-based solutions and addressing client requirements directly to improve sales and engagement.\n- Collaborated with cross-functional teams to integrate security frameworks and tools into cloud architectures, aligning project goals with best practices in cloud security.\n- Championed effective communication between technical teams and customers, resulting in a **30%** increase in client adoption rates of cloud solutions across projects.\n- Successfully managed **5** large-scale cloud projects simultaneously, directing resource allocation and project milestones to enhance operational efficiency."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Leveraged **AWS** and **Azure** for cloud networking solutions, ensuring scalable and secure deployments across multiple environments, resulting in a **30%** reduction in operational costs for clients.\nDesigned and implemented robust problem-solving frameworks using **Linux** and **Windows** systems to tackle complex client issues, achieving an **95%** client satisfaction rate based on post-implementation surveys.\nEngineered solution designs integrating various **security tools** and policies to enhance platform security, achieving **100%** compliance with GDPR and other relevant security standards.\nManaged data archiving and disaster recovery (DR) strategies, utilizing **backup** processes to ensure data integrity and availability, successfully preventing data loss in **99.9%** of scenarios.\nUtilized Identity and Access Management (**IAM**) techniques for establishing role-based access control (RBAC) systems, optimizing user permissions and minimizing security risks across distributed platforms.\nCreated and deployed business continuity plans incorporating **cloud storage** solutions, enabling seamless access and restoration of critical business data, and reducing downtime to less than **1 hour**.\nDeveloped tailored presentations and demonstrations showcasing technology solutions, resulting in securing **20 new clients** within the past quarter through effective communication and problem-solving skills.\nCollaborated with cross-functional teams to identify customer requirements and deliver innovative, solution-oriented strategies that improved operational efficiency and performance by an average of **15%**."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, JavaScript/TypeScript\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n **Frontend Frameworks:**\n\tReact, Vue, Angular\n\n **API Technologies:**\n\tJWT, OAuth2, Keycloak (OIDC, RBAC)\n\n **Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n **Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Helm, Terraform, Ansible\n\n **Cloud & Infrastructure:**\n\tWindows, Linux, Cloud networking, IAM, Storage, Security tools, DR, Backup\n\n **Other:**\n\tMLflow, Airflow, Kubeflow, Problem-solving, Solution design",
  "apply_company": "Cloud Bridge"
}