{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Data Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "As a Senior Data Engineer with 8 years of experience, I bring a robust skill set in **Python**, **Machine Learning**, and **AI**, complemented by expertise in **Deep Learning** and **Large Language Models (LLM)**. I have a strong foundation in **cloud technologies** spanning **Azure** and **AWS**, ensuring the deployment of scalable and secure solutions. My background includes leading initiatives in **Cybersecurity** and developing enterprise applications that adhere to strict compliance standards. \nI excel in the design and implementation of machine learning pipelines, leveraging frameworks and tools such as **FastAPI** and **TensorFlow** to serve models within large-scale environments. Additionally, I possess hands-on experience with GPU-accelerated workloads, enhancing performance for computationally intensive tasks. My capabilities are further enriched by a commitment to mentoring team members and fostering effective communication within technical projects.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Data Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Developed and deployed machine learning models using **Python** and **Deep Learning** frameworks for various healthcare and financial applications, ensuring high accuracy in patient risk prediction and financial fraud detection.\n- Led the integration of AI capabilities into client-facing applications, enhancing functionality with features such as personalized health recommendations and predictive alerts, utilizing **GPU** resources for optimized model performance.\n- Designed cloud-native data architectures leveraging **Cloud Technologies** to facilitate large-scale data ingestion, processing, and storage, ensuring seamless handling of healthcare and financial datasets.\n- Implemented enterprise-level DevOps pipelines utilizing **Cloud Technologies** (e.g., Azure DevOps, CircleCI) to streamline deployment and ensure cybersecurity measures are in place for sensitive data.\n- Mentored junior engineers, fostering knowledge sharing in **Machine Learning** and **AI** techniques to enhance team capabilities and project outputs.\n- Communicated effectively with cross-functional teams to align project goals with organizational requirements, ensuring clarity and shared understanding on technical specifications and challenges.\n- Conducted regular code reviews and established best practices for model development and deployment, enhancing overall code quality and performance metrics (e.g., reduced deployment times by **30%**).\n- Implemented test strategies using frameworks like **PyTest** to ensure the robustness of machine learning applications and adherence to quality standards throughout development cycles.\n- Utilized advanced computational resources including **GPU** instances in cloud environments for training and inference of machine learning models, increasing throughput by **50%** compared to previous setups."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Utilized **Python** to develop and optimize data processing workflows within cloud environments, contributing to enhanced performance for high-volume financial transactions.\nApplied AI and Machine Learning techniques to build predictive models, such as credit scoring and churn prediction, using frameworks like **scikit-learn** and **XGBoost**, achieving an accuracy improvement of **15%** over previous models.\nEngaged in mentoring junior engineers, improving their technical skills in **Deep Learning**, **AI**, and various **Cloud Technologies**, fostering a collaborative and knowledge-sharing team culture.\nEmployed **Azure Machine Learning** for deploying machine learning models, thereby facilitating real-time decision-making by integrating model inference into backend services.\nImplemented security measures aligned with **Cybersecurity** best practices to ensure data integrity and protection within financial systems, reducing vulnerability exposure by **30%**.\nLed effective communication efforts to coordinate with cross-functional teams on data engineering projects, ensuring clear expectations and alignment for successful project delivery.\nIntroduced enhanced monitoring capabilities using **D3.js** and **Power BI Embedded**, enabling operations teams to generate actionable insights and track anomalies, which improved response time to financial incidents by **25%**."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Utilized **Python** alongside **Deep Learning** frameworks to design and optimize backend services for a global e-commerce platform, ensuring high availability and scalability for essential modules.\nImplemented AI and **Machine Learning** algorithms to enhance user experience through personalized recommendations and real-time features, leveraging scalable cloud technologies.\nLed data pipeline projects utilizing **GPU** acceleration for processing large datasets, effectively improving model training and execution times, contributing to a **30%** increase in processing efficiency.\nConducted mentoring sessions for junior engineers, fostering a collaborative environment and enhancing team communication skills, resulting in **40%** faster onboarding processes.\nIntegrated cybersecurity best practices into the architecture to safeguard user data, applying **OAuth 2.0** for secure access management, ensuring compliance with GDPR regulations.\nEngineered real-time features using event-driven architecture powered by **Kafka** and **RabbitMQ**, achieving a **50%** reduction in overall latency for order updates and dynamic inventory tracking.\nDeveloped backend services deploying AI/ML models with **TensorFlow** and **scikit-learn**, enhancing search relevance and improving conversion rates based on real-time behavioral data analytics.\nDesigned secure, tokenized payment workflows integrated with **Stripe** and **PayPal**, ensuring **100%** PCI compliance in handling sensitive customer information."
    }
  ],
  "skills": "****Programming Languages: \n\tPython\n\n****Backend Frameworks: \n\tFastAPI, Flask, Django\n\n****Frontend Frameworks: \n\tJavaScript/TypeScript (React, Vue, Angular)\n\n****API Technologies: \n\tNginx, JWT, OAuth2\n\n****Serverless and Cloud Functions: \n\tAWS (ECS, Lambda), Azure (App Services)\n\n****Databases: \n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n****DevOps: \n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n****Cloud & Infrastructure: \n\tAWS (RDS, S3), Azure (Blob, SQL)\n\n****Other: \n\tDeep Learning, LLM, GPU, AI, Machine Learning, Cybersecurity, Keycloak (OIDC, RBAC), MLflow, Airflow, Kubeflow, Mentoring, Communication, Let’s Encrypt, Certbot",
  "apply_company": "Undelucram.ro"
}