{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Full Stack Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Senior Full Stack Engineer with 13+ years of experience delivering high-performance applications across the healthcare and financial industries. Highly skilled in **JavaScript**, **TypeScript**, **React**, and **PHP**, with a solid foundation in **HTML5**, **CSS**, and **MySQL**. Proven expertise in developing and maintaining applications using **Laravel** and advanced **CI/CD** practices, ensuring robust deployment pipelines and quality-driven software through **TDD**. \nDemonstrated experience in implementing cloud-native solutions on **Kubernetes** and **Docker**, agile methodologies, and event-driven architectures. Committed to fostering team collaboration, mentoring junior developers, and maintaining compliance with industry standards (HIPAA, FHIR, PCI DSS, and SOC 2). Strong background in building AI/ML-powered platforms with a focus on predictive analytics, automation, and real-time processing.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Full Stack Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Developed high-quality web applications utilizing **React** and **TypeScript**, ensuring efficient component rendering and state management through best practices in frontend development.\n• Collaborated in an **Agile** environment to design, develop, and maintain scalable systems using **Laravel** and **MySQL**, contributing to both backend API design and frontend integration.\n• Implemented **CI/CD** practices with tools such as **Docker** and **Kubernetes**, enhancing deployment processes and application stability for over 5 production releases monthly.\n• Led team collaboration efforts focusing on **TDD** strategies, applying **PHP** and **JavaScript** for robust unit and integration testing to ensure software quality across projects.\n• Mentored junior developers on best practices in code modularization and efficient database handling using **MySQL**, improving overall team performance by 30%.\n• Enhanced team collaboration and communication through detailed documentation and code reviews, fostering an environment where feedback is actively sought and implemented.\n• Utilized **HTML5** and **CSS** for creating responsive and user-friendly front-end layouts, leading to a 15% increase in user satisfaction in application usage.\n• Engaged in critical thinking to troubleshoot and optimize application performance, reducing page load times by 25% through efficient coding practices.\n• Created and maintained comprehensive documentation for project workflows and architectural decisions, facilitating knowledge sharing among teams and ensuring adherence to project goals."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "- Developed front-end applications using **React (18)** and **TypeScript** to create engaging user interfaces for comprehensive financial platforms, enhancing user experience.\n- Implemented back-end services with **Laravel** and **PHP**, ensuring robust integration with front-end systems and maintaining high performance for **MySQL** databases.\n- Leveraged **Docker** and **Kubernetes** for containerization and orchestration, streamlining development processes and deployment pipelines.\n- Applied **CI/CD** practices to automate testing and deployment, improving release speed by **30%**.\n- Fostered **Agile** methodologies within cross-functional teams, enhancing collaboration and boosting project efficiency, resulting in a **25%** reduction in delivery timelines.\n- Utilized **TDD** (Test-Driven Development) to ensure high-quality code and minimize bugs, achieving a **40%** decrease in post-release defects.\n- Conducted mentorship sessions to elevate team members’ competencies in **JavaScript**, **HTML5**, and **CSS**, promoting growth and knowledge sharing.\n- Practiced **critical thinking** to troubleshoot complex issues across the stack, ensuring timely resolutions to maintain service reliability.\n- Facilitated **communication** among stakeholders to align project goals and updates, enhancing transparency and team effectiveness."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Utilized **Laravel** for developing and optimizing backend services, ensuring high availability, scalability, and performance in the e-commerce platform.\nDeveloped interactive, dynamic frontend applications utilizing **React** (18) and **TypeScript**, improving user engagement and experience across web and mobile environments.\nImplemented CI/CD pipelines and **Docker** containers for agile deployment strategies, ensuring fast and efficient release cycles within an **Agile** framework.\nApplied **MySQL** for reliable and efficient database management, ensuring data integrity and performance for high-traffic workflows.\nEmployed **Kubernetes** for microservices orchestration, facilitating seamless scaling and managing containerized applications across diverse environments.\nDesigned, reviewed, and tested feature enhancements using **TDD** (Test-Driven Development), establishing a robust code base and ensuring high-quality deliverables.\nFostered a culture of **Team Collaboration** and continuous improvement through mentoring junior developers, enhancing team skill sets, and promoting best practices in software development.\nDeveloped comprehensive web applications leveraging **HTML5** and **CSS** for responsive design, ensuring compatibility and accessibility across various devices and platforms.\nDemonstrated strong **Critical Thinking** and **Communication** skills while collaborating with cross-functional teams to gather requirements and translate them into technical solutions.\nLed team discussions and offered insights on project improvements, contributing to the overall enhancement of team efficiency and project outcomes."
    }
  ],
  "skills": "Programming Languages:\n\tJavaScript, TypeScript, PHP, Python\n\nBackend Frameworks:\n\tLaravel, FastAPI, Flask, Django\n\nFrontend Frameworks:\n\tReact, Vue, Angular, HTML5, CSS\n\nAPI Technologies:\n\t\n\nServerless and Cloud Functions:\n\tAWS: Lambda, ECS, Azure: App Services\n\nDatabases:\n\tPostgreSQL, MySQL, MongoDB, Redis\n\nDevOps:\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\nCloud & Infrastructure:\n\tAWS: RDS, S3, Azure: Blob Storage, SQL Database\n\nOther:\n\tMLflow, Airflow, Kubeflow, TDD, CI/CD, Agile, Critical Thinking, Communication, Team Collaboration, Mentoring, Keycloak (OIDC, RBAC), OAuth2, JWT, Nginx, Let’s Encrypt, Certbot",
  "apply_company": "Workwize"
}