{
  "name": "Rei Taro",
  "role_name": "Senior Backend Engineer",
  "email": "rei515@outlook.com",
  "phone": "+48732529451",
  "address": "Warszawa, Poland",
  "linkedin": "https://www.linkedin.com/in/rei-taro-81a410391/",
  "profile_summary": "Results-driven Senior Backend Engineer with over 10 years of experience specializing in building scalable backend systems and financial platforms. Proficient in **Node.js**, **TypeScript**, **AWS**, and the **Serverless Framework**, with a strong focus on creating robust **RESTful APIs** and high-performance services. Skilled in **PostgreSQL** and implementing **CI/CD** pipelines. Proven ability to leverage **Agile** and **SCRUM** methodologies for efficient project execution. Recognized for delivering impactful AI and ML solutions while adhering to software design principles and embracing **Test-Driven Development**. Strong organizational and communication skills, honed through collaborative work with leading organizations such as VISA, Sii Poland, and Reply Polska.",
  "education": [
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2010",
      "to_year": "2015",
      "location": "Japan",
      "university": "Keio University"
    }
  ],
  "experience": [
    {
      "role": "Senior Backend Engineer",
      "company": "Leobit",
      "from_date": "Aug 2022",
      "to_date": "Present",
      "location": "Poland",
      "responsibilities": "Engineered scalable backend services using **Node.js** and **TypeScript** to enhance document automation and reporting workflows.\nDeveloped RESTful APIs for efficient data access and manipulation, ensuring a response time of under **200ms** for end-user requests.\nImplemented CI/CD pipelines with **Git** to automate deployment processes, achieving a deployment frequency of **10 releases per week**.\nUtilized **AWS** and the **Serverless Framework** to enable microservice architecture, improving system scalability and reducing operational costs by **30%**.\nDesigned database schemas and queries with **PostgreSQL** to ensure optimal data retrieval, reducing average query times by **50%**.\nEmployed Agile methodologies and **SCRUM** practices to effectively manage project timelines and deliverables, facilitating daily stand-ups and bi-weekly sprints.\nIntegrated AI and ML capabilities into backend solutions for enhanced data analytics, driving insightful business decisions based on real-time user interactions.\nPracticed Test-Driven Development to ensure code quality and reliability, achieving a code coverage percentage of **85%** across all services.\nCollaborated using strong communication and organizational skills to address system integration challenges and streamline workflows across cross-functional teams."
    },
    {
      "role": "Software Engineer",
      "company": "Innovature",
      "from_date": "Nov 2018",
      "to_date": "Jun 2022",
      "location": "Japan",
      "responsibilities": "Developed backend systems using **Node.js** and **TypeScript**, applying software design principles to automate document workflows and streamline user onboarding with a focus on **RESTful APIs**.\nCreated event-driven microservices utilizing **AWS** and **Serverless Framework**, enhancing asynchronous processing of financial data and transaction requests with a performance improvement of **30%**.\nManaged deployment processes with **Git** and implemented **CI/CD** pipelines for maintaining consistent and scalable environments across **100+** microservices.\nEngineered secure data pipelines for regulatory compliance, employing **PostgreSQL** and integrating **ZOD** for robust data validation and error handling, achieving a data exchange success rate of **99%**.\nExecuted security audits to ensure compliance with industry standards, integrating **OAuth2** and **Azure AD B2C** for effective authentication management and access control.\nCollaborated with cross-functional teams in an **Agile** environment, ensuring smooth system integration and regulatory compliance, ultimately driving successful release management practices."
    },
    {
      "role": "Software Developer",
      "company": "Wizcorp",
      "from_date": "Apr 2015",
      "to_date": "Nov 2018",
      "location": "Japan",
      "responsibilities": "Designed and implemented robust backend services leveraging **Node.js** and **TypeScript** to enhance trading operations for a high-transaction environment.\nDeveloped scalable RESTful APIs and integrated **PostgreSQL** databases for efficient data handling, resulting in a reduction of data retrieval time by **30%**.\nLeveraged **AWS** and **Serverless Framework** to deploy applications ensuring high availability and scalability, achieving a server uptime of **99.9%**.\nCollaborated with cross-functional teams in an **Agile** and **SCRUM** environment to ensure alignment on product goals, enhancing project delivery timelines by **25%**.\nImplemented **CI/CD** pipelines using **Git**, streamlining the deployment process and improving overall development speed.\nUtilized **ZOD** for schema validation, ensuring data integrity across the platform.\nAdopted tested-driven development practices with **PyTest** and integrated automated testing tools, leading to a **40%** increase in code coverage and minimizing bugs in production releases.\nCommunicated effectively with stakeholders to gather requirements, while applying **Software Design Principles**, bolstering both organizational efficiency and project clarity."
    }
  ],
  "skills": " **Programming Languages**\n\t Node.js, TypeScript, Python (3.8+), SQL, Bash, JavaScript\n\n **Backend Frameworks**\n\t FastAPI, Flask, Django, Celery\n\n **Frontend Frameworks**\n\t  \n\n **API Technologies**\n\t REST/gRPC APIs, RESTful APIs\n\n **Serverless and Cloud Functions**\n\t AWS (EC2, S3, Lambda), Serverless Framework\n\n **Databases**\n\t PostgreSQL, MySQL, MongoDB, Redis\n\n **DevOps**\n\t Docker, Kubernetes, GitHub Actions, Azure DevOps, CI/CD\n\n **Cloud & Infrastructure**\n\t AWS, Azure\n\n **Other**\n\t AI/ML Tools: Pandas, NumPy, scikit-learn, TensorFlow, Airflow, MLflow, Agile, SCRUM, ZOD, Software Design Principles, Test-Driven Development, Communication, Organizational Skills",
  "apply_company": "Vita Health"
}