{
  "name": "Patryk Zaslawski",
  "role_name": "Senior QA Engineer",
  "email": "patrykzas0428@outlook.com",
  "phone": "+48669862402",
  "address": "Gdanski, Poland",
  "linkedin": "https://www.linkedin.com/in/patryk-z-107978395/",
  "profile_summary": "As a dedicated Senior QA Engineer with a focus on automation and test automation, I possess over 8 years of experience adept at leveraging tools such as **Playwright**, **Cypress**, and emerging technologies to ensure the delivery of high-quality software solutions. My background in software engineering allows me to bring a unique perspective to quality assurance, where I develop comprehensive test plans and implement CI/CD pipelines using **Gitflow** for streamlined operations. I am committed to mentoring team members and fostering a culture of continuous improvement. Additionally, my proficiency with Python and full stack development enhances collaboration with development teams to identify and resolve issues early, leading to robust software deployments in e-commerce and financial sectors.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2014",
      "to_year": "2017",
      "location": "United Kingdom",
      "university": "The University of Manchester"
    }
  ],
  "experience": [
    {
      "role": "Senior QA Engineer",
      "company": "Binary Studio",
      "from_date": "Aug 2023",
      "to_date": "Present",
      "location": "United Kingdom (Remote)",
      "responsibilities": "Developed and executed comprehensive **test plans** using **Playwright** and **Cypress** to ensure the reliability and functionality of Python microservices in the healthcare domain.\nSpearheaded the **CI/CD** pipeline integration for automated testing frameworks, streamlining the deployment process and reducing release times by **30%**.\nLed **mentorship** initiatives for junior engineers, enhancing their skills in **test automation** and quality assurance best practices within agile teams.\nAutomated the testing of healthcare workflows through integration with emerging technologies, enhancing operational efficiency and achieving a **25%** reduction in manual errors.\nUtilized **Gitflow** for effective version control and collaboration, ensuring seamless transitions between development and production branches.\nImplemented **automation** strategies for regression and performance testing using **Playwright** and **Cypress**, successfully validating application functionality pre and post-release.\nPromoted the adoption of **QA best practices** within cross-functional teams, resulting in increased awareness and proactivity around software quality.\nCollaborated with software development teams to identify and resolve bugs and issues, contributing to improved code quality and decreasing bug reports by **40%**.\nLeveraged **AI** tools to enhance testing accuracy and optimize resources, paving the way for implementing smart testing solutions in the development workflows.\nExplored and evaluated **emerging technologies** to continuously improve testing methodologies and processes in the organizations' QA practices."
    },
    {
      "role": "Software Engineer",
      "company": "Ardigen",
      "from_date": "Mar 2020",
      "to_date": "Aug 2023",
      "location": "Poland",
      "responsibilities": "Developed comprehensive test plans leveraging **Cypress** and **Playwright** for robust test automation frameworks, ensuring high-quality deliverables and streamlined testing processes.\nImplemented CI/CD pipelines using **GitHub Actions** and **Azure DevOps** to automate testing and deployment workflows, increasing efficiency by **30%**.\nMentored junior QA engineers in best practices for test automation, fostering a culture of continuous improvement and skill development within the team.\nConducted thorough testing and validation of features in collaboration with cross-functional teams, ensuring alignment with emerging technologies and industry standards.\nUtilized AI-driven testing tools to enhance test coverage and improve defect detection rates by **25%** across the application.\nDesigned and executed end-to-end test cases that empowered the team to deliver high-quality software on schedule, resulting in a **15%** reduction in defect leakage post-deployment.\nImplemented effective test management strategies, utilizing modern tools for tracking and maintaining test cases and ensuring comprehensive coverage.\nEnhanced existing test scripts and frameworks to accommodate new features and changes, maintaining up-to-date and relevant testing processes.\nParticipated in agile ceremonies and actively contributed to sprint planning, retrospectives, and daily stand-ups to improve team collaboration and project alignment.\nEvaluated and integrated new tools and technologies into the testing process, championing innovation and technological advancements in the QA department."
    },
    {
      "role": "Software Engineer",
      "company": "Altum Software",
      "from_date": "Oct 2017",
      "to_date": "Feb 2020",
      "location": "United Kingdom",
      "responsibilities": "Implemented **test automation** strategies utilizing **Playwright** and **Cypress** to enhance the quality and reliability of web applications through comprehensive test plans and execution.\nLeveraged **CI/CD** processes and **Gitflow** methodologies for streamlined development and deployment cycles, significantly reducing time-to-release and ensuring continuous integration of code changes.\nConducted mentorship and training sessions for junior QA engineers, fostering a collaborative environment focused on quality assurance and best practices in testing.\nAutomated testing for e-commerce backend services in **Python** using frameworks like **PyTest** and integrated performance validation tools such as **JMeter** and **Locust** for robust quality assurance.\nDesigned and executed manual and automated test cases that aligned with cross-platform compatibility for websites built on **Next.js**, **Angular**, and **React**.\nCollaborated with development teams to integrate **AI** and emerging technologies into the testing process, optimizing performance and increasing automation capabilities.\nCreated detailed documentation for testing processes and results, enabling transparency and effective communication with cross-functional teams.\nParticipated in strategy sessions to refine test automation workflows and improve overall testing efficiency, leading to up to **75%** reduction in testing time.\nEmployed various testing techniques including functional, regression, usability, and performance testing to ensure comprehensive coverage and alignment with business requirements.\nContributed to the development of a robust testing framework and library, enabling the QA team to execute tests more effectively and reliably across **100%** of critical user flows."
    }
  ],
  "skills": "**Programming Languages:**\n\tPython\n\n**Backend Frameworks:**\n\tFastAPI, Django, Flask, Spring Boot\n\n**Frontend Frameworks:**\n\tAngular (1–16), React (15–18), Next.js, Vue.js (2/3), Blazor\n\n**API Technologies:**\n\tREST & gRPC APIs\n\n**Serverless and Cloud Functions:**\n\tAWS (Lambda), Azure\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, CI/CD, Gitflow\n\n**Cloud & Infrastructure:**\n\tAWS (ECS, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Other:**\n\tSQLAlchemy, Pydantic, Celery, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, automation, test automation, test plans, mentorship, AI, emerging technologies, Playwright, Cypress",
  "apply_company": "Planetary Talent"
}