{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Software / Application Developer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-187801395/",
  "profile_summary": "Software/Application Developer with 13+ years of experience specializing in **C#**, **.NET**, and **SQL** to create high-performance applications. Proficient in developing **RESTful APIs** and adept in **Microsoft Azure**, ensuring robust application integration and cloud-native deployment. Demonstrated expertise in **Agile development** methodologies, fostering effective collaboration and communication within teams.\nAdditionally skilled in **PowerShell**, **Power Apps**, and **Power Automate** for streamlining processes and enhancing operational efficiency. Strong problem-solving abilities complemented by a solid foundation in both frontend and backend technologies, including **JavaScript/TypeScript**, **Python**, **React**, **Node.js**, and **Django**. Experience in deploying microservices and CI/CD pipelines while ensuring compliance with industry standards.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Software / Application Developer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Developed robust **RESTful APIs** in **.NET** using **C#** to efficiently integrate applications across various platforms, enhancing application interoperability.\n- Managed application workflows using **Power Automate** for seamless integration and automation of business processes.\n- Leveraged **Microsoft Azure** services for deploying scalable applications, ensuring compliance with industry best practices in application development.\n- Employed SQL databases for data storage and retrieval, optimizing queries for performance and reliability across different applications.\n- Collaborated in Agile development teams to deliver high-quality software solutions, utilizing effective communication and problem-solving skills to address challenges.\n- Integrated **Power Apps** for rapid application development, enabling business users to create custom applications with minimal code within a **$100K** budget.\n- Developed comprehensive application documentation, enhancing communication across teams and ensuring clarity in project requirements.\n- Conducted integration tests and implemented agile methodologies that reduced deployment time by up to **30%**, improving overall efficiency.\n- Designed and managed CI/CD pipelines utilizing Azure DevOps, fostering automation and reducing manual errors in deployment processes.\n- Assisted in the training and onboarding of new team members, enhancing collaboration and ensuring alignment with organizational goals.\n- Provided continuous support and problem resolution for applications post-deployment, maintaining uptime above **99.5%** across all services."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Designed and developed **RESTful APIs** utilizing **C#** and **.NET** to ensure seamless application integration and enhance data accessibility across platforms.\nImplemented **PowerShell** scripts and automation workflows using **Power Apps** and **Power Automate** to optimize and streamline operational processes, leading to a **30%** increase in team productivity.\nCollaborated with cross-functional teams in an **Agile development** environment to deliver features on time, addressing stakeholder requirements and ensuring smooth project execution.\nUtilized **Microsoft Azure** services for deployment and scaling of applications, maintaining performance standards while managing budget constraints effectively.\nMaintained and optimized **SQL** databases, achieving an **optimisation** in query performance by up to **40%**, ensuring the reliability of financial data operations.\nFacilitated regular communication and collaboration with team members and stakeholders to provide updates and receive feedback, fostering a continuous improvement culture.\nProactively identified and resolved technical challenges, employing strong problem-solving skills to deliver innovative solutions.\n"
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Developed robust applications using **C#** and **.NET** technologies to create efficient solutions for business processes, improving overall application performance by **30%**.\nDesigned and implemented **RESTful APIs** for application integration, facilitating seamless communication between various systems and increasing data retrieval speed by **25%**.\nUtilized **Microsoft Azure** for cloud-based deployment and management, ensuring high availability and scalability of applications to support fluctuating user demands.\nAutomated workflows and business processes using **PowerShell**, **Power Apps**, and **Power Automate**, reducing manual intervention and increasing task efficiency by **40%**.\nParticipated in **Agile development** practices, collaborating with cross-functional teams to enhance project visibility and improve delivery timelines by **20%**.\nApplied SQL for efficient data querying and management, supporting robust database solutions and enhancing data accessibility for end-users.\nLeveraged strong **problem-solving** skills to troubleshoot and resolve complex technical issues, ensuring minimal downtime and optimal user experiences.\nEnhanced team **communication** and **collaboration** through regular code reviews and knowledge-sharing sessions, fostering a culture of continuous improvement and innovation."
    }
  ],
  "skills": " **Programming Languages:**\n\tC#, Python, JavaScript/TypeScript\n\n **Backend Frameworks:**\n\t.NET, FastAPI, Flask, Django\n\n **Frontend Frameworks:**\n\tReact, Vue, Angular\n\n **API Technologies:**\n\tRESTful APIs, Keycloak (OIDC, RBAC), OAuth2, JWT\n\n **Serverless and Cloud Functions:**\n\tAWS: Lambda, Azure: App Services\n\n **Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD\n\n **Cloud & Infrastructure:**\n\tMicrosoft Azure, AWS: ECS, RDS, S3, Terraform, Ansible, Helm, Docker Compose\n\n **Other:**\n\tMLflow, Airflow, Kubeflow, PowerShell, Power Apps, Power Automate, SQL, Agile development, application integration, problem-solving, communication, collaboration"
}