{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Google Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "As an accomplished Senior Google Engineer, I possess extensive experience in **Google Cloud** and adept at **IT Consulting** and **Project Management** for high-performance solutions. My background includes **Cloud Services** expertise, enabling effective integration and collaboration with tools like **Google Workspace** and **Microsoft Active Directory**. I excel in **Networking** and demonstrate strong **Customer Service** capabilities while promoting **Team Collaboration** through continuous learning initiatives. \n\nWith 8 years as a Full Stack Developer, I have effectively harnessed modern technologies including JavaScript/TypeScript, Python, and **Flutter** to deliver enterprise-grade platforms. My proficiency in **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**, combined with deep knowledge of **Azure** and **AWS**, empower me to build robust applications compliant with industry standards like HIPAA, FHIR, PCI DSS, and SOC 2. I also have hands-on experience in creating machine learning pipelines and implementing MLOps workflows using **MLflow**, **Airflow**, and **Kubeflow**, ensuring real-time data processing and intelligent automation.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Google Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Managed and optimized cloud services including **Google Cloud** and **Microsoft** technologies to ensure seamless project execution and customer satisfaction in line with corporate goals.\nLed IT consultancy projects focusing on effective **Active Directory** and **Exchange** integration, enhancing organizational efficiency and network security for the enterprise.\nCoordinated with cross-functional teams to deliver high-quality project outcomes, ensuring robust **Networking** solutions that meet client needs and industry standards.\nUtilized strong project management skills to oversee timelines and deliverables, ensuring adherence to budget constraints while maintaining a customer-focused approach.\nFacilitated team collaboration and knowledge sharing through regular meetings and continuous learning initiatives, resulting in a **20%** increase in team productivity.\nProvided exceptional customer service and technical support, leveraging advanced knowledge of **Google Workspace** to streamline processes and improve user experience.\nFluently communicated in both **Fluent German** and **Fluent English**, effectively bridging language gaps during international client consultations and training sessions.\nDeveloped actionable strategies for system enhancements as part of ongoing IT support, leading to a **30%** reduction in project turnaround times.\nImplemented robust training programs for new users, resulting in improved team performance and user adoption rates by **40%** among newly onboarded staff."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Managed cloud services and IT consulting for financial platforms, emphasizing **Google Cloud** for infrastructure efficiency and reliability.\nFostered team collaboration and project management, delivering projects on time and within budget, with a focus on utilizing **Google Workspace** to enhance productivity and communication.\nEnsured seamless integration of **Microsoft Exchange** and **Active Directory** for streamlined user management and authentication across services.\nLed networking initiatives to optimize system performance and availability, utilizing best practices and methodologies in cloud environments.\nProvided exceptional customer service through effective problem-solving and responsiveness, maintaining a satisfaction rating of over **95%** in client feedback.\nChampioned continuous learning within the team by facilitating knowledge-sharing sessions on emerging technologies and tools, supporting a culture of growth and development.\nCommunicated fluently in **German** and **English**, enhancing collaboration with cross-functional teams across regions."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "- Provided IT consulting and project management expertise by integrating **Google Workspace** and **Google Cloud** solutions, which enhanced team collaboration and increased productivity by up to **20%**.\n- Managed Active Directory and Exchange for secure user access and seamless communication across departments, streamlining operational workflows and reducing downtime by **15%**.\n- Developed and implemented networking strategies to optimize cloud services, resulting in **99.9%** uptime for critical applications.\n- Delivered exceptional customer service by collaborating with cross-functional teams to address user needs and troubleshoot issues effectively, contributing to a **30%** improvement in user satisfaction ratings.\n- Fostered a culture of continuous learning within the team, leading training sessions on **Microsoft** tools and cloud services to enhance technical skills and service delivery capabilities.\n- Demonstrated strong communication skills in **Fluent German** and **Fluent English** while liaising with international stakeholders and presenting project updates, ensuring clarity and alignment across teams.\n"
    }
  ],
  "skills": "Programming Languages:\n\tPython, JavaScript, TypeScript\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\t\n\n**Serverless and Cloud Functions:**\n\tAWS (Lambda), Azure\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS (ECS, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Other:**\n\tGoogle Workspace, Google Cloud, Microsoft, Active Directory, Exchange, Networking, Cloud Services, IT Consulting, Project Management, Customer Service, Team Collaboration, Continuous Learning, Fluent German, Fluent English, MLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot",
  "apply_company": "PCG DACH"
}