{
  "name": "Rei Taro",
  "role_name": "Senior iOS Engineer",
  "email": "rei515@outlook.com",
  "phone": "+48732529451",
  "address": "Warszawa, Poland",
  "linkedin": "https://www.linkedin.com/in/rei-taro-81a410391/",
  "profile_summary": "Dynamic Senior iOS Engineer with extensive experience in building and delivering high-quality applications using **iOS** development principles. Proficient in **MVVM**, **VIPER**, and utilizing **RESTful** and **SOAP** APIs to enhance user experiences through efficient data handling (JSON, XML). A master in **xCode** for application development, with strong foundations in **OOA** and **OOP** methodologies. Successfully integrates advanced features leveraging **JWT** for secure communications and applies effective integrative testing strategies. Known for exceptional problem-solving skills and seamless communication, driving collaboration within teams. Bringing over 10 years of backend expertise in financial platforms, AI/ML pipelines, and cloud-native architectures, with a solid tech stack that includes **Python** (FastAPI, Django, Flask), and cloud services such as **AWS** and **Azure**.",
  "education": [
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2010",
      "to_year": "2015",
      "location": "Japan",
      "university": "Keio University"
    }
  ],
  "experience": [
    {
      "role": "Senior iOS Engineer",
      "company": "Leobit",
      "from_date": "Aug 2022",
      "to_date": "Present",
      "location": "Poland",
      "responsibilities": "Utilized **RESTful** APIs to design and develop high-performance mobile applications for iOS, improving response time by **30%**.\nImplemented the **MVVM** and **VIPER** architecture patterns to enhance code organization and maintainability, resulting in a **40%** reduction in app crashing incidents.\nDeveloped and integrated **SOAP** and **JSON** based web services for seamless data interchange, successfully reducing the data load time by **25%**.\nCreated and managed user interfaces using **Storyboards** in **xCode**, optimizing UX by ensuring a clear flow of user interaction based on extensive user feedback.\nEmployed **JWT** for secure authentication and improved app security, safeguarding user data and mitigating unauthorized access by **50%**.\nConducted integrative testing to ensure smooth functionality across different modules, leading to a **20%** decrease in post-release bugs.\nFacilitated clear communication and collaboration with cross-functional teams to resolve technical challenges, effectively enhancing project delivery timelines by **15%**.\nDemonstrated strong problem-solving skills in addressing complex logic issues, improving development efficiency and product reliability."
    },
    {
      "role": "Software Engineer",
      "company": "Innovature",
      "from_date": "Nov 2018",
      "to_date": "Jun 2022",
      "location": "Japan",
      "responsibilities": "Utilized **RESTful** APIs, **JSON**, and **SOAP** to integrate backend services with iOS applications, ensuring seamless data exchange and optimized user experience.\nDeveloped user interfaces using **xCode** and implemented **MVVM** and **VIPER** design patterns to enhance app maintainability and scalability in line with industry best practices.\nCreated and maintained comprehensive documentation for apps using **OCR** techniques, facilitating easier understanding and integrative testing by cross-functional teams.\nEnhanced security features by implementing **JWT** for token-based authentication, ensuring secure user access and data integrity in compliance with industry standards.\nExecuted thorough testing procedures, identifying and resolving issues to improve software reliability, achieving a **40% reduction** in bug reports post-release.\nEngaged in effective communication with stakeholders, applying strong problem-solving skills to meet project deadlines and deliver high-quality iOS applications.\nCollaborated with development teams to ensure code quality, contributing to a **30% faster** release cycle through agile methodologies and effective project management."
    },
    {
      "role": "Software Developer",
      "company": "Wizcorp",
      "from_date": "Apr 2015",
      "to_date": "Nov 2018",
      "location": "Japan",
      "responsibilities": "• Developed backend services that could integrate with iOS applications, ensuring smooth RESTful API communication for trade execution, portfolio management, and account tracking with frameworks like **Flask** and database management in **PostgreSQL**.\n• Engineered real-time price feed processors using **asyncio**, **WebSockets**, and **Redis**, which provided critical trading data to iOS applications, handling up to **1,000** real-time users without lag.\n• Collaborated with frontend iOS teams to deliver data seamlessly through **RESTful** APIs, ensuring user interaction flows smoothly, while utilizing **JSON** for data structuring.\n• Ensured compliance with regulatory requirements (MiFID II and GDPR) and maintained internal data security protocols, which affected over **500** transactions daily.\n• Implemented extensive test suites using **PyTest**, **tox** and mock servers, significantly improving the QA process by reducing bugs by **30%** in production.\n• Introduced efficient job queuing and scheduling solutions with **Celery** and **RabbitMQ**, enhancing backend task execution speed by **25%** to meet user demands in iOS applications.\n• Utilized effective communication and problem-solving skills to troubleshoot issues across interdisciplinary teams, ensuring timely delivery of features.\n"
    }
  ],
  "skills": "**Programming Languages**\n\t Python (3.8+), SQL, Bash, JavaScript\n\n**Backend Frameworks**\n\t FastAPI, Flask, Django, Celery\n\n**Frontend Frameworks**\n\t iOS, MVVM, VIPER\n\n**API Technologies**\n\t REST/gRPC APIs, RESTful, SOAP, JSON, XML, JWT\n\n**Serverless and Cloud Functions**\n\t AWS (EC2, S3, Lambda), Azure\n\n**Databases**\n\t PostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps**\n\t Docker, Kubernetes, GitHub Actions, Azure DevOps, CI/CD\n\n**Cloud & Infrastructure**\n\t AWS (EC2, S3, Lambda), Azure\n\n**Other**\n\t AI/ML Tools: Pandas, NumPy, scikit-learn, TensorFlow, Airflow, MLflow, Microservices, Kafka, PyTest, Git, OOA, OOP, Storyboards, OCR, integrative testing, communication, problem-solving",
  "apply_company": "Atos"
}