{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Sales Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "As a Senior Sales Engineer with 8 years of experience, I possess a strong foundation in **Cybersecurity**, **Network Security**, and **Application Security**, focusing on comprehensive solutions in healthcare and financial sectors. My technical expertise includes pivotal skills such as **TCP/IP**, **HTTP**, **Load Balancing**, and **API Security**. I have experience with top-tier technologies and tools including **Akamai**, **Fortinet**, **F5**, **Imperva**, and **Palo Alto** to enhance application security and performance.\n\nIn addition, my background includes **AWS** and **Azure** cloud services, enabling the deployment of secure and scalable solutions. I have successfully communicated complex technical concepts through my excellent **Presentation** and **Negotiation Skills**, ensuring customer satisfaction while driving sales.\n\nLeveraging my knowledge in **DDoS Protection**, **Firewalls**, and **WAF**, I am adept at implementing stringent security measures that comply with industry standards. My passion for technology, along with strong **Customer Service Skills**, equips me to effectively bridge the gap between technical teams and clients, ensuring successful project delivery and enhancement of client relationships.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Sales Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Engaged in **pre-sales engineering**, effectively articulating product capabilities of security solutions including **DDoS Protection** and **WAF** to potential clients, leveraging strong **presentation skills** for impactful demonstrations.\n• Collaborated with cross-functional teams to assess customer requirements and provide tailored solutions in **network security** and application protection using tools such as **Fortinet**, **Palo Alto**, and **Checkpoint**.\n• Delivered technical presentations showcasing cybersecurity strategies focused on **application security**, **bot management**, and **API security**, enhancing client understanding of product values.\n• Developed proposals and conducted product demonstrations that highlighted load balancing strategies using **F5** and **Citrix** to optimize application performance and security.\n• Designed **firewall** implementations and configurations to protect customer's environments, ensuring compliance with industry standards.\n• Conducted market research to stay ahead of trends in **network security** and **cybersecurity**, allowing informed discussions with clients on emerging threats like **DDoS attacks**.\n• Provided effective **customer service skills** through ongoing support and consultation, ensuring that solutions were delivered efficiently and effectively solved client pain points.\n• Managed relationships with clients throughout the sales process, ensuring seamless communication and support, drawing on strong **negotiation skills** to finalize contracts.\n• Created visual aids and documentation that clearly articulated technical solutions, enhancing customer clarity on the implementation of **routing**, **switching**, and **HTTP** protocols attributed to platform performance.\n• Collaborated with technology partners like **Akamai** to extend value propositions for clients, augmenting product offerings with complementary services like **CDN** and **caching** that improved response times by up to **30%**."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Utilized strong **cybersecurity** principles to ensure the integrity and security of financial applications, employing best practices in **application security** and **API security**.\nPerformed in-depth technical presentations pertaining to **network security** solutions, emphasizing the features of **F5**, **Palo Alto**, and **Azure DDoS Protection** to meet client needs.\nDemonstrated expert knowledge in **TCP/IP**, **HTTP**, and secure communication protocols to enhance application delivery and performance across platforms.\nCollaborated with cross-functional teams to design and implement **load balancing** and **caching** strategies using **Akamai** and **CDN** technologies to optimize traffic and user experience, leading to a **30%** increase in application efficiency.\nExecuted effective negotiation strategies during the pre-sales process to articulate the benefits of **reverse proxies** and **firewall** solutions in securing application deliveries.\nDeveloped strategies for managing bot traffic and implementing **bot management** solutions, resulting in a **20% reduction** in fraudulent transactions for client applications.\nLeveraged expertise in **presentation skills** to communicate complex technical information to a variety of stakeholders, ensuring clarity in the proposed security solutions for prospects and clients.\nMaintained a comprehensive knowledge of cloud environments, including **AWS**, **GCP**, and **Azure**, adapting sales strategies to leverage cloud security offerings for financial services.\nSupported the technical aspects of the sales cycle, engaging with **customer service skills** to address client inquiries and provide tailored solutions that enhanced client satisfaction and retention."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "- Demonstrated **strong presentation skills** by conveying complex cybersecurity concepts to clients in pre-sales engineering scenarios, resulting in a 25% increase in conversion rates in our division.\n- Leveraged expertise in **network security**, **application security**, and **firewalls** (e.g., **Checkpoint**, **Palo Alto**) to provide tailored solutions for diverse customer needs, effectively securing client applications in a competitive landscape.\n- Collaborated with technical teams to implement **API security** measures and **bot management** strategies, enhancing protection against DDoS attacks and improving overall system performance by **15%**.\n- Conducted comprehensive assessments of clients' existing infrastructures, including **load balancing** and **reverse proxies**, identifying vulnerabilities which led to strategic upgrades and fortified defenses.\n- Provided detailed recommendations on utilizing **CDN** solutions and **caching strategies** to optimize performance, achieving a **30%** reduction in load times for customer-facing applications.\n- Developed negotiation strategies based on in-depth analysis of client requirements and competitive products, driving successful negotiations that resulted in **$2M** in new business revenue.\n- Coordinated with cross-functional teams to ensure seamless integration of cloud services such as **AWS**, **Azure**, and **GCP** into existing client infrastructures, enhancing their scalability and resilience across enterprise solutions.\n- Assisted in the deployment of **application delivery controllers** to optimize software delivery, enhance user experiences, and maintain service availability during peak traffic.\n- Trained internal teams on cybersecurity best practices, ensuring alignment with client expectations and regulatory compliance, enhancing overall customer service skills and satisfaction ratings by **20%**.\n- Maintained ongoing relationships with clients, offering continuous assessments and updates on the latest security threats and technologies (including **Akamai** and **F5**), fostering trust and loyalty in our cybersecurity offerings."
    }
  ],
  "skills": "**Programming Languages:**\n\tPython, JavaScript, TypeScript\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tJWT, OAuth2, API Security\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL), GCP\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tCybersecurity, Network Security, Application Security, Load Balancing, Firewalls, DDoS Protection, WAF, Cisco, Citrix, Checkpoint, Corero, F5, Fortinet, Imperva, Palo Alto\n\n**Other:**\n\tPresentation Skills, Negotiation Skills, Customer Service Skills, MLflow, Airflow, Kubeflow, Keycloak, Nginx, Certbot, HTTP, Routing, Switching, TCP/IP, Caching, CDN, Compression, DDoS, Bot Management",
  "apply_company": "Radware"
}