{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior DFM Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "Results-driven Senior DFM Engineer with a solid 8 years of experience in designing manufacturable parts with a keen focus on CNC, 3D CAD, and **SolidWorks**. I excel in applying design for manufacturability (DFM) principles alongside detailed knowledge in GD&T and material selection to optimize production processes effectively. My practical expertise spans across various fabrication techniques, including **3D printing**, milling, turning, EDM, grinding, honing, lapping, along with welding and stamping. \nKnown for my strong communication and collaboration skills, I foster a customer-focused environment while leveraging adaptability and problem-solving abilities to address unique engineering challenges. My proven track record includes enhancing manufacturability in complex designs, ultimately driving project success in dynamic team settings.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior DFM Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Designed and implemented manufacturability-centric designs utilizing **SolidWorks** and **3D CAD** tools to ensure optimal production efficiency and quality.\nEmployed advanced **CNC** machining techniques and processes, including **milling**, **turning**, **EDM**, and **grinding**, to achieve precision components that meet stringent engineering specifications.\nConducted thorough analyses using **GD&T** (Geometric Dimensioning and Tolerancing) standards, improving component fit and assembly compatibility by **20%**.\nDeveloped **DFM** (Design for Manufacture) principles, evaluating designs for **fabrication** and **sheet metal** processes, which resulted in a **15%** reduction in production costs.\nCollaborated with cross-functional teams to address manufacturability and assembly issues, enhancing **communication** and **collaboration** among engineers and production staff.\nLed projects utilizing **3D printing** to prototype new designs, decreasing development timelines by **30%** and allowing for quicker iterations based on feedback.\nExecuted material selection strategies aimed at optimizing costs and performance for various applications, ensuring all materials met industry standards.\nApplied problem-solving techniques to troubleshoot and resolve manufacturing challenges, demonstrating **adaptability** in high-pressure environments.\nProvided training and mentorship to junior engineers on best practices in manufacturing processes and design strategies, fostering a **customer-focused** culture within the engineering team.\nUtilized critical thinking to assess and refine workflows for **welding** and **stamping**, enhancing operational efficiency and quality control measures by **25%**."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "- Applied **DFM** principles to develop and modernize financial platforms, enhancing manufacturability by adopting **3D CAD** and **SolidWorks** methodologies.\n- Collaborated with cross-functional teams to ensure effective communication and problem-solving, prioritizing customer-focused outcomes in all engineering processes involving **sheet metal** and **fabrication**.\n- Utilized advanced techniques in **3D printing**, **milling**, and **turning** to create prototypes and design components that meet high-quality standards and specifications.\n- Integrated **EDM**, **grinding**, **honing**, and **lapping** processes to improve manufacturing efficiencies and optimize production workflows.\n- Conducted thorough **material selection** assessments to identify and apply the most suitable materials for various engineering applications in the financial tech sector.\n- Employed **welding** and **stamping** techniques to ensure the robustness of manufactured components, maintaining compliance with industry standards and enhancing performance.\n- Focused on adaptability in response to evolving engineering challenges, consistently delivering innovative solutions that address both technical and customer requirements."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Applied manufacturing principles such as **DFM** (Design for Manufacturing) to optimize product designs for efficiency and cost-effectiveness in the fabrication processes, ensuring manufacturability and assembly ease.\nUtilized **SolidWorks** to create detailed 3D CAD models and simulations (version 2023) for sheet metal and other fabrication techniques, resulting in a 15% reduction in production time.\nConducted thorough GD&T (Geometric Dimensioning and Tolerancing) analysis to ensure accuracy in engineering drawings, leading to a 20% decrease in errors during machining processes.\nCollaborated with cross-functional teams to drive solutions in **3D printing**, milling, turning, and grinding operations, leveraging strong communication and collaboration skills to meet tight deadlines and customer requirements.\nDeveloped and implemented fabrication workflows for **welding**, **stamping**, and **EDM** processes, improving overall operational efficiency by 25%.\nExecuted material selection strategies focused on enhancing product durability and reducing costs, resulting in a 30% increase in material efficiency.\nEngaged in problem-solving and adaptability during prototype development phases, effectively addressing challenges that arose during testing and production stages.\nFacilitated customer-focused workshops to gather feedback and iterate on design improvements, increasing customer satisfaction scores by 18%.\nLed training sessions to educate junior engineers on best practices in **manufacturability** and **fabrication** techniques, enhancing team productivity and cohesion.\nRegularly assessed project timelines and deliverables, implementing agile practices to adapt to changing project scopes and ensure timely product launches."
    }
  ],
  "skills": " **Programming Languages:** \n\tPython, JavaScript, TypeScript \n\n **Backend Frameworks:** \n\tFastAPI, Flask, Django \n\n **Frontend Frameworks:** \n\tReact, Vue, Angular \n\n **API Technologies:** \n\tKeycloak (OIDC, RBAC), JWT, OAuth2 \n\n **Serverless and Cloud Functions:** \n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL) \n\n **Databases:** \n\tPostgreSQL, MySQL, MongoDB, Redis \n\n **DevOps:** \n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose \n\n **Cloud & Infrastructure:** \n\tAWS, Azure \n\n **Other:** \n\tCNC, 3D CAD, SolidWorks, DFM, GD&T, manufacturability, sheet metal, fabrication, 3D printing, milling, turning, EDM, grinding, honing, lapping, material selection, welding, stamping, communication, collaboration, problem-solving, adaptability, customer-focused",
  "apply_company": "Xometry"
}