{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Solutions Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Senior Solutions Engineer with 13+ years of experience in delivering high-performance applications, with a strong focus on **GenAI**, **ConversationalAI**, and automation strategies. Proficient in cloud service deployment on **AWS**, **Azure**, and **GoogleCloud**, with hands-on experience in building and integrating **APIs** including **REST** and **GraphQL**.\nSkilled in leveraging modern frameworks such as **JavaScript**/**TypeScript**, **Python**, and **Flutter** for Full Stack development, utilizing tools like **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**. Expertise in designing AI/ML-powered applications for predictive analytics and real-time processing, while actively applying **NLP** techniques.\nDemonstrated ability in implementing automation processes, RPA solutions, and maintaining compliance with standards such as HIPAA, FHIR, PCI DSS, and SOC 2. Strong communication and relationship-building skills, ensuring effective presentation of technical solutions and collaboration with stakeholders.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Solutions Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Leveraged **cloud** platforms such as **AWS** and **Azure** to design and build scalable solutions for healthcare and fintech applications.\nImplemented **REST** and **GraphQL** APIs to enhance connectivity and integration with **CRM** systems like **Salesforce** and **HubSpot**, ensuring seamless data flow and customer relationship management.\nDeveloped conversational interfaces and intelligent features powered by **NLP** technologies, enabling personalized user interactions and improving user engagement.\nAutomated deployment processes using CI/CD tools, enhancing operational efficiency with a deployment frequency increase of **30%**.\nCreated **GenAI**-driven applications that utilize machine learning models for enhanced risk scoring and fraud detection, achieving a model accuracy increase of **25%**.\nDesigned user-friendly dashboards and reporting tools to facilitate data presentation, optimizing decision-making processes for stakeholders.\nMaintained strong relationships with cross-functional teams, applying effective communication to gather requirements and ensure alignment with project goals.\nConducted presentations to showcase automated solutions and their impact on business processes, emphasizing the automation of workflows to reduce operational costs by **15%**.\nEnsured compliance with industry regulations (HIPAA, GDPR) while optimally implementing technologies that support regulatory requirements in financial and health data environments.\nParticipated in the transformation of legacy systems by integrating innovative solutions that drive efficiency and performance improvements in existing infrastructures."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Integrated **cloud** solutions across multiple platforms, utilizing **Azure** and **AWS** for scalable deployment and management of microservices architecture in financial systems.\nImplemented automated processes and enhancements using **RPA** tools to improve operational efficiency, maintaining a focus on **automation** for routine tasks.\nLeveraged **APIs**, including **REST** and **GraphQL**, for seamless integration of financial applications with **CRM** and **ERP** systems like **Salesforce** and **HubSpot**, enhancing user experience and operational workflows.\nUtilized **NLP** techniques for conversational AI applications, improving user interactions and engagement in customer service solutions.\nBuilt interactive front-end applications with **React (18)**, **Vue 3**, **Next.js**, and **TypeScript**, creating sleek, responsive interfaces for financial tools and admin panels.\nDeveloped real-time analytics dashboards employing **D3.js** and **Power BI Embedded**, enabling data-driven decision-making across teams with up to **90%** faster reporting capabilities.\nDesigned and deployed a robust event-driven architecture with **Kafka**, **RabbitMQ**, and **Azure Service Bus**, ensuring asynchronous communication across critical workflows such as payments, alerts, and compliance, handling transactions with up to **100,000** messages per day.\nSuccessfully developed and optimized ETL pipelines for ingesting financial data from internal and third-party sources using **Python**, **Apache Airflow**, and **Azure Data Factory**, achieving a **30%** reduction in data processing time.\nCreated machine learning models for fraud detection using **scikit-learn**, **XGBoost**, and **Azure ML**, achieving an accuracy rate of over **95%** in identifying fraudulent transactions based on user behavior and transaction patterns.\nEstablished ML pipelines for real-time credit scoring, churn prediction, and transaction classification, leveraging **MLflow** and **Airflow** to integrate model inference into backend services."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "- Developed cloud-based solutions leveraging **AWS**, **Azure**, and **GoogleCloud** services to enhance e-commerce functionalities including automation and scalability.\n- Engineered and deployed **REST** and **GraphQL** APIs to facilitate seamless integration with various CRM and ERP systems such as **Salesforce** and **HubSpot**.\n- Utilized automation tools and script-based solutions for process improvements and operational efficiency, implementing **RPA** strategies to reduce manual intervention and enhance accuracy.\n- Integrated **GenAI** and **ConversationalAI** technologies to enhance customer interaction and support, showcasing strong communication and relationship-building skills.\n- Designed scalable backend services for a global e-commerce platform using **Python** (**FastAPI**, **Django**) and **Node.js** (**NestJS**, **Express**), ensuring high availability, low latency, and scalability across key modules like checkout, cart, and order fulfillment.\n- Developed frontend applications using **React** (**18**), **Vue 3**, and **Angular**, enhanced with **TypeScript**, **Redux Toolkit**, and **Tailwind CSS**, delivering fast, responsive user experiences on both web and mobile platforms.\n- Leveraged **MongoDB**, **PostgreSQL**, **Redis**, and **Cassandra** for distributed data storage, ensuring fast, fault-tolerant data access for high-traffic e-commerce workflows and caching frequently accessed resources for performance gains.\n- Implemented Redis caching for product metadata, shopping cart sessions, and search results, significantly improving application responsiveness and reducing read pressure on databases.\n- Built secure payment workflows integrated with **Stripe**, **PayPal**, and **Razorpay**, applying tokenized transactions and PCI-compliant handling of sensitive data.\n- Applied role-based access control (RBAC) and **OAuth 2.0** for secure customer and admin access, ensuring GDPR compliance and user data protection throughout the platform."
    }
  ],
  "skills": "**Programming Languages:**\n\tPython: FastAPI, Flask, Django\n\tJavaScript/TypeScript: React, Vue, Angular\n\n**Backend Frameworks:**\n\t\n\n**Frontend Frameworks:**\n\t\n\n**API Technologies:**\n\tREST, GraphQL, APIs\n\n**Serverless and Cloud Functions:**\n\tAWS: ECS, Lambda, RDS, S3\n\tAzure: App Services, Blob Storage, SQL Database\n\tGoogleCloud\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare)\n\tMongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes\n\tGitHub Actions, GitLab CI/CD\n\tCI/CD: Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tcloud, automation\n\n**Other:**\n\tGenAI, ConversationalAI, NLP, RPA\n\tSalesforce, HubSpot, CRM, ERP\n\tpresentation, communication, relationshipBuilding",
  "apply_company": "Enterprise Bot"
}