{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Software Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "Results-driven Senior Software Engineer with 8 years of comprehensive experience in high-performance software solutions. Proficient in **Go**, **Java**, **C#**, and **C++**, with a strong background in **Linux** and **Postgres** for backend development. Skilled in data processing and asynchronous work paradigms, enhancing efficiency and scalability in enterprise applications. Demonstrated expertise in VM management and protocols, bringing a solid understanding of RFCs and automation strategies.\n\nMy unique blend of technical skills includes full-stack development leveraging frameworks like **React**, **Next.js**, **Vue**, **Node.js**, along with server-side technologies such as **FastAPI** and **Django**. I possess experience in cloud environments including **Azure** and **AWS** and have led the development of secure, compliant applications following standards like HIPAA and PCI DSS. Additionally, I am adept in microservices architecture and implementing CI/CD pipelines, while integrating AI/ML capabilities for advanced data processing and predictive analytics.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Software Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Developed and optimized data processing pipelines using **Postgres** to ensure efficient handling of large-scale healthcare and financial data across various platforms, adhering to regulatory protocols.\nEmployed asynchronous work strategies to enhance system performance and reduce latency in applications, utilizing **Go** and **Java** for back-end services.\nImplemented automation scripts for continuous integration and deployment, utilizing **Linux** environments to streamline development workflows and improve code quality.\nArchitected reliable systems for VM management, applying **QEMU** for virtualization to create test environments that ensure robust application performance.\nConducted thorough malware analysis and applied security protocols to safeguard sensitive data in compliance with regulatory standards.\nDeveloped core application functionalities using **C#**, **C++**, and **Go**, ensuring high-level system integration and performance across multiple platforms.\nCollaborated in cross-functional teams to define and adhere to RFCs, enhancing team coherence and enhancing system interoperability.\nLed the initiative to integrate advanced protocols for improved communication between microservices, facilitating efficient data exchange in the ecosystem.\nContributed to the implementation of automated monitoring and analysis scripts to support application health checks, utilizing tools written in **Java**, **C#**, and **Python**.\nIntroduced unit and integration testing frameworks leveraging existing technologies for robust software solutions, ensuring reliable deployment in production environments."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Leveraged deep expertise in **Go** and **Linux** to enhance application performance and optimize backend services in line with industry standards.\nDesigned and implemented **Postgres** database schemas and optimized queries to improve data processing efficiency and scalability, handling over **10 million transactions** per day.\nUtilized automation techniques to streamline operations, reducing deployment times by **30%** through the use of CI/CD practices and tools.\nEmployed **asynchronous work** patterns to enhance the responsiveness of systems, resulting in a **25%** increase in throughput during peak operational hours.\nApplied advanced **protocols** and **RFCs** for integrating new microservices, ensuring robust communication between systems.\nConducted comprehensive **data processing** initiatives to transform and analyze large datasets, contributing to strategic business decisions and operational improvements.\nManaged **VM management** efforts with **QEMU** to create virtual environments for testing and deployment, resulting in reduced infrastructure costs by **20%**.\nConducted **Malware Analysis** to safeguard application integrity, implementing security measures that decreased vulnerabilities by **15%** across platforms.\nEngaged in cross-functional collaboration to identify and implement **Java**, **C#**, and **C++** solutions that enhanced system capability and user satisfaction."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Utilized **Go** and **Java** for developing microservices, enhancing system efficiency and performance in large-scale applications.\nImplemented resilient architecture on **Linux** for scalable applications, ensuring robust reliability across services.\nEngineered efficient data processing solutions with **Postgres**, optimizing complex queries and ensuring integrity across distributed systems.\nDeveloped asynchronous workflows leveraging advanced **C++** techniques for improving application performance and responsiveness.\nOversaw VM management using **QEMU**, ensuring optimal resource allocation and system virtualization for versatile development environments.\nConducted in-depth malware analysis as part of security protocols, proactively identifying and mitigating vulnerabilities in application code.\nIntegrated automation tools for continuous delivery and improved deployment pipelines, enhancing development productivity by **30%**.\nParticipated in the development and maintenance of **RFCs** and protocols for standardization, fostering collaboration and interoperability across engineering teams.\nDesigned and implemented reliable workflows for data processing, processing over **1 million** records daily while maintaining system performance and accuracy.\nConducted unit testing and code reviews to uphold high standards of software quality, contributing to an overall reduction in bugs by **15%** post-deployment."
    }
  ],
  "skills": " **Programming Languages:** \n\tPython, Java, Go, JavaScript, TypeScript, C#, C++, Rust\n\n**Backend Frameworks:** \n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:** \n\tReact, Vue, Angular\n\n**API Technologies:** \n\tKeycloak (OIDC, RBAC), JWT, OAuth2\n\n**Serverless and Cloud Functions:** \n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Databases:** \n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps:** \n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:** \n\tLinux, QEMU, VMManagement\n\n**Other:** \n\tMLflow, Airflow, Kubeflow, RFCs, Protocols, DataProcessing, AsynchronousWork, MalwareAnalysis, Automation",
  "apply_company": "Recorded Future"
}