{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Developer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-187801395/",
  "profile_summary": "Senior Developer with 13+ years of experience in delivering high-performance applications across the healthcare and financial industries. Proficient in **.NET**, **C#**, **Web API**, and database management with **SQL** and **PostgreSQL**. Skilled in **TypeScript**, and **JavaScript**, with hands-on expertise in **React**, **Angular**, and **NestJS** for frontend development. Strong understanding of backend systems and API design.\nExperienced in deploying cloud-native systems on **AWS** and adopting Agile methodologies along with **DevOps** practices for seamless CI/CD pipelines and automated testing. Demonstrates strong problem-solving abilities, effective communication, and collaboration skills while also mentoring junior developers.\nAdditionally, well-versed in compliance-driven development practices and building AI/ML-powered platforms, leveraging automation and real-time processing.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Developer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Developed enterprise-level applications utilizing **.NET**, **C#**, and **Web API**, ensuring high-quality coding standards and adhering to Agile methodologies.\nDesigned and implemented robust database solutions using **SQL** and **PostgreSQL**, optimizing complex queries and achieving performance enhancements by **30%**.\nEngineered front-end solutions with **TypeScript**, **React** and **Angular**, successfully delivering features within **2 weeks** of sprint cycles while enhancing user experience.\nLed CI/CD initiatives employing **automated testing** frameworks and tools, integrating with **GitHub Actions** to streamline deployments and reduce release times by **25%**.\nMentored junior developers, fostering a collaborative work environment while raising team competency in **DevOps** practices and problem-solving techniques.\nCollaborated effectively with cross-functional teams, enhancing communication channels to drive the success of multi-environment deployment strategies across projects.\nCreated Web APIs and microservices using **NestJS** to facilitate seamless integration across platforms, ensuring reliable service delivery and scalability.\nUtilized Agile project management practices to manage project timelines, resulting in the successful launch of **3 major products** within the past year, each meeting its performance targets.\nEmployed **JavaScript** libraries for interactive features and optimized front-end performance using best coding practices, achieving load times under **2 seconds**.\nImplemented comprehensive security measures during application development to protect user data, ensuring compliance with regulatory standards."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Utilized **.NET** and **C#** to develop scalable web APIs for core financial applications, ensuring seamless integration and robust functionality.\nImplemented **SQL** and **PostgreSQL** for efficient database management and data retrieval, optimizing query performance by **40%**.\nDesigned and built user-friendly front-end applications with **React (18)** and **TypeScript**, enhancing user experience and interactivity for various financial tools.\nCollaborated in an **Agile** environment, focusing on continuous integration and deployment (CI/CD) practices, which increased release frequency by **30%**.\nConducted **automated testing** with frameworks and tools to ensure high code quality and prevent regressions in critical applications.\nMentored junior developers in best practices and coding standards, fostering a collaborative team environment and enhancing overall productivity by **25%**.\nApplied strong problem-solving skills to troubleshoot and address issues quickly, maintaining system reliability for high-traffic applications with over **1M** daily users.\nEngaged in effective communication and collaboration within cross-functional teams, leading to successful project deliveries under tight deadlines.\nLeveraged modern web frameworks and cloud services, continuously updating technology stacks including **NestJS**, **React**, and **AWS** for front and backend development. "
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "• Developed robust backend services utilizing **.NET** and **C#**, ensuring high availability and scalability of core platform modules like API and database interactions, supporting over **100,000** concurrent users.\n• Created and consumed **Web APIs** for seamless data communication, enhancing system integration and performance by more than **30%**.\n• Implemented advanced SQL and **PostgreSQL** solutions to optimize data storage and retrieval processes, resulting in a **50%** increase in query performance.\n• Collaborated in an **Agile** development environment, conducting regular sprint reviews and retrospectives to enhance team communication and problem-solving effectiveness.\n• Mentored junior developers by sharing knowledge on **TypeScript**, **JavaScript**, and modern frontend frameworks such as **React**, **Angular**, and **NestJS**, fostering a collaborative learning atmosphere.\n• Conducted automated testing and robust quality assurance practices, incorporating **CI/CD** pipelines to streamline deployment processes and minimize downtime by **25%**.\n• Engaged in **DevOps** practices to manage infrastructure on **AWS**, optimizing deployment workflows and ensuring high uptime for applications.\n• Led discussions on best practices for coding standards and **collaboration** tools, improving code quality and team dynamics within the organization.\n• Drove initiatives for feature development by utilizing Agile methodologies, maintaining a focus on iterative improvements and timely delivery of application features."
    }
  ],
  "skills": "**Programming Languages:**\n\tC#, .NET, Python, JavaScript, TypeScript\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django, NestJS\n\n**Frontend Frameworks:**\n\tReact, Angular, Vue\n\n**API Technologies:**\n\tWeb API\n\n**Serverless and Cloud Functions:**\n\tAWS Lambda\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis, SQL\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS: ECS, RDS, S3; Azure: App Services, Blob Storage, SQL Database\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, Agile, automated testing, mentoring, problem-solving, communication, collaboration, Keycloak (OIDC, RBAC), OAuth2, JWT, Nginx, Let’s Encrypt, Certbot"
}