{
  "name": "Patryk Zaslawski",
  "role_name": "Senior Solutions Engineer",
  "email": "patrykzas0428@outlook.com",
  "phone": "+48669862402",
  "address": "Gdanski, Poland",
  "linkedin": "https://www.linkedin.com/in/patryk-z-9b9455391/",
  "profile_summary": "As a dynamic Senior Solutions Engineer with 8+ years in software engineering, I excel in **Python** development and possess robust capabilities in **data analysis** and **analytics**. My proficiency extends beyond technical implementation to include effective **project management** and **client engagement**, ensuring solutions meet client needs and drive results. I leverage my extensive experience in **AI** and **GIS** technologies to innovate and enhance system performance. With a strong foundation in high-performance applications and solutions design, I am adept at integrating **district heating** technologies while ensuring clear **communication** and collaboration across teams.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2014",
      "to_year": "2017",
      "location": "United Kingdom",
      "university": "The University of Manchester"
    }
  ],
  "experience": [
    {
      "role": "Senior Solutions Engineer",
      "company": "Binary Studio",
      "from_date": "Aug 2023",
      "to_date": "Present",
      "location": "United Kingdom (Remote)",
      "responsibilities": "Utilized **Python** to develop scalable solutions that leverage **GIS** and **analytics** for enhanced project management and client engagement within the energy sector.\nManaged data analysis projects utilizing **AI** for predictive insights, facilitating improved decision-making processes in district heating systems.\nEngaged in the architectural design and integration of advanced analytic tools to streamline workflow and optimize performance in energy operations.\nConducted extensive communication with stakeholders to ensure alignment on project goals and deliverables, enhancing client satisfaction and engagement.\nLed cross-functional teams in project development, ensuring successful implementation of solutions through effective project management and collaboration techniques.\nImplemented data-driven insights using **Python** and modern analytic tools, significantly improving operational efficiency and data utilization in energy projects.\nDelivered presentations and reports that effectively communicated project outcomes and insights derived from thorough data analysis, enhancing the decision-making capabilities of government and private clients.\nLeveraged strong communication skills to interact with clients and project stakeholders, ensuring engagement and clarity of project specifications and expectations.\nEmployed **analytics** and **AI** strategies to assess project performance, recommend improvements, and foster innovation in energy resource management."
    },
    {
      "role": "Software Engineer",
      "company": "Ardigen",
      "from_date": "Mar 2020",
      "to_date": "Aug 2023",
      "location": "Poland",
      "responsibilities": "Utilized **Python** for developing scalable and maintainable solutions for project management and data analysis, ensuring seamless integration with various data management tools.\nEngaged with clients to gather requirements and provide analytics-driven solutions, enhancing their experience in the energy domain, including district heating projects.\nLed project management efforts to ensure timely delivery and efficient resource allocation within a cross-functional team, achieving a **95%** on-time project completion rate.\nCollaborated with teams to implement GIS technologies in conjunction with **Python**, improving data visualization and geographic analysis for energy solutions.\nApplied AI techniques in data analysis to derive insights for district heating systems, facilitating better decision-making processes.\nImplemented effective communication strategies with stakeholders to align project objectives and expectations, boosting client engagement levels remarkably.\nPerformed analytics to evaluate the performance of project initiatives, leveraging data to recommend optimizations in energy utilization and district heating systems.\nDesigned and delivered training programs on data analysis and GIS utilization for clients, resulting in improved operational efficiencies in their processes.\nUtilized meticulous project management methods to oversee project lifecycles from conception to implementation, enhancing team collaboration and client satisfaction.\nDeveloped real-time data analysis tools that analyzed energy production and consumption patterns, leading to energy savings of up to **20%** for clients."
    },
    {
      "role": "Software Engineer",
      "company": "Altum Software",
      "from_date": "Oct 2017",
      "to_date": "Feb 2020",
      "location": "United Kingdom",
      "responsibilities": "Utilized **Python** to design and optimize backend services, ensuring robust functionality for energy-related applications in district heating projects.\nApplied strong **data analysis** and **analytics** skills to enhance client engagement and project management through effective communication of complex information.\nLeveraged GIS technologies to analyze geographic data, improving project outcomes and customer satisfaction in energy sector initiatives.\nDeveloped and maintained integrations with existing systems, applying advanced **Python** libraries to streamline project workflows and deliver actionable insights to stakeholders.\nConducted thorough **data analysis** to identify trends and provide innovative solutions to improve operational efficiency in district heating systems.\nCollaborated with cross-functional teams to gather requirements and implement features, ensuring alignment with strategic goals and client needs.\nManaged project timelines and deliverables, applying project management skills to ensure on-time completion and adherence to budget constraints.\nEngaged with clients to understand their needs, providing analytical support and recommendations on energy solutions tailored to their requirements.\nPresented complex technical concepts around energy analytics and GIS in a clear and concise manner to both technical and non-technical audiences, enhancing communication and engagement with clients.\nMonitored project progress using **AI** tools, optimizing workflows and ensuring project milestones are met efficiently and effectively.\nGenerated documentation detailing project specifications and analytics methodologies, maintaining clear guidelines for future project execution and client reference."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, GIS, AI\n\n **Backend Frameworks:**\n\tFastAPI, Django, Flask, Spring Boot\n\n **Frontend Frameworks:**\n\tAngular (1–16), React (15–18), Next.js, Vue.js (2/3), Blazor\n\n **API Technologies:**\n\tREST & gRPC APIs\n\n **Serverless and Cloud Functions:**\n\tAWS (Lambda), Azure\n\n **Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD\n\n **Cloud & Infrastructure:**\n\tAWS (ECS, RDS, S3), Azure (App Services, Blob, SQL)\n\n **Other:**\n\tSQLAlchemy, Pydantic, Celery, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, analytics, project management, data analysis, client engagement, energy, district heating, communication",
  "apply_company": "Gradyent"
}