{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior FullStack Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "As a Senior Full Stack Engineer with 8 years of experience, I excel in utilizing **React**, **TypeScript**, **Python**, and **Django** to create high-performance solutions in the healthcare and financial sectors. My expertise in **Next.js** and API development allows me to build scalable and maintainable applications, while my strong problem-solving, critical-thinking, and attention to detail skills ensure optimal delivery of software projects. I am well-versed in Agile methodologies, enhancing team collaboration and project efficiency.\n\nI possess a comprehensive understanding of cloud services, having worked extensively with **Azure** and **AWS**. My experience includes leading the development of enterprise-grade platforms, leveraging **observability** tools to monitor application performance. I have a strong foundation in microservices architecture and CI/CD automation, ensuring robust and compliant applications aligned with industry standards such as HIPAA, FHIR, PCI DSS, and SOC 2. Moreover, I bring hands-on experience in machine learning pipelines and MLOps workflows with tools like **MLflow**, **Airflow**, and **Kubeflow**.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior FullStack Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Utilized **React** and **Next.js** to architect and develop scalable, full-stack applications, employing **TypeScript** and **Python (Django)** for robust back-end solutions while ensuring adherence to industry standards.\nApplied **APIs** for seamless integration between front-end and back-end services, enhancing application observability and performance.\nExecuted Agile methodologies to coordinate development workflow, including sprint planning and iterative releases, improving overall project delivery times by **20%**.\nDemonstrated strong problem-solving and critical-thinking skills to troubleshoot complex system issues, achieving resolution within **48 hours** on average and contributing to improved application stability.\nConducted thorough code reviews with a focus on attention to detail, resulting in a reduction of bugs by **30%** in production releases.\nDeveloped web services that effectively communicate with databases using **Django REST Framework**, optimizing round-trip times and bolstering user experience.\nCollaborated closely with UI/UX designers to refine application interfaces for enhanced user engagement and satisfaction metrics - achieving an increase in user retention of **15%**.\nImplemented observability and monitoring solutions to enhance system reliability, leading to a **25%** decrease in system downtime.\nEngaged in regular brainstorming sessions with cross-functional teams to ideate and implement new features, improving application functionality and user base.\nLeveraged modern developer tools and best practices to maintain high-quality code standards and foster a culture of technical excellence within the team."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "- Developed and modernized financial platforms utilizing **React** (18), **TypeScript**, and **Python** (Django), enhancing scalability and maintainability for high-volume transaction systems.\n- Built dynamic and user-focused front-end applications employing **Next.js**, applying redux toolkit and **Tailwind CSS** to create responsive and performant interfaces for financial dashboards.\n- Led the integration of robust APIs to facilitate seamless communication between front-end and back-end services, ensuring smooth data flow and enhanced user experience.\n- Demonstrated strong problem-solving and critical-thinking skills by developing real-time transaction monitoring dashboards with **D3.js** and Power BI Embedded, enabling operational teams to track financial activity effectively.\n- Harnessed event-driven architecture using **Kafka**, **RabbitMQ**, and **Azure Service Bus** to support asynchronous communication and robust processing for transactions, alerts, and compliance workflows.\n- Implemented ETL pipelines with **Python**, **Apache Airflow**, and **Azure Data Factory** to enable batch and real-time ingestion of financial data, improving data accessibility and accuracy.\n- Applied AI/ML techniques to develop fraud detection systems leveraging **scikit-learn**, **XGBoost**, and **Azure Machine Learning**, proactively identifying suspicious activities in banking transactions.\n- Created ML pipelines for credit scoring and transaction classification using **MLflow** and Airflow, integrating direct model inference into backend services to enhance real-time decision-making capabilities."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Utilized **React** (18) and **TypeScript** to develop dynamic, responsive frontend applications, ensuring seamless user experiences on both web and mobile platforms.\nLeveraged **Python** with **Django** to design and optimize backend services for a global e-commerce platform, achieving high availability and scalability for key modules by managing over **100,000 transactions** per day.\nImplemented APIs to facilitate communication between frontend and backend, enhancing data flow and user interface performance by reducing load time by **30%**.\nApplied **Ruby on Rails** for rapid prototyping and development of new features, maintaining code quality and adhering to best practices within an **Agile** environment.\nEnhanced application observability through rigorous logging and monitoring to proactively identify and resolve issues, ensuring service reliability and minimizing downtime to less than **1%** annually.\nExercised strong problem-solving and critical-thinking skills to analyze system performance and implement effective solutions that improved response times by **25%**.\nAdopted a meticulous attention to detail when building responsive, SEO-friendly e-commerce UIs using **Next.js** and HTML5/CSS3 to ensure compliance with **WCAG 2.1** accessibility guidelines.\nEngaged in regular code reviews and collaborative discussions to foster a high-quality codebase, mentoring junior developers and promoting best practices in software development.\nContributed to architectural decisions and strategic planning that improved overall application sustainability and performance across the tech stack."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, Ruby, TypeScript\n\n **Backend Frameworks:**\n\tDjango, Rails, FastAPI, Flask\n\n **Frontend Frameworks:**\n\tReact, Vue, Angular, Next.js\n\n **API Technologies:**\n\tAPIs\n\n **Serverless and Cloud Functions:**\n\tAWS (Lambda), Azure (App Services)\n\n **Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:**\n\tAWS (ECS, RDS, S3), Azure (Blob, SQL)\n\n **Other:**\n\tMLflow, Airflow, Kubeflow, Authentication & Security (Keycloak, JWT, OAuth2, Let’s Encrypt, Nginx, Certbot), Observability, Agile, Problem-solving, Critical-thinking, Attention to detail",
  "apply_company": "Numan"
}