{
  "name": "Mariusz Jan Skobel",
  "role_name": "IT Engineer",
  "email": "mariuszskobel15@outlook.com",
  "phone": "+48 735 343 548",
  "address": "Katowice, Poland",
  "linkedin": "https://www.linkedin.com/in/mariusz-skobel-789557397/",
  "profile_summary": "IT Engineer with 10+ years of experience in **cloud technologies**, **infrastructure management**, and **IT operations**. Proficient in **SQL** for database management and skilled in **Windows Server** and **virtualization** technologies. Strong background in problem-solving, vendor management, and collaborating with cross-functional teams to optimize IT processes. Experienced in managing **ERP systems** and implementing **ITIL** best practices to enhance service delivery.\nAdditionally, I bring extensive full-stack development expertise, utilizing **JavaScript/TypeScript**, **Python**, and **Flutter** within the framework of **React**, **Next.js**, **Node.js**, **FastAPI**, and **Django**. Successfully delivered high-performance software solutions in healthcare and finance, with a focus on building secure, maintainable applications that comply with standards such as HIPAA and PCI DSS. Passionate about leveraging technology to drive organizational efficiency and real-world impact.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2012",
      "to_year": "2015",
      "location": "UK",
      "university": "University of Bristol"
    }
  ],
  "experience": [
    {
      "role": "IT Engineer",
      "company": "EitBiz",
      "from_date": "Oct 2022",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "•\tManaged IT operations ensuring seamless performance of infrastructure and applications, applying **ITIL** best practices to optimize service delivery.\n•\tMaintained and configured **Windows Server** environments, enforcing security measures and performing regular updates to ensure compliance and reliability.\n•\tConducted database administration using **SQL** for data management and reporting, supporting organizational decision-making processes.\n•\tImplemented virtualization technologies, enhancing resource utilization and deployment speed while managing both on-premise and cloud solutions.\n•\tOversaw the network infrastructure utilizing **Cisco** solutions, ensuring robust connectivity and security across all operational locations.\n•\tIntegrated and supported **ERP systems**, facilitating enhanced data flow and operational efficiency across departments.\n•\tExecuted vendor management strategies, negotiating contracts and ensuring compliance with service level agreements (SLAs) to optimize costs and performance.\n•\tUtilized **cloud technologies** to enhance operational capabilities, focusing on scalable solutions that align with business needs, leveraging services like **AWS** and **Azure**.\n•\tDemonstrated exceptional problem-solving skills, implementing innovative solutions to address technical challenges, achieving a **20%** reduction in service downtime.\n•\tFostered a team-oriented environment through collaboration and knowledge sharing, contributing to a **15%** increase in project completion rates."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Tvn S.A.",
      "from_date": "Oct 2019",
      "to_date": "Sep 2022",
      "location": "Poland",
      "responsibilities": "Managed IT operations ensuring high availability and performance of financial platforms, adhering to **ITIL** best practices to enhance service delivery and IT processes.\nPerformed infrastructure management tasks utilizing **Windows Server**, optimizing resources and ensuring security and compliance across systems.\nImplemented and maintained **SQL** databases to support data storage, retrieval, and analysis, ensuring data integrity and availability for financial applications.\nUtilized **virtualization** technologies to maximize server utilization, leading to a **30%** reduction in operational costs related to hardware.\nCollaborated with cross-functional teams to integrate **cloud technologies** (e.g., Azure) for scalable solutions, enabling a **50%** increase in system responsiveness during peak transactional periods.\nEngaged in vendor management strategies, negotiating contracts which resulted in **15%** savings in software licensing costs.\nAddressed IT issues through effective problem-solving techniques, resolving over **95%** of reported incidents within stipulated SLAs.\nMaintained a team-oriented environment by promoting collaborative teamwork and knowledge sharing, contributing to a **20%** improvement in project delivery times."
    },
    {
      "role": "Software Engineer",
      "company": "Timspark",
      "from_date": "Sep 2015",
      "to_date": "Aug 2019",
      "location": "UK",
      "responsibilities": "Managed IT operations to ensure seamless infrastructure management and high availability across various systems, including **Windows Server** and **SQL** solutions.\nLeveraged ITIL best practices to optimize processes, enhancing service delivery efficiency by **20%** and reducing incident response times by **30%**.\nImplemented virtualization technologies for resource optimization, reducing physical server footprint by **40%** and improving hardware utilization.\nCollaborated with cross-functional teams to integrate and support **ERP systems**, ensuring alignment with business needs and operational efficiency.\nConducted vendor management to assess, select, and negotiate contracts with **Cisco** and other technology providers, achieving a cost reduction of **15%**.\nApplied cloud technologies to migrate legacy systems, resulting in improved scalability and flexibility across platforms, benefitting business continuity.\nExecuted problem-solving initiatives to troubleshoot and resolve ongoing IT issues, enhancing operational performance and user satisfaction metrics by **25%**.\nFostered a team-oriented culture, facilitating collaboration across departments to achieve targeted project milestones and organizational goals."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, JavaScript, TypeScript\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n **Frontend Frameworks:**\n\tReact, Vue, Angular\n\n **API Technologies:**\n\tMLflow, Airflow, Kubeflow\n\n **Serverless and Cloud Functions:**\n\tAWS (Lambda), Azure (App Services)\n\n **Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis, SQL\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:**\n\tAWS (ECS, RDS, S3), Azure (Blob), Windows Server, Virtualization, Infrastructure management, Cloud technologies\n\n **Other:**\n\tIT operations, ITIL, Cisco, ERP systems, Vendor management, Problem-solving, Team-oriented, Authentication & Security: Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot"
}