{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Backend Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-623a26390/",
  "profile_summary": "Backend Engineer with 13+ years of experience in delivering scalable applications, particularly in the healthcare and financial sectors. Proficient in **Elixir**, **Phoenix**, and **Postgres**, with extensive hands-on expertise in **JavaScript**, **TypeScript**, **Node.js**, **React**, **Next.js**, and**Vue**. Demonstrated ability to implement CI/CD pipelines using **GitLab** and deploy systems on **AWS** utilizing **Kubernetes** for container orchestration and **Docker** for consistent development environments. \nStrong background in building microservices, event-driven architectures, and AI/ML solutions that enhance predictive analytics, automation, and real-time processing. Committed to compliance-driven development, aligning projects with standards such as HIPAA and PCI DSS. Well-versed in MLOps practices, including model training and orchestration.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Backend Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Built and maintained scalable backend systems using **Elixir** and **Phoenix**, optimizing for performance and efficiency to support high-volume transactions and data handling.\n- Designed and implemented **Postgres** databases for robust data storage, ensuring data integrity and high availability in health and finance applications.\n- Developed CI/CD pipelines with **GitLab**, automating deployment processes and integration steps for streamlined development cycles and improved code quality.\n- Leveraged containerization tools like **Docker** and orchestration with **Kubernetes** to manage application deployment, scaling, and monitoring across multiple environments.\n- Integrated modern frontend frameworks like **Next.js**, **React**, **Vue**, and **Angular** to facilitate seamless communication between backend services and user interfaces.\n- Collaborated with cross-functional teams to define software requirements, translating them into effective engineering solutions that address user needs and technical constraints.\n- Ensured adherence to best security practices, facilitating compliance with regulations relevant to healthcare and financial industries.\n- Created detailed documentation for backend services, CI/CD processes, and database schemas, ensuring maintainability and knowledge sharing within the team.\n- Conducted regular code reviews and maintained high standards of code quality, employing tools such as **ESLint** and **Prettier** for consistent formatting and linting."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Designed and maintained scalable backend solutions utilizing **Elixir** and **Phoenix** frameworks, focusing on microservices architecture to enhance performance and reliability in high-demand environments.\nDeveloped and optimized **Postgres** database schemas and queries, improving data retrieval time by **30%** for critical financial applications.\nImplemented CI/CD pipelines using **GitLab** to streamline deployment processes, reducing deployment times from **2 hours** to **15 minutes** while improving code quality and consistency.\nUtilized **AWS** cloud services to deploy applications with **Kubernetes** and **Docker**, ensuring seamless scalability and management of containerized environments.\nCollaborated with frontend teams developing components in **Next.js**, **React**, and **Vue**, ensuring smooth integration and user experience across all financial platforms.\nInvested in performance monitoring tools for predictive analysis and operational insights, achieving a **25%** decrease in system downtimes.\nConducted regular code reviews and knowledge sharing sessions, fostering a culture of continuous improvement and professional growth within the engineering team."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Developed and maintained robust backend services using **Elixir** (Phoenix) integrated with **Postgres**, ensuring peak performance, scalability, and high availability for all critical functionalities across the e-commerce platform.\nImplemented CI/CD pipelines via **GitLab**, streamlining deployment processes and reducing time to market by **30%** while maintaining quality and consistency through automated testing and monitoring.\nOrchestrated containerization strategies using **Docker** and orchestrated applications with **Kubernetes**, delivering diverse applications in a cloud-native environment.\nCollaborated with frontend teams to enhance user experience via **React**, **Vue**, and **Angular** frameworks, implementing features that increased user engagement by over **25%**.\nManaged cloud infrastructure in **AWS**, optimizing resources and minimizing deployment costs by **15%** through effective resource monitoring and scaling.\nCreated and optimized responsive and SEO-compliant user interfaces utilizing **Next.js**, ensuring compatibility and performance across all devices.\nDesigned data models within **Postgres** to support efficient data handling and improved query performance, achieving response times under **200ms** for all critical transactions.\nLed cross-functional teams through agile methodologies, delivering project milestones on time and fostering a culture of continuous improvement and collaboration.\nAdvanced application security by implementing best practices, such as role-based access control (RBAC) and OAuth 2.0, ensuring user data protection and compliance with standards such as GDPR."
    }
  ],
  "skills": "**Programming Languages:**\n\tElixir, Python\n\n**Backend Frameworks:**\n\tPhoenix, FastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tNext.js, React, Vue, Angular\n\n**API Technologies:**\n\t\n\n**Serverless and Cloud Functions:**\n\tAWS: Lambda\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming)\n\n**DevOps:**\n\tDocker, Kubernetes, GitLab CI/CD, GitHub Actions\n\n**Cloud & Infrastructure:**\n\tAWS: ECS, RDS, S3, Azure: App Services, Blob Storage, SQL Database\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), OAuth2, JWT, Nginx, Let’s Encrypt, Certbot, Redis, Terraform, Ansible, Helm, Docker Compose"
}