{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Cloud Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Senior Cloud Engineer with 13+ years of experience in **Cloud Infrastructure**, **System Administration**, and performance tuning within healthcare and financial industries. Proficient in **Linux**, **PHP**, **Python**, and **Bash**, with a strong focus on database management and security monitoring. Adept at implementing effective incident response strategies and maintaining high-performance systems through robust network monitoring.\n\nDemonstrated expertise in deploying cloud-native applications on AWS and Azure, utilizing CI/CD pipelines, and microservices architecture. Proven ability to solve complex problems and provide exceptional customer support, while ensuring solutions align with compliance standards such as HIPAA, PCI DSS, and SOC 2. Committed to technical documentation and enhancing operational efficiency.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Cloud Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Managed and optimized **Linux** environments for cloud infrastructure deployments, ensuring system stability and reliability for **Senior Cloud Engineer** projects.\nDeveloped scripts in **Bash** and **Python** to automate routine system administration tasks, enhancing operational efficiency by **30%**.\nMonitored network performance and conducted tuning activities, reducing incident response time by **40%** through proactive alerts and diagnostics.\nImplemented security monitoring practices to safeguard cloud resources, enforcing compliance with best security standards and reducing vulnerabilities by **50%**.\nDesigned and maintained databases with expertise in database management and performance tuning, ensuring high availability and optimized query performance for critical applications.\nAuthored and maintained technical documentation for cloud infrastructure configurations and processes, improving onboarding time for new team members by **25%**.\nProvided customer support to internal teams, guiding them through technical issues and optimizing their use of cloud resources, resulting in a **20%** increase in satisfaction ratings.\nLed incident response efforts during outages, coordinating with cross-functional teams to restore services rapidly and mitigate future risks effectively.\nUtilized cloud services according to project requirements, ensuring deployments aligned with industry standards and service level agreements (SLAs)."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Managed **Linux** servers for optimal performance and reliability in cloud environments, utilizing **Bash** scripting for automated tasks and system administration.\nImplemented and monitored **Cloud Infrastructure** solutions to enhance scalability, availability, and security of multi-tenant applications.\nExecuted performance tuning measures, achieving an average reduction of latency by **30%** across cloud services.\nOversaw **Database Management** tasks, ensuring data integrity and availability, contributing to a **99.9%** uptime in critical applications.\nConducted **Network Monitoring** to swiftly identify and resolve connectivity issues, improving overall network resilience by **25%**.\nProvided **Technical Documentation** for cloud architecture and processes to streamline knowledge sharing and onboarding.\nLed **Incident Response** initiatives, coordinating efforts to mitigate service disruptions and executing a swift recovery plan, successfully reducing downtime by **40%**.\nDrove **Problem Solving** efforts in diagnosing complex technical issues, providing effective solutions in line with best practices for cloud services.\nOffered **Customer Support** for cloud-based services, enhancing user satisfaction ratings by **15%** through timely resolution of inquiries and technical issues."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Managed **Linux** environments to enhance system performance and reliability, applying **performance tuning** techniques to ensure optimal operation of cloud infrastructure supporting **PHP** and **Python** applications.\nOversaw **cloud infrastructure** deployment and maintenance, ensuring robust resource management and uptime for critical services and applications.\nDeveloped and maintained **technical documentation** for each system and process, facilitating clear communication and knowledge sharing within the team, including incident response procedures for timely resolution of system issues.\nExecuted **system administration** tasks including monitoring network and server performance, ensuring compliance with security standards, and implementing best practices for **security monitoring** across cloud environments.\nUtilized **Bash** scripting to automate repetitive tasks, improving efficiency and reducing human error in system configurations and deployments.\nConducted performance metrics analysis and troubleshooting for database systems, utilizing effective **database management** strategies to optimize access and ensure data integrity.\nProvided **customer support** by promptly addressing technical queries and issues related to the cloud infrastructure, fostering a high level of satisfaction among clients.\nCollaborated with cross-functional teams to develop and enhance cloud services, implementing solutions that improved incident response time by **30%** and reduced operational costs by **20%**.\nDesigned and executed **security monitoring** protocols that resulted in a **40%** decrease in security incidents, ensuring the integrity and safety of customer data and applications."
    }
  ],
  "skills": "Programming Languages:\n\tPHP, Python, Bash\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tJavaScript/TypeScript: React, Vue, Angular\n\n**API Technologies:**\n\tKeycloak (OIDC, RBAC), OAuth2, JWT\n\n**Serverless and Cloud Functions:**\n\tAWS: Lambda, ECS; Azure: App Services\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS: RDS, S3; Azure: Blob Storage, SQL Database, Cloud Infrastructure\n\n**Other:**\n\tLinux, System Administration, Network Monitoring, Performance Tuning, Database Management, Security Monitoring, Technical Documentation, Incident Response, Problem Solving, Customer Support",
  "apply_company": "Jamf"
}