{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Golang Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Senior Golang Engineer with 13+ years of experience specializing in **Golang** and **Kubernetes** to build robust microservices and distributed systems. Proficient in designing **API** integrations, implementing **event-driven architectures**, and executing **CI/CD** strategies to ensure seamless deployment. Committed to fostering an open-source culture, demonstrating a strong collaborative mindset while driving innovation in development teams.\nSkilled in leveraging a diverse **tech stack**, including **JavaScript/TypeScript**, **Python**, and **Flutter**, with hands-on expertise in frontend frameworks such as **React**, **Next.js**, **Vue**, and backend technologies like **Node.js**, **FastAPI**, and **Django**. Experienced in developing AI/ML-powered platforms with a focus on predictive analytics, automation, and real-time data processing, while ensuring compliance with industry standards such as HIPAA and PCI DSS.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Golang Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Developed and maintained microservices using **Golang** for high-performance applications within distributed systems, ensuring scalability and resilience.\nImplemented **Kubernetes** orchestrated solutions for deployment and management of containerized applications, enhancing system performance and reliability.\nDesigned and built robust APIs following **Event-driven Architecture**, enabling seamless integration with various services and supporting real-time data processing.\nEstablished CI/CD pipelines using industry-standard tools to streamline application delivery, incorporating automated testing and deployment workflows for consistent and reliable releases.\nLeveraged **Open Source** tools and frameworks to foster innovation and collaboration, enhancing overall project efficiency and code quality.\nCollaborated with cross-functional teams to drive project success, fostering a **Collaborative Mindset** to achieve shared goals and deliver high-quality software solutions.\nIntegrated and optimized business logic within microservices, facilitating efficient communication and data management across distributed components.\nEstablished rigorous testing protocols to ensure software quality and system integrity, utilizing **API** testing frameworks and tools to validate functionality and performance.\nAdopted and integrated **Model Context Protocol** for enhancing interoperability between services, promoting a standardized approach to context management.\nLed the transformation of legacy systems to a microservices architecture, improving deployment cycles and enabling faster development times.\nEngaged in routine code reviews and architecture discussions, driving best practices and coding standards across the development team."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Implemented **microservices** architecture to modernize core financial platforms, leveraging **Golang** for improved scalability and performance in high-volume transactional systems.\nUtilized **Kubernetes** for orchestration and management of containerized applications, ensuring efficient deployment and scaling across environments.\nDesigned and developed high-performance **API** endpoints, facilitating seamless integration within distributed systems and enhancing system responsiveness.\nAdopted an event-driven architecture with **Kafka** and **RabbitMQ**, streamlining asynchronous communication for mission-critical workflows such as payments and compliance, which improved processing times by **40%**.\nCollaborated with cross-functional teams, fostering a **collaborative mindset** and ensuring alignment on project goals and methodologies, contributing to a 25% reduction in development cycles.\nImplemented CI/CD pipelines to automate deployment processes, reducing the time to market for new features by **30%** and ensuring high-quality standards across all codebases.\nEngaged in the development of open source tools, enhancing community collaboration and knowledge sharing, which led to improved efficiency in project execution."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Utilized **Golang** to design and develop **microservices** architecture for high-performance backend services, ensuring seamless communication via **API** endpoints and integration with other systems.\nImplemented **Kubernetes** for orchestrating containerized applications, improving deployment efficiency, management, and scalability of distributed systems, achieving a **30%** reduction in deployment time.\nAdopted **event-driven architecture** principles, leveraging **Model Context Protocol** to facilitate real-time data processing and inter-service communication across the platform.\nDeveloped and maintained CI/CD pipelines to automate testing and deployment processes, reducing release cycle time by **40%**, improving code quality, and enhancing team productivity.\nApplied a **collaborative mindset** by actively engaging in code reviews and architecture discussions, contributing to open source projects to foster community-driven solutions and innovation.\nMonitored and optimized system performance, addressing bottlenecks to ensure high availability and responsiveness for users, resulting in a **50%** decrease in latency across critical services.\nEngaged in knowledge-sharing sessions with teams, promoting best practices in **microservices** and **distributed systems** design, facilitating an environment of continuous learning and improvement."
    }
  ],
  "skills": " **Programming Languages:**\n\tGolang, Python, JavaScript/TypeScript\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tAPI\n\n**Serverless and Cloud Functions:**\n\tAWS: ECS, Lambda, Azure: App Services\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, CI/CD\n\n**Cloud & Infrastructure:**\n\tTerraform, Ansible, Helm, Docker Compose\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, Model Context Protocol, Microservices, Distributed Systems, Event-driven Architecture, Open Source, Collaborative Mindset, Authentication & Security: Keycloak (OIDC, RBAC), OAuth2, JWT, Nginx, Let’s Encrypt, Certbot",
  "apply_company": "Stacklok"
}