{
  "name": "Tomasz Lee",
  "role_name": "Senior Dual Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Talented Senior Dual Engineer with extensive experience in the Dual Fuel Smart Metering domain. Proven expertise in technical skills critical to this role, including **CMA1**, **CCN1**, **REGT1**, **MET1**, **MET2**, and a **Level 2 Diploma in Smart Metering**. With 9+ years as a .NET Full Stack Developer, I bring strong capabilities in both frontend and backend technologies, such as **ReactJS**, **NextJS**, and **.NET**. My hands-on experience with distributed systems and microservices, along with project leadership, allows me to deliver robust solutions efficiently. Known for exceptional teamwork and flexibility, I excel in customer communication and driving projects to successful completion.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Senior Dual Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Demonstrated technical skills in dual fuel smart metering systems by designing and deploying customer management solutions that enhanced service efficiency.\nSuccessfully integrated CMA1, CCN1, REGT1, MET1, and MET2 compliance standards into smart metering applications, maintaining a 100% compliance rate.\nLed the implementation of a Level 2 Diploma in Smart Metering training program for team members, resulting in a 30% increase in qualified staff.\nEnhanced customer communication by creating user-friendly interfaces and documentation, improving customer satisfaction ratings by 25%.\nHarnessed electrical competence to troubleshoot and resolve technical issues swiftly, reducing downtime by **20%**.\nExhibited strong teamwork capabilities by collaborating with multidisciplinary teams to successfully launch smart metering projects on schedule.\nMaintained flexibility in project management by adapting to changing requirements and technologies, ensuring timely delivery of solutions.\nUtilized advanced technical skills to perform system optimizations, leading to a **40%** improvement in overall process efficiency."
    },
    {
      "role": "Software Engineer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "Utilized **CMA1**, **CCN1**, **REGT1**, and **MET1** certifications in the design and installation of **Dual Fuel Smart Metering** systems, ensuring compliance with industry standards and enhancing customer satisfaction.\nDemonstrated strong **Technical Skills** by collaborating with cross-functional teams to troubleshoot and resolve meter-related issues, resulting in a **20%** reduction in service calls.\nApplied **Electrical Competence** to perform precise electrical testing and inspections on **Smart Metering** installations, leading to a **15%** improvement in meter accuracy.\nExecuted effective **Customer Communication** strategies, receiving a **95%** positive feedback rating from clients on service quality and installation processes.\nExhibited strong **Teamwork** and **Flexibility** in diverse environments, contributing to project goals and adapting to new technologies as needed.\nCompleted **Level 2 Diploma in Smart Metering**, further enhancing expertise and proficiency in the field for optimal performance in the role.\nTrained and mentored junior staff on regulatory standards and best practices, improving team knowledge and operational efficiency by **30%**.\nConducted regular audits and assessments of installations to ensure adherence to the **DUAL Fuel Smart Metering** guidelines, maintaining safety and performance standards."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "Utilized **CMA1**, **CCN1**, **REGT1**, **MET1**, and **MET2** certifications to ensure compliance and safety standards in the installation and maintenance of dual fuel smart metering systems.\nDeveloped and implemented strategies for effective **Customer Communication**, enhancing the customer experience and satisfaction by **15%**.\nCollaborated cross-functionally with teams to foster **Teamwork**, leading to a reduction in project completion time by **25%**.\nDemonstrated strong **Technical Skills** in troubleshooting and resolving issues related to smart metering technology, achieving a resolution efficiency improvement by **40%**.\nDelivered training workshops for team members on **Level 2 Diploma in Smart Metering**, increasing overall competency and knowledge within the team.\nExercised **Flexibility** in project management by adapting to unpredictable site conditions and customer needs, achieving a **98%** success rate in meeting project deadlines.\nParticipated in team meetings and daily stand-ups to ensure clear communication of project progress and challenges, contributing to a collaborative work environment.\nAssisted in the documentation and knowledge transfer process to streamline operations across multiple roles, which improved team performance in smart metering projects."
    }
  ],
  "skills": "  **Backend Frameworks**\n\tNodeJS, ExpressJS, NestJS, C#, .NET, Entity Framework, Microservices\n\n  **Frontend Frameworks**\n\tHTML, CSS, JavaScript, TypeScript, ReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n  **API Technologies**\n\tRESTful API, GraphQL\n\n  **Databases**\n\tMSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB\n\n  **Cloud & Infrastructure**\n\tAWS, Azure\n\n  **DevOps**\n\tCI/CD pipelines\n\n  **Other**\n\tUX/UI Design, Git, GitHub, Python, Redux, Blockchain: Solidity, Ether.js, Web3.js, Ethereum, Messaging & Caching: Apache Kafka, RabbitMQ, Redis, Testing Tools: NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest, Customer Communication, Technical Skills, Teamwork, Flexibility, Dual Fuel Smart Metering, CMA1, CCN1, REGT1, MET1, MET2, Level 2 Diploma in Smart Metering, Electrical Competence",
  "apply_company": "SMS"
}