{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Software Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Results-driven Senior Software Engineer with 13+ years of experience in developing high-performance applications in the healthcare and financial sectors. Proficient in **Go**, **Java**, **Kotlin**, and **Docker**, with expertise in **Kubernetes** for orchestration and **Azure DevOps** for pipeline automation. Skilled in designing and implementing **microservices** architectures, RESTful **APIs**, and utilizing **CI/CD** practices to ensure seamless software delivery. Experienced in both SQL and NoSQL databases, along with strong capabilities in **ETL**, **TDD**, and **Clean Code** methodologies.\n\nAdept in building AI/ML-powered platforms for data analytics and automation while maintaining compliance with industry standards such as HIPAA, PCI DSS, and SOC 2. Demonstrates effective communication and team-oriented collaboration, combined with a solid background in **Artificial Intelligence** and **Data Analytics**. Strong problem-solving skills with a commitment to delivering robust, high-quality software solutions.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Software Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Developed and maintained microservices architectures utilizing **Docker** and **Kubernetes** (version **1.21**), ensuring scalable, fault-tolerant deployments across multiple environments with **Azure DevOps**.\n- Implemented CI/CD pipelines using **Azure DevOps** and **GitHub Actions**, incorporating automated testing, deployment workflows, and security checks to enhance code quality and efficiency.\n- Designed and built RESTful APIs for service integration, employing best practices in **Clean Code** and **TDD**, enabling seamless communication between services and enhancing system reliability.\n- Employed **SQL** and **NoSQL** databases effectively, including **PostgreSQL**, and **MongoDB**, to manage and analyze large datasets with a focus on performance optimization and data integrity.\n- Led data analytics initiatives that focused on ETL processes and intelligence integration, driving data-driven decision-making by developing analytical frameworks and reporting tools.\n- Collaborated with cross-functional teams to design and integrate robust solutions based on **Go** and **Kotlin**, ensuring the delivery of high-quality software products.\n- Advocated for and enforced testing strategies across the entire software stack using **Postman**, **Jest**, and **Cypress** to achieve comprehensive code coverage and reliability.\n- Enhanced team collaboration and project delivery through effective communication strategies and defined agile practices, ensuring milestones were met consistently within timelines.\n- Contributed to the development of innovative AI features, leveraging **Artificial Intelligence** tools for enhanced functionality and user experience within applications.\n- Championed best practices in software development, emphasizing team-oriented outcomes and fostering a culture of knowledge sharing and continuous improvement."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Leveraged **Go** and **Kotlin** to develop high-performance microservices and RESTful APIs that improved system modularity and scalability by **40%**.\nImplemented **Docker** and **Kubernetes** for containerization and orchestration, enhancing deployment efficiency and service reliability, achieving a **30%** reduction in production downtimes.\nDeveloped CI/CD pipelines using **Azure DevOps**, facilitating seamless integration and continuous delivery of applications, which accelerated the deployment process by **25%**.\nConducted thorough **TDD** practices to ensure high-quality code and reduced bug rates, leading to an overall application stability improvement of **35%**.\nApplied **SQL** and **NoSQL** databases to optimize data storage and retrieval processes, achieving a performance improvement of **20%** in query execution times.\nOrchestrated ETL processes to handle large datasets and integrate data analytics into real-time applications, utilizing best practices in **Data Analytics**.\nEmployed principles of **Clean Code** to enhance maintainability and readability of code across development teams, fostering a collaborative and team-oriented environment.\nFacilitated team communication by actively participating in code reviews and providing constructive feedback, contributing to a culture of continuous improvement and knowledge sharing.\nIntegrated **Artificial Intelligence** techniques in analytical frameworks, enabling robust data-driven decisions and predictive insights for strategic planning."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Leveraged **Go** and **Kotlin** in developing scalable backend services within a microservices architecture, ensuring seamless integration through well-defined **APIs** and demonstrating high proficiency in **Docker** and **Kubernetes** for containerization and orchestration.\nUtilized **Azure DevOps** for implementing **CI/CD** pipelines, promoting efficient code deployment and integration while adhering to **TDD** principles and maintaining **Clean Code** practices.\nEngineered robust, data-driven solutions by implementing advanced **SQL** and **NoSQL** databases, facilitating effective **ETL** processes for data management and analytics, leading to data-driven decision-making across the organization.\nDrove application stability and performance through rigorous **Data Analytics** initiatives, optimizing system resource usage and improving response times by **30%** on average.\nCollaborated within cross-functional teams, fostering a **team-oriented** environment and enhancing communication, resulting in a **25%** increase in project delivery speed through agile methodologies.\nIntegrated state-of-the-art **Artificial Intelligence** solutions to enhance application functionality, yielding a **15%** improvement in user engagement metrics.\nParticipated in regular code reviews and knowledge-sharing sessions to cultivate a culture of continuous learning, resulting in measurable improvements in team coding standards and effective problem resolution.\nDeveloped comprehensive documentation and guided team members in adopting best practices for software development and deployment, ensuring alignment with organizational goals and industry standards."
    }
  ],
  "skills": " **Programming Languages**\n\tGo, Kotlin, Java, Python, JavaScript/TypeScript\n\n **Backend Frameworks**\n\tFastAPI, Flask, Django\n\n **Frontend Frameworks**\n\tReact, Vue, Angular\n\n **API Technologies**\n\tAPI, OAuth2, JWT\n\n **Serverless and Cloud Functions**\n\tAWS: Lambda, Azure: App Services\n\n **Databases**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n **DevOps**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose, Azure DevOps\n\n **Cloud & Infrastructure**\n\tAWS: ECS, RDS, S3, Azure: Blob Storage, SQL Database\n\n **Other**\n\tMLflow, Airflow, Kubeflow, Microservices, ETL, TDD, Clean Code, Data Analytics, team-oriented, communication",
  "apply_company": "fino"
}