{
  "name": "Mariusz Jan Skobel",
  "role_name": "Senior Fullstack Engineer",
  "email": "mariuszskobel15@outlook.com",
  "phone": "+48 735 343 548",
  "address": "Katowice, Poland",
  "linkedin": "https://www.linkedin.com/in/mariusz-skobel-927764397/",
  "profile_summary": "Senior Full Stack Engineer with over 10 years of experience in delivering high-performance software solutions, specializing in **React**, **TypeScript**, **Node.js**, and **Python**. Demonstrated expertise in building scalable applications utilizing **Redux**, **HTML**, **CSS**, and REST/GraphQL APIs, with a strong focus on performance optimization and adherence to best practices in CI/CD. Proficient in architecting secure, maintainable solutions that ensure compliance with industry standards. Hands-on experience with cloud services such as **AWS** (including **EC2**, **Lambda**, and **S3**) for deploying cloud-native applications, and databases like **PostgreSQL** and **MongoDB**. Solid skills in ensuring application security and optimizing performance using modern tools such as Lighthouse and Axe.\n\nFurther, I bring practical experience in integrating MLOps processes—from developing ML pipelines to managing workflows with tools like MLflow and Airflow. Committed to developing systems that drive real-world impact while fostering collaboration and innovation.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2012",
      "to_year": "2015",
      "location": "UK",
      "university": "University of Bristol"
    }
  ],
  "experience": [
    {
      "role": "Senior Fullstack Engineer",
      "company": "EitBiz",
      "from_date": "Oct 2022",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Designed and implemented scalable full-stack solutions using **React** (17–18), **TypeScript**, and **Node.js**, ensuring adherence to best practices for performance optimization, security, and regulatory standards like HIPAA and PCI DSS.\n• Developed intricate single-page applications leveraging **Redux** and **Hooks** for state management, enhancing user interaction and engagement across both web and API services.\n• Spearheaded the integration of **GraphQL** for efficient data retrieval and manipulation, optimizing query performance with real-time insights from **PostgreSQL** and **MongoDB**.\n• Optimized deployment strategies through CI/CD pipelines using **GitHub Actions** and **AWS services** like **Lambda** and **S3**, ensuring streamlined integration and continuous delivery with minimal downtime.\n• Developed and maintained responsive UIs with **HTML** and **CSS**, implementing best practices to enhance user experience and accessibility.\n• Collaborated with cross-functional teams to produce high-performance RESTful services, utilizing **Node.js** and **Express`**, ensuring secure communication between front-end and back-end systems.\n• Conducted performance audits and security scans using **Lighthouse** and **Axe** to ensure applications met industry standards and provided a smooth user experience.\n• Analyzed user feedback and application performance to inform feature improvements and iterations, effectively reducing load times by **30%**.\n• Implemented robust backend solutions in **Python** for data processing tasks and integrated with **Firebase** for real-time database functionalities, enhancing overall application responsiveness.\n• Launched new features guided by user-centered design principles and data-driven insights, successfully increasing user engagement by **25%** over **6 months**."
    },
    {
      "role": "Software Engineer",
      "company": "Tvn S.A.",
      "from_date": "Oct 2019",
      "to_date": "Sep 2022",
      "location": "Poland",
      "responsibilities": "Utilized **React (18)**, **TypeScript**, and **Redux Toolkit** to build dynamic, user-focused front-end applications, enhancing performance and user experience for financial dashboards and admin portals.\nEmployed **Node.js** (NestJS/Express) and **Python** (FastAPI, Django) to modernize financial platforms with a microservices-based architecture, resulting in a **30% increase** in scalability and throughput for high-volume transaction systems.\nOptimized application performance and security by implementing best practices in **REST** and **GraphQL** APIs, ensuring compliance with industry standards.\nDeveloped real-time transaction monitoring dashboards using **D3.js** and **Power BI Embedded**, facilitating tracking of financial activities and enabling operations teams to generate actionable insights, thus improving detection times by **25%**.\nIntegrated messaging systems like **Kafka**, **RabbitMQ**, and **Azure Service Bus** to support asynchronous communication and real-time event processing, which enhanced alert delivery efficiency by **40%**.\nDesigned and orchestrated ETL pipelines with **Python**, **Apache Airflow**, and **Azure Data Factory**, leading to efficient batch and real-time data ingestion from both internal and external sources.\nImplemented AI/ML-powered fraud detection algorithms using **scikit-learn** and **XGBoost**, proactively identifying suspicious activities and improving fraud detection effectiveness by **20%**.\nCreated machine learning pipelines for credit scoring and transaction classification using **MLflow** and **Airflow**, ensuring models are integrated into backend services for real-time decision-making, reducing processing latency by **15%**."
    },
    {
      "role": "Software Engineer",
      "company": "Timspark",
      "from_date": "Sep 2015",
      "to_date": "Aug 2019",
      "location": "UK",
      "responsibilities": "Developed and optimized high-performance web applications as a **Senior Fullstack Engineer** utilizing **React (18)**, **TypeScript**, and **Redux** to create responsive user interfaces, achieving a **20%** increase in user engagement.\nEngineered backend services with **Node.js (Express)** and **Python** to deliver robust RESTful APIs, maintaining a system uptime of **99.9%** across all services.\nLeveraged **PostgreSQL** and **MongoDB** for efficient data management and storage solutions, ensuring high-speed access with optimized queries that reduced data retrieval time by **30%**.\nImplemented **CI/CD** pipelines to automate build and deployment processes, reducing the time to market for new features by **25%** while adhering to best practices and performance optimization strategies.\nApplied secure coding practices and integrated **AWS** services such as **EC2**, **Lambda**, and **S3** for hosting and storage, achieving compliance with security standards to protect sensitive user information.\nConducted application performance audits using **Lighthouse** and **Axe**, enhancing site loading speed to under **2 seconds** and ensuring accessibility compliance with WCAG 2.1.\nUtilized **Firebase** for real-time data synchronization, enabling an interactive experience for users without compromising performance.\nCreated dynamic and REST-compliant APIs as well as **GraphQL** implementations to streamline client-server communication for optimal data fetching.\nParticipated in peer code reviews and established best practices among the development team to foster a culture of quality and effectiveness in software delivery."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, JavaScript, TypeScript\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django, Node.js, Express\n\n **Frontend Frameworks:**\n\tReact, Vue, Angular, Redux, Hooks, HTML, CSS\n\n **API Technologies:**\n\tREST, GraphQL\n\n **Serverless and Cloud Functions:**\n\tAWS (Lambda, S3), Firebase\n\n **Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:**\n\tAWS (ECS, RDS, EC2), Azure (App Services, Blob, SQL)\n\n **Other:**\n\tMLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, performance optimization, security, best practices, Lighthouse, Axe",
  "apply_company": "AccessiWay"
}