{
  "name": "Mariusz Jan Skobel",
  "role_name": "Python QA Automation Engineer",
  "email": "mariuszskobel15@outlook.com",
  "phone": "+48 735 343 548",
  "address": "Katowice, Poland",
  "linkedin": "https://www.linkedin.com/in/mariusz-skobel-789557397/",
  "profile_summary": "Results-driven Python QA Automation Engineer with over 10 years of experience in building scalable, high-performing software solutions. Expertise in **Python 3**, **AWS**, and modern testing methodologies, including automated testing and API testing. Proficient in leveraging **Kafka** for event-driven data-driven systems and employing effective test frameworks for robust quality assurance. Demonstrated ability in designing and executing end-to-end (E2E) testing strategies that ensure software reliability and performance. Strong collaborative skills backed by effective communication, enabling seamless teamwork in cross-functional environments. Additional background in **JavaScript/TypeScript**, **React**, **Node.js**, and **Django**, bringing versatility and broad understanding of full-stack development. Passionate about utilizing testing excellence to contribute to impactful software within healthcare and finance domains.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2012",
      "to_year": "2015",
      "location": "UK",
      "university": "University of Bristol"
    }
  ],
  "experience": [
    {
      "role": "Python QA Automation Engineer",
      "company": "EitBiz",
      "from_date": "Oct 2022",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "•\tExecuted comprehensive **API testing** strategies utilizing **Python 3** alongside various **test frameworks** to ensure high-quality software releases in financial and healthcare sectors.\n•\tDeveloped and maintained automated testing frameworks leveraging tools such as Jest, Cypress, and Postman, resulting in a **30%** reduction in regression testing time and boosting overall test coverage to **85%**.\n•\tDesigned and implemented end-to-end testing (E2E Testing) processes for applications built with **Python**, assuring seamless performance and functionality across diverse platforms.\n•\tCollaborated closely with cross-functional teams to refine testing strategies and foster a **collaborative** environment, leading to a **25%** improvement in communication and project delivery timelines.\n•\tUtilized **AWS** services for test environment deployments and integrations, ensuring scalability and reliability for test processes across both development and production stages.\n•\tParticipated in the development of data-driven systems by ensuring thorough testing of systems integrated with **Kafka**, enhancing the reliability of data exchanges.\n•\tContributed to the automation of testing processes for Java-based components, further expanding the capabilities of the QA team and increasing the efficiency of test execution by **40%**.\n•\tEngaged in continuous learning about **automated testing** best practices to elevate the overall standards of software quality assurance within the team, leading workshops that educated over **50** team members."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Tvn S.A.",
      "from_date": "Oct 2019",
      "to_date": "Sep 2022",
      "location": "Poland",
      "responsibilities": "Utilized **Python 3** to implement automated testing frameworks and perform E2E testing for quality assurance of financial applications, enhancing reliability and performance across systems.\nParticipated in collaborative efforts with cross-functional teams, ensuring effective communication and seamless integration of testing processes within the development lifecycle.\nDeveloped and executed comprehensive API testing strategies using **Java** and **testing frameworks**, facilitating timely identification and resolution of issues, thus ensuring high-quality deliverables.\nLed the adoption of **AWS** services to facilitate the deployment of test environments, streamlining processes to achieve a 25% reduction in deployment time.\nDesigned robust data-driven testing methodologies to enhance test coverage and accuracy, significantly improving fault detection rates during system transactions by 35%.\nLeveraged tools like **Kafka** to simulate real-time transaction volumes during stress testing, ensuring systems could efficiently handle peak loads of up to **1000** transactions per second.\nAutomated testing workflows using innovative methods to increase testing efficiency, resulting in a 40% decrease in manual testing hours and increased focus on high-impact areas.\nMaintained high documentation standards to support clear communication of testing methodologies and results, fostering a culture of quality across teams."
    },
    {
      "role": "Software Engineer",
      "company": "Timspark",
      "from_date": "Sep 2015",
      "to_date": "Aug 2019",
      "location": "UK",
      "responsibilities": "Implemented automated testing frameworks using **Python 3** to ensure the quality of backend services in a global e-commerce platform, focusing on reliability and performance.\nCollaborated with cross-functional teams to design and execute E2E testing strategies, leveraging **Kafka** for real-time data processing and efficient communication across services.\nConducted thorough API testing for services built with **Python** and **Java**, verifying functionality, performance, and security compliance.\nDeveloped data-driven testing systems that effectively validated key modules like checkout, cart, and order fulfillment, improving testing coverage by **30%**.\nUtilized **AWS** cloud services to streamline test environments, enhancing CI/CD pipeline efficiency and reducing deployment headaches by **25%**.\nStreamlined the testing process by employing automated testing tools, ensuring quicker feedback loops and improving team collaboration.\nCommunicated effectively with stakeholders to gather requirements, provide status updates, and share insights, enhancing project transparency and decision-making processes.\nParticipated in regular code reviews and knowledge-sharing sessions, fostering a culture of continuous improvement and collaborative problem-solving within the team.\nUtilized test management tools to track and report on testing progress, maintaining clear visibility of QA activities across the development lifecycle.\nEngaged in performance tuning and optimization of test cases, achieving a reduction in testing time by **40%** while maintaining high standards of quality."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython 3, Java\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tAPI testing, data-driven systems\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD\n\n**Cloud & Infrastructure:**\n\tTerraform, Ansible, Helm, Docker Compose\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, Kafka, test frameworks, automated testing, E2E Testing, collaborative, communication, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot"
}