{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Dynamics Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-152840397/",
  "profile_summary": "Results-driven Senior Dynamics Engineer with 8 years of experience specializing in **Microsoft Dynamics 365**, **Power Automate**, and **CRM** solutions. Proficient in **API integration** and skilled in **Azure DevOps** and **GitHub Actions** for CI/CD automation. Possessing strong analytical skills and exceptional problem-solving abilities, I leverage **JavaScript**, **TypeScript**, and **C#** to deliver high-quality software solutions in an Agile environment. My background includes full-stack development using modern frameworks and technologies, including **React**, **Next.js**, **Vue**, **Node.js**, **Python**, and **Flutter**. I have a solid cloud foundation, particularly in **Azure** and **AWS**, and have led the development of scalable platforms that prioritize compliance with standards like HIPAA and PCI DSS. My expertise extends to building and deploying machine learning pipelines, utilizing tools such as **MLflow**, **Airflow**, and **Kubeflow**, ensuring robust architecture for advanced data processing.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Dynamics Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Utilized **Microsoft Dynamics 365** to enhance customer relationship management (CRM) processes, ensuring seamless integration across platforms.\nDeveloped and implemented robust **API integration** strategies to enable data flow between **Dynamics 365** and third-party applications, driving efficiency and performance improvements.\nDesigned and managed CI/CD pipelines using **Azure DevOps** and **GitHub Actions**, facilitating streamlined deployment processes and code quality assurance across multiple projects.\nLeveraged **JavaScript**, **TypeScript**, and **C#** to develop dynamic, user-friendly interfaces, enhancing overall user experience for CRM solutions.\nDemonstrated strong **analytical skills** and **problem-solving** abilities by delivering data-driven recommendations that improved system performance by **15%**.\nContributed to an **Agile** development environment, participating in sprint planning, daily stand-ups, and retrospectives to ensure timely delivery of high-quality products.\nCollaborated with cross-functional teams to identify and resolve technical challenges, resulting in a **20%** reduction in project delivery times.\nImplemented enterprise-level **DevOps** practices to automate workflows and improve collaboration between development and operations teams.\nExecuted testing strategies using tools like Jest and Cypress to ensure high-quality code, achieving over **90%** test coverage across major functionalities.\nParticipated in documentation efforts, creating user manuals and technical specifications in **English** for better understanding and usage of CRM solutions among stakeholders."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Enhanced CRM capabilities by integrating **Microsoft Dynamics 365** with existing applications, leveraging **API integration** to streamline workflows and improve user experience.\nAutomated business processes using **Power Automate** to drive efficiency, resulting in a **30%** reduction in manual tasks and significantly improving operational agility.\nUtilized **Azure DevOps** and **GitHub Actions** for CI/CD pipeline automation, ensuring seamless deployment and version control for project releases, increasing deployment frequency by **40%**.\nApplied strong **analytical skills** and **problem-solving** techniques to diagnose issues, optimize performance, and improve the platform's overall reliability for enhanced customer satisfaction.\nDeveloped and maintained modular code in **JavaScript** and **TypeScript** for various features, ensuring that the delivered solutions met project requirements and adhered to best practices.\nLed Agile project management methodologies, facilitating effective collaboration in cross-functional teams and delivering projects on time with consistent stakeholder communication.\nAssured code quality through rigorous testing practices and code reviews, maintaining high standards to support stable software performance for client-facing systems.\nCollaborated with technical teams to drive DevOps culture, enabling faster problem resolution and increasing deployment stability by **25%**."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Leveraged **Microsoft Dynamics 365** to design and optimize backend services enhancing CRM functionalities.\nImplemented robust **API integration** to connect with third-party services, ensuring seamless data flow across all systems utilized in e-commerce workflows.\nUtilized **Power Automate** to streamline business processes, improving operational efficiency by **30%** through automated workflows and task management.\nDeveloped cloud solutions using **Azure DevOps** for continuous integration and deployment, significantly reducing deployment time by **40%** while supporting high availability and low latency.\nEmployed **JavaScript** and **TypeScript** for developing dynamic and responsive frontend applications, ensuring superior user experiences on both web and mobile platforms.\nSpearheaded the adoption of **GitHub Actions** for CI/CD processes, enhancing team collaboration and code quality through automated testing and deployments.\nApplied analytical skills to troubleshoot and resolve complex development issues, improving platform reliability and performance based on user feedback and system monitoring.\nEngaged in Agile methodologies, participating in sprint planning and reviews to deliver features iteratively and respond to stakeholder feedback effectively.\nImplemented DevOps practices to optimize workflows, ensuring smoother transitions between development, testing, and production environments while adhering to best practices for security and compliance.\nFostered strong problem-solving abilities while leading cross-functional teams in achieving strategic project milestones and meeting deadlines.\nCommunicated effectively in English with stakeholders and team members, enhancing collaboration and ensuring clarity in project objectives and updates."
    }
  ],
  "skills": "Programming Languages:\n\tC#, JavaScript, TypeScript\n\n**Backend Frameworks:**\n\tPython (FastAPI, Flask, Django)\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tAPI integration\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Azure DevOps, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS, Azure\n\n**Other:**\n\tMicrosoft Dynamics 365, Power Automate, CRM, Analytical skills, Problem-solving, Agile, English, Authentication & Security (Keycloak, JWT, OAuth2, Let’s Encrypt, Nginx, Certbot), MLflow, Airflow, Kubeflow",
  "apply_company": "Data Edge"
}