{
  "name": "Rei Taro",
  "role_name": "Senior Frontend Engineer",
  "email": "rei515@outlook.com",
  "phone": "+48732529451",
  "address": "Warszawa, Poland",
  "linkedin": "https://www.linkedin.com/in/rei-taro-81a410391/",
  "profile_summary": "Results-driven Senior Frontend Engineer with a strong foundation in **React**, **TypeScript**, **Next.js**, and **Tailwind**. Expertise in delivering user-centric solutions through A/B testing and feature flags to enhance UX design. Proven ability to collaborate cross-functionally, apply best practices in frontend development, and create responsive applications. With over 10 years of experience in backend development specializing in **Python** (FastAPI, Django, Flask), and cloud platforms like **AWS** and **Azure**, I bring a unique perspective to frontend workflows. I have a history of contributing to high-impact projects at leading organizations, including VISA, Sii Poland, and Reply Polska.",
  "education": [
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2010",
      "to_year": "2015",
      "location": "Japan",
      "university": "Keio University"
    }
  ],
  "experience": [
    {
      "role": "Senior Frontend Engineer",
      "company": "Leobit",
      "from_date": "Aug 2022",
      "to_date": "Present",
      "location": "Poland",
      "responsibilities": "Utilized **React** and **TypeScript** to develop dynamic user interfaces, enhancing user experience by over **30%** through optimized UX design and responsive layouts.\nImplemented **Tailwind** for efficient styling, reducing CSS bloat by **15%** and improving loading times across applications.\nDesigned and deployed A/B testing strategies to analyze user interaction, leading to data-driven feature enhancements by **25%**.\nLeveraged **Next.js** for server-side rendering, improving SEO visibility and application performance by **40%**.\nManaged feature flags to enable gradual rollout of new functionalities, minimizing user impact during transitions.\nCollaborated with cross-functional teams to ensure seamless integration of backend services with frontend applications, addressing scalability and performance challenges.\nConducted regular code reviews and provided mentorship to junior developers, fostering a collaborative work environment.\n"
    },
    {
      "role": "Software Engineer",
      "company": "Innovature",
      "from_date": "Nov 2018",
      "to_date": "Jun 2022",
      "location": "Japan",
      "responsibilities": "Utilized **React** and **TypeScript** to create dynamic and responsive user interfaces that enhance user experience and engagement.\nImplemented **Tailwind** CSS for streamlined styling, ensuring consistency and efficiency in design across multiple components.\nDeveloped **Next.js** applications to improve performance and SEO, achieving up to a **30%** increase in load speed.\nExecuted A/B testing strategies to validate design decisions and optimize user engagement rates by as much as **20%**.\nLeveraged feature flags to manage feature releases seamlessly, allowing for selective exposure to users and minimizing risks during deployment.\nConducted user experience (UX) design reviews and collaborated with UX teams to ensure alignment with user needs and best practices.\nManaged version control systems, maintaining code quality and facilitating collaborative development processes among the engineering team."
    },
    {
      "role": "Software Developer",
      "company": "Wizcorp",
      "from_date": "Apr 2015",
      "to_date": "Nov 2018",
      "location": "Japan",
      "responsibilities": "• Developed responsive web applications using **React**, **TypeScript**, and **Next.js** to enhance user interfaces and improve user experience, resulting in a **30%** increase in user engagement.\n• Implemented modern styling techniques with **Tailwind CSS**, ensuring a consistent and visually appealing design across all devices.\n• Enhanced application performance by employing **A/B testing** and feature flags, leading to optimized features and functionalities that catered to user preferences.\n• Collaborated with backend services teams to integrate REST APIs and WebSocket channels, ensuring a seamless flow of data while maintaining a high standard of user interaction.\n• Conducted user research and applied **UX design** principles, resulting in a **15%** reduction in user drop-off rates during critical actions.\n• Ensured the web application adhered to best practices and security standards, including compliance with regulatory requirements and data protection laws.\n• Provided mentorship and support to junior developers, sharing knowledge in modern frontend technologies and encouraging best coding practices."
    }
  ],
  "skills": "**Frontend Frameworks**\n\tReact, TypeScript, Tailwind, Next.js\n\n**Programming Languages**\n\tPython (3.8+), SQL, Bash, JavaScript\n\n**Backend Frameworks**\n\tFastAPI, Flask, Django, Celery\n\n**API Technologies**\n\tREST/gRPC APIs, Microservices, Kafka\n\n**Serverless and Cloud Functions**\n\tAWS (EC2, S3, Lambda), Azure\n\n**Databases**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps**\n\tDocker, Kubernetes, GitHub Actions, Azure DevOps, CI/CD, PyTest, Git\n\n**Cloud & Infrastructure**\n\tAWS (EC2, S3, Lambda), Azure\n\n**Other**\n\tA/B testing, feature flags, UX design, Pandas, NumPy, scikit-learn, TensorFlow, Airflow, MLflow",
  "apply_company": "Relocify"
}