{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior FullStack Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "As a Senior Full Stack Engineer with 8 years of experience, I possess expertise in **JavaScript**, **TypeScript**, **React**, **Next.js**, and **PostgreSQL**, with an emphasis on building scalable and high-performance applications. My proficiency extends to utilizing **Vercel** for seamless deployment and integration of serverless functions while embracing **Tailwind CSS** for creating responsive designs that enhance UI/UX. I have strong experience developing data pipelines and automation solutions that leverage AI technologies, including working with **OpenAI** and **Anthropic** models for image and video generation as well as incorporating agentic AI and context engineering into applications.\n\nI have a solid foundation in microservices architecture, event-driven systems, and CI/CD automation practices. My hands-on experience includes working with third-party APIs, Git for version control, and leading project teams in startup environments. I am adept at developing efficient machine learning workflows, implementing automation strategies, and ensuring compliance with relevant standards. My ability to integrate innovative technologies with traditional systems has consistently yielded robust and secure applications tailored to client needs.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior FullStack Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Developed and maintained scalable, full-stack applications using **TypeScript**, **JavaScript**, and modern front-end frameworks such as **React** (versions **17-18**), ensuring adherence to UI/UX best practices and responsive design principles.\n- Leveraged **Next.js** for server-side rendering and optimized performance on **Vercel**, improving load times and user experience across healthcare and financial platforms.\n- Integrated **AI** features into applications, utilizing **OpenAI**, and other advanced technologies for intelligent decision-making and context engineering.\n- Collaborated on the design of **data pipelines** that automate data transfers and processing between systems, enhancing operational efficiency in healthcare and financial services.\n- Utilized cloud-based solutions and **serverless architecture**, deploying back-end services on platforms like **AWS** and **Google Cloud**, thereby reducing infrastructure overheads and achieving high availability.\n- Designed and optimized databases using **PostgreSQL** for storing complex financial data, ensuring robust querying capabilities for analytics and reporting requirements.\n- Implemented third-party API integrations to enhance application functionalities, expanding service capabilities for data retrieval and operations.\n- Participated in the creation of effective testing strategies utilizing frameworks such as Jest and Cypress, achieving comprehensive coverage across both front-end and back-end systems.\n- Established automated CI/CD workflows with **Git** and DevOps tools, streamlining the deployment process for multi-environment deployments in fast-paced development cycles.\n- Collaborated with UX designers using **Figma** to translate design mockups into functional, user-friendly interfaces in web applications.\n- Managed the creation and implementation of responsive designs using **Tailwind CSS**, ensuring adaptability across various devices and screen resolutions.\n- Actively contributed to team discussions and strategic decision-making, leveraging startup experience to foster innovation and agility in development processes."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "• Developed dynamic, user-focused front-end applications utilizing **React (18)**, **Next.js**, and **TypeScript** for responsive and performant interfaces, applying **Tailwind CSS** for efficient styling.\n• Built and deployed serverless architectures leveraging **Vercel**, enhancing application scalability and reducing operational costs by 30% through effective asynchronous operations.\n• Developed and integrated real-time event processing solutions using third-party APIs and **Kafka** to enhance transaction monitoring and automate compliance workflows.\n• Architected and implemented data pipelines for batch and real-time ingestion of financial data using **Apache Airflow** and **Azure Data Factory**, achieving a data processing efficiency increase of 25%.\n• Led the automation of fraud detection systems using AI/ML techniques with **scikit-learn** and **XGBoost**, successfully reducing false positives by 15% while identifying suspicious activities in banking systems.\n• Collaborated closely with cross-functional teams to design and optimize UI/UX, utilizing **Figma** for crafting wireframes and prototypes that improved user engagement metrics by over 20%.\n• Drove innovations in content creation by integrating **AI** capabilities for image and video generation, enhancing the platform’s offerings and user experience.\n• Managed version control using **Git**, ensuring seamless collaboration and streamlined code deployments across development teams.\n• Championed the adoption of vector databases and embeddings techniques, improving data retrieval times by 40% and enhancing context engineering for personalized user experiences."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Utilized **JavaScript**, **TypeScript**, and **React (18)** frameworks to architect and implement interactive frontend applications using **Next.js** and **Vercel**, optimizing for responsive design and SEO compliance.\nEmployed **serverless architecture** to enhance application scalability and reduce costs, deploying features that seamlessly integrated third-party APIs such as **Stripe** and **PayPal** for payment processing.\nDesigned intuitive UI/UX interfaces using **Tailwind CSS** and **Figma**, focusing on mobile-first development to enhance user engagement and accessibility.\nDeveloped backend solutions with **PostgreSQL** and optimized database interactions through data pipelines, ensuring swift and reliable data retrieval in high-traffic scenarios, optimizing read operations by **30%**.\nIntegrated machine learning capabilities into applications for features like personalized recommendations, utilizing **AI** technologies from **OpenAI** and **Google** to boost user satisfaction and increase conversion rates by **15%**.\nManaged responsive design adjustments using front-end technologies to cater to diverse devices, while ensuring compliance with **WCAG 2.1** accessibility standards.\nExecuted automation strategies to improve development efficiency, employing version control systems like **Git** for streamlined code management and collaboration.\nApplied advanced concepts in **context engineering** and **agentic AI** to enhance user interactions, focusing on generating engaging content with functionalities for **video** and **audio generation**.\nExploited capabilities of **vector databases** and **embeddings** to process and manage complex data types, improving data retrieval speed for real-time applications.\nDrove startup growth by implementing iterative development cycles, prioritizing automation, and refining data pipelines for enhanced operational efficiency."
    }
  ],
  "skills": " **Programming Languages:**\n\tJavaScript, TypeScript, Python\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n **Frontend Frameworks:**\n\tReact, Vue, Angular, Next.js, Tailwind CSS\n\n **API Technologies:**\n\tthird-party APIs\n\n **Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL), serverless\n\n **Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis, vector databases\n\n **DevOps:**\n\tDocker, Kubernetes, Git, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:**\n\tAWS, Azure\n\n **Other:**\n\tAI, MLflow, Airflow, Kubeflow, OpenAI, Anthropic, image generation, context engineering, agentic AI, data pipelines, automation, responsive design, UI/UX, video generation, audio generation, startup experience, content creation",
  "apply_company": "Crypto Banter"
}