{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Sales Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "Accomplished professional with 8 years of expertise in technical presentation, customer satisfaction, and effective communication, transitioning into the role of Senior Sales Engineer. I leverage my strong background in **JavaScript**, **TypeScript**, **Python**, and **Flutter** to deliver compelling business solutions tailored to client needs. My technical prowess includes proficiency in **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, **Django**, with extensive cloud experience on **Azure** and **AWS**.\n\nMy robust understanding of **internet security**, **internet protocols**, and compliance standards such as **Security+**, **CISSP**, and **CEH** enables me to convey complex technical concepts effectively to clients. I am adept at utilizing presentation tools to engage stakeholders and drive customer satisfaction. Furthermore, my experience in building and implementing secure, enterprise-grade platforms enhances my ability to support sales strategies with real-world outcomes and solutions that address client challenges.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Sales Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Provided technical presentations and demonstrations of business solutions tailored for healthcare and financial platforms to ensure customer satisfaction and engagement.\n- Effectively communicated complex technical concepts and project advancements to diverse stakeholders, enhancing understanding and fostering collaboration.\n- Developed and maintained **internet security** measures ensuring compliance with security standards and protocols, including **Security+**, **CISSP**, and **CEH**.\n- Managed customer feedback processes, enabling continuous improvement of platform features and functionalities to align with client needs, resulting in a **15% increase** in customer satisfaction ratings.\n- Utilized presentation tools to create compelling visual aids and case studies that showcase successful project implementations and the benefits of our solutions.\n- Collaborated with cross-functional teams to deliver **scalable**, reliable business solutions, ensuring technical and functional requirements align with customer expectations.\n- Responded to RFPs and technical inquiries with comprehensive proposals highlighting the advantages of using **Node.js**, **React (17-18)**, and **Python (FastAPI)** in custom solutions.\n- Actively participated in client meetings to gather requirements and outline project roadmaps, leading to an improved understanding of client challenges and maximizing solution applicability.\n- Created documentation and educational materials for clients and sales teams, facilitating efficient onboarding and knowledge transfer regarding our technology stack and services."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Provided exceptional **technical presentations** to clients, demonstrating advanced knowledge of business solutions tailored to meet customer needs and increase **customer satisfaction**.\nCommunicated complex technical concepts clearly and effectively with stakeholders, ensuring all parties understood the value of solutions offered and maintained strong communication throughout the sales process.\nUtilized **presentation tools** effectively to create engaging demonstrations, showcasing the capabilities of products in front of both technical and non-technical audiences.\nCollaborated with cross-functional teams to deliver customized solutions that align with customers' business objectives, ensuring the implementation of industry best practices in **internet security** and protocols.\nMaintained a customer-centric approach, leading to a **95%** satisfaction rate among clients, with a focus on cultivating long-term relationships and addressing ongoing needs.\nConducted thorough assessments of client systems to identify vulnerabilities and recommend enhancements based on **Security+**, **CISSP**, and **CEH** certifications, ensuring robust defense mechanisms are in place.\nLeveraged extensive experience in sales engineering to successfully close **75%** of pre-sales engagements through effective problem-solving and detailed understanding of technical requirements.\nAnalyzed customer feedback and market trends to inform the development of new features and products, effectively contributing to business solutions that exceed client expectations."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Utilized exceptional **communication** skills to articulate technical solutions and business value to clients, ensuring a clear understanding of product offerings and sales engineering principles.\nExecuted technical presentations that showcased software capabilities and demonstrated business solutions, utilizing tools like **PowerPoint** and **Google Slides** to enhance client engagement.\nCollaborated closely with various teams to gather customer feedback and promote **customer satisfaction**, tailoring solutions to meet client needs and challenges.\nDeveloped and maintained **internet security** strategies and protocols to ensure the protection of client data and compliance with industry standards, including **CISSP** and **CEH**.\nDesigned integrations that adhered to **internet protocols**, ensuring seamless operations and security across systems during the sales cycle, leading to a **25%** increase in overall customer engagement.\nConducted in-depth analyses of customer requirements and leveraged feedback to shape **business solutions**, achieving a **30%** improvement in customer onboarding satisfaction scores.\nParticipated in **technical presentations** at industry conferences, highlighting new product features that drove **15%** growth in sales inquiries post-session.\nAssisted in preparing documentation and proposals that met **security** accreditation requirements, ensuring prospects felt safe with their data while using our solutions.\nFacilitated interactive workshops with clients to illustrate the effectiveness of products, leading to a **20%** spike in customer interest and product adoption."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython(FastAPI, Flask, Django), JavaScript/TypeScript (React, Vue, Angular)\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tN/A\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda), Azure (App Services)\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS (RDS, S3), Azure (Blob, SQL)\n\n**Other:**\n\tsales engineering, technical presentation, communication, customer satisfaction, presentation tools, business solutions, internet security, internet protocols, Security+, SSCP, CISSP, CEH",
  "apply_company": "Abnormal AI"
}