{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Frontend Developer (Angular)",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-623a26390/",
  "profile_summary": "Frontend Developer with 13+ years of experience in building high-performance applications, specifically utilizing **Angular**, **TypeScript**, **HTML5**, **SCSS**, **RxJS**, and **ReactiveForms**. Proven expertise in developing Single Page Applications (SPAs) and implementing microfrontend architectures with **Module Federation** and Backend for Frontend (BFF) strategies. Strong command of CI/CD pipelines and version control using **Git**, **GitHub**, and **GitLab**.\nAdditionally, adept at working in Agile environments with a focus on Kanban methodologies and documentation using **Confluence**. Bringing a solid background in full stack development with technologies such as **JavaScript**, **Python**, **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**, along with experience in cloud-native solutions on **AWS** and **Azure**. Demonstrated ability in compliance-driven development within healthcare and financial sectors, ensuring alignment with industry standards such as HIPAA, FHIR, PCI DSS, and SOC 2.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Frontend Developer (Angular)",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Developed interactive and high-performance frontend applications using **Angular**, **TypeScript**, **HTML5**, and **SCSS**, focusing on delivering seamless user experiences across single-page applications (SPA).\nImplemented state management and reactive programming with **RxJS** and **ReactiveForms** to enhance application efficiency and responsiveness, improving load times by **30%**.\nUtilized **Git**, **GitHub**, and **GitLab** to manage version control, collaborating in a distributed team environment with comprehensive CI/CD pipelines to streamline deployment processes, achieving a **50% reduction** in deployment time.\nArchitected microfrontend solutions through **Module Federation** and **Microfrontends** strategies, enabling independent development and deployment of frontend modules across various teams.\nConducted thorough code reviews and maintained documentation using **Confluence**, ensuring adherence to coding standards and best practices.\nEmployed **Kanban** methodologies to enhance project management workflow and increase transparency within cross-functional teams, resulting in a **25% improvement** in sprint delivery timelines.\nCreated robust onboarding tools and documentation for new team members to facilitate smooth transitions and reduce ramp-up time to **2 weeks**.\nDeveloped unit and integration tests to ensure code quality and functionality, utilizing industry standards and frameworks for testing, thus boosting application reliability by **20%**."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Developed high-performance web applications utilizing **Angular**, **TypeScript**, **HTML5**, and **SCSS**, ensuring a seamless user experience for financial platforms and tools.\nImplemented **ReactiveForms** and state management with **RxJS** to optimize form handling and data flow within Single Page Applications (SPAs).\nCollaborated on an agile team employing **Kanban** methodologies, facilitating continuous delivery and improvement through regular stand-ups and retrospectives.\nIntegrated **CI/CD pipelines** to automate testing and deployment, significantly reducing release time by **30%** and increasing application stability.\nParticipated in code reviews using **Git** and version control on **GitHub**/**GitLab**, enhancing code quality and promoting best practices across the development team.\nOrchestrated the development of microfrontend architectures using **Module Federation** and **Monorepos**, allowing for scalable project organization and team collaboration.\nEngaged in cross-team initiatives to refine backend-for-frontend (BFF) strategies, improving responsiveness and load times across various components of the application.\n"
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Utilized **Angular** (latest version) and **TypeScript** to architect and enhance responsive, SEO-friendly frontend applications, implementing **HTML5** and **SCSS** for rich user interfaces that comply with accessibility standards (WCAG 2.1).\nEmployed **RxJS** and **ReactiveForms** for effective form handling and asynchronous data streams, improving user interactions and dynamic responsiveness in single-page applications (SPA).\nImplemented **Microfrontends** and **Module Federation** strategies to enable scalable and maintainable code, facilitating efficient development workflows using **Monorepos**.\nCollaborated with backend teams on **BFF** (Backend for Frontend) architectures to optimize data handling between frontend and backend services, ensuring seamless integration of diverse APIs.\nManaged version control systems such as **Git**, with repositories hosted on **GitHub** and **GitLab**, adhering to CI/CD pipelines for smooth deployment processes and maintaining high code quality with consistent reviews.\nParticipated in project management using **Confluence** to document development processes, user stories, and sprint planning, following **Kanban** methodology to enhance team collaboration and productivity.\nContributed to development projects using **Node.js** (for server-side interaction) alongside **Angular**, ensuring a cohesive approach across the tech stack and streamlined frontend-backend communication."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, JavaScript, TypeScript\n\n **Frontend Frameworks:**\n\tAngular, React, Vue, HTML5, SCSS, RxJS, ReactiveForms, Monorepos, Microfrontends, Module Federation, SPA\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n **API Technologies:**\n\tBFF\n\n **Serverless and Cloud Functions:**\n\tAWS: Lambda, ECS, S3; Azure: App Services\n\n **Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n **DevOps:**\n\tDocker, Kubernetes, Git, GitHub, GitLab, GitHub Actions, GitLab CI/CD, CI/CD pipelines, Terraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:**\n\tAWS: RDS; Azure: Blob Storage, SQL Database\n\n **Other:**\n\tMLflow, Airflow, Kubeflow, Nginx, Let’s Encrypt, Certbot, Confluence, Kanban, OAuth2, JWT, Keycloak (OIDC, RBAC)"
}