{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Security Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-152840397/",
  "profile_summary": "Skilled in **AWS**, **Docker**, **Kubernetes**, **Ansible**, and **Terraform**, I am a seasoned Full Stack Developer with 8 years of experience transitioning into a Senior Security Engineer role. My expertise includes developing secure, high-performance solutions in healthcare and financial sectors, leveraging **React**, **Node.js**, and **Python** technologies. I have a proven track record of building compliant applications with strong knowledge of security standards (HIPAA, PCI DSS, etc.) and infrastructure management using **GitLab** and **VMware**.\n\nI excel in problem-solving and teamwork, demonstrating effective communication while leading the development of enterprise-grade platforms. My hands-on experience with **NGINX** for server management and troubleshooting includes implementing security mechanisms and enhancing system resilience. As a self-motivated professional, I continuously drive innovative solutions in secure application development and deployment.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Security Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Implemented enterprise-level security solutions using **AWS**, **Kubernetes**, **Docker**, and **Ansible** to enhance system resilience and compliance across healthcare and finance platforms, ensuring alignment with industry standards such as HIPAA and PCI DSS.\n- Managed infrastructure as code using **Terraform**, promoting efficient deployment and scalability of security measures across various environments, with an emphasis on automation and consistency.\n- Developed secure access protocols leveraging **Active Directory**, **SSO**, and **PKI**, fostering secure user authentication and authorization for applications, reducing security incidents by **30%**.\n- Collaborated cross-functionally with development and operations teams to integrate **NGINX** for secure reverse proxy setups, improving the security posture while maintaining high availability of services.\n- Enforced continuous security monitoring and compliance checks through automation using **GitLab**, ensuring that all deployments are certificate compliant with security audits every **quarter**.\n- Conducted thorough security assessments and risk analysis for both cloud-based solutions and on-premise resources, identifying vulnerabilities and implementing remediation strategies to reduce potential breaches by **40%**.\n- Employed **PowerShell** scripting to automate routine security tasks, enhancing team productivity and allowing for more focus on proactive security measures.\n- Provided leadership in implementing container security protocols within **Kubernetes** clusters, ensuring all applications adhered to security best practices and reducing container-related vulnerabilities.\n- Spearheaded the use of **VMware** for securing virtual environments through optimal configuration and resource restriction strategies, ensuring stable and secure platform performance.\n- Engaged in continuous education and trainings to stay abreast of emerging security threats and trends in the industry, enhancing overall security framework and strategy adaptation."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Utilized **Linux** and **VMware** to design secure environments for financial platforms, ensuring compliance with industry standards and enhancing overall security posture.\nImplemented **NGINX** as a reverse proxy and load balancer to improve system performance and availability, supporting up to **10,000** simultaneous connections without degradation of service.\nManaged user authentication and access controls through **Active Directory** and **SSO**, streamlining user experience while safeguarding sensitive information.\nAutomated deployment processes and configuration management using **Ansible** and **Terraform**, reducing infrastructure provisioning time by **40%** and minimizing manual errors.\nLeveraged **GitLab** for version control and CI/CD pipelines, ensuring code integrity and facilitating seamless collaboration within the engineering team.\nDeveloped and implemented security policies using **PowerShell**, providing automated reporting on compliance, vulnerabilities, and incident response.\nUtilized **AWS** and **Kubernetes** to orchestrate containerized applications, achieving greater scalability and reliability in deployable environments.\nCollaborated with cross-functional teams to identify security risks and develop remedial action plans, reinforcing a culture of security awareness and proactive problem-solving.\nDemonstrated strong communication skills by presenting security findings and recommendations to stakeholders, fostering a collaborative approach to security initiatives.\nEmployed **Docker** for containerization, enhancing the portability and consistency of applications across development and production environments.\nWorked independently while being **self-motivated** and committed to staying updated with the latest cybersecurity trends and technologies."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Utilized **AWS** and **Kubernetes** to design and implement secure cloud infrastructures, optimizing for performance and scalability across **9** distinct environments.\nManaged and automated server configurations using **Ansible** and **Terraform**, ensuring consistent deployments and reducing setup time by **30%**.\nDeveloped and maintained CI/CD pipelines using **GitLab**, enhancing deployment efficiency by **25%** through streamlined workflows and automated testing.\nImplemented advanced security measures, including role-based access control (RBAC) and single sign-on (SSO) protocols, to safeguard user data and ensure GDPR compliance across the platform.\nCreated comprehensive documentation and guidelines for system use and security practices, improving team collaboration and enhancing information-sharing protocols by **40%**.\nConducted regular security audits and vulnerability assessments, identifying potential risks and implementing remediation strategies to maintain the integrity of systems.\nLeveraged **NGINX** for efficient load balancing and web service performance monitoring, ensuring high availability and reliability of e-commerce services under peak demand.\nProvided support for **Linux** systems, optimizing configurations and performance to ensure seamless operation and minimal downtime effective for **24/7** services.\nCollaborated with cross-functional teams using exceptional problem-solving, teamwork, and communication skills to propose and implement innovative security solutions across diverse projects.\nActively engaged in continuous learning and self-development to stay updated with emerging security trends and technologies, contributing to the enhancement of team capabilities."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython(FastAPI, Flask, Django), JavaScript/TypeScript (React, Vue, Angular)\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n **Frontend Frameworks:**\n\tReact, Vue, Angular\n\n **API Technologies:**\n\tJWT, OAuth2, Keycloak (OIDC, RBAC)\n\n **Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n **Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, GitLab, Ansible, Terraform, Helm, Docker Compose\n\n **Cloud & Infrastructure:**\n\tAWS, Azure, VMware, NetApp\n\n **Other:**\n\tLinux, NGINX, Active Directory, SSO, PKI, PowerShell, MLflow, Airflow, Kubeflow, problem-solving, teamwork, communication, self-motivated",
  "apply_company": "SolarEdge"
}