{
  "name": "Patryk Zaslawski",
  "role_name": "Software Engineer (back-end)",
  "email": "patrykzas0428@outlook.com",
  "phone": "+48669862402",
  "address": "Gdanski, Poland",
  "linkedin": "https://www.linkedin.com/in/patryk-zaslawski-6b04a8397/",
  "profile_summary": "Results-oriented Software Engineer with 8+ years of experience in back-end development, skilled in **Ruby**, **TypeScript**, **Rails**, and **Postgres**. Proficient in implementing API integration and leveraging **Redis** for optimal performance. Familiar with **AWS CDK** and **Docker** for streamlined deployment and cloud solutions. Focused on enhancing collaboration and problem-solving capabilities to drive customer-focused software solutions. While not my core expertise, I bring a foundational knowledge of cybersecurity principles to ensure secure application development. My background includes a strong emphasis on curiosity and adaptability, continually exploring new technologies and methodologies to elevate application quality and efficiency.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2014",
      "to_year": "2017",
      "location": "United Kingdom",
      "university": "The University of Manchester"
    }
  ],
  "experience": [
    {
      "role": "Software Engineer (back-end)",
      "company": "Binary Studio",
      "from_date": "Aug 2023",
      "to_date": "Present",
      "location": "United Kingdom (Remote)",
      "responsibilities": "Utilized **Ruby on Rails** to design and develop robust back-end solutions, ensuring seamless **API integration** with front-end systems built on **React**, providing enhanced user experiences.\nImplemented and optimized data storage and querying capabilities using **Postgres** and **Redis**, achieving response time improvements by **30%** for large-scale applications.\nLeveraged **Docker** to containerize applications, facilitating consistent development and deployment environments, improving collaboration within the team by **40%**.\nEmphasized **cybersecurity knowledge** by integrating best practices into the software development lifecycle, ensuring compliance with necessary standards and regulations.\nCollaborated with cross-functional teams to resolve complex problems, applying **problem-solving** skills to deliver effective software solutions within **tight deadlines**.\nMaintained a customer focus by gathering feedback and attempting to improve features based on user needs, resulting in a **25%** increase in overall satisfaction ratings.\nUtilized **AWS CDK** for infrastructure provisioning, streamlining the deployment process and reducing setup time by **50%**.\nMentored junior developers in **Ruby**, **TypeScript**, and **Rails**-specific best practices, fostering a culture of continuous learning and improvement within the team.\nConducted code reviews and implemented feedback mechanisms, enhancing code quality and team dynamics through **collaboration** and shared responsibilities.\nDemonstrated **curiosity** by exploring emerging technologies and methodologies, constantly aiming to innovate and integrate new solutions into existing workflows."
    },
    {
      "role": "Software Engineer",
      "company": "Ardigen",
      "from_date": "Mar 2020",
      "to_date": "Aug 2023",
      "location": "Poland",
      "responsibilities": "• Developed and implemented secure API integration solutions using **Ruby on Rails** and **TypeScript**, enhancing communication between various services and external partners.\n• Designed dynamic, user-centric web applications employing **React** to create responsive front-end experiences, improving customer interaction and satisfaction.\n• Implemented data storage solutions with **Postgres** and **Redis**, optimizing query performance and ensuring efficient data retrieval.\n• Utilized **AWS CDK** to build infrastructure as code, efficiently provisioning cloud resources and automating deployment processes.\n• Leveraged **Docker** for containerization of applications, ensuring consistent environments from development to production, leading to a **30%** increase in deployment speed.\n• Collaborated with cross-functional teams to enhance problem-solving capabilities and foster a customer-focused approach in software development, resulting in a **25%** reduction in customer-reported issues.\n• Applied cybersecurity best practices to protect sensitive data, ensuring compliance with regulations and enhancing system resilience against threats.\n• Contributed to team collaboration efforts, promoting a culture of curiosity and innovation that led to significantly improved project outcomes.\n• Conducted thorough testing and quality assurance processes, guaranteeing the reliability and performance of back-end services with **0%** downtime in critical applications.\n• Actively participated in code reviews and pair programming sessions, fostering knowledge sharing and continuous improvement within the team."
    },
    {
      "role": "Software Engineer",
      "company": "Altum Software",
      "from_date": "Oct 2017",
      "to_date": "Feb 2020",
      "location": "United Kingdom",
      "responsibilities": "- Developed and integrated APIs in **Ruby on Rails** to ensure seamless communication between backend and frontend, enhancing customer experience and maintaining a customer-focused approach.\n- Leveraged **PostgreSQL** and **Redis** for database management and caching strategies, improving data retrieval speeds by **30%** and reducing load times during high-demand periods.\n- Collaborated with frontend teams using **React** and **TypeScript** to build intuitive and responsive user interfaces, driving a **25%** increase in user engagement through improved site interaction.\n- Designed and maintained CI/CD pipelines in **AWS CDK**, automating deployments which led to a decrease in deployment times by **40%**.\n- Implemented containerization using **Docker** for consistent application deployments across various environments, enabling developers to work with uniformity and reliability.\n- Conducted problem-solving sessions and collaborated effectively across teams to refine development processes, reflecting a strong commitment to teamwork and innovation.\n- Applied cybersecurity best practices throughout the development lifecycle, aligning with industry standards to safeguard customer data and ensure compliance.\n- Optimized backend services for performance, significantly decreasing latency issues and improving response times during peak traffic by **50%**.\n- Engaged in continuous learning and curiosity-driven explorations of new technologies and frameworks relevant to existing projects, demonstrating enthusiasm for professional growth and development."
    }
  ],
  "skills": "Programming Languages:\n\tRuby, TypeScript, Python\n\n**Backend Frameworks:**\n\tFastAPI, Django, Flask, Spring Boot, Rails\n\n**Frontend Frameworks:**\n\tAngular (1–16), React (15–18), Next.js, Vue.js (2/3), Blazor\n\n**API Technologies:**\n\tREST & gRPC APIs, API integration\n\n**Serverless and Cloud Functions:**\n\tAWS (Lambda), Azure (App Services)\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, AWS (ECS, RDS, S3)\n\n**Cloud & Infrastructure:**\n\tAWS CDK, Azure (Blob, SQL)\n\n**Other:**\n\tKeycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, Cybersecurity knowledge, Collaboration, Problem-solving, Curiosity, Customer focus"
}