{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Cloud Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Senior Cloud Engineer with 13+ years of experience leveraging **AWS**, **Azure**, and **OpenStack** to design and implement cloud-native solutions. Proficient in **AI/ML** technologies and AIaaS frameworks, with a strong focus on predictive analytics and automation. Experienced in deploying scalable infrastructures, including **IaaS**, **PaaS**, and **GPU** resources, ensuring high-performance and compliance with industry standards such as HIPAA and PCI DSS.\nSkilled in virtualization with **VMware** and hands-on experience managing bare metal solutions. Effective communicator with a solid background in presenting complex technical concepts clearly. Demonstrated ability to collaborate across teams to drive project success and implement event-driven architectures and microservices.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Cloud Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Utilized cloud technologies including **AWS**, **Azure**, and **Google Cloud** to deploy scalable solutions meeting stringent business and compliance requirements.\nEngineered and maintained robust infrastructure-as-a-service (**IaaS**) solutions, optimizing resource allocation and deployment efficiency across **VMware** and **OpenStack**.\nImplemented platform-as-a-service (**PaaS**) strategies that advanced application development cycles, focusing on deployment and resource management.\nDemonstrated advanced networking skills to ensure secure and efficient communication between distributed systems and cloud resources.\nLeveraged AI as a Service (**AIaaS**) tools to enhance application intelligence, including integration with GPU-accelerated machine learning models for data processing.\nDelivered compelling presentations and effectively communicated technical concepts to stakeholders, ensuring transparency and alignment with business goals.\nDesigned and executed cloud migration strategies, reducing infrastructure costs by **25%** and improving system performance by analyzing data across multiple environments.\nCollaborated on enhancing disaster recovery plans, implementing multiple failover strategies that reduced downtime by **99%**.\nDeveloped training and documentation materials for cross-functional teams to facilitate the adoption of new cloud technologies and best practices.\nManaged vendor relations with solutions like **Salesforce** and **HubSpot**, optimizing data workflows and improving customer engagement strategies."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Designed and implemented robust cloud solutions in **IaaS** and **PaaS** environments, utilizing **Azure** and **OpenStack** to enhance infrastructure scalability and performance, achieving a **40%** increase in resource efficiency.\nUtilized **VMware** for virtualization, successfully reducing on-premise hardware costs by **30%** through effective resource allocation and management.\nDeveloped and deployed machine learning models for fraud detection using **AIaaS** services, resulting in a **25%** reduction in false positives in transaction monitoring.\nExecuted comprehensive networking strategies that improved data flow and minimized latency across cloud platforms, resulting in enhanced user experience.\nConducted regular presentations and communications with stakeholders to demonstrate the benefits and functionality of cloud solutions, boosting team collaboration by **50%**.\nImplemented GPU acceleration technologies in cloud-based applications, increasing processing speeds for computational tasks by **3x**.\nEnsured seamless integration of third-party tools like **Salesforce** and **HubSpot** into cloud architecture, optimizing customer relationships and data management.\nOptimized communication protocols through event-driven architectures like **RabbitMQ** and **Kafka**, enhancing system responsiveness and operational efficiency."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "• Designed and optimized cloud infrastructure solutions leveraging **IaaS** and **PaaS** for global e-commerce applications, ensuring high availability and scalability, thereby reducing downtime by **30%**.\n• Developed cloud-based AI solutions using **AIaaS** frameworks to enhance system intelligence, improving user engagement through personalized recommendations and increasing conversion rates by **15%**.\n• Implemented robust networking architectures utilizing **VMware**, **OpenStack**, and **Bare Metal** to maximize resource efficiency and deliver high-performance environments to facilitate quick deployment of applications.\n• Utilized **Salesforce** and **HubSpot** for effective customer relationship management, resulting in enhanced communication and collaborative efforts across teams leading to a **25%** increase in customer satisfaction.\n• Communicated complex technical topics and project updates to stakeholders through effective presentation strategies, ensuring alignment on project goals and timelines.\n• Applied effective measures in **GPU** provisioning to accelerate processing tasks, reducing computational time for data-heavy applications by **40%**.\n• Ensured seamless integration and deployment of applications in cloud environments, enhancing overall operational capability and maintaining compliance with industry standards.\n• Participated in regular cloud architecture reviews and strategy sessions, facilitating knowledge sharing among team members and promoting continuous improvement practices."
    }
  ],
  "skills": "**Programming Languages:**\n\tPython: FastAPI, Flask, Django\n\tJavaScript/TypeScript: React, Vue, Angular\n\n**Backend Frameworks:**\n\tFastAPI\n\tFlask\n\tDjango\n\n**Frontend Frameworks:**\n\tReact\n\tVue\n\tAngular\n\n**API Technologies:**\n\tOAuth2\n\tJWT\n\tKeycloak (OIDC, RBAC)\n\n**Serverless and Cloud Functions:**\n\tAWS: Lambda\n\tAzure: App Services\n\n**Databases:**\n\tPostgreSQL (Fintech)\n\tMySQL (Healthcare)\n\tMongoDB (Gaming)\n\tRedis\n\n**DevOps:**\n\tDocker\n\tKubernetes\n\tGitHub Actions\n\tGitLab CI/CD\n\tTerraform\n\tAnsible\n\tHelm\n\tDocker Compose\n\n**Cloud & Infrastructure:**\n\tAWS: ECS, RDS, S3\n\tAzure: Blob Storage, SQL Database\n\tIaaS\n\tPaaS\n\tBare Metal\n\tVMware\n\tOpenStack\n\n**Other:**\n\tAIaaS\n\tGPU\n\tSalesforce\n\tHubSpot\n\tNetworking\n\tCommunication\n\tPresentation",
  "apply_company": "Gcore"
}