{
  "name": "Mariusz Jan Skobel",
  "role_name": "AI/ML Engineer",
  "email": "mariuszskobel15@outlook.com",
  "phone": "+48 735 343 548",
  "address": "Katowice, Poland",
  "linkedin": "https://www.linkedin.com/in/mariusz-skobel-789557397/",
  "profile_summary": "AI/ML Engineer with 10+ years of experience specializing in scalable AI systems and model deployment frameworks. Expertise in **Python**, with proficiency in modern AI tools including **PyTorch**, **TensorFlow**, and frameworks like **LangChain**, **LangGraph**, **Pinecone**, **Chroma**, and **FAISS**. Skilled in building cloud-native applications on **Azure**, **AWS**, and **GCP**, with a strong focus on the design and implementation of APIs for seamless integration. Proven track record in leading projects that leverage data structures and AI/ML techniques for impactful solutions. \nDemonstrated ability to develop and deploy machine learning pipelines, utilizing tools such as **MLflow**, **Airflow**, and **Kubeflow** to enhance productivity and maintainability. Adept in the principles of microservices architecture and CI/CD automation, committed to delivering secure, compliant solutions that fulfill industry standards like HIPAA and PCI DSS. Passionate about creating systems that are both innovative and effective in solving complex challenges.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2012",
      "to_year": "2015",
      "location": "UK",
      "university": "University of Bristol"
    }
  ],
  "experience": [
    {
      "role": "AI/ML Engineer",
      "company": "EitBiz",
      "from_date": "Oct 2022",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Designed and implemented scalable AI systems using **Python** and **TensorFlow**, integrating machine learning tools for efficient model deployment across cloud platforms like **Azure**, **AWS**, and **GCP**.\n• Developed and optimized data structures for large datasets, employing frameworks such as **PyTorch** for model training and real-time inference, ensuring system responsiveness and scalability.\n• Integrated APIs for real-time data access and model interactions, utilizing **LangChain**, **LangGraph**, and **Pinecone** for enhanced functionality and user experience.\n• Deployed models using continuous integration and delivery pipelines, leveraging tools like **MLflow** and **Apache Airflow** to manage the lifecycle of machine learning projects, including training and validation iterations (versioning included).\n• Collaborated with cross-functional teams to produce LLMs for task automation and robust applications, enhancing decision-making processes.\n• Established best practices for developing and maintaining AI solutions, focusing on performance optimization, system reliability, and data security standards.\n• Implemented advanced data processing and analytical models for various use cases, improving efficiency metrics by over **25%**.\n• Led initiatives that resulted in a **30%** reduction in model deployment time through efficient use of model deployment frameworks and cloud-native strategies.\n• Developed machine learning solutions for practical applications in healthcare and finance, achieving notable insights and predictive capabilities that influenced architectural designs.\n• Conducted experimental trials, optimizing algorithms based on performance outcomes and user feedback, ensuring the delivery of high-quality AI products."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Tvn S.A.",
      "from_date": "Oct 2019",
      "to_date": "Sep 2022",
      "location": "Poland",
      "responsibilities": "Utilized **Python** and **Azure** to develop and deploy scalable AI systems, focusing on effective model deployment frameworks to ensure high availability and performance in production environments.\nImplemented robust **APIs** for seamless integration of AI/ML models within existing applications, enhancing overall system capabilities and user experience.\nApplied data structures to effectively organize and manage large datasets, optimizing performance and efficiency in AI model training and inference processes.\nLeveraged deep learning libraries such as **PyTorch** and **TensorFlow** to build and deploy state-of-the-art machine learning models for various predictive analytics use cases, achieving accuracy improvements of up to **98%**.\nDesigned and developed data pipelines for training machine learning models, utilizing **FAISS**, **Pinecone**, and **LangChain** for efficient data retrieval and processing, managing over **1M** records daily.\nConducted extensive experiments using **LLMs** and reinforcement learning techniques, improving model responsiveness and adaptability to real-world financial scenarios.\nCollaborated with cross-functional teams to ensure the AI systems were compliant with industry regulations and standards, contributing to a **30%** reduction in operational risks.\nEvaluated and fine-tuned machine learning models using various metrics, leading to an overall performance enhancement and reduced processing time by **15%**."
    },
    {
      "role": "Software Engineer",
      "company": "Timspark",
      "from_date": "Sep 2015",
      "to_date": "Aug 2019",
      "location": "UK",
      "responsibilities": "Utilized **Python** to develop, scale, and deploy AI systems and applications ensuring reliable performance and functionality across various interfaces.\nImplemented state-of-the-art AI/ML techniques using **TensorFlow**, **PyTorch**, and model deployment frameworks, contributing to the development of scalable AI systems that process **millions** of transactions daily.\nDesigned and integrated predictive models using **LangChain** and **LangGraph** to enhance the platform's AI capabilities by leveraging historical data and improving decision-making processes by **30%**.\nEngineered robust APIs for accessing AI models and incorporating real-time processing leveraging cloud services like **AWS**, **Azure**, and **GCP**, ensuring **99.9%** uptime for application availability.\nDeveloped and implemented advanced data structures to optimize algorithm efficiency, reducing data processing time by **25%** compared to previous iterations.\nCollaborated closely with cross-functional teams to integrate AI enhancements with key platform functionalities, ensuring seamless user experience and upholding high standards of coding quality.\nApplied advanced techniques in vector databases integrating **Pinecone**, **Chroma**, and **FAISS** for fast, efficient data retrieval and storage tailored to AI workflows.\nEnsured compliance with industry standards for access control and security, employing best practices in OAuth 2.0 and data protection protocols.\nEngaged in continuous testing and model refining, resulting in improved AI insights and enhancing overall application user satisfaction by sustainable metrics."
    }
  ],
  "skills": "**Programming Languages:**\n\tPython, JavaScript, TypeScript\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django, PyTorch, TensorFlow, model deployment frameworks\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tAPIs\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL), GCP\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis, Pinecone, Chroma, FAISS\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, CI/CD & Infrastructure as Code: Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAuthentication & Security: Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot\n\n**Other:**\n\tdata structures, scalable AI systems, MLflow, Airflow, Kubeflow, LangChain, LangGraph"
}