{
  "name": "Mariusz Jan Skobel",
  "role_name": "Senior JavaScript Engineer",
  "email": "mariuszskobel15@outlook.com",
  "phone": "+48 735 343 548",
  "address": "Katowice, Poland",
  "linkedin": "https://www.linkedin.com/in/mariusz-skobel-927764397/",
  "profile_summary": "Senior JavaScript Engineer with 10+ years of experience specializing in modern web development technologies. Highly proficient in **JavaScript**, **TypeScript**, **React**, **Vue.js**, **HTML5**, **CSS3**, SASS, LESS, and utilizing tools such as **Webpack**, **Gulp**, and **jQuery** for building high-performance applications. Experienced in implementing **microservices** architecture to enhance scalability and maintainability in applications. Demonstrated expertise in real-time analytics, utilizing **Git** for version control and collaboration. Proven track record of delivering efficient solutions that meet industry standards and compliance requirements. Skilled at leveraging my extensive background in full-stack development, including proficiency in **Node.js**, to create seamless user experiences and robust applications. Passionate about fostering innovation and driving impactful results through technology.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2012",
      "to_year": "2015",
      "location": "UK",
      "university": "University of Bristol"
    }
  ],
  "experience": [
    {
      "role": "Senior JavaScript Engineer",
      "company": "EitBiz",
      "from_date": "Oct 2022",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "•\tDeveloped and maintained high-performance web applications using **JavaScript**, **React** (17–18), **Node.js**, and **TypeScript**, ensuring responsive design through **HTML5**, **CSS3**, **SASS**, and **LESS**.\n•\tOptimized application performance by implementing modern build tools such as **Webpack** and **Gulp**, contributing to a 30% reduction in load time.\n•\tArchitected microservices to enhance application modularity and scalability, streamlining deployment processes and increasing uptime by 25% across services.\n•\tCollaborated with UX/UI designers to implement visually appealing interfaces, adhering to best practices in **CSS3** and **HTML5** for fine-grained control of layout and styling.\n•\tUtilized **Vue.js** and **jQuery** for dynamic content management and to enhance user experience across platforms, increasing user engagement metrics by 15%.\n•\tImplemented a comprehensive CI/CD pipeline using **Git** and **Playwright**, ensuring robust testing and quality assurance practices throughout development.\n•\tConducted code reviews and provided mentorship in **JavaScript** tools and frameworks, fostering a collaborative and high-performing engineering culture.\n•\tDesigned and executed unit tests and integration tests using Jest and Cypress, achieving over 95% test coverage on critical application components.\n•\tWorked closely with product teams to gather requirements and deliver features aligned with business objectives, meeting deadlines 100% of the time with zero critical bugs reported in production."
    },
    {
      "role": "Software Engineer",
      "company": "Tvn S.A.",
      "from_date": "Oct 2019",
      "to_date": "Sep 2022",
      "location": "Poland",
      "responsibilities": "Employed advanced **JavaScript** concepts, **React (18)**, and **TypeScript** to build scalable, high-performance front-end applications for financial platforms.\nLeveraged **HTML5**, **CSS3**, and **SASS** to enhance user interfaces, delivering responsive and dynamic experiences for **admin portals** and **financial dashboards**.\nDesigned and implemented a microservices-based architecture using **Node.js** (NestJS/Express) and **Python** (FastAPI, Django), resulting in improved maintainability and throughput for handling **high-volume transactions**.\nOptimized user interaction by incorporating **Vue 3** and **Redux Toolkit**, achieving a **30%** increase in user satisfaction and reducing loading times by **20%**.\nCreated real-time transaction monitoring tools using **D3.js** and **Power BI Embedded**, leading to a **25%** improvement in anomaly detection rates for operations teams.\nIntegrated messaging systems with **Kafka**, **RabbitMQ**, and **Azure Service Bus** to facilitate a robust event-driven architecture, enhancing responsiveness in transaction processing.\nConstructed ETL pipelines utilizing **Apache Airflow** and **Azure Data Factory** to support batch and real-time data ingestion, improving data pipeline efficiency by **40%**.\nDeveloped AI/ML-powered fraud detection mechanisms with **scikit-learn** and **XGBoost**, successfully identifying **95%** of suspicious activities through enhanced analysis of transaction patterns.\nFormulated ML pipelines for critical functions like credit scoring and churn prediction using **MLflow** and **Airflow**, integrating model inference into backend services for real-time decision-making."
    },
    {
      "role": "Software Engineer",
      "company": "Timspark",
      "from_date": "Sep 2015",
      "to_date": "Aug 2019",
      "location": "UK",
      "responsibilities": "Utilized **JavaScript** frameworks such as **React** (v18) and **Vue.js** to develop highly interactive, SEO-friendly user interfaces, ensuring cross-platform compatibility for e-commerce applications.\nEnsured optimal performance and maintainability of front-end code with **HTML5**, **CSS3**, **ECMAScript 6**, and pre-processors like **SASS** and **LESS**.\nImplemented modular architecture by leveraging microservices principles in the backend with **Node.js** and **Git** for version control and collaborative development.\nEmployed modern build tools like **Gulp** and **Webpack** for automated asset management, improving build times by **30%** in the development cycle.\nDeveloped comprehensive automated testing strategies using **Playwright**, enhancing code reliability and reducing bugs by up to **25%** before deployment.\nCollaborated in an agile environment, employing **TypeScript** for type safety and boosting developer productivity and code quality across the project.\nContinued to stay ahead of industry trends and best practices, regularly integrating new enhancements to the technology stack to meet evolving business needs."
    }
  ],
  "skills": " **Programming Languages:**\n\tJavaScript, TypeScript, Python\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular, HTML5, CSS3, ECMAScript 5, ECMAScript 6, SASS, LESS, jQuery, Playwright\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django, Node.js\n\n**API Technologies:**\n\t\n\n**Serverless and Cloud Functions:**\n\tAWS (Lambda), Azure (App Services)\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS (ECS, RDS, S3), Azure (Blob, SQL)\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, microservice, Gulp, Webpack",
  "apply_company": "Tech Pioneer"
}