{
  "name": "Tomasz Lee",
  "role_name": "Senior Backend Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Detail-oriented Senior Backend Engineer with 9+ years of experience in software development, specializing in Agile methodologies and Scrum practices. Proficient in **Spring** and ORM frameworks, with a strong foundation in database management and development. Adept at creating comprehensive documentation that enhances project clarity and facilitates communication across teams. Proven expertise in collaborating effectively and leading project initiatives to successful delivery. Additional skills include fluency in both German and English, enriching team interactions and client relations.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Senior Backend Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Utilized **Spring** framework for robust backend solutions, ensuring scalability and efficiency in software development.\nImplemented **ORM** techniques to streamline database interactions and improve data management processes.\nApplied **Agile** methodologies and **Scrum** practices to enhance project delivery timelines and foster collaborative development efforts.\nOversaw comprehensive **documentation** processes for software solutions, ensuring clarity and accessibility for future projects.\nDeveloped and maintained backend services with a focus on high availability, contributing to a **95%** uptime rate.\nAchieved a **30%** increase in team productivity through streamlined development practices and effective use of **Agile** frameworks.\nCollaborated with cross-functional teams to design scalable systems, resulting in a **20%** reduction in development time for new features.\nEnsured multilingual support by integrating **German** and **English** into software solutions, expanding user accessibility and satisfaction.\nParticipated in code reviews and mentoring sessions, improving overall code quality and team performance.\n"
    },
    {
      "role": "Software Engineer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "Utilized **Spring** framework and **ORM** techniques to design and develop robust backend solutions, enhancing the efficiency of software development processes.\nImplemented **Agile** methodologies and **Scrum** practices to optimize project workflows, successfully delivering projects on time and within scope.\nManaged various **Database** systems, including optimizations for SQL queries, achieving a **30%** increase in data retrieval efficiency.\nCreated and maintained comprehensive documentation for system architecture and user guides, ensuring clarity and accessibility for team members and stakeholders.\nDeveloped and integrated APIs with robust backend services leading to a **25%** increase in application performance, through careful management of system resources.\nCollaborated with cross-functional teams to gather project requirements and deliver tailored solutions, ensuring a seamless integration of user feedback into the software development lifecycle.\nParticipated actively in code reviews and provided mentorship to junior developers, fostering a culture of continuous learning and improvement within the team.\nConducted sprint planning and retrospectives to refine future development processes, contributing to an average **15%** increase in team velocity.\nFacilitated communication in both **German** and **English**, ensuring effective collaboration with diverse team members and stakeholders."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "Utilized **Spring** framework to enhance backend services within Agile framework, ensuring timely project delivery and adherence to Scrum methodologies.\nDeveloped ORM solutions to facilitate seamless database interactions, resulting in a **30%** increase in data retrieval efficiency.\nImplemented robust database strategies that improved overall data management processes and reduced system downtime by **15%**.\nCreated extensive technical documentation to streamline software development processes and aid knowledge transfer among team members.\nCollaborated with cross-functional teams to uphold Agile best practices, actively participating in weekly standups and sprint reviews.\nProvided support for English and German-speaking stakeholders, ensuring effective communication throughout the software development lifecycle.\nLeveraged comprehensive software development skills to deliver high-quality backend solutions, enhancing system performance and maintainability.\nContributed to the development of internal systems while adhering to coding standards and best practices, positively impacting overall project outcomes."
    }
  ],
  "skills": " **Programming Languages** \n\t Python, JavaScript, TypeScript, C#, \n\n **Backend Frameworks** \n\t NodeJS, ExpressJS, NestJS, Spring, .NET, Entity Framework, Microservices \n\n **Frontend Frameworks** \n\t HTML, CSS, ReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS \n\n **API Technologies** \n\t RESTful API, GraphQL \n\n **Serverless and Cloud Functions** \n\t AWS, Azure \n\n **Databases** \n\t MSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB \n\n **DevOps** \n\t CI/CD pipelines \n\n **Cloud & Infrastructure** \n\t Agile, Scrum \n\n **Other** \n\t UX/UI Design, Git, GitHub, Blockchain, Solidity, Ether.js, Web3.js, Ethereum, Apache Kafka, RabbitMQ, Redis, Testing Tools: NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest, Documentation, German, English, Software Development",
  "apply_company": "top itservices AG"
}