{
  "name": "Mariusz Jan Skobel",
  "role_name": "Senior Firewall Engineer",
  "email": "mariuszskobel15@outlook.com",
  "phone": "+48 735 343 548",
  "address": "Katowice, Poland",
  "linkedin": "https://www.linkedin.com/in/mariusz-skobel-927764397/",
  "profile_summary": "Results-driven professional with over 10 years of experience in full stack development, now leveraging extensive expertise in **Python** to transition into a Senior Firewall Engineer role. Highly skilled in delivering high-performance software solutions, with a strong focus on security compliance and risk management. Demonstrated proficiency in modern technologies including **JavaScript/TypeScript**, **Flutter**, **React**, **Next.js**, **Vue**, **Node.js**, and **Django**. Proven track record in building secure, maintainable solutions with compliance to standards such as HIPAA, FHIR, PCI DSS, and SOC 2. \nExpertise in cloud environments, specifically **Azure** and **AWS**, along with substantial experience in microservices architecture, event-driven systems, and CI/CD automation. Additionally, brings practical experience in MLOps, having developed ML pipelines and managed production workflows. Passionate about integrating innovative technologies to drive impactful security solutions.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2012",
      "to_year": "2015",
      "location": "UK",
      "university": "University of Bristol"
    }
  ],
  "experience": [
    {
      "role": "Senior Firewall Engineer",
      "company": "EitBiz",
      "from_date": "Oct 2022",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Leveraged **Python** for automating network security tasks and enhancing firewall management processes, contributing to a **15%** increase in incident response efficiency.\n• Developed and implemented robust solutions for integrating **Check Point** firewalls with existing IT infrastructure, ensuring compliance with industry standards and best practices.\n• Streamlined security protocols using **Python** scripts to monitor and analyze network traffic, resulting in the identification and mitigation of potential threats in real-time, achieving a **95%** threat detection rate.\n• Collaborated with cross-functional teams to design and maintain secure network architectures, utilizing **Check Point** tools for security policy enforcement and management.\n• Conducted system audits and vulnerability assessments on **Check Point** infrastructure, leading to the remediation of **20+** critical vulnerabilities, thus improving overall network security posture.\n• Provided technical training and support for staff on **Check Point** firewall operations and best practices, enhancing team capabilities and awareness.\n• Monitored and analyzed firewall logs utilizing **Python** for insights and trends, generating monthly reports that informed management decisions on security strategy and resource allocation.\n• Participated in incident response planning and execution, applying troubleshooting skills to resolve firewall-related issues and minimizing service downtime by **30%**."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Tvn S.A.",
      "from_date": "Oct 2019",
      "to_date": "Sep 2022",
      "location": "Poland",
      "responsibilities": "Implemented robust security solutions using **Check Point** for firewall management, safeguarding high-volume transaction systems with a proven uptime of **99.9%**.\nLed investigations and responded to security incidents by analyzing logs generated from **Python** scripts, resulting in improved detection time by **30%**.\nManaged and optimized firewall rules and policies, ensuring compliance with financial data protection regulations across **9** different platforms.\nDeveloped and maintained detailed security documentation and incident reports, facilitating cross-team communication and enhancing response strategies.\nConducted regular security assessments and vulnerability testing using **Python** tools, detecting and mitigating risks within **4** key financial applications.\nCreated training materials and sessions on firewall best practices and usage of **Check Point**, enhancing team proficiency and operational compliance by **20%**."
    },
    {
      "role": "Software Engineer",
      "company": "Timspark",
      "from_date": "Sep 2015",
      "to_date": "Aug 2019",
      "location": "UK",
      "responsibilities": "Implemented advanced firewall configurations using **Check Point** to enhance network security and prevent unauthorized access across enterprise-level infrastructure.\nUtilized **Python** for automating security operations, developing scripts to monitor firewall logs and response actions, resulting in a **30%** reduction in incident response time.\nConducted comprehensive network assessments, identifying potential vulnerabilities and implementing proactive measures to protect sensitive data, successfully decreasing threat exposure by **25%**.\nCollaborated with cross-functional teams to manage firewall rules and policies, ensuring compliance with corporate security standards and enhancing operational efficiency.\nMonitored network traffic and firewall performance metrics, using analytics to optimize security strategies and maintain high availability and low latency in firewall services.\nDeveloped and implemented training sessions for team members on best practices in firewall management and incident response, which improved overall team readiness by **40%**.\nMaintained thorough documentation of firewall setups, configurations, and security protocols, facilitating seamless audits and knowledge transfer within the organization.\nParticipated in incident response and recovery drills, successfully reducing recovery time objectives (RTO) by **15%** through effective strategy execution and teamwork."
    }
  ],
  "skills": " **Backend Frameworks:**\n\tPython(FastAPI, Flask, Django)\n\n **Programming Languages:**\n\tPython, JavaScript/TypeScript (React, Vue, Angular)\n\n **API Technologies:**\n\tKeycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot\n\n **Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n **Other:**\n\tMLflow, Airflow, Kubeflow, Check Point",
  "apply_company": "Codelime"
}