{
  "name": "Mariusz Jan Skobel",
  "role_name": "Senior C# Engineer",
  "email": "mariuszskobel15@outlook.com",
  "phone": "+48 735 343 548",
  "address": "Katowice, Poland",
  "linkedin": "https://www.linkedin.com/in/mariusz-skobel-927764397/",
  "profile_summary": "Senior C# Engineer with over 10 years of experience in developing secure, high-performance software solutions with a deep focus on cybersecurity and regulatory compliance. Adept in **C#**, **.NET**, and **Python**, and skilled in secure coding practices, vulnerability management, authentication, and authorization strategies. Expertise in industrial network security, IT/OT integration, and familiar with frameworks and guidelines such as **NIST** and **OWASP**. Proven track record in building applications that adhere to regulatory standards while leveraging technologies for automated testing and threat modeling using methodologies like **STRIDE**.\n\nAdditionally, experienced in full-stack development with a strong technical toolkit that includes **JavaScript/TypeScript**, **Flutter**, **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**. Proficient in deploying cloud-native applications on **Azure** and **AWS** while leveraging microservices architecture and CI/CD automation. Committed to designing systems that not only excel in functionality but also prioritize security and compliance, enabling organizations to navigate the complexities of the healthcare and finance sectors effectively.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2012",
      "to_year": "2015",
      "location": "UK",
      "university": "University of Bristol"
    }
  ],
  "experience": [
    {
      "role": "Senior C# Engineer",
      "company": "EitBiz",
      "from_date": "Oct 2022",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Leveraged **C#** and **.NET** frameworks to design and implement secure, scalable applications, ensuring adherence to regulatory compliance standards such as NIST and OWASP.\n• Developed robust authentication and authorization mechanisms using **encryption** strategies, enhancing **cyber security** posture against vulnerabilities and threats.\n• Executed vulnerability management processes in alignment with **cyber security** best practices, utilizing tools for threat modeling following **STRIDE** methodology.\n• Enhanced industrial network security by integrating **TCP/IP** protocols and ensuring secure communications for **IT/OT integration** environments.\n• Collaborated with cross-functional teams to implement automated testing strategies, ensuring high code quality and reliability in applications deployed in production environments.\n• Designed and built secure APIs using **Python** for backend services, while incorporating secure coding practices to protect against vulnerabilities.\n• Authored comprehensive documentation for secure coding practices and vulnerability management processes, promoting awareness of **cyber security** within the development team.\n• Executed tests using automated testing frameworks, achieving over **90% test coverage** in both unit and integration testing, thereby improving overall software quality.\n• Participated in security audits and assessments, successfully remediating issues to maintain compliance with **regulatory frameworks** such as **HIPAA**, **GDPR**, and **PCI DSS**.\n• Engaged in continuous improvement by staying updated on the latest trends in **cyber security** and incorporating new strategies into current projects."
    },
    {
      "role": "Software Engineer",
      "company": "Tvn S.A.",
      "from_date": "Oct 2019",
      "to_date": "Sep 2022",
      "location": "Poland",
      "responsibilities": "• Developed robust financial platform solutions with a strong emphasis on **C#**, ensuring compliance with regulatory standards and secure coding practices.\n• Enhanced system security while modernizing infrastructures through established vulnerability management strategies, cyber security protocols, and adherence to **NIST** guidelines.\n• Implemented authentication and authorization mechanisms within financial applications to ensure secure access management, employing **OWASP** principles.\n• Transformed legacy systems utilizing **C#** and **Python**, significantly improving maintainability and scalability for high-volume transaction environments.\n• Led initiatives to enhance industrial network security (OT cybersecurity) by integrating **TCP/IP** and **USB** protocols, fortifying the security posture of operational technology.\n• Automated testing processes using established frameworks to ensure system integrity, reliability, and compliance across various modules.\n• Conducted threat modeling using the **STRIDE** methodology to identify potential vulnerabilities in financial software architectures, implementing appropriate mitigations.\n• Collaborated on cross-functional teams to integrate **IT/OT integration**, enhancing performance metrics across systems while maintaining security standards.\n• Engaged in continuous learning and adaptation of best practices in **cyber security**, ensuring teams remained updated on emerging threats and mitigation strategies. "
    },
    {
      "role": "Software Engineer",
      "company": "Timspark",
      "from_date": "Sep 2015",
      "to_date": "Aug 2019",
      "location": "UK",
      "responsibilities": "Enhanced industrial network security and OT cybersecurity initiatives by integrating secure coding practices in **.NET** and **C#** applications, aligning with **NIST** standards for regulatory compliance.\nDeveloped and maintained authentication and authorization protocols utilizing **OWASP** guidelines to ensure user data protection and secure access control, with a focus on **role-based access control (RBAC)**.\nImplemented robust vulnerability management strategies encompassing encryption mechanisms and threat modeling using **STRIDE** to fortify the application against attacks.\nDesigned efficient data communication and protocols, leveraging **TCP/IP** for secure transfer in industrial environments while utilizing **USB** standards for device connectivity.\nEngineered automated testing frameworks using **Python**, ensuring high-quality code with reduced vulnerabilities across **9+** applications.\nConducted security audits and tests to evaluate compliance with cybersecurity regulations, thereby maintaining adherence to **IT/OT integration** protocols.\nLed training sessions for development teams on secure coding practices, enhancing the overall security competence by **30%**.\nCollaborated with cross-functional teams to identify potential threats and implementing solutions that resulted in a **50%** reduction in application vulnerabilities over two release cycles.\n"
    }
  ],
  "skills": " **Programming Languages:**\n\tC, C#, Python\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n **Frontend Frameworks:**\n\tJavaScript/TypeScript (React, Vue, Angular)\n\n **API Technologies:**\n\tJWT, OAuth2\n\n **Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda), Azure (App Services)\n\n **Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:**\n\tAWS (RDS, S3), Azure (Blob, SQL)\n\n **Other:**\n\tMLflow, Airflow, Kubeflow, cyber security, NIST, TCP/IP, USB, vulnerability management, authentication, authorization, encryption, industrial network security, OT cybersecurity, IT/OT integration, automated testing, regulatory compliance, secure coding practices, threat modeling, STRIDE, OWASP",
  "apply_company": "GlobalLogic"
}