{
  "name": "Patryk Zaslawski",
  "role_name": "Senior Rust Engineer",
  "email": "patrykzas0428@outlook.com",
  "phone": "+48669862402",
  "address": "Gdanski, Poland",
  "linkedin": "https://www.linkedin.com/in/patryk-z-107978395/",
  "profile_summary": "As a seasoned Senior Rust Engineer with 8+ years of software engineering experience, I bring expertise in **Rust** and **Golang**, focusing on back-end development and the implementation of secure solutions through effective **authentication** and **authorization** practices. Proficient in **TypeScript**, I design composable services and asynchronous workflows that enhance application performance. My technical skill set includes **identity management** and utilizing protocols such as **OAuth** and **OIDC** for robust security measures, ensuring system integrity and user safety. Beyond my technical acumen, I excel in problem-solving and mentoring, fostering collaboration and adaptability in team environments. My prior experience as a Full Stack Developer has equipped me with a unique perspective on building secure, high-performance solutions across various sectors.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2014",
      "to_year": "2017",
      "location": "United Kingdom",
      "university": "The University of Manchester"
    }
  ],
  "experience": [
    {
      "role": "Senior Rust Engineer",
      "company": "Binary Studio",
      "from_date": "Aug 2023",
      "to_date": "Present",
      "location": "United Kingdom (Remote)",
      "responsibilities": "- Developed secure authentication and authorization mechanisms using **OAuth** and **OIDC** to protect user identities and access control in a Rust environment.\n- Led initiatives for security best practices across **backend development**, ensuring robust protection of sensitive data while maintaining compliance with industry standards.\n- Designed and implemented **asynchronous workflows** leveraging **Rust** and modern paradigms to enhance performance and user experience in composable services.\n- Mentored junior engineers in **Rust** programming, fostering a collaborative environment and promoting continuous professional development within the team.\n- Championed integration of identity management solutions to enhance security protocols, focusing on collaborative efforts to drive innovation and adaptability.\n- Utilized **TypeScript** for building scalable front-end solutions that interact seamlessly with **Rust** backends, ensuring efficient data exchange and user interface responsiveness.\n- Collaborated with cross-functional teams to solve complex problems, driving project outcomes that improved team efficiency and product quality.\n- Contributed to the growth of composable services by integrating with various tools and frameworks that align with modern development practices.\n- Ensured high-quality deliveries through rigorous testing and code reviews, leading to a **30% reduction** in production issues.\n- Leveraged **WASM** for performance enhancements in web applications, supporting faster execution of Rust code within browsers.\n- Engaged in continuous learning and adaptation of new technologies in the **Rust** ecosystem to evolve coding standards and practices within the engineering team.\n- Implemented comprehensive documentation and mentoring programs, equipping team members with skills in **Rust**, security frameworks, and advanced software engineering methodologies."
    },
    {
      "role": "Software Engineer",
      "company": "Ardigen",
      "from_date": "Mar 2020",
      "to_date": "Aug 2023",
      "location": "Poland",
      "responsibilities": "• Developed and implemented robust security measures, including **OAuth** and **OIDC** for seamless authentication and authorization in backend systems.\n• Utilized **Rust** to create composable services, enhancing modularity and system efficiency in developing asynchronous workflows.\n• Employed **TypeScript** to support dynamic user-interface development and integration with backend services, ensuring effective collaboration across project teams.\n• Led mentoring initiatives within the team to enhance problem-solving skills and foster a culture of adaptability and collaboration in software development.\n• Contributed to back-end development of high-performance applications with a focus on optimizing code in **Rust** and ensuring reliable system integrations.\n• Collaborated on system architecture design, enhancing composability and scalability in various projects, resulting in a **30%** increase in deployment efficiency.\n• Spearheaded projects utilizing **WASM** for performance improvements in web applications, achieving load times reduced by **40%**.\n• Conducted thorough security assessments and audits to ensure compliance with industry standards and best practices in identity management, resulting in zero security breaches over a **12-month** period.\n• Designed and executed asynchronous data workflows, significantly improving processing times and user experience in response to client requirements.\n• Initiated brainstorming sessions, leading to innovative solutions and problem-solving strategies that reduced project timelines by **25%**.\n• Actively participated in code reviews and technical discussions to foster challenging yet supportive development environments, enhancing overall team performance."
    },
    {
      "role": "Software Engineer",
      "company": "Altum Software",
      "from_date": "Oct 2017",
      "to_date": "Feb 2020",
      "location": "United Kingdom",
      "responsibilities": "Focused on back-end development in **Rust** and **Golang**, expertly implementing composable services to enhance system architecture and scalability.\nDeveloped secure authentication and authorization mechanisms in line with **OAuth** and **OIDC**, ensuring robust identity management for users and administrators.\nCollaborated effectively in asynchronous workflows, improving project delivery timelines by **20%** through streamlined communication and code review initiatives.\nMentored junior developers on best practices in secure coding and problem-solving strategies, fostering a culture of collaboration and continuous improvement.\nUtilized **TypeScript** to enhance integration with various frontends, ensuring smooth data flow and user experience across applications.\nLeveraged advanced security measures to protect data and applications from vulnerabilities, adhering to the latest industry standards and compliance requirements.\nApplied problem-solving techniques to debug and optimize backend services, successfully reducing processing time by **30%** through efficient code refactoring and architecture redesign.\nParticipated in architecture discussions to design systems that improve adaptability and support evolving project requirements, preparing for future technology shifts.\nConducted thorough code reviews, contributing to a significant increase in overall code quality and maintainability.\nImplemented unit and integration tests in **Rust**, achieving a test coverage of **85%**, ensuring high reliability and performance of backend services.\nOptimized workflows to handle peak traffic loads, resulting in system responsiveness improvements of **40%** during high-demand periods."
    }
  ],
  "skills": "Programming Languages:\n\tPython, Rust, Golang, TypeScript\n\n**Backend Frameworks:**\n\tFastAPI, Django, Flask, Spring Boot\n\n**Frontend Frameworks:**\n\tAngular (1–16), React (15–18), Next.js, Vue.js (2/3), Blazor\n\n**API Technologies:**\n\tREST & gRPC APIs, OAuth, OIDC\n\n**Serverless and Cloud Functions:**\n\tAWS (Lambda), Azure\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD\n\n**Cloud & Infrastructure:**\n\tAWS (ECS, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Other:**\n\tKeycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, security, authentication, authorization, identity management, composable services, asynchronous workflows, problem solving, mentoring, collaboration, adaptability",
  "apply_company": "1Password"
}