{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "Results-driven Senior Engineer with 8 years of experience in developing scalable solutions in distributed systems and microservices architecture. Proficient in **AWS** and **Kubernetes**, with solid expertise in implementing **Java** technologies to architect resilient applications that meet high-performance standards. Adept at leveraging **Apache Flink** for real-time data processing and integrating machine learning capabilities for advanced analytics.\n\nMy background encompasses a strong foundation in data structures and algorithms, ensuring efficient application logic. I have a proven track record of designing CI/CD pipelines for automation and robust security compliance including standards like HIPAA, FHIR, PCI DSS, and SOC 2. Additionally, I possess practical experience in crafting machine learning pipelines and deploying models using **MLflow**, **Airflow**, and **Kubeflow**, contributing to intelligent automation within enterprise-grade platforms.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Developed and optimized scalable microservices architectures using **Java** and **Kubernetes (v1.21)**, ensuring effective collaboration across distributed systems to enhance system resilience and performance.\nDesigned and implemented efficient data structures and algorithms to solve complex technical challenges across various applications, contributing to improved data processing and application responsiveness.\nLeveraged **AWS** cloud services for deploying robust, serverless solutions, enhancing application scalability and reducing operational overhead while ensuring high availability.\nArchitected systems with a focus on distributed systems concepts, deploying **Apache Flink** for real-time data processing and analytics in healthcare and financial services applications.\nUtilized machine learning (ML) techniques to integrate predictive analytics, improving decision-making processes within core applications and enhancing user experiences.\nCollaborated with cross-functional teams to establish clear communication channels, ensuring alignment on project goals and expectations, while delivering features efficiently.\nExecuted code reviews and implemented best practices in software development to maintain high-quality standards and enhance application maintainability over **9** months.\nParticipated in the development and deployment of innovative API solutions, enhancing system interoperability and data exchange across various platforms, achieving a **40%** improvement in response times.\nContributed to reliable development operations by using CI/CD practices, engaging with tools such as **GitHub Actions** and **AWS** to ensure consistent application delivery and performance monitoring.\nImplemented rigorous testing strategies that encompass unit, integration, and end-to-end testing resulting in a **30%** reduction in production defects across applications.\nFacilitated knowledge sharing and mentorship within engineering teams to foster skill development with an emphasis on fundamental operating systems principles and compiler design."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Utilized **Java** to develop and maintain microservices, enhancing distributed systems for high scalability and performance across financial platforms.\nDesigned and implemented efficient data structures and algorithms to optimize transaction processing, resulting in a 30% increase in system throughput.\nLeveraged **AWS** services to deploy and manage applications in a cloud environment, improving resource utilization and reducing operational costs by 25%.\nOrchestrated containerized applications using **Kubernetes**, ensuring seamless scaling and reliability of services in production.\nIntegrated data processing frameworks such as **Apache Flink** to facilitate real-time data analytics, supporting compliance and decision-making workflows with sub-second latency.\nDeveloped AI/ML models for real-time fraud detection and predictive analytics using **TensorFlow** and **scikit-learn**, improving anomaly detection accuracy by 15%.\nCollaborated on cross-functional teams to enhance communication protocols and system integration, resulting in a 40% reduction in incident resolution times.\nContributed to code reviews and mentorship sessions to strengthen team capabilities in data handling and machine learning applications, fostering a culture of continuous improvement."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "• Engineered robust **microservices** architecture leveraging **Java** within a scalable environment, ensuring optimal performance and enhanced maintainability in a distributed system.\n• Implemented efficient **data structures** and **algorithms** to optimize backend processes, achieving a 30% improvement in response time for high-frequency operations.\n• Deployed and managed cloud infrastructure using **AWS** and **Kubernetes** for dynamic scaling and resource management, supporting an uptime target of **99.99%**.\n• Integrated **Apache Flink** for real-time stream processing, enhancing data processing capabilities and enabling timely analytics on user interactions.\n• Spearheaded the adoption of **ML** solutions to drive insights and improve features, leveraging machine learning frameworks for predictive modeling and decision-making processes.\n• Conducted multi-layered testing and performance benchmarking on new deployments, achieving a reduction of **40%** in communication latency across applications.\n• Developed secure and efficient communication protocols to facilitate client-server interactions, ensuring data integrity and confidentiality while supporting concurrent users.\n• Collaborated in cross-functional teams to design and implement feature improvements based on user feedback and analytics, resulting in a **20%** increase in user satisfaction metrics.\n• Drove the continuous integration and deployment pipeline, achieving a **50%** reduction in release time while maintaining high-quality code standards through automated testing and static analysis."
    }
  ],
  "skills": " **Programming Languages:**\n\tJava, Python, JavaScript/TypeScript\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django, Microservices, Apache Flink\n\n **Frontend Frameworks:**\n\tReact, Vue, Angular\n\n **API Technologies:**\n\tJWT, OAuth2, Keycloak (OIDC, RBAC)\n\n **Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n **Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:**\n\tAWS, Azure, Nginx, Certbot\n\n **Other:**\n\tMLflow, Airflow, Kubeflow, Data Structures, Algorithms, Distributed Systems, Operating Systems, Communication, Compilers",
  "apply_company": "Toughbyte"
}