{
  "name": "Mariusz Jan Skobel",
  "role_name": "Senior Fullstack Engineer",
  "email": "mariuszskobel15@outlook.com",
  "phone": "+48 735 343 548",
  "address": "Katowice, Poland",
  "linkedin": "https://www.linkedin.com/in/mariusz-skobel-927764397/",
  "profile_summary": "Senior Full Stack Engineer with 10+ years of experience delivering high-performance software solutions, specializing in **React**, **TypeScript**, **Node.js**, and **AWS**. Proficient in building dynamic web applications using **Redux**, **HTML**, **CSS**, and implementing robust backend services with **Express** and **REST/GraphQL** APIs. Skilled in CI/CD automation for seamless deployment and integration. Adept at managing databases with **PostgreSQL** and **MongoDB**, ensuring optimal performance and security. \nDemonstrated success in creating cloud-native applications and driving projects from conception to completion, with a strong attention to detail and a creative problem-solving mindset. Experienced in developing features that meet compliance standards such as HIPAA and PCI DSS while focusing on user-centric design and real-world impact.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2012",
      "to_year": "2015",
      "location": "UK",
      "university": "University of Bristol"
    }
  ],
  "experience": [
    {
      "role": "Senior Fullstack Engineer",
      "company": "EitBiz",
      "from_date": "Oct 2022",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Designed and implemented scalable, full-stack solutions using **React** (17–18), **TypeScript**, and **Node.js**, ensuring adherence to regulatory standards like HIPAA and PCI DSS.\n• Developed responsive web applications utilizing **Redux**, HTML, and CSS for enhanced user experience while maintaining attention to detail in design and performance.\n• Built and deployed cross-platform mobile apps leveraging **React Native** and **Flutter**, delivering seamless experiences on iOS and Android platforms.\n• Led the transition of monolithic applications to microservices architectures employing **Docker** and **Kubernetes** (AKS/EKS), optimizing for scalability and fault tolerance.\n• Designed and maintained cloud-native data architectures with **PostgreSQL** and **MongoDB**, focusing on efficient data ingestion and querying for healthcare and financial services.\n• Integrated **GraphQL** for optimized data retrieval and streamlined API communication, enhancing overall application performance.\n• Established CI/CD pipelines using **GitHub Actions** and **Azure DevOps**, facilitating smooth deployments and ensuring code quality through automated testing and security scans.\n• Collaborated with data scientists to implement machine learning models for use cases such as fraud detection and health prediction, utilizing **scikit-learn** and **TensorFlow**.\n• Developed advanced data visualization tools using **D3.js** and **Chart.js**, enabling real-time insights into transaction trends and KPI metrics for financial data.\n• Conducted comprehensive testing strategies utilizing **Jest**, **Cypress**, and **Postman** for robust verification of both front-end and back-end services, ensuring high quality and reliability.\n• Integrated **Firebase** and AWS services to enhance application performance and enable real-time data synchronization, driving effective collaboration and communication.\n• Utilized **Lighthouse** and **Axe** for performance audits and accessibility checks, ensuring the highest standards in application usability and compliance."
    },
    {
      "role": "Software Engineer",
      "company": "Tvn S.A.",
      "from_date": "Oct 2019",
      "to_date": "Sep 2022",
      "location": "Poland",
      "responsibilities": "Developed user-focused front-end applications leveraging **React (18)**, **TypeScript**, **Redux**, **HTML**, and **CSS**, enhancing usability and performance of financial dashboards and admin portals by achieving over **90%** user satisfaction scores.\nEngineered scalable server-side applications using **Node.js (Express)**, implementing **REST** and **GraphQL** APIs that improved data retrieval speed by **30%** for high-volume transaction systems.\nEmployed **PostgreSQL** and **MongoDB** for efficient data storage and retrieval, optimizing database performance leading to a **25%** reduction in response times for user queries.\nPracticed CI/CD methodologies to streamline deployment processes across multiple environments, reducing downtime by **40%** and ensuring rapid delivery of new features and updates.\nImplemented comprehensive testing strategies using tools like **Lighthouse** and **Axe**, leading to enhanced code quality and accessibility, achieving **98%** coverage on critical functionalities.\nUtilized problem-solving and creative thinking skills to address complex engineering challenges, enhancing overall project outcomes and efficiency in financial services development.\nDemonstrated strong attention to detail throughout the development lifecycle, ensuring high standards in code quality and user experience across multiple applications."
    },
    {
      "role": "Software Engineer",
      "company": "Timspark",
      "from_date": "Sep 2015",
      "to_date": "Aug 2019",
      "location": "UK",
      "responsibilities": "• Developed and maintained **React (18)** components, leveraging **TypeScript** and **Redux** to enhance state management, ensuring a high-quality user experience on e-commerce platforms.\n• Implemented intuitive and responsive layouts using **HTML5**, **CSS3**, and **Tailwind CSS**, adhering to best practices for mobile-first design and accessibility (WCAG 2.1).\n• Engineered backend services with **Node.js** and **Express** for efficient API development, including **REST** and **GraphQL** endpoints to support seamless data retrieval and integration.\n• Collaborated on database architecture using both **PostgreSQL** and **MongoDB**, achieving a performance improvement of up to **30%** through optimal indexing and query strategies.\n• Integrated CI/CD pipelines for smooth deployment processes, utilizing tools like **Firebase** and **AWS** to automate testing and release workflows, reducing deployment time by more than **40%**.\n• Conducted performance audits using **Lighthouse** and accessibility checks with **Axe**, ensuring applications met both speed benchmarks and compliance standards.\n• Demonstrated strong problem-solving skills by addressing complex technical challenges, enhancing application functionality and user satisfaction.\n• Fostered creativity in product development discussions, contributing innovative ideas for feature enhancements and UX improvements.\n• Maintained high attention to detail throughout the development process, guaranteeing bug-free releases and consistent code quality in line with project requirements."
    }
  ],
  "skills": "**Frontend Frameworks:**\n\tReact, TypeScript, Redux, HTML, CSS\n\n**Backend Frameworks:**\n\tNode.js, Express\n\n**API Technologies:**\n\tREST, GraphQL\n\n**Databases:**\n\tPostgreSQL, MongoDB\n\n**DevOps:**\n\tCI/CD\n\n**Cloud & Infrastructure:**\n\tAWS\n\n**Other:**\n\tproblem solving, creativity, attention to detail\n\n**Frameworks & Technologies:**\n\tPython(FastAPI, Flask, Django), JavaScript/TypeScript (React, Vue, Angular)\n\n**Artificial Intelligence & Machine Learning:**\n\tMLflow, Airflow, Kubeflow\n\n**DevOps & Cloud:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, AWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Authentication & Security:**\n\tKeycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot\n\n**Databases & Caching:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**CI/CD & Infrastructure as Code:**\n\tTerraform, Ansible, Helm, Docker Compose",
  "apply_company": "AccessiWay"
}