{
  "name": "Tomasz Lee",
  "role_name": "Senior Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Results-driven Senior Engineer with 9+ years of experience in building and delivering high-quality applications utilizing **React**, **TypeScript**, **Next.js**, and **SCSS**. Proficient in developing RESTful APIs and integrating **GraphQL** for efficient data management while employing **CI/CD** practices with **GitHub Actions** for streamlined deployment. Experienced in cloud services, specifically **AWS**, enabling robust scaling and performance optimization. Strong background in debugging and conducting code reviews to foster continuous improvement. Proven track record of collaborating effectively across cross-functional teams and leading projects to successful outcomes, specializing in enhancing user experiences and operational efficiency.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Senior Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "• Developed robust web applications using **React**, **Next.js**, and **TypeScript**, enhancing functionality and user experience.\n• Spearheaded the design and implementation of RESTful APIs, ensuring seamless integration and communication across services.\n• Integrated CI/CD pipelines utilizing **GitHub Actions**, improving deployment efficiency by **40%**.\n• Collaborated with cross-functional teams to define project requirements and deliver high-quality software in iterative cycles.\n• Conducted code reviews to ensure adherence to best practices and fostered a culture of continuous improvement.\n• Developed and maintained interactive data visualizations using **D3.js** and **Three.js**, enriching the analytical capabilities of the platform.\n• Debugged complex issues, utilizing **Python** for scripting automation and improving troubleshooting processes.\n• Implemented Version **1.0** for a microservices architecture, ensuring scalability and maintainability of the system.\n• Enhanced user interfaces through collaboration with UX/UI designers, leading to an overall increase in user satisfaction by **25%**.\n• Optimized database interactions, contributing to reduced average query execution time by **20%**."
    },
    {
      "role": "Full Stack Developer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "Developed and maintained web applications using **React**, **Next.js**, and **TypeScript** to enhance user experience and engagement by **25%**.\nImplemented RESTful and GraphQL APIs to facilitate smooth communication between front-end and back-end services, ensuring real-time data access and system interoperability.\nDesigned and optimized CI/CD pipelines with **GitHub Actions**, minimizing production deployment errors by **30%** through automation and streamlined processes.\nApplied **SCSS** for styling components, ensuring responsive design and improved visual consistency across platforms.\nLeveraged **Python** for backend processes, enhancing data processing efficiency and supporting various integrations.\nCollaborated with cross-functional teams to gather requirements and develop project timelines, promoting effective **collaboration** throughout the project lifecycle.\nConducted thorough **code reviews** and provided mentorship to junior developers, fostering a culture of continuous improvement and skill development within the team.\nEngaged in debugging and troubleshooting sessions to resolve technical issues, thus maintaining high standards of code quality and performance.\nUtilized **AWS** for cloud services, ensuring high availability and scalability of applications across different environments.\nActively participated in team meetings to discuss project status, aligning objectives with business goals and stakeholder expectations."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "Utilized **React** and **Next.js** to build high-performance front-end components, enhancing user experience by 30%.\nDeveloped applications using **TypeScript** to improve code maintainability and reduce errors by 25%.\nImplemented **AWS** services for scalable cloud solutions, resulting in a 40% decrease in operational costs.\nEnsured effective collaboration through participation in daily standups and conducted thorough code reviews to maintain coding standards and best practices.\nEngaged in CI/CD processes using **GitHub Actions**, accelerating deployment frequency by 50%.\nDebugged various applications, leading to a 35% reduction in reported software bugs.\nEmployed **GraphQL** and **REST** APIs for efficient data communication between front-end and back-end systems.\nCreated and maintained style sheets using **SCSS**, achieving a cohesive and visually appealing UI across the platform.\nFacilitated continuous improvement initiatives by gathering feedback and iterating on development cycles.\nProduced and refined technical documentation and user guides, fostering knowledge sharing and onboarding efficiency across teams."
    }
  ],
  "skills": "Frontend Frameworks:\n\tReact, TypeScript, Next.js, Angular, VueJS, NuxtJS, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS, SCSS\n\nBackend Frameworks:\n\tNodeJS, ExpressJS, NestJS, C#, .NET, Entity Framework, Microservices\n\nAPI Technologies:\n\tREST, GraphQL\n\nCloud & Infrastructure:\n\tAWS, Azure\n\nDevOps:\n\tCI/CD pipelines, GitHub Actions\n\nDatabase Systems:\n\tMSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB\n\nMessaging & Caching:\n\tApache Kafka, RabbitMQ, Redis\n\nTesting Tools:\n\tNUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest\n\nOther:\n\tBlockchain: Solidity, Ether.js, Web3.js, Ethereum, UX/UI Design, Git, GitHub, Python, Redux, debugging, collaboration, code reviews, continuous improvement"
}