{
  "name": "Rei Taro",
  "role_name": "Senior Website Engineer",
  "email": "rei515@outlook.com",
  "phone": "+48732529451",
  "address": "Warszawa, Poland",
  "linkedin": "https://www.linkedin.com/in/rei-taro-81a410391/",
  "profile_summary": "Results-driven Senior Website Engineer with over 10 years of experience in **frontend development** and **architecture**. Proficient in **JavaScript** and committed to **performance optimization** for high-traffic web applications. Demonstrated ability to integrate **CMS** and **martech** solutions, ensuring efficient SEO practices. Skilled in coaching and leadership, fostering team collaboration and communication to achieve project goals. Strong background in backend systems design for financial platforms and cloud-native architectures, leveraging expertise in **Python (FastAPI, Django, Flask)** and cloud services like **AWS** and **Azure** to enhance system capabilities.",
  "education": [
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2010",
      "to_year": "2015",
      "location": "Japan",
      "university": "Keio University"
    }
  ],
  "experience": [
    {
      "role": "Senior Website Engineer",
      "company": "Leobit",
      "from_date": "Aug 2022",
      "to_date": "Present",
      "location": "Poland",
      "responsibilities": "Leveraged expertise in **JavaScript** and **frontend development** to enhance user experience by optimizing website performance.\nImplemented **SEO** strategies to improve website visibility and organic search ranking, achieving a **30%** increase in traffic within a **6-month** period.\nIntegrated various **martech** tools into the content management system (**CMS**) for streamlined campaign management and enhanced analytics tracking.\nEnsured seamless system **integration** between frontend and backend services, reducing data retrieval time by **25%**.\nArchitected and developed scalable website solutions, emphasizing clean code and maintainability through modern design principles.\nProvided coaching and leadership to junior developers, enhancing team skills in **performance optimization** and best practices in web development.\nCommunicated effectively with stakeholders to gather requirements, address challenges, and oversee project delivery, improving project completion rates by **15%**."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Innovature",
      "from_date": "Nov 2018",
      "to_date": "Jun 2022",
      "location": "Japan",
      "responsibilities": "Utilized **JavaScript** for optimal **frontend development** and **performance optimization** of web applications, enhancing user experience and system efficiency.\nLed architecture discussions to improve system integration and streamline processes across various **martech** platforms, ensuring adherence to best practices for SEO.\nCoached team members on effective **CMS** strategies, fostering leadership and strong communication across departments to enhance collaboration.\nImplemented best practices for **SEO** and performance optimization, resulting in a **30% increase** in website traffic within **6 months**.\nOversaw development and integration processes, ensuring all web applications met high standards of quality, scalability, and maintainability.\nConducted regular performance audits, leading to a **15% reduction** in load times and improved user engagement metrics.\nFacilitated cross-functional teamwork, acting as a key liaison for successful project delivery and innovation in website architecture."
    },
    {
      "role": "Software Developer",
      "company": "Wizcorp",
      "from_date": "Apr 2015",
      "to_date": "Nov 2018",
      "location": "Japan",
      "responsibilities": "Developed and optimized frontend architecture and performance using **JavaScript**, ensuring seamless user experiences for web applications.\nLed integration efforts by collaborating with various CMS and martech platforms, enhancing overall website functionality and SEO metrics.\nCoached junior engineers on frontend development best practices, fostering a culture of continuous improvement and knowledge sharing.\nApplied leadership skills to guide cross-functional teams in delivering projects on time and within scope, effectively communicating updates and addressing challenges.\nEngineered solutions that improved website performance by **30%** through strategic enhancements and optimizations, ensuring adherence to modern web standards.\nImplemented comprehensive testing strategies to reduce bugs by **25%** and improve site reliability, utilizing tools and frameworks best suited for frontend environments.\nUtilized advanced SEO techniques to increase organic traffic by **50%**, contributing to the overall success of digital marketing initiatives."
    }
  ],
  "skills": " **Programming Languages**\n\t JavaScript, Python (3.8+), SQL, Bash\n\n **Backend Frameworks**\n\t FastAPI, Flask, Django, Celery\n\n **Frontend Frameworks**\n\t frontend development\n\n **API Technologies**\n\t REST/gRPC APIs, Microservices, integration\n\n **Serverless and Cloud Functions**\n\t AWS (EC2, S3, Lambda), Azure\n\n **Databases**\n\t PostgreSQL, MySQL, MongoDB, Redis\n\n **DevOps**\n\t Docker, Kubernetes, GitHub Actions, Azure DevOps, CI/CD, PyTest, Git\n\n **Cloud & Infrastructure**\n\t performance optimization, architecture\n\n **Other**\n\t SEO, martech, coaching, leadership, communication",
  "apply_company": "360Learning"
}