{
  "name": "Mariusz Jan Skobel",
  "role_name": "Backend Data Engineer",
  "email": "mariuszskobel15@outlook.com",
  "phone": "+48 735 343 548",
  "address": "Katowice, Poland",
  "linkedin": "https://www.linkedin.com/in/mariusz-skobel-789557397/",
  "profile_summary": "Backend Data Engineer with 10+ years of experience in delivering high-performance software solutions in healthcare and finance. Proficient in **Java**, **Oracle PL/SQL**, and **SQL**, with a strong focus on Test-Driven Development (TDD) and Agile methodologies. Experienced in Continuous Integration/Continuous Deployment (CI/CD) processes and leveraging **Python** for backend solutions. Demonstrates exceptional communication skills and stakeholder management, ensuring alignment and collaboration across teams. \nAdditional strengths include hands-on expertise in modern technologies such as **JavaScript/TypeScript**, **Flutter**, **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**. Proficient in building and deploying cloud-native applications on **Azure** and **AWS**. Experienced in leading the development of enterprise platforms that integrate AI/ML capabilities for real-time analytics. Strong background in microservices architecture, event-driven systems, and compliance with standards like HIPAA, FHIR, and PCI DSS.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2012",
      "to_year": "2015",
      "location": "UK",
      "university": "University of Bristol"
    }
  ],
  "experience": [
    {
      "role": "Backend Data Engineer",
      "company": "EitBiz",
      "from_date": "Oct 2022",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Developed robust, scalable backend solutions utilizing **Java** and **Oracle PL/SQL**, facilitating efficient data retrieval and manipulation for healthcare and finance applications.\n• Implemented **SQL** database queries to optimize performance and ensure seamless data interaction within large-scale applications, supporting the processing of over **1 million** transactions daily.\n• Employed **Test-Driven Development (TDD)** practices to enhance code quality and reliability, resulting in a **30%** reduction in bugs and faster deployment cycles.\n• Collaborated within an **Agile** framework, participating in sprint planning and retrospectives to continuously improve team workflow and deliver features that meet stakeholder requirements.\n• Managed **Continuous Integration/Continuous Deployment (CI/CD)** pipelines to ensure rapid delivery of application updates, reducing deployment time by **50%**.\n• Fostered clear and effective **communication** with cross-functional teams, stakeholders, and clients to gather requirements and provide timely updates on project progress.\n• Led discussions on data architecture and design, prioritizing stakeholder management to align technical solutions with business goals, resulting in improved project outcomes.\n• Built and maintained fully functional APIs using **Python** for data processing, securing inter-service communication between various application components.\n• Established comprehensive testing strategies for backend services using industry-standard tools, enhancing test coverage by **40%** and ensuring scheduling effectiveness for routine testing."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Tvn S.A.",
      "from_date": "Oct 2019",
      "to_date": "Sep 2022",
      "location": "Poland",
      "responsibilities": "Utilized **Java** and **Oracle PL/SQL** to enhance data processing efficiency in backend systems, implementing robust data solutions and reducing query times by **20%**.\nEmbraced **Test-Driven Development (TDD)** methodologies to ensure high-quality code, resulting in fewer than **5%** of production bugs in multiple releases.\nDeveloped and optimized SQL scripts to facilitate data extraction and manipulation, improving data retrieval speed by **30%** in large financial datasets.\nCollaborated in an **Agile** environment to deliver iterative updates, maintaining a rapid development cycle while adapting quickly to stakeholder feedback.\nStreamlined deployment processes using **Continuous Integration/Continuous Deployment (CI/CD)** practices, resulting in a reduction of deployment time by **15%**.\nLed data integration projects utilizing **Python** for ETL processes, managing data flow from various sources and ensuring accuracy and reliability of datasets.\nMaintained open lines of **communication** with cross-functional teams and stakeholders to effectively manage project timelines and deliverables.\nExercised strong **stakeholder management** skills to align project goals with business objectives, ensuring transparency and accountability throughout project life cycles."
    },
    {
      "role": "Software Engineer",
      "company": "Timspark",
      "from_date": "Sep 2015",
      "to_date": "Aug 2019",
      "location": "UK",
      "responsibilities": "Utilized **Java** and **Oracle PL/SQL** for crafting robust backend systems, ensuring efficient data handling and compliance with standards for high-performance applications.\nExecuted **SQL** queries for data manipulation and retrieval from databases, optimizing data structures for faster access in a high-traffic environment.\nAdopted **Test-Driven Development (TDD)** methodologies to enhance code quality and reliability, achieving a test coverage of over **90%** across critical services.\nImplemented **Agile** practices to foster collaboration within cross-functional teams, leading to a **25%** reduction in project delivery time.\nDesigned and executed automated **Continuous Integration/Continuous Deployment (CI/CD)** pipelines for seamless integration of new features and timely updates, reducing deployment times by up to **50%**.\nDeveloped backend services using **Python** frameworks including FastAPI and Django, ensuring scalability and maintainability for diverse applications.\nMaintained proficient communication and stakeholder management skills to align project goals with client expectations, enhancing overall satisfaction ratings by **20%**.\nStreamlined database access using optimized queries, resulting in performance improvements that reduced latency by **15%**."
    }
  ],
  "skills": " **Programming Languages:**\n\tJava, Python\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\t\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis, Oracle PL/SQL, SQL\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose, Continuous Integration/Continuous Deployment (CI/CD)\n\n**Cloud & Infrastructure:**\n\tAWS, Azure\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, Test-Driven Development (TDD), Agile, Communication, Stakeholder Management"
}