{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Software Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-623a26390/",
  "profile_summary": "Senior Software Engineer with 13+ years of experience in developing high-performance, scalable applications within the healthcare and financial sectors. Proficient in building **RESTful APIs** and implementing **microservice architecture** using **Kotlin** and **Spring Boot**. Experienced in database management with **PostgreSQL** and **MySQL**, ensuring optimal **system performance** and **scalability**. Skilled at applying **automated testing** and **test-driven development** methodologies to enhance code quality and reduce **technical debt**.\n\nStrong advocate for **monitoring and observability** to drive continuous improvement. Adept in **agile delivery**, fostering collaboration among teams, and providing mentorship to junior developers. Original strengths include hands-on expertise in **JavaScript/TypeScript**, **Python**, and **Flutter**, with a solid foundation in frontend technologies such as **React**, **Next.js**, and **Vue**. Additionally experienced in deploying cloud-native systems on **AWS** and **Azure**, constructing AI/ML-powered platforms using **FastAPI** and **Django**, and implementing CI/CD pipelines that support rapid delivery.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Software Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Developed scalable **microservice architecture** solutions utilizing **Kotlin** and **Spring Boot**, ensuring efficient communication through **RESTful APIs** while adhering to system performance and scalability standards.\nEngineered robust data persistence layers with **PostgreSQL** and **MySQL**, facilitating seamless data management across applications and enhancing monitoring and observability practices for improved system performance.\nImplemented automated testing protocols and test-driven development (TDD) methodologies, driving quality assurance and reducing technical debt across the project lifecycle.\nLed agile delivery processes, collaborating effectively with cross-functional teams to ensure timely project completion while mentoring junior developers and enhancing team communication skills.\nDesigned and executed performance metrics, focusing on improving system performance and scalability, achieving a **20% reduction** in latency during peak usage periods.\nConducted code reviews and integrated comprehensive monitoring tools, establishing best practices for system observability that increased response times by **15%**.\nFacilitated knowledge-sharing sessions to bolster team expertise in **Kotlin**, **Spring Boot**, and architectural patterns, fostering a culture of collaboration and continuous improvement.\nDeveloped user-centric features by incorporating customer feedback, resulting in a **30% increase** in user satisfaction ratings on application hold periods.\nEnsured operational excellence through meticulous documentation and streamlined processes, significantly improving onboarding times for new team members by **25%**.\nOptimized existing applications for better performance, successfully reducing operational costs by **10%**, while enhancing the overall user experience."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "• Developed and implemented **microservice architecture** solutions using **Kotlin** and **Spring Boot** to enhance scalability and system performance for financial applications.\n• Designed and built robust **RESTful APIs** for seamless integration between microservices and database systems like **PostgreSQL** and **MySQL**, improving response time by **30%**.\n• Conducted **automated testing** and employed **test-driven development** (TDD) to ensure reliable deployment practices, resulting in a **20%** reduction in production bugs.\n• Led initiatives for **monitoring and observability** enhancements, allowing real-time performance insights, reducing incident response times by **40%**.\n• Mentored junior developers and fostered an environment of **collaboration** and **agile delivery**, contributing to a **15%** increase in team productivity.\n• Initiated a review of **technical debt** management strategies, successfully optimizing code quality and project timelines.\n• Participated in cross-functional teams to enhance communication and facilitate system performance improvements across the organization."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Engineered scalable **RESTful APIs** and backend services leveraging **Kotlin**, **Spring Boot**, and **microservice architecture**, ensuring high system performance and responsiveness in a high-traffic environment.\nDesigned and maintained robust database schemas using **PostgreSQL** and **MySQL**, ensuring data integrity and efficient query performance with over **99% uptime** in critical systems.\nImplemented automated testing frameworks in a **test-driven development** approach, achieving over **90% code coverage** and significantly reducing technical debt over time.\nMonitored and optimized system performance with observability tools, leading to a **40% reduction** in response times for key microservices.\nCollaborated in cross-functional teams to deliver features within sprint cycles, emphasizing agile delivery methodologies to meet project goals consistently.\nMentored junior developers by conducting code reviews and pairing sessions, fostering a culture of knowledge sharing and continuous improvement.\nCommunicated effectively with stakeholders to gather requirements and provide project updates, ensuring alignment with business objectives and user needs.\nDeveloped feature enhancements in existing applications, focusing on performance improvements and scalability to accommodate a **50% increase** in user load.\nUtilized **monitoring and observability** tools to ensure system reliability, resulting in proactive identification and resolution of issues before impacting users.\nAdopted best practices for code quality and team collaboration, contributing to a more efficient and productive engineering environment."
    }
  ],
  "skills": "**Programming Languages:**\n\tPython, JavaScript/TypeScript, Kotlin\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django, Spring Boot\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tRESTful APIs\n\n**Serverless and Cloud Functions:**\n\tAWS: Lambda\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS: ECS, RDS, S3, Azure: App Services, Blob Storage, SQL Database\n\n**Other:**\n\tMachine Learning: MLflow, Airflow, Kubeflow, automated testing, test-driven development, monitoring and observability, system performance, scalability, technical debt, agile delivery, collaboration, mentorship, communication"
}