{
  "name": "Tomasz Lee",
  "role_name": "Customer Success Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Results-driven Customer Success Engineer with 9+ years of experience in project management and delivering exceptional customer support. Proficient in SQL and Python, with a strong understanding of cloud technologies and data privacy/protection principles including **DLP**, **DSPM**, **CSPM**, and **SIEM**. Skilled in APIs and web services, ensuring seamless integration and optimal functionality. Excellent technical communication and interpersonal skills, enabling effective collaboration and training of clients. Strong problem-solving abilities, with a consultative approach that addresses client needs and enhances satisfaction. Proven track record in leading projects and delivering robust solutions across diverse technical environments.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Customer Success Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Leveraged **cloud technologies** to enhance customer success by developing robust solutions tailored to client needs.\nUtilized **SQL** for effective data management and reporting, optimizing data retrieval processes by 20%.\nEngaged in effective **technical communication** with clients, ensuring seamless onboarding and support for new features and updates.\nApplied a consultative approach to understand customer requirements, leading to a **25%** increase in user satisfaction with our services.\nCollaborated with cross-functional teams for **project management**, ensuring timely delivery of solutions that align with client expectations.\nDesigned **APIs** to facilitate interactions between systems, ensuring data integrity and security across services.\nImplemented **Data Loss Prevention (DLP)** strategies, safeguarding customer data while adhering to **Data Privacy/Protection** regulations.\nDeveloped training materials and conducted sessions to empower clients in using the platform, enhancing overall user experience.\nManaged **vulnerability assessments** and collaborated on **SIEM** initiatives to ensure system security and compliance.\nExecuted regular system health checks and optimizations, contributing to a robust and resilient application infrastructure."
    },
    {
      "role": "Full Stack Developer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "Utilized **cloud technologies** to design and develop a cloud-based project management tool, enhancing customer success with a **15%** increase in team collaboration efficiency.\nImplemented effective **project management** strategies across cross-functional teams, ensuring alignment with customer needs and timely project delivery.\nLeveraged **APIs** and **web services** to create microservices architecture for task orchestration, improving scalability and customer satisfaction.\nConducted **technical communication** to gather requirements from customers, leading to the development of RESTful APIs integrated with a **PostgreSQL** database for real-time data access.\nOptimized **SQL** database performance by managing **MSSQL** and **MySQL** databases, resulting in faster data retrieval and improved customer experience.\nDeveloped interactive project visualizations using **D3.js** for better customer engagement, achieving a **25%** improvement in platform engagement metrics.\nExecuted CI/CD pipelines using **GitHub Actions**, reducing production deployment errors by **30%**, contributing to smoother customer interactions.\nProvided training and mentorship to junior developers, fostering interpersonal skills and improving team productivity, directly impacting customer success initiatives.\nApplied consultative approach and problem-solving skills to address customer inquiries and technical challenges related to data privacy through **DLP**, **DSPM**, and **CSPM** strategies.\nEngaged in vulnerability management using **SIEM** tools, ensuring that security measures are communicated effectively to stakeholders."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "Leveraged **cloud technologies** to enhance customer success initiatives, resulting in a **20%** increase in customer satisfaction metrics.\nImplemented robust **APIs** to facilitate seamless integration with external systems, improving data accessibility and communication.\nManaged **SQL** database operations, resulting in a **30%** improvement in query performance across customer data management tasks.\nUtilized **Python** for automating support processes, reducing manual effort and increasing efficiency in resolving customer issues by **25%**.\nDeveloped comprehensive technical documentation focused on **Data Privacy/Protection** and **DLP** practices to support compliance and enhance customer trust.\nCollaborated with cross-functional teams to apply **vulnerability management** strategies, ensuring the security and integrity of customer data.\nProvided training and support on **DSPM** and **CSPM** tools to internal teams, enhancing the overall customer success approach.\nActively participated in project management meetings, contributing to prioritization and alignment of customer feedback into actionable development tasks.\nExecuted effective technical communication by delivering regular updates and engaging in interpersonal interactions with clients to ensure their needs are met.\nConducted problem-solving sessions to address customer challenges, driving successful resolutions and improving customer retention."
    }
  ],
  "skills": " Frontend Technologies: HTML, CSS, JavaScript, TypeScript, ReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\tBackend Technologies: NodeJS, ExpressJS, NestJS, C#, .NET, Entity Framework, Microservices\n\tAPI Technologies: RESTful API, GraphQL, APIs, web services\n\tDatabase Systems: MSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB, SQL\n\tCloud & Infrastructure: AWS, Azure, cloud technologies\n\tMessaging & Caching: Apache Kafka, RabbitMQ, Redis\n\tDevOps: CI/CD pipelines, DLP, Data Privacy/Protection, DSPM, CSPM, SIEM, vulnerability management\n\tOther: UX/UI Design, Git, GitHub, Python, Redux, customer success, project management, technical communication, interpersonal skills, training, consultative approach, problem solving"
}