{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Backend Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Senior Backend Engineer with 13+ years of experience specializing in backend development, focusing on **PHP**, **SQL**, and **APIs** within the healthcare and financial sectors. Proficient in **OOP** and **SOLID** principles, with a strong understanding of **TDD** and **DDD** methodologies that enhance code quality and maintainability. Adept in **Version Control** practices to ensure collaborative success and code integrity.\nSkilled in **JavaScript**, leveraging frameworks and libraries such as **React** and **Node.js** for full stack development. Experienced in deploying robust applications with cloud technologies including **AWS** and **Azure**. Proven track record in compliance-driven architecture, aligning solutions with HIPAA and PCI DSS standards, and maintaining high availability and performance in high-demand environments. Strong problem-solving capabilities complemented by experience in testing frameworks and methodologies.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Backend Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Leveraged **PHP** and **SQL** to develop robust backend systems, adhering to principles of **OOP**, **SOLID**, and **TDD**, enhancing code maintainability and scalability across applications.\nCrafted and consumed **APIs** for seamless integration between frontend components and backend services, ensuring efficient communication and data flow.\nDesigned and implemented high-quality, responsive web interfaces using **HTML**, **CSS**, and **JavaScript**, enhancing user experience while maintaining high performance and security standards.\nUtilized **Wordpress** for content management solutions, providing customized functionalities to meet specific business needs and improving user engagement metrics by **30%**.\nEmployed version control practices with tools like Git to manage codebase effectively, facilitating collaboration and maintaining a history of modifications.\nConducted comprehensive testing strategies across the backend systems, ensuring reliability through unit tests, integration tests, and end-to-end testing frameworks.\nImplemented Domain-Driven Design (**DDD**) principles to align the development process with business objectives, resulting in a **40%** reduction in feature rollout times.\nCollaborated with cross-functional teams to deliver features that meet **industry standards** and improve operational KPIs, directly affecting user satisfaction.\nEngaged in code reviews and mentor junior developers, sharing best practices in backend development to foster a culture of learning and improvement within the team."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "- Developed and maintained backend systems using **PHP** and **SQL** to manage databases, ensuring data integrity and performance optimization for high-volume transactions.\n- Implemented Object-Oriented Programming (**OOP**) principles utilizing **SOLID** design patterns to create scalable, maintainable, and robust code for complex systems.\n- Designed and integrated RESTful APIs to enhance functionality and communication across diverse applications while ensuring robust documentation and adherence to best practices.\n- Performed extensive testing (TDD and DDD frameworks) to ensure high-quality code with a focus on reliability by achieving over **95%** test coverage through automated testing strategies.\n- Utilized version control systems (Git) to improve collaboration and code management, implementing a branching strategy that reduced conflicts by **30%**.\n- Collaborated with cross-functional teams to gather requirements and deliver user-centric solutions based on modern web technologies.\n- Engaged in continuous integration and deployment (CI/CD) practices leading to a **40%** reduction in deployment time while enhancing the overall software development lifecycle."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "- Developed high-quality backend solutions using **PHP**, adhering to **OOP** principles and **SOLID** design patterns, implementing efficient APIs for various application modules.\n- Designed and maintained database schemas with **SQL**, optimizing queries for performance and scalability in a high-traffic environment.\n- Engaged in **TDD** practices to enhance code reliability and maintainability, ensuring that test cases align with user requirements and facilitate continuous integration.\n- Contributed to the architecture of e-commerce systems by integrating **Wordpress** for content management and enhancing user experience through dynamic and responsive designs using **HTML**, **CSS**, and **JavaScript**.\n- Implemented version control protocols for collaborative development, leveraging tools like Git, ensuring seamless team integration and code quality through pull requests and comprehensive code reviews.\n- Optimized existing application code for performance enhancements, achieving a **20%** reduction in response time on critical API endpoints.\n- Conducted regular code reviews and mentoring sessions, enhancing team competency in best practices for software development, particularly around **APIs** and modern architecture principles like **DDD**.\n- Collaborated with cross-functional teams to define, design, and ship new features, effectively communicating technical information and best practices in software development.\n- Enhanced application security through careful coding practices and architecture review, ensuring compliance with industry standards and reducing vulnerability exposure by **30%**."
    }
  ],
  "skills": " **Programming Languages:**\n\tPHP,\n\tPython,\n\tJavaScript,\n\tTypeScript,\n\tSQL,\n\n**Backend Frameworks:**\n\tFastAPI,\n\tFlask,\n\tDjango,\n\n**Frontend Frameworks:**\n\tReact,\n\tVue,\n\tAngular,\n\tHTML,\n\tCSS,\n\n**API Technologies:**\n\tAPIs,\n\n**Serverless and Cloud Functions:**\n\tAWS: ECS,\n\tLambda,\n\tRDS,\n\tS3,\n\tAzure: App Services,\n\tBlob Storage,\n\tSQL Database,\n\n**Databases:**\n\tPostgreSQL (Fintech),\n\tMySQL (Healthcare),\n\tMongoDB (Gaming),\n\tRedis,\n\n**DevOps:**\n\tDocker,\n\tKubernetes,\n\tGitHub Actions,\n\tGitLab CI/CD,\n\tTerraform,\n\tAnsible,\n\tHelm,\n\tDocker Compose,\n\n**Cloud & Infrastructure:**\n\tAuthentication & Security:\n\tKeycloak (OIDC, RBAC),\n\tOAuth2,\n\tJWT,\n\tNginx,\n\tLet’s Encrypt,\n\tCertbot,\n\n**Other:**\n\tOOP,\n\tSOLID,\n\tTDD,\n\tDDD,\n\tTesting,\n\tVersion Control,\n\tWordpress",
  "apply_company": "wecity"
}