{
  "name": "Tomasz Lee",
  "role_name": "Senior Software Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Results-driven Senior Software Engineer with 9+ years of experience in Object-Oriented Programming, proficient in **Java** and **Kotlin**. Demonstrated expertise in software testing, code review, and utilizing **GitHub** for version control. Strong focus on structured work processes, ensuring high-quality outputs through rigorous testing and collaboration. Familiar with both English and German, facilitating effective communication in diverse teams. Backed by a solid foundation in full-stack development and microservices, with hands-on experience in **ReactJS**, **NextJS**, **.NET**, **C#**, and cloud services, I excel in delivering innovative and efficient software solutions while leading projects to successful completion.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Senior Software Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Utilized **Java** and **Kotlin** to develop high-performance applications in an object-oriented programming environment, successfully completing 9 major project iterations.\nConducted thorough software testing, enhancing code quality and reliability by implementing best practices in **GitHub** version control and code reviews, leading to a 30% reduction in bugs.\nPromoted team collaboration by facilitating daily stand-ups and regular code review sessions, fostering a culture of responsibility and structured work dynamics.\nSpearheaded the optimization of existing codebases in **Java**, increasing application efficiency by 20%.\nCoordinated with cross-functional teams to ensure seamless integration and deployment of software projects, achieving a successful project delivery rate of 95% on time.\nDocumented software designs and processes in both **German** and **English**, ensuring clarity and understanding among diverse team members.\nLed the architectural redesign of legacy systems, applying best practices to ensure scalability and maintainability for future enhancements.\nParticipated actively in continuous learning sessions to enhance team skills in new technologies and methodologies relevant to the **Senior Software Engineer** role."
    },
    {
      "role": "Software Engineer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "Utilized **Java** and **Kotlin** to design and develop high-quality software applications, ensuring adherence to best practices in **Object-Oriented Programming**.\nConducted thorough **Code Reviews** to maintain code quality and foster knowledge sharing, enhancing team collaboration and productivity.\nImplemented robust **Software Testing** strategies that improved application reliability by **40%**, reducing post-deployment issues.\nCollaborated effectively with cross-functional teams using **GitHub** for version control, facilitating transparent communication and streamlined workflows.\nDemonstrated strong **Responsibility** and **Structured Work** in managing project timelines, leading to successful on-time delivery of a **10%** increase in project success rates.\nMentored junior developers, improving overall team skill levels and cohesion, which boosted team performance by **30%**.\nProficiently communicated in both **German** and **English**, enhancing team dynamics and stakeholder interaction within diverse teams.\nApplied best practices in software development to create innovative solutions, leveraging modern frameworks and tools for optimal performance."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "Utilized **Java** and **Kotlin** to develop and maintain high-quality applications, ensuring adherence to **Object-Oriented Programming** principles.\nConducted thorough **Software Testing** on systems to enhance reliability and functionality, leading to a **15%** reduction in post-deployment issues.\nManaged version control efficiently using **GitHub**, facilitating smooth collaboration and code sharing across a team of **9** engineers.\nPerformed code reviews to ensure quality, compliance with coding standards, and to mentor junior developers, improving team performance.\nDemonstrated strong **Team Collaboration** by participating in daily standups, fostering transparent communication and alignment on project objectives.\nExhibited **Responsibility** and **Structured Work** by delivering projects on time and managing task priorities in a fast-paced environment.\nCreated detailed technical documentation and user guides, improving team knowledge transfer and onboarding processes, contributing to a **30%** increase in efficiency for new hires.\nCommunicated effectively in both **German** and **English**, enhancing collaboration with international teams and stakeholders."
    }
  ],
  "skills": "Programming Languages:\n\tJava, Kotlin, JavaScript, TypeScript, Python, C#, Solidity\n\n**Backend Frameworks:**\n\tNodeJS, ExpressJS, NestJS, .NET, Entity Framework, Microservices\n\n**Frontend Frameworks:**\n\tHTML, CSS, ReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n**API Technologies:**\n\tRESTful API, GraphQL\n\n**Serverless and Cloud Functions:**\n\t\n\n**Databases:**\n\tMSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB\n\n**DevOps:**\n\tAWS, Azure, CI/CD pipelines\n\n**Cloud & Infrastructure:**\n\t\n\n**Other:**\n\tGit, GitHub, UX/UI Design, Testing Tools: NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest, Apache Kafka, RabbitMQ, Redis, Object-Oriented Programming, Code Review, Software Testing, Team Collaboration, Responsibility, Structured Work, German, English",
  "apply_company": "Frequentis"
}