{
  "name": "Rei Taro",
  "role_name": "Senior Sales Engineer",
  "email": "rei515@outlook.com",
  "phone": "+48732529451",
  "address": "Warszawa, Poland",
  "linkedin": "https://www.linkedin.com/in/rei-taro-81a410391/",
  "profile_summary": "Dynamic Senior Sales Engineer with a strong background in business development and technical sales, complemented by over 10 years of experience in the engineering sector. Skilled in environmental engineering with a focus on water treatment technologies, including **reverse osmosis**, **filtration**, **softening**, and **wastewater treatment**. Proficient in utilizing **CRM** systems for effective customer relationship management and proposal management to drive sales success. Excellent communication and project management skills, enabling the development of strong client relationships and successful project outcomes. Proven ability to leverage technical expertise to deliver high-impact solutions and drive business growth.",
  "education": [
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2010",
      "to_year": "2015",
      "location": "Japan",
      "university": "Keio University"
    }
  ],
  "experience": [
    {
      "role": "Senior Sales Engineer",
      "company": "Leobit",
      "from_date": "Aug 2022",
      "to_date": "Present",
      "location": "Poland",
      "responsibilities": "• Applied technical sales expertise in water treatment solutions, focusing on reverse osmosis, filtration, and wastewater treatment technologies to drive business development initiatives.\n• Utilized a CRM system to manage customer relationships and track sales proposals effectively, ensuring a **75%** follow-up rate on leads generated.\n• Developed technical proposals showcasing environmental engineering innovations to meet client requirements, achieving a **30%** increase in project wins.\n• Collaborated with project management teams to align on strategic goals, ensuring timely delivery of customized water treatment solutions.\n• Conducted in-depth consultations to identify client needs, leveraging advanced knowledge in dewatering and softening processes to recommend tailored solutions.\n• Provided training and support to internal teams on the technical aspects of water treatment, enhancing overall communication and collaboration by **20%**.\n• Maintained and updated documentation for projects and proposals using Microsoft Office tools, ensuring clear and consistent communication with stakeholders."
    },
    {
      "role": "Software Engineer",
      "company": "Innovature",
      "from_date": "Nov 2018",
      "to_date": "Jun 2022",
      "location": "Japan",
      "responsibilities": "Led technical sales efforts by leveraging **CRM** systems to track customer interactions and improve response times, achieving a **15%** increase in client satisfaction ratings.\nDeveloped comprehensive proposals for advanced water treatment solutions, including **reverse osmosis** and **filtration** systems, generating an **increase of 20%** in successful project bids.\nExecuted business development strategies by identifying potential clients and fostering relationships through effective **communication** and tailored presentations, ultimately expanding the customer base by **30%**.\nManaged project timelines and resources effectively to meet delivery deadlines, ensuring successful project execution within budget constraints.\nProvided expertise in **environmental engineering** to guide clients through compliance requirements and treatment options, enhancing customer trust and loyalty.\nCoordinated with cross-functional teams to align product offerings with customer needs, streamlining the proposal management process to enhance efficiency.\nUtilized **Microsoft Office** tools to develop impactful sales materials, including presentations and documentation that resonate with prospective clients."
    },
    {
      "role": "Software Developer",
      "company": "Wizcorp",
      "from_date": "Apr 2015",
      "to_date": "Nov 2018",
      "location": "Japan",
      "responsibilities": "• Leveraged technical sales expertise to drive business development initiatives, exceeding sales targets by **15%** annually.\n• Utilized CRM tools to manage customer relationships effectively and enhance communication, resulting in a **25%** increase in customer retention.\n• Developed detailed proposals for water treatment solutions including **reverse osmosis**, **filtration**, and **softening**, tailored to meet client needs, with a **95%** proposal acceptance rate.\n• Collaborated with engineering teams on environmental engineering projects, ensuring compliance with industry standards while optimizing project management processes for timely delivery.\n• Conducted market analysis and identified new opportunities for wastewater treatment and dewatering technologies, contributing to a **30%** growth in market share.\n• Delivered presentations and technical demonstrations to clients, showcasing innovative solutions and fostering strong business relationships.\n• Maintained proficiency in Microsoft Office to produce clear and compelling reports and project documentation, enhancing overall team communication."
    }
  ],
  "skills": "**Programming Languages**\n\tPython (3.8+), SQL, Bash, JavaScript\n\n**Backend Frameworks**\n\tFastAPI, Flask, Django, Celery\n\n**Frontend Frameworks**\n\t\n\n**API Technologies**\n\tREST/gRPC APIs, Microservices\n\n**Serverless and Cloud Functions**\n\tAWS (EC2, S3, Lambda), Azure\n\n**Databases**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps**\n\tDocker, Kubernetes, GitHub Actions, Azure DevOps, CI/CD, PyTest, Git\n\n**Cloud & Infrastructure**\n\t\n\n**Other**\n\twater treatment, technical sales, business development, CRM, proposal management, environmental engineering, reverse osmosis, filtration, softening, wastewater treatment, dewatering, Microsoft Office, communication, customer relationship management, project management",
  "apply_company": "Nijhuis Saur Industries"
}