{
  "name": "Tomasz Lee",
  "role_name": "Senior Python Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Skilled Senior Python Engineer with 9+ years of experience in data-driven application development and optimization. Proficient in **Python**, **SQL**, **PostgreSQL**, and **Data Science** methodologies, leveraging frameworks like **TensorFlow** and **PyTorch** for machine learning initiatives. Strong background in Agile methodologies, version control using **Git**, and open-source projects. Adept in architectural and design patterns for scalable solutions, with proven capabilities in collaboration and communication across diverse teams. Excellent analytical skills and multitasking abilities to streamline processes and enhance performance across various systems.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Senior Python Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Utilized **Python** and **TensorFlow** to develop machine learning models, enhancing data analysis capabilities for the customer management platform.\nCollaborated with cross-functional teams in an **Agile** environment to drive project success and facilitate effective communication, improving team productivity by **30%**.\nDesigned and optimized **PostgreSQL** database performance, achieving a **25%** reduction in query execution time through strategic indexing and query construction.\nImplemented version control practices using **Git**, ensuring seamless collaboration and code integrity across development teams.\nDeveloped automated scripts for data processing and analysis leveraging **Scikit-learn**, automating routine tasks and saving **15 hours/week** of manual effort.\nUtilized **LangChain** and **AutoGen** for enhancing the capabilities of natural language processing features, improving user interaction and response times.\nEmployed architectural and design patterns to build scalable and maintainable software components, aligning with best coding practices and standards.\nConducted performance optimization using **Redis** caching strategies, resulting in an overall application performance improvement of **35%**.\nMaintained security best practices, integrating robust authentication methods including token-based (JWT) solutions, ensuring user data protection.\nCreated responsive designs that enhanced user experience across various devices, leading to a **15%** increase in engagement metrics."
    },
    {
      "role": "Full Stack Developer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "Utilized **Python** and **PostgreSQL** to design and develop scalable data-driven applications that optimized performance by **25%** through efficient querying and storage.\nImplemented **TensorFlow** and **PyTorch** for machine learning models, enhancing data analytics capabilities and contributing to a **15%** increase in project insights.\nDeveloped RESTful APIs using **Python** frameworks, ensuring seamless integration with front-end components and real-time data access for users.\nIntegrated data handling strategies with **LangChain** and **AutoGen** to streamline data processing workflows and improve operational efficiency.\nLed project teams in agile methodologies, facilitating collaboration and communication between developers and stakeholders, resulting in timely project completion.\nEstablished version control practices using **Git**, ensuring robust code management and reducing deployment errors by **30%**.\nConducted thorough performance optimization reviews, applying architectural and design patterns that improved system responsiveness by **25%**.\nMentored junior developers on **open-source** contributions and best practices, fostering a culture of continuous improvement and learning.\nCollaborated on creating responsive designs that enhanced user engagement and satisfaction across the platform, using tools like **D3.js** for dynamic data visualization.\nEngaged in multitasking across multiple projects while maintaining analytical focus on system security and data integrity."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "Utilized **Python** and **TensorFlow** for developing and optimizing ML models, contributing to a **15%** increase in predictive accuracy.\nEngaged with **PostgreSQL** for efficient data management, leading to a **25%** improvement in query response times for analytical reporting.\nApplied **LangChain** and **AutoGen** to streamline data processing and automation workflows, reducing server load by **30%** during peak analysis times.\nImplemented **Git** for version control, enhancing collaboration within the engineering team and improving code integrity across the project.\nParticipated in Agile project management, contributing to sprint planning and retrospectives to ensure timely delivery of features.\nOptimized system performance through effective application of **Scikit-learn**, achieving a **40%** reduction in processing time for large datasets.\nDesigned and implemented responsive designs using front-end frameworks, ensuring cross-device compatibility.\nCollaborated closely with cross-functional teams to gather requirements and provide analytical insights, ensuring clear communication throughout the workflow.\nConducted thorough code reviews, adhering to software architectural patterns and design patterns to maintain code quality and security standards.\nProduced detailed technical documentation and user guides to enhance knowledge transfer among team members and stakeholders."
    }
  ],
  "skills": "  **Programming Languages**\n\tPython, TypeScript, JavaScript, C#, SQL\n\n  **Backend Frameworks**\n\tNodeJS, ExpressJS, NestJS, .NET, Microservices, Entity Framework\n\n  **Frontend Frameworks**\n\tHTML, CSS, ReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n  **API Technologies**\n\tRESTful API, GraphQL\n\n  **Serverless and Cloud Functions**\n\tAWS, Azure\n\n  **Databases**\n\tMSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB\n\n  **DevOps**\n\tCI/CD pipelines, Version control (Git, GitHub)\n\n  **Cloud & Infrastructure**\n\tSecurity, Performance optimization\n\n  **Other**\n\tBlockchain: Solidity, Ether.js, Web3.js, Ethereum, UX/UI Design, Testing Tools: NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest, Agile, Open-source, Collaboration, Communication, Analytical skills, Multitasking, Data Science, TensorFlow, PyTorch, Scikit-learn, LangChain, AutoGen, Architectural patterns, Design patterns, Responsive design",
  "apply_company": "Nearform"
}