{
  "name": "Mariusz Jan Skobel",
  "role_name": "R&D Engineer",
  "email": "mariuszskobel15@outlook.com",
  "phone": "+48 735 343 548",
  "address": "Katowice, Poland",
  "linkedin": "https://www.linkedin.com/in/mariusz-skobel-789557397/",
  "profile_summary": "R&D Engineer with 10+ years of experience in developing innovative solutions with a strong focus on **Python**, **React**, **Next.js**, **FastAPI**, and **cloud deployment**. Adept at creating AI/LLM pipelines and real-time services, I possess deep expertise in **CI/CD** practices and **APIs**, ensuring robust software development life cycle (SDLC) methodologies. Proven track record of leveraging modern technologies like **Git** in the development of scalable and maintainable applications. \n\nI specialize in the integration of cutting-edge technologies to produce high-performance software solutions in healthcare and finance, particularly focusing on building systems that adhere to regulatory compliance standards such as HIPAA and PCI DSS. My substantial background in microservices architecture and event-driven systems is complemented by hands-on experience in cloud-native applications on platforms like Azure and AWS. \n\nDriven by a passion for innovation, I bring valuable insights into communication and collaboration, effectively translating complex technical concepts to diverse stakeholders. Committed to delivering impactful solutions, I strive to make a meaningful contribution in every project I undertake.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2012",
      "to_year": "2015",
      "location": "UK",
      "university": "University of Bristol"
    }
  ],
  "experience": [
    {
      "role": "R&D Engineer",
      "company": "EitBiz",
      "from_date": "Oct 2022",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Designed and implemented scalable, full-stack solutions leveraging **Python (FastAPI)**, **React**, and **Next.js** to meet dynamic research and development needs.\n• Developed real-time services that enhance user engagement and respond to evolving project requirements, utilizing APIs and advanced cloud deployment strategies.\n• Innovated continuous integration and continuous deployment (CI/CD) practices using **Git**, **Azure DevOps**, and **GitHub Actions** to streamline SDLC processes for R&D initiatives.\n• Employed **AI/LLM pipelines** to integrate machine learning capabilities and facilitate the development of intelligent applications, ensuring innovation in R&D projects.\n• Collaborated effectively with cross-functional teams, enhancing communication skills to translate complex technical concepts into actionable insights during the development lifecycle.\n• Ensured high-quality delivery of software solutions by implementing rigorous testing strategies using **Jest**, **Cypress**, and **Postman**, covering over **90%** test coverage across projects.\n• Managed cloud-based architecture deployment with AWS and Azure for seamless application scalability, improving system performance by up to **30%**.\n• Led and contributed to innovative consulting methodologies, driving forward-thinking solutions tailored to specific R&D challenges, resulting in a **20%** increase in project efficiency.\n• Engaged in the design and continuous improvement of user interfaces with **React** and **Next.js**, enhancing UI/UX for various R&D applications, while adhering to best practices for maintainability and performance."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Tvn S.A.",
      "from_date": "Oct 2019",
      "to_date": "Sep 2022",
      "location": "Poland",
      "responsibilities": "Utilized **Python** and **FastAPI** to develop and modernize financial platforms with a microservices-based architecture, significantly enhancing scalability, maintainability, and throughput for high-volume transaction systems.\nEmployed **React** (18), **Next.js**, and **TypeScript** to build dynamic, user-focused front-end applications, leveraging **Redux Toolkit** and **Tailwind CSS** to deliver highly responsive user interfaces for financial dashboards and admin portals.\nArchitected real-time transaction monitoring and analytics dashboards using **React**, **D3.js**, and **Power BI Embedded**, enabling operations teams to monitor financial activities and generate actionable insights, resulting in a **30%** reduction in transaction anomalies.\nIntegrated **Kafka**, **RabbitMQ**, and **Azure Service Bus** to implement a robust event-driven architecture, facilitating asynchronous communication and real-time processing for transactions, alerts, and compliance workflows.\nDesigned and orchestrated ETL pipelines with **Python**, **Apache Airflow**, and **Azure Data Factory**, achieving **95%** efficiency in the batch and real-time ingestion of financial data from diverse sources.\nDeveloped AI/ML-driven fraud detection systems using **scikit-learn** and **XGBoost**, applying **Azure Machine Learning** to analyze transaction patterns and user behavior, proactively identifying suspicious activities in banking systems and reducing false positives by **20%**.\nCreated ML pipelines for credit scoring, churn prediction, and transaction classification using **MLflow** and **Airflow**, integrating real-time model inference into backend services for improved decision-making during the financial transaction process.\nFocused on continuous improvement of the **SDLC** by implementing CI/CD practices with **Git**, ensuring rapid deployment and a streamlined workflow for development and testing activities."
    },
    {
      "role": "Software Engineer",
      "company": "Timspark",
      "from_date": "Sep 2015",
      "to_date": "Aug 2019",
      "location": "UK",
      "responsibilities": "Leveraged **Python** and **FastAPI** to design and optimize APIs for innovative features and functionalities that support R&D initiatives, ensuring robust performance and scalability in high-traffic environments.\nUtilized **React** and **Next.js** to create advanced, responsive user interfaces for R&D projects, enhancing the user experience and fostering innovation through seamless interaction and significant engagement metrics.\nEngineered **real-time services** using **WebSockets** and event-driven architectures, contributing to the development of AI/LLM pipelines that enable instant feedback and data processing, thereby streamlining research workflows.\nImplemented CI/CD practices through **Git** to automate testing and deployment phases, reducing release times by approximately **30%** while maintaining high code quality during the Software Development Life Cycle (SDLC).\nEmployed cloud deployment strategies to enhance the accessibility of research tools and collaborative platforms, ensuring **99.9%** uptime and immediate scalability to meet fluctuating demands.\nIntegrated cutting-edge machine learning frameworks, utilizing **TensorFlow** and other libraries, to build AI models that support decision-making in R&D processes, improving accuracy and efficiency by over **25%**.\nCollaborated effectively with cross-functional teams to define product requirements and technical specifications, ensuring alignment with innovation consulting methodologies to drive strategic outcomes for R&D initiatives.\nCommunicated complex technical concepts to non-technical stakeholders, fostering a culture of knowledge sharing and collaboration that promotes continuous improvement and innovative thinking.\n"
    }
  ],
  "skills": " **Programming Languages:**\n\tPython\n\n **Backend Frameworks:**\n\tFastAPI\n\n **Frontend Frameworks:**\n\tReact\n\tNext.js\n\n **API Technologies:**\n\tAPIs\n\n **Serverless and Cloud Functions:**\n\t AWS (ECS, Lambda, RDS, S3)\n\tAzure (App Services, Blob, SQL)\n\n **Databases:**\n\tPostgreSQL (Fintech)\n\tMySQL (Healthcare)\n\tMongoDB (Gaming)\n\tRedis\n\n **DevOps:**\n\tDocker\n\tKubernetes\n\tGitHub Actions\n\tGitLab CI/CD\n\tCI/CD\n\tTerraform\n\tAnsible\n\tHelm\n\tDocker Compose\n\n **Cloud & Infrastructure:**\n\tcloud deployment\n\n **Other:**\n\tArtificial Intelligence & Machine Learning\n\tMLflow\n\tAirflow\n\tKubeflow\n\tJavaScript/TypeScript (Vue, Angular)\n\treal-time services\n\tSDLC\n\tcommunication skills\n\tinnovation consulting methodologies\n\tAuthentication & Security (Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot)"
}