{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior AI Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Senior AI Engineer with 13+ years of experience specializing in building AI-driven UIs and SaaS integrations. Proficient in **TypeScript**, **Node.js**, **Python**, and developing robust **REST APIs**. Experienced in leveraging **LangChain** and **Vercel AI SDK** to create innovative solutions. Demonstrated ability in collaboration across interdisciplinary teams to enhance productivity and delivery.\nSkilled in both frontend and backend technologies including **React**, with a solid background in deploying microservices architectures and integrating with **MCP servers**. Strong understanding of compliance-driven development within the healthcare and financial sectors, ensuring adherence to standards like HIPAA, PCI DSS, and SOC 2. Proficient in creating AI/ML-powered platforms that facilitate predictive analytics and real-time data processing, with hands-on experience in MLOps including model training and orchestration using tools such as **MLflow**, **Airflow**, and **Kubeflow**.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior AI Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Developed and integrated **AI-driven UIs** using **TypeScript**, **Node.js**, and **Python** for seamless user interactions across applications.\nDesigned and implemented **REST APIs** to facilitate data exchange between different components and third-party **SaaS integrations**.\nLeveraged **React** for building responsive front-end applications, enhancing user experience and engagement.\nCollaborated with cross-functional teams to deliver innovative features aligned with business goals and user needs, ensuring efficient workflows in line with **MCP servers** and **Vercel AI SDK**.\nContributed to comprehensive testing strategies, utilizing tools such as Jest and Cypress to ensure code quality and functionality across various levels.\nOptimized existing solutions and incorporated **LangChain** framework for better data processing capabilities.\nDelivered projects on **time** and within budget constraints, achieving a minimum of **95%** stakeholder satisfaction in final product assessment.\nActively participated in code reviews and architectural discussions, promoting best practices and continuous improvements across the development team.\nMaintained up-to-date knowledge of industry trends and emerging technologies in AI and machine learning to drive innovation within projects."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Leveraged **TypeScript** and **Node.js** to develop robust **REST APIs** and enhance SaaS integrations, driving seamless communication between various financial platforms.\nDesigned and implemented AI-driven UIs using **React (18)**, creating user-centric applications that enhance user engagement by **30%**.\nCollaborated with cross-functional teams to modernize core systems employing **Python** for backend processes, guaranteeing high performance under a load of over **500K transactions/day**.\nUtilized **LangChain** and **Vercel AI SDK** to integrate machine learning capabilities into applications, advancing the analytical edge of the products.\nBuilt efficient microservices for the financial sector utilizing standards such as **Express** for seamless API management and **FastAPI** for rapid development cycles.\nStructured and monitored operational dashboards using **Power BI** and **D3.js**, enhancing visibility over financial metrics and improving decision-making speed by **25%**.\nPioneered the use of event-driven architecture with tools like **Kafka**, **RabbitMQ**, and **Azure Service Bus**, improving workflow efficiency and reducing latency in alerts and compliance operations.\nDeveloped and maintained ETL pipelines through **Apache Airflow** and **Azure Data Factory** for smooth data ingestion from over **10** key internal and third-party sources, enabling real-time data processing and insights.\nEngineered and trained machine learning models leveraging **scikit-learn** and **XGBoost**, facilitating proactive fraud detection based on transactional analytics, identifying suspicious activities with an **accuracy of 95%**.\nIntegrated **MLflow** and **Airflow** into the machine learning lifecycle for real-time credit scoring and churn prediction, enhancing the bank’s predictive capabilities and process automation."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Developed and integrated AI-driven UIs leveraging **React** and **TypeScript** to create intuitive and responsive user experiences for a cutting-edge e-commerce platform, prioritizing customer engagement and satisfaction.\nEngineered REST APIs and microservices using **Node.js** and **Python** for backend functionality, ensuring seamless interactions with third-party integrations and **SaaS** applications, while maintaining high performance with an emphasis on scalability and low-latency responsiveness.\nCollaborated with cross-functional teams to implement **LangChain** and **Vercel AI SDK** for building intelligent features that enhance user interaction, significantly improving platform engagement metrics by over **30%**.\nUtilized container orchestration (Kubernetes) and deployed applications in **MCP servers**, ensuring efficient resource management, high availability, and consistent application performance through blue-green deployments.\nDesigned and maintained robust, secure RESTful services with a focus on API design best practices, ensuring efficient data flow and business logic implementation in compliance with industry standards.\nImplemented advanced caching strategies using **Redis** and optimized database interactions with **PostgreSQL** and **MongoDB**, achieving a **40%** reduction in response times for critical data queries while improving throughput during peak user traffic.\nPioneered the development of machine learning components for personalized experiences and decision-making processes, utilizing frameworks and tools like **TensorFlow** to leverage real-time user data for enhancing product recommendations.\nAchieved successful outcomes in project timelines through effective collaboration within agile development teams, emphasizing communication and coordination across technical and non-technical stakeholders to align project goals and priorities."
    }
  ],
  "skills": "**Programming Languages:**\n\tPython, TypeScript\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django, Node.js\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tREST APIs\n\n**Serverless and Cloud Functions:**\n\tAWS: Lambda, Azure: App Services, SaaS integrations\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS: ECS, RDS, S3, Azure: Blob Storage, SQL Database, MCP servers\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), OAuth2, JWT, Nginx, Let’s Encrypt, Certbot, AI-driven UIs, collaboration, Vercel AI SDK",
  "apply_company": "Hostaway"
}