{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Front-End Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-karol-kotlinski-bb2520397/",
  "profile_summary": "As a Senior Front-End Engineer with 8 years of comprehensive experience, I excel in developing high-performance applications utilizing **React**, **TypeScript**, **JavaScript**, **HTML**, **CSS**, **Tailwind**, **SCSS**, **Cypress**, and **Jest**. My proficiency in modern development practices such as **Nx monorepo**, **React Query**, and agile methodologies enables me to deliver optimal user experiences and performance improvements.\n\nIn addition to my front-end expertise, I have a rich background in building scalable solutions within the healthcare and financial sectors. I have successfully integrated AI/ML capabilities for real-time data processing, employing **Python**, **FastAPI**, and **Django** as part of my tech stack. My strong foundation in microservices architecture and CI/CD automation ensures that I produce robust, secure applications that adhere to compliance standards including HIPAA and PCI DSS.\n\nPassionate about collaboration and fostering a product mindset, I dedicate myself to optimizing applications for performance while leveraging tools like **MLflow**, **Airflow**, and **Kubeflow** to support machine learning workflows.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Front-End Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Developed interactive user interfaces leveraging **React (17-18)**, **TypeScript**, and **JavaScript**, focusing on performance optimization and responsive design principles.\n• Utilized **Nx monorepo** for modular development, enhancing collaboration and maintainability across multiple projects.\n• Implemented state management solutions using **React Query** and seamlessly styled components using **Tailwind** and **SCSS**.\n• Established comprehensive testing frameworks using **Cypress**, **Jest**, and **Storybook**, ensuring high-quality deliverables through rigorous unit, integration, and E2E testing.\n• Promoted Agile methodologies within team environments, fostering collaboration and alignment with a product mindset to meet business requirements effectively.\n• Architected and designed full-stack healthcare and financial platforms while ensuring compliance with regulations such as HIPAA and PCI DSS.\n• Led cross-functional teams in delivering high-quality software, achieving an improvement of deployment frequency by **200%** through DevOps practices.\n• Enhanced application performance through code reviews and optimization techniques, resulting in a **30%** decrease in load times.\n• Integrated **Azure Cognitive Search** and **ElasticSearch** for advanced data retrieval capabilities, improving search response times by **50%**.\n• Collaborated closely with UI/UX designers to translate visions into functional interfaces, ensuring seamless user experiences that drive engagement."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "• Developed dynamic, user-focused front-end applications utilizing **React** (18), **TypeScript**, and **JavaScript**, contributing to a 30% improvement in user engagement and experience.\n• Implemented performance optimization techniques, reducing load times by 25% through the application of **Tailwind CSS** and **SCSS** for efficient styling and layout.\n• Leveraged **Nx monorepo** strategy to manage project structure, streamline development processes, and ensure code quality and maintainability across the team.\n• Enhanced application functionality with **React Query** for effective data fetching and state management, providing a seamless user experience for financial dashboards.\n• Collaborated within an Agile framework to deliver project milestones on time, demonstrating a product mindset and improving team efficiency by 20%.\n• Conducted unit tests with **Cypress** and **Jest** to ensure code reliability and reduce bugs in production by 15%.\n• Developed storytelling components using **Storybook** to enhance collaboration between designers and developers, ensuring alignment on UI/UX.\n• Integrated collaborative feedback loops, enhancing product features based on user and stakeholder feedback, improving overall satisfaction ratings by 10%."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Developed dynamic and responsive frontend applications using **React (18)**, **TypeScript**, and **JavaScript** to deliver optimized user experiences across various devices, achieving a customer satisfaction rate of over **95%**.\nEmployed modern styling frameworks such as **Tailwind CSS** and **SCSS** to ensure seamless UI design that adheres to mobile-first principles and accessibility standards (WCAG 2.1).\nUtilized **Nx monorepo** strategy to manage and maintain codebase efficiency and streamline development processes across multiple projects, resulting in a **30%** reduction in build times.\nImplemented state management solutions with **React Query** to enhance the performance of data fetching and caching strategies, significantly improving application responsiveness during peak usage times.\nConducted comprehensive testing using **Cypress**, **Jest**, and **Storybook** to ensure the reliability of frontend components, achieving a code coverage goal of at least **85%**.\nPromoted Agile methodologies within the team, fostering a culture of collaboration that led to improved velocity in feature delivery and a **40%** increase in team efficiency.\nContributed to continuous performance optimization discussions, leveraging industry best practices to enhance frontend loading times, achieving a target of **90** for Lighthouse performance scores.\nEngaged in cross-functional collaboration with designers and backend engineers to align the product vision, ensuring that business requirements were met, and product quality was upheld."
    }
  ],
  "skills": "Programming Languages:\n\tJavaScript, TypeScript, Python\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular, React Query, Tailwind, SCSS, HTML, CSS\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**API Technologies:**\n\tNginx, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS, Azure\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, Agile, Collaboration, Product mindset, Performance optimization, Cypress, Jest, Storybook"
}