{
  "name": "Rei Taro",
  "role_name": "Senior Software Engineer",
  "email": "rei515@outlook.com",
  "phone": "+48732529451",
  "address": "Warszawa, Poland",
  "linkedin": "https://www.linkedin.com/in/rei-taro-81a410391/",
  "profile_summary": "Results-driven Senior Software Engineer with 10+ years of experience in backend development, specializing in **Go**, **Linux**, **Postgres**, and **Web Services**. Expertise in building scalable services and high-performing APIs, alongside proficiency in automation tools and data processing methodologies. Strong background in virtualization technologies including **QEMU** and expertise in **Malware Analysis**, **Static Analysis**, and **Dynamic Analysis**. Skilled in various programming languages such as **Java**, **C#**, and **C++**, with a proven track record of delivering impactful projects for major organizations, including VISA, Sii Poland, and Reply Polska. Committed to optimizing performance and driving innovation in software solutions.",
  "education": [
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2010",
      "to_year": "2015",
      "location": "Japan",
      "university": "Keio University"
    }
  ],
  "experience": [
    {
      "role": "Senior Software Engineer",
      "company": "Leobit",
      "from_date": "Aug 2022",
      "to_date": "Present",
      "location": "Poland",
      "responsibilities": "Utilized **Go**, **Linux**, and **Postgres** to develop high-performance backend services that improve automation and processing workflows.\nImplemented efficient data processing strategies involving **DataProcessing** and **WebServices**, enhancing the responsiveness by **30%**.\nLeveraged **Java** and **C#** for inter-service communication and integration, ensuring effective collaboration across various platforms.\nDesigned and maintained virtualized environments using **QEMU** and **VMs** to facilitate efficient system testing and deployment, achieving a reduction in code release cycles by **15%**.\nConducted thorough **StaticAnalysis** and **DynamicAnalysis** to identify and address vulnerabilities, maintaining system integrity and compliance with industry standards.\nCreated robust protocols and ensured adherence to **RFCs** for optimal data exchange between services, significantly improving system interoperability.\nCollaborated with multidisciplinary teams to resolve complex integration issues and oversee implementation strategies, driving successful project completion on time and within scope."
    },
    {
      "role": "Software Engineer",
      "company": "Innovature",
      "from_date": "Nov 2018",
      "to_date": "Jun 2022",
      "location": "Japan",
      "responsibilities": "Utilized **Go** and **Linux** to develop efficient backend systems for processing complex workflows and automating document handling.\nImplemented robust **Postgres** databases to manage and store user data, ensuring swift retrieval and data integrity across systems.\nEmployed **Java** and **C#** in creating scalable microservices, adhering to industry **RFCs** and protocols for optimal performance and compliance with standards.\nDesigned and deployed virtual machines (**VMs**) in a secure environment, utilizing **QEMU** for effective testing and management of software deployment.\nConducted comprehensive data processing and analysis for real-time decision making, integrating static and dynamic analysis techniques for improved data validation and threat detection.\nAutomated backend routines to maximize efficiency through **Web Services**, with additional enhancements to reduce manual effort by 50%.\nCollaborated with cross-functional teams, managing successful release cycles and ensuring project milestones met the **DataProcessing** and system integration requirements."
    },
    {
      "role": "Software Developer",
      "company": "Wizcorp",
      "from_date": "Apr 2015",
      "to_date": "Nov 2018",
      "location": "Japan",
      "responsibilities": "• Developed and enhanced backend services for trade execution and portfolio management using **Python**, **Flask**, and **PostgreSQL**, improving trading operations by 30%.\n• Engineered real-time price feed processors employing **asyncio**, **WebSockets**, and **Redis**, reducing latency to under **100 ms** for high-frequency transactions.\n• Collaborated with frontend teams to deliver dynamic data through REST APIs and WebSocket channels, ensuring a seamless user experience with an uptime of **99.9%**.\n• Ensured strict adherence to regulatory requirements, including MiFID II and GDPR, implementing internal data security protocols that passed compliance audits.\n• Implemented comprehensive testing suites with **PyTest**, **tox**, and mock servers, reducing QA testing time by **40%** and expediting the CI process.\n• Introduced innovative job queuing and scheduling solutions with **Celery** and **RabbitMQ**, optimizing backend task execution and achieving a processing efficiency increase of **25%**."
    }
  ],
  "skills": "**Programming Languages**\n\tGo, Python (3.8+), SQL, Bash, JavaScript, Java, C#, C++, Linux\n\n**Backend Frameworks**\n\tFastAPI, Flask, Django, Celery\n\n**Frontend Frameworks**\n\t\n\n**API Technologies**\n\tREST/gRPC APIs, WebServices\n\n**Serverless and Cloud Functions**\n\tAWS (EC2, S3, Lambda), Azure, Docker, Kubernetes, GitHub Actions, Azure DevOps\n\n**Databases**\n\tPostgreSQL, MySQL, MongoDB, Redis, Postgres\n\n**DevOps**\n\tCI/CD, Git, Automation\n\n**Cloud & Infrastructure**\n\tQEMU, VMs\n\n**Other**\n\tAI/ML Tools: Pandas, NumPy, scikit-learn, TensorFlow, Airflow, MLflow, Microservices, Kafka, DataProcessing, StaticAnalysis, DynamicAnalysis, RFCs, Protocols, MalwareAnalysis",
  "apply_company": "Recorded Future"
}