{
  "name": "Rei Taro",
  "role_name": "Senior QA Engineer",
  "email": "rei515@outlook.com",
  "phone": "+48732529451",
  "address": "Warszawa, Poland",
  "linkedin": "https://www.linkedin.com/in/rei-taro-81a410391/",
  "profile_summary": "Results-driven Senior QA Engineer with over 10 years of experience in testing, automating, and reporting for backend systems and APIs. Skilled in **API** testing, **automation** frameworks, and collaborative methodologies to ensure high-quality software delivery. Proficient with **ISTQB** standards, utilizing robust testing strategies to support financial platforms and AI/ML pipelines. With a strong background in creating scalable services using technologies such as **Python** (FastAPI, Django, Flask), and cloud services including **AWS** and **Azure**, I have successfully contributed to impactful projects at top-tier organizations such as VISA, Sii Poland, and Reply Polska.",
  "education": [
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2010",
      "to_year": "2015",
      "location": "Japan",
      "university": "Keio University"
    }
  ],
  "experience": [
    {
      "role": "Senior QA Engineer",
      "company": "Leobit",
      "from_date": "Aug 2022",
      "to_date": "Present",
      "location": "Poland",
      "responsibilities": "Testing and validating **APIs** to ensure robustness and reliability of backend services.\nAutomatised testing workflows to enhance efficiency in reporting and documentation, utilizing industry best practices.\nCollaborated in cross-functional teams to address integration challenges, providing high-quality deliverables influenced by the **ISTQB** standards.\nConducted evaluations of existing automation processes and improved them to boost the accuracy of testing by **30%**.\nEnsured compliance with quality standards and methodologies throughout the development and deployment process.\nDeveloped comprehensive test plans and test cases to cover all aspects of **backend** functionalities supporting user onboarding and reporting workflows.\nLed training sessions for team members on effective testing strategies and tools to foster a collaborative environment."
    },
    {
      "role": "Software Engineer",
      "company": "Innovature",
      "from_date": "Nov 2018",
      "to_date": "Jun 2022",
      "location": "Japan",
      "responsibilities": "Implemented robust testing strategies for backend APIs developed in **Python** and **FastAPI**, ensuring high-quality standards and automating testing workflows.\nDesigned and executed automated test cases for event-driven microservices built with **Celery** and **Redis**, enhancing efficiency and accuracy in transaction processing.\nUtilized **Terraform** for infrastructure automation to support constant performance of testing environments deployed on **Azure App Services**, achieving a deployment success rate of **99%**.\nEngineered comprehensive testing frameworks for data pipelines that exchange regulatory information, employing **Apache Airflow** and **Azure Functions** to ensure data integrity and compliance with industry standards.\nConducted thorough security audits and bug assessments, implementing compliance measures while integrating **OAuth2** and **Azure AD B2C** for secure authentication processes.\nCollaborated with cross-functional teams to facilitate effective release management, improving the overall system integration process by **30%**."
    },
    {
      "role": "Software Developer",
      "company": "Wizcorp",
      "from_date": "Apr 2015",
      "to_date": "Nov 2018",
      "location": "Japan",
      "responsibilities": "Implemented comprehensive test strategies, enhancing overall product quality and adherence to ISTQB standards by developing thorough test plans and documentation.\nDeveloped and maintained automated testing frameworks for REST APIs, utilizing tools like **PyTest** and **tox** to ensure robust and reliable service validation.\nCollaborated effectively with cross-functional teams to ensure seamless integration of testing processes in the software development life cycle, promoting a collaborative work environment.\nCreated detailed reporting mechanisms to track test results and software performance metrics, driving continuous improvement initiatives.\nDesigned and executed automated test suites that reduced manual testing time by **30%**, increasing overall productivity and efficiency in development cycles.\nDocumented all testing processes and findings in a structured manner, ensuring clarity and accessibility for stakeholders and enabling effective communication across teams.\nParticipated in sprint planning and retrospective meetings, offering insights and recommendations based on automated testing outcomes to optimize future releases."
    }
  ],
  "skills": "**Programming Languages**\n\tPython (3.8+), SQL, Bash, JavaScript\n\n**Backend Frameworks**\n\tFastAPI, Flask, Django, Celery\n\n**Frontend Frameworks**\n\t\n\n**API Technologies**\n\tREST/gRPC APIs, API\n\n**Serverless and Cloud Functions**\n\tAWS (EC2, S3, Lambda), Azure\n\n**Databases**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps**\n\tDocker, Kubernetes, GitHub Actions, Azure DevOps, CI/CD, Git\n\n**Cloud & Infrastructure**\n\t\n\n**Other**\n\tAI/ML Tools: Pandas, NumPy, scikit-learn, TensorFlow, Airflow, MLflow, test, automatisation, reporting, collaboratif, bureautique, ISTQB",
  "apply_company": "Fédération pour l'Entrepreneuriat Durable"
}