{
  "name": "Tomasz Lee",
  "role_name": "Engenheiro(a) de Software",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Results-driven Software Engineer with over 9 years of experience in developing scalable applications and proficient in **Python**, **pandas**, **SQL**, and **REST** API integration. Demonstrated expertise in cloud services, particularly **AWS** including **AWS EC2** and **AWS Athena**, with a solid understanding of data formats such as **JSON** and **CSV**. A strong background in managing data processing frameworks like **Hadoop** and deploying **SaaS** solutions. Renowned for strong problem-solving skills, effective time management, and the ability to work autonomously while fostering teamwork. Additionally, experienced in microservices architecture and skilled in tools like **Apache Kafka**, **RabbitMQ**, and **Redis**, along with proficiency in frontend and backend technologies, including **ReactJS**, **NextJS**, **.NET**, and **C#**. Proven track record in delivering high-quality solutions and optimizing development processes.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Engenheiro(a) de Software",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "• Utilized **AWS** services such as **EC2** and **AWS Athena** to enhance application performance and scalability while processing data effectively.  \n• Developed robust data analysis features using **Python** and **pandas**, enabling the processing of large data sets with support for formats like **JSON** and **CSV**.  \n• Designed and built RESTful APIs, ensuring seamless integration with various services, improving data accessibility for users.  \n• Implemented data backup and recovery strategies on **AWS**, enhancing system reliability while reducing downtime by **30%**.  \n• Collaborated within a cross-functional team to deliver software solutions efficiently, leveraging strong time management and problem-solving skills.  \n• Championed best practices in code development and documentation, promoting autonomy and clarity across the project teams.  \n• Analyzed data with **Hadoop**, streamlining data processing workflows and facilitating informed decision-making across departments.  \n• Leveraged **SaaS** platforms to improve overall system interoperability and user experience, achieving a **25%** increase in user satisfaction.  \n• Regularly engaged in team projects, demonstrating teamwork and collaboration, which contributed to a smoother project flow and expedited delivery timelines."
    },
    {
      "role": "Full Stack Developer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "Utilized **Python** and **pandas** for data analysis and manipulation, significantly enhancing data processing efficiency by **20%**.\nDeveloped and maintained scalable **AWS** solutions, leveraging **EC2** and **AWS Athena**, which improved data retrieval speed by **30%**.\nImplemented robust **REST** APIs for seamless integration with various data formats such as **JSON** and **CSV**.\nDesigned and executed SQL queries to optimize database performance, utilizing both **MSSQL** and **MySQL**, leading to a **25%** reduction in retrieval times.\nBuilt a cloud-based SaaS project that facilitated real-time data access and reduced operational costs by **15%**.\nEmployed **Hadoop** for big data processing, which contributed to enhanced analytical capabilities across the platform.\nCollaborated with cross-functional teams to align on project requirements and delivery timelines, ensuring **100%** on-time project completion.\nEngaged in problem-solving sessions that fostered team autonomy and improved overall project management.\nConducted regular code reviews and provided mentorship to junior developers, enhancing team productivity by **15%**."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "Leveraged **Python** and **pandas** for data analysis, leading to a **15%** improvement in decision-making speed across teams.\nUtilized **SQL** for efficient database management, enhancing data retrieval and processing times by **30%**.\nIntegrated data with **AWS** services, implementing **AWS EC2** for scalable computing and **AWS Athena** for querying large datasets using SQL, reducing report generation time by **25%**.\nDeveloped RESTful APIs to facilitate smooth data exchange in **JSON** and **CSV** formats, improving interoperability between applications.\nApplied problem-solving skills to resolve technical challenges and streamline workflows, achieving an average resolution time of **2 days**.\nEnsured effective teamwork through collaboration across departments, leading to successful project completions ahead of deadlines by an average of **10%**.\nDemonstrated autonomy in managing multiple projects, adhering to strict timelines while maintaining high-quality coding standards.\nParticipated in regular sprint meetings and code reviews to align project goals, enhancing communication and collaboration within the team.\nCreated technical documentation that enhanced the understanding of systems, contributing to better onboarding experiences for new team members."
    }
  ],
  "skills": "  **Programming Languages**\n\tPython, JavaScript, TypeScript, C#, Solidity\n\n  **Backend Frameworks**\n\tNodeJS, ExpressJS, NestJS, .NET, Entity Framework, Microservices\n\n  **Frontend Frameworks**\n\tHTML, CSS, ReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n  **API Technologies**\n\tRESTful API, GraphQL\n\n  **Serverless and Cloud Functions**\n\tAWS, AWS Athena, EC2\n\n  **Databases**\n\tMSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB, SQL\n\n  **DevOps**\n\tCI/CD pipelines\n\n  **Cloud & Infrastructure**\n\tAzure\n\n  **Other**\n\tGit, GitHub, Redux, Apache Kafka, RabbitMQ, Redis, NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest, JSON, CSV, Hadoop, SaaS, análise de dados, resolução de problemas, autonomia, gestão do tempo, trabalho em equipe"
}