{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Sales Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "Dynamic Senior Sales Engineer with strong expertise in customer consulting, proposal preparation, and CRM solutions. Proven track record in driving sales through effective negotiation and communication strategies, ensuring a strong customer focus and service mindset. Bilingual in English, Italian, and German, enabling seamless communication across diverse clientele.\n\nWith a solid foundation in electrical engineering, I leverage my technical background to enhance customer interactions and deliver tailored solutions. Committed to utilizing MS Office proficiency to create compelling presentations and reports that elevate sales outcomes.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Sales Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Provided exceptional **customer consulting** to gather requirements and understand client needs in relation to complex products and solutions.\nCrafted tailored proposals utilizing **MS Office** suite to present technical solutions, demonstrating value to clients and addressing their specific challenges.\nUtilized strong **communication** skills to engage with stakeholders, presenting technical insights and facilitating discussions to drive decision-making in sales processes.\nLeveraged advanced **CRM** tools to manage customer relationships, track sales progress, and maintain a strong pipeline, ensuring a consistent follow-up strategy and customer focus.\nNegotiated contracts and pricing agreements effectively to meet revenue goals, utilizing **negotiation** skills to achieve mutual benefits in sales agreements.\nMaintained an in-depth understanding of products and technologies in **electrical engineering** to effectively communicate features and benefits to potential clients.\nFocused on building long-term relationships with clients by providing ongoing support and a strong **service mindset**, enhancing customer satisfaction.\nDemonstrated fluency in **English**, **Italian**, and **German** to cater to diverse client bases and enhance communication strategies in client engagement.\nAnalyzed customer feedback and market trends to provide insights for future product developments, ensuring alignment with customer expectations and needs.\nConducted presentations and product demonstrations that effectively showcased technical capabilities and how they address customer requirements."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Utilized outstanding **communication** and **customer focus** skills to lead technical consultations, providing expert guidance on electrical engineering solutions tailored to customer needs.\nImplemented effective **negotiation** strategies to prepare and deliver compelling proposals, resulting in a **30%** increase in successful project bids.\nLeveraged **MS Office** and **CRM** tools to streamline customer relationship management, enhancing client interactions and service delivery, thereby improving customer satisfaction scores by **25%**.\nDemonstrated a strong **service mindset**, addressing customer inquiries and support requirements with efficiency and professionalism, consistently achieving a **95%** satisfaction rate in feedback surveys.\nConducted in-depth technical presentations and demonstrations, communicating complex engineering principles in a clear and effective manner to diverse audiences fluent in **English**, **Italian**, and **German**.\nCollaborated closely with cross-functional teams to develop customer-centric solutions, drawing on extensive knowledge of electrical engineering to meet project specifications and promote service excellence."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Utilized exceptional communication skills to engage with clients and provide technical consultation, translating customer needs into effective solutions, achieved a **20%** increase in customer satisfaction ratings.\nLeveraged CRM tools to track leads and manage customer relationships, ensuring follow-ups and driving **30%** more sales opportunities through proactive engagement and proposal preparation.\nDeveloped and delivered detailed proposals and presentations tailored to customer specifications, employing MS Office for pitch decks, resulting in a **15%** higher conversion rate on proposals.\nConducted thorough electrical engineering assessments and consultations to identify customer requirements and opportunities for tailored solutions, enhancing client relationships and fostering ongoing collaboration.\nNegotiated contracts and agreements effectively to meet customer needs while ensuring profitability for the organization, achieving a **25%** increase in contract renewals.\nDemonstrated a strong service mindset by responding promptly to customer inquiries and issues in three languages: English, Italian, and German, catering to a diverse clientele and building trust.\nConducted customer training sessions to enhance product understanding and user adoption, utilizing effective communication skills to ensure clarity and engagement.\nFocused on a customer-centric approach, utilizing a consultative sales process to offer solutions that align with customer goals and objectives, leading to long-term partnerships."
    }
  ],
  "skills": "Programming Languages:\n\tPython, JavaScript, TypeScript\n\nBackend Frameworks:\n\tFastAPI, Flask, Django\n\nFrontend Frameworks:\n\tReact, Vue, Angular\n\nAPI Technologies:\n\t\n\nServerless and Cloud Functions:\n\tAWS (ECS, Lambda), Azure (App Services)\n\nDatabases:\n\tPostgreSQL, MySQL, MongoDB, Redis\n\nDevOps:\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\nCloud & Infrastructure:\n\tAWS (RDS, S3), Azure (Blob, SQL)\n\nOther:\n\tArtificial Intelligence, Machine Learning, MLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, sales, electrical engineering, customer consulting, proposal preparation, CRM, MS Office, negotiation, communication, customer focus, service mindset, English, Italian, German",
  "apply_company": "Personalberatung Rochus Mummert"
}