{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Support Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Dedicated Senior Support Engineer with 13+ years of experience enhancing customer experience through exceptional technical support and problem-solving capabilities. Proficient in tools like **Zendesk**, **Linear**, **JIRA**, and **Sendgrid**, adept at leveraging **SaaS** solutions to troubleshoot and resolve client issues effectively. Strong analytical skills with experience in leveraging **SQL** and **metabase** for data-driven decision-making and reporting.\n\nPossesses a robust background as a Full Stack Developer, with hands-on expertise in JavaScript/TypeScript, Python, and **Flutter**. Experience in both frontend and backend development using **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**. Skilled in developing AI/ML-powered platforms for predictive analytics and real-time processing, supported by deployment of robust cloud-native systems on **AWS** and **Azure**. Well-versed in compliance, aligning solutions with standards such as HIPAA and PCI DSS, coupled with a strong understanding of MLOps tools like **MLflow**, **Airflow**, and **Kubeflow**.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Support Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Provided technical support for SaaS applications, ensuring optimal customer experience by troubleshooting and resolving issues with **SQL** databases and analytics tools like **Metabase**.\nUtilized project management tools such as **JIRA** and **Linear** to track support tickets and manage workflows, aiming to maintain a high level of customer satisfaction and communication.\nDeveloped and maintained documentation to enhance the customer experience, generating clear guides and best practices around issues reported in **Zendesk**.\nCollaborated with cross-functional teams to identify and analyze trends in customer feedback, employing **problem-solving** skills to derive actionable insights and improve product offerings.\nConducted analytics on support interactions, utilizing data to optimize response times and enhance overall support strategies, leading to a **30%** reduction in resolution times.\nEngaged in effective communication with customers to understand their needs, providing tailored solutions and enhancing the overall experience with our SaaS products.\nImplemented workflows for onboarding new customers using **SendGrid** for communication and ensuring they receive the necessary training and support.\nFacilitated internal and external communication channels to foster collaboration and streamline processes, troubleshooting complex technical inquiries with a focus on efficiency.\nProvided ongoing feedback to product development teams based on customer insights, leveraging a strong understanding of customer experience to influence product direction and features.\nMonitored and reported on key performance indicators related to support efficiency and customer satisfaction, driving improvements through regular analysis."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Provided outstanding technical support for SaaS solutions, ensuring a high-quality customer experience through clear communication and problem-solving skills.\nUtilized SQL and analytical tools to troubleshoot issues efficiently, streamlining support processes and enhancing service delivery accuracy.\nCollaborated with cross-functional teams using **JIRA** and **Linear** to address product enhancements and resolve customer feedback promptly, maintaining 99% customer satisfaction ratings.\nLeveraged **Metabase** for insightful analytics, enabling proactive issue resolution and improved reporting within the support infrastructure.\nManaged communications through **Zendesk** and **Sendgrid**, ensuring timely updates and responses to client inquiries and support tickets, achieving an average response time of less than **30 minutes**.\nImplemented best practices to ensure efficient technical support workflows, resulting in a **20% reduction** in ticket resolution time over **6 months**.\nConducted regular training sessions on technical troubleshooting and customer service strategies, enhancing team efficacy and boosting overall team performance.\nFacilitated root cause analysis on recurring issues, applying lessons learned to prevent future occurrences and improve product reliability."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Provided **technical support** for a SaaS platform ensuring optimal customer experience and satisfaction in collaboration with teams using **JIRA** and **Linear** for task tracking and project management.\nEnsured accurate **SQL** data analysis and support on customer queries leveraging tools like **Metabase** to enhance analytics and provide data-driven solutions.\nAddressed customer issues effectively with problem-solving skills, enhancing **communication** with users for prompt resolution of technical difficulties.\nUtilized **Zendesk** for managing customer interactions and improving the support workflow, achieving a ticket resolution rate of **95%** within **24 hours**.\nContributed to continuous improvement of customer support processes, applying analytics to identify trends and optimize service delivery, resulting in a decrease in average response time by **30%**.\nCreated training materials and conducted sessions to upskill team members on new features, communication methods, and handling technical queries, boosting overall team efficiency.\nCollaborated with cross-functional teams to enhance product features based on customer feedback, ensuring alignment between technical support and product development teams.\nMonitored and reported on customer satisfaction metrics through tools like **Sendgrid** for automated follow-ups, striving for a customer satisfaction score exceeding **90%**.\nEngaged in regular review sessions to analyze ticket trends, feedback, and team performance, utilizing insights to foster a culture of continuous improvement and excellence within the support department."
    }
  ],
  "skills": "**Programming Languages:**\n\tPython: FastAPI, Flask, Django\n\tJavaScript/TypeScript: React, Vue, Angular\n\n**Backend Frameworks:**\n\n**Frontend Frameworks:**\n\n**API Technologies:**\n\n**Serverless and Cloud Functions:**\n\tAWS: ECS, Lambda, RDS, S3\n\tAzure: App Services, Blob Storage, SQL Database\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare)\n\tMongoDB (Gaming), Redis\n\tSQL\n\n**DevOps:**\n\tDocker, Kubernetes\n\tGitHub Actions, GitLab CI/CD\n\tTerraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\n**Other:**\n\tSaaS, metabase, Zendesk, Linear, JIRA, Sendgrid, technical support, customer experience, communication, problem-solving, analytics, MLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), OAuth2, JWT, Nginx, Let’s Encrypt, Certbot",
  "apply_company": "Sona"
}