{
  "name": "Mariusz Jan Skobel",
  "role_name": "Ingeniero de Software",
  "email": "mariuszskobel15@outlook.com",
  "phone": "+48 735 343 548",
  "address": "Katowice, Poland",
  "linkedin": "https://www.linkedin.com/in/mariusz-skobel-789557397/",
  "profile_summary": "Proficient Software Engineer with 10+ years of experience in developing high-performance software solutions, emphasizing **Python**, **Machine Learning**, and **Artificial Intelligence**. Adept at creating and managing **RAG systems** and utilizing **Databricks** for data processing and analytics. Deep experience in modern technologies includes hands-on expertise in **CI/CD**, **Infrastructure as Code**, and **Kubernetes**, ensuring robust software delivery pipelines. Skilled in leveraging **MLflow** for managing machine learning workflows and model deployment, as well as **Seldon** and **Mosaic** for enhanced ML operational capabilities. Strong background in data security and governance practices, ensuring compliance and protection of sensitive data.\n\nAdditionally, brings practical experience from healthcare and finance domains, with a strong focus on building cloud-native applications using **Azure** and **AWS**. An excellent communicator in English, dedicated to crafting systems that are not only technically robust but also contribute substantial real-world impact.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2012",
      "to_year": "2015",
      "location": "UK",
      "university": "University of Bristol"
    }
  ],
  "experience": [
    {
      "role": "Ingeniero de Software",
      "company": "EitBiz",
      "from_date": "Oct 2022",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "•\tDeveloped robust **Python** solutions for Machine Learning and Artificial Intelligence applications, enhancing patient risk prediction and financial fraud detection systems.\n•\tLeveraged **MLflow** and **Databricks** to establish MLOps pipelines, ensuring efficient model training, validation, and deployment across diverse environments.\n•\tImplemented **Kubernetes** for container orchestration, enhancing application scalability and management in cloud environments.\n•\tUtilized **Seldon** and **Mosaic** for deploying and monitoring machine learning models in production, ensuring high performance and reliability.\n•\tAdopted Infrastructure as Code methodologies for CI/CD processes, integrating version control with **GitHub Actions** and **Azure DevOps** to streamline deployment of applications.\n•\tEnsured data security and governance compliance through strategic data architectures designed to meet standards such as HIPAA and GDPR.\n•\tCommunicated effectively in English, collaborating with cross-functional teams to meet project goals and timelines, enhancing team productivity.\n•\tDesigned and implemented full-stack applications using **TypeScript**, **FastAPI**, and various frameworks, emphasizing scalable, secure solutions for the healthcare and finance sectors.\n•\tBuilt and deployed cross-platform applications with **Flutter** and **React Native**, improving user engagement for clients across **iOS** and **Android** platforms.\n•\tArchitected and transitioned monolithic applications to microservices using **Docker** and serverless strategies, achieving a 99.9% uptime and improved fault tolerance.\n•\tCreated cloud-native data solutions with **PostgreSQL**, **MongoDB**, and **GraphQL**, optimizing storage and querying capabilities for large datasets.\n•\tDelivered real-time financial data visualization tools utilizing **D3.js** and **Power BI Embedded**, facilitating insights into transaction trends and operational KPIs.\n•\tEnhanced search functionalities using **Azure Cognitive Search** and **ElasticSearch**, managing millions of unstructured and structured records effectively."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Tvn S.A.",
      "from_date": "Oct 2019",
      "to_date": "Sep 2022",
      "location": "Poland",
      "responsibilities": "Utilized **Python** to implement Machine Learning and Artificial Intelligence solutions, enhancing system capabilities to flag fraudulent activities in real-time.\nDeveloped robust RAG systems that facilitate advanced analytics using **Databricks** for efficient data processing and management, ensuring accurate forecasting and reporting.\nEmployed **MLflow** for creating and managing ML pipelines for credit scoring, churn prediction, and transaction classification, integrating seamlessly with existing infrastructure for streamlined deployment.\nImplemented **CI/CD** practices to automate deployment processes, significantly reducing deployment times from 8 hours to 1 hour and maximizing team productivity.\nLeveraged **Kubernetes** for container orchestration, improving application deployment efficiency by 30% and ensuring high availability of services through automated scaling.\nEnsured optimal **Data Security** and **Data Governance** in compliance with industry standards, enhancing data protection measures for sensitive financial information across systems.\nFostered effective **English Communication** within cross-functional teams, leading collaboration efforts in the development and modernization of financial applications, with over 50 team members engaged in bi-weekly sprints.\nManaged and deployed **Infrastructure as Code** practices using tools like Terraform, resulting in a streamlined infrastructure setup time, reducing provisioning from 4 days to 1 hour.\n"
    },
    {
      "role": "Software Engineer",
      "company": "Timspark",
      "from_date": "Sep 2015",
      "to_date": "Aug 2019",
      "location": "UK",
      "responsibilities": "Utilized **Python** and **Machine Learning** frameworks to design and optimize backend services for a global e-commerce platform, ensuring robust architecture and delivery across key modules with a target availability of **99.9%**.\nEngineered real-time features leveraging **CI/CD** pipelines and **Kubernetes** for deployment, enabling continuous updates while maintaining system integrity and performance under load conditions exceeding **5000** simultaneous users.\nImplemented **Data Security** measures and **Data Governance** protocols, ensuring compliance with GDPR and safeguarding user data through advanced access control mechanisms such as **RBAC** and **OAuth 2.0**.\nCollaborated on **Infrastructure as Code** solutions to streamline deployment processes, reducing configuration errors by **40%** and enhancing operational efficiency.\nDeveloped and maintained AI-driven features employing **Artificial Intelligence** models integrated with **Databricks** and **MLflow**, delivering personalized recommendations that boosted conversion rates by **25%**.\nDesigned and contributed to end-to-end data pipelines using **Unity Catalog** for enhanced data discovery and management, improving data accessibility for analytics teams.\nFostered effective **English Communication** within teams and with stakeholders, ensuring alignment on project goals and achieving a **90%** satisfaction rate in project milestones assessment.\nUtilized **Seldon** for deploying machine learning models into production and managed workflows that supported iterative improvements and feature integrations.\nConducted training sessions on **Mosaic** and data context understanding tools for cross-functional teams, elevating overall team proficiency in AI/ML methodologies."
    }
  ],
  "skills": " **Programming Languages:** \n\tPython, JavaScript/TypeScript \n\n **Artificial Intelligence & Machine Learning:** \n\tMachine Learning, Artificial Intelligence, MLflow \n\n **Backend Frameworks:** \n\tFastAPI, Flask, Django \n\n **Frontend Frameworks:** \n\tReact, Vue, Angular \n\n **API Technologies:** \n\tNone \n\n **Serverless and Cloud Functions:** \n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL) \n\n **Databases:** \n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis \n\n **DevOps:** \n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, CI/CD, Infrastructure as Code, Terraform, Ansible, Helm, Docker Compose \n\n **Cloud & Infrastructure:** \n\tNone \n\n **Other:** \n\tKeycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, RAG systems, Databricks, Unity Catalog, Seldon, Mosaic, Data Security, Data Governance, English Communication"
}