{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Java Node Developer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-623a26390/",
  "profile_summary": "Dynamic Full Stack Developer with 13+ years of experience specializing in designing and delivering high-performance applications. Proficient in **Node.js**, **TypeScript**, and **AWS**, with a strong foundation in **Java** and **Spring Boot**. Expertise in leveraging **MongoDB** for database management and building robust APIs using **API Gateway** and **Lambda** functions. Skilled in collaboration and problem-solving, ensuring seamless integration and delivery of projects.\nDemonstrated ability in developing AI/ML-powered platforms, utilizing skills in **React**, **Next.js**, and **Vue** for frontend development and **FastAPI** and **Django** for backend solutions. Experienced in deploying cloud-native systems using services such as **S3** and **CDK**. Proven track record of implementing microservices, event-driven architectures, and CI/CD pipelines while adhering to compliance standards like HIPAA and PCI DSS.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Java Node Developer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Utilized **Node.js** and **TypeScript** to design and build scalable full-stack applications, ensuring high performance and maintainability in line with industry standards.\nCollaborated effectively with cross-functional teams to deliver high-quality software solutions, demonstrating strong **collaboration** and **problem-solving** skills.\nImplemented RESTful APIs using **Java** and **Spring Boot**, ensuring seamless integration with front-end applications and microservices.\nManaged data persistence with **MongoDB**, optimizing query performance and data structure for efficient data retrieval.\nDeployed cloud-native applications on **AWS**, incorporating services such as **API Gateway**, **Lambda**, and **S3** to enhance application scalability and resilience.\nCreated CI/CD pipelines using industry-standard tools, improving release management cycles by **50%** through automation.\nParticipated in code reviews, contributing to a **10%** improvement in code quality and adherence to best practices.\nDeveloped unit and integration tests reaching a coverage of **85%**, ensuring robust software delivery and minimizing bugs in production.\nDesigned and maintained documentation and technical specifications for software components, ensuring clarity and knowledge transfer across teams.\nActively engaged in agile ceremonies and provided insights for continuous improvement, fostering a culture of collaboration and efficiency."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Utilized **Node.js** and **TypeScript** to develop and maintain robust microservices architecture, enhancing the scalability and performance of financial systems by over **50%**.\nImplemented RESTful APIs using **Java** and **Spring Boot** to facilitate seamless integration with internal and external services, achieving a response time improvement of **30%**.\nDesigned and optimized databases using **MongoDB**, ensuring efficient data storage and retrieval for high-volume transaction processing and reporting, resulting in reduced latency and improved data handling.\nCollaborated with cross-functional teams to troubleshoot and resolve software issues, employing advanced **problem-solving** skills to optimize system performance and reliability.\nDeployed and managed cloud infrastructure on **AWS** using **S3**, **Lambda**, and **API Gateway**, driving a **40%** reduction in operational costs through resource optimization.\nLeveraged **AWS CDK** for infrastructure as code, enabling consistent and reproducible deployments across different environments.\nPromoted a culture of collaboration by actively participating in team meetings and code reviews, fostering knowledge sharing and best practices across the development team."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Developed robust backend services utilizing **Node.js** and **Java** with **Spring Boot**, ensuring high availability and scalability for e-commerce applications, enhancing performance across checkout and order fulfillment modules.\nCollaborated efficiently with cross-functional teams, leveraging problem-solving skills to troubleshoot and optimize services, achieving a **25% increase** in system responsiveness during peak traffic.\nDesigned and deployed secure APIs using **AWS API Gateway**, backed by **Lambda** functions, resulting in improved integration and functionality, facilitating smooth data transfer between services.\nImplemented data management strategies utilizing **MongoDB** and optimized queries for performance, leading to a **30% reduction** in data retrieval times, and ensuring smooth user experiences.\nStreamlined frontend development with **TypeScript**, enhancing the maintainability of applications and reducing the likelihood of runtime errors by **40%**.\nUtilized **AWS S3** for optimized storage solutions and efficient asset management, supporting smooth content delivery and asset retrieval processes.\nEmployed **AWS CDK** for infrastructure as code, improving deployment consistency and reducing setup time by **50%** across several microservices.\nFostered collaborative working environments to tackle complex challenges and enhance system features, contributing to project success under tight deadlines.\nApplied best practices for version control and CI/CD pipelines, significantly reducing deployment times and ensuring high-quality code practices across the team.\n"
    }
  ],
  "skills": " **Programming Languages:**\n\tJava, JavaScript, Python, TypeScript\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django, Node.js, Spring Boot\n\n **Frontend Frameworks:**\n\tReact, Vue, Angular\n\n **API Technologies:**\n\tAPI Gateway\n\n **Serverless and Cloud Functions:**\n\tAWS: Lambda, S3\n\n **Databases:**\n\tMongoDB, PostgreSQL, MySQL, Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:**\n\tAWS: ECS, RDS, Azure: App Services, Blob Storage, SQL Database\n\n **Other:**\n\tMLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), OAuth2, JWT, Nginx, Let’s Encrypt, Certbot, collaboration, problem-solving, CDK"
}