{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Frontend Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "Results-driven Senior Frontend Engineer with 8 years of experience specializing in advanced front-end technologies like **React**, **Next.js**, and **TypeScript** to create high-performance applications. Proven track record in utilizing AI frameworks, including **OpenAI** and **Hugging Face**, with hands-on experience in integrating **WebGL**, **Three.js**, and **React Three Fiber** for immersive, interactive interfaces. Proficient in UI/UX design using tools like **Figma** and **Tailwind** to develop aesthetically pleasing and responsive designs.\n\nSkilled in working with modern testing frameworks such as **Cypress**, **Playwright**, and **Vitest**, ensuring top-quality deliverables. I leverage **REST** and **GraphQL** for efficient data management and real-time applications, and I excel in implementing **WebSocket** for dynamic client-server communication.\n\nComplementing my technical prowess, I bring a robust background in full-stack development using **Node.js** and **Python**, along with a strong foundation in **Docker** for containerization. My experience includes effectively leading projects in the healthcare and financial sectors, emphasizing compliance with standards such as HIPAA and PCI DSS. I am passionate about building innovative solutions that harness the power of AI/ML for improved functionality and user experience.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Frontend Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Utilized **React** (17-18) and **Next.js** to architect and develop user-centric frontend components for scalable healthcare and financial applications, enhancing UI/UX experience through integration with design systems and tools like **Figma** and **Storybook**.\nImplemented asynchronous communication and data fetching patterns using **REST** and **GraphQL**, ensuring smooth interactions between frontend and backend services while maintaining high performance.\nParticipated in the development of interactive graphics and animations leveraging libraries such as **Three.js** and **WebGL**, delivering engaging healthcare data visualizations and real-time analytics through powerful dashboards.\nDesigned reusable component libraries with **Radix UI** and **Tailwind** for consistent styling and functionality across multiple projects, reducing development time by **30%**.\nCollaborated with backend engineers to integrate complex data handling and state management using **Node.js** and **Python**, ensuring optimal frontend performance and user experience across platforms.\nFostered the implementation of responsive design principles and mobile-first strategies, ensuring full compatibility across various devices and platforms.\nConducted thorough unit and integration testing utilizing **Cypress** and **Vitest**, achieving **95%** test coverage and maintaining high reliability in delivery cycles.\nEnhanced application interactivity and responsiveness by using **WebSocket** for real-time updates, supporting features like patient alerts and transaction notifications.\nContributed to AI-based feature development utilizing interfaces like **OpenAI** and **Hugging Face**, integrating predictive models to personalize user experience and improve engagement metrics.\nEngaged in performance optimization and code reviews, leading initiatives that reduced load times for key application features by **50%**, while also mentoring junior team members on best practices in frontend engineering."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "• **Led** the design and implementation of user-centric applications using **React (18)**, **Next.js**, and **TypeScript**, focusing on responsive UI/UX and performance optimizations.\n• **Created** interactive animations and visual components with **Three.js**, **WebGL**, and **React Three Fiber** to enhance user engagement in financial dashboards.\n• **Developed** end-to-end solutions incorporating **REST** and **GraphQL** APIs for seamless data retrieval and integration across platforms.\n• **Utilized** **Tailwind CSS** for styling, ensuring mobile-first design principles and consistency across multiple application interfaces.\n• **Implemented** automated testing strategies using **Playwright**, **Cypress**, and **Vitest** to ensure high code quality and functionality in production-ready applications.\n• **Adopted** Agile methodologies using **Figma** for prototyping and user testing, resulting in a **30%** increase in user satisfaction based on feedback.\n• **Collaborated** in cross-functional teams to build and maintain a **robust** microservices architecture using **Node.js** (NestJS/Express) and **Python**.\n• **Integrated** advanced AI features using **OpenAI**, **Hugging Face**, and **LangChain** tools to deliver enhanced functionalities such as chatbots and predictive text in user interfaces.\n• **Created** efficient ETL pipelines for data ingestion, utilizing cloud services such as **Azure Data Factory** and Docker for deployment, enhancing data processing throughput by **25%**."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Developed and optimized scalable frontend applications using **React (18)**, **Next.js**, **TypeScript**, and **Tailwind CSS** to deliver fast, responsive user experiences across mobile and web platforms, reaching over **1M** users monthly.\nEngineered engaging UI components through **Storybook**, leveraging design systems to maintain consistency and reusability, enhancing UI/UX design alongside tools like **Figma** and **Framer**.\nIntegrated and executed animations and interactions utilizing **WebGL**, **Three.js**, and **React Three Fiber**, enhancing user engagement and visual appeal of applications.\nImplemented real-time data features using **WebSocket** protocols for live updates in user interfaces and engaging experiences, currently serving **10+** dynamic dashboards.\nConducted tests using **Cypress**, **Vitest**, and **Playwright**, achieving **95%** test coverage to ensure reliability and responsiveness of applications.\nCollaborated on the integration of AI features utilizing **OpenAI** and **Hugging Face** frameworks, significantly improving user interaction and personalization of content based on behavioral data.\nUtilized **Docker** for containerization of applications, ensuring consistent development and deployment processes across environments while improving build times by **40%**.\nExecuted RESTful and GraphQL APIs for seamless data fetching, ensuring optimal performance and user experience while supporting high-volume transactions.\nMaintained performance and accessibility standards, adhering to WCAG 2.1, ensuring an inclusive experience for all users.\nManaged and optimized third-party integrations with payment gateways like **Stripe**, ensuring secure and seamless payment workflows while maintaining PCI compliance."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, JavaScript, TypeScript\n\n **Frontend Frameworks:**\n\tReact, Next.js, Vue, Angular, React Three Fiber, Tailwind, Storybook, Radix UI\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django, Node.js\n\n **API Technologies:**\n\tREST, GraphQL, WebSocket\n\n **Serverless and Cloud Functions:**\n\tAWS (Lambda), Azure (App Services)\n\n **Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD\n\n **Cloud & Infrastructure:**\n\tAWS (ECS, RDS, S3), Azure (Blob, SQL), Terraform, Ansible, Helm, Docker Compose\n\n **Other:**\n\tAI, MLflow, Airflow, Kubeflow, OpenAI, Hugging Face, LangChain, Stable Diffusion, ComfyUI, Midjourney, LLM, UI/UX, animation, Figma, Framer, Playwright, Vitest, Cypress",
  "apply_company": "Noxx"
}