{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Angular Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Senior Angular Engineer with 13+ years of experience in developing high-performance applications, specializing in **Angular**, **TypeScript**, and **Tailwind**. Adept in creating responsive web designs optimized for mobile compatibility and user experience. Proven track record in Agile and Scrum methodologies, fostering collaborative team environments.\nSkilled in performance optimization, debugging, and crafting technical documentation that enhances project clarity and collaboration. Strong problem-solving abilities and meticulous attention to detail ensure the delivery of robust and efficient solutions.\nWith extensive hands-on experience in both frontend and backend technologies like **React**, **Next.js**, **Vue**, **Node.js**, **Flutter**, **FastAPI**, and **Django**, I have successfully built AI/ML-powered platforms for predictive analytics and real-time processing. Proficient in deploying cloud-native systems on **AWS** and **Azure**, implementing microservices, event-driven architectures, and maintaining CI/CD pipelines while adhering to compliance standards such as HIPAA and PCI DSS.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Angular Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Utilized **Angular** and **TypeScript** to develop high-performance, responsive web applications, ensuring optimal usability and mobile compatibility across different devices.\nCollaborated with UI/UX designers to implement aesthetically pleasing interfaces with **Tailwind**, enhancing user experience through responsive web design principles.\nParticipated in Agile methodologies and Scrum practices to streamline development processes and effectively manage project timelines, resulting in a **30%** increase in delivery efficiency.\nPerformed extensive debugging and performance optimization on applications, identifying bottlenecks and enhancing load times by **25%**.\nCreated comprehensive technical documentation for API integrations and feature implementations, ensuring clarity and maintainability for future developers.\nAdopted strong problem-solving skills to address user feedback and technical challenges, leading to improved application stability and user satisfaction rates by **15%**.\nEngaged in regular code reviews and teamwork sessions to foster collaboration and attention to detail in all project phases, contributing to a cohesive development environment.\nContributed to the development of mobile-compatible versions of web applications, ensuring cross-platform functionality and accessibility.\nAssisted in the design and implementation of CI/CD practices which integrated automated testing and deployment, cutting down deployment times by **40%**."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Designed and developed dynamic, interactive front-end applications using **Angular** and **TypeScript**, adhering to **UI/UX** best practices to create responsive web designs compatible with various devices.\nImplemented **Tailwind CSS** for styling, ensuring sleek visual interfaces and enhancing user experience across all financial tools and admin panels.\nUtilized Agile and Scrum methodologies to effectively manage project deliverables, ensuring timeliness, quality, and stakeholder satisfaction in a fast-paced development environment.\nConducted thorough performance optimization and debugging processes to enhance application efficiency, achieving load times improved by **30%** in high-traffic scenarios.\nAuthored detailed technical documentation for applications and features, facilitating knowledge transfer and enhancing team collaboration.\nDemonstrated strong problem-solving skills while addressing complex technical challenges, leading to a **25%** reduction in issue resolution time.\nMaintained a keen attention to detail during the development lifecycle to ensure high-quality deliverables that align with both business needs and user expectations."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Developed and optimized engaging user interfaces for web and mobile applications using **Angular** and **TypeScript**, ensuring responsive web design and mobile compatibility to enhance user experience.\nConducted performance optimization techniques on both frontend and backend systems, identifying bottlenecks and enhancing loading speeds by up to **40%**.\nCollaborated in an Agile team environment, utilizing **Scrum** methodology to deliver features in increments, improving team efficiency by **25%** and ensuring timely project delivery.\nCreated detailed technical documentation to support development processes and assist other engineers in troubleshooting and debugging, maintaining high standards of clarity and attention to detail.\nEmployed **Tailwind CSS** for styling, enabling rapid UI development and ensuring consistency and maintainability across the application’s design.\nImplemented responsive web design principles adhering to best practices for accessibility (WCAG 2.1), ensuring an inclusive experience for all users.\nLeveraged problem-solving skills to address complex technical challenges, resulting in a **30%** reduction in bug rates during the QA phase of product releases.\nEnhanced UI/UX through iterative testing and user feedback, fostering a user-centered design approach that directly contributed to increased user engagement and satisfaction rates."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, JavaScript, TypeScript\n\n **Frontend Frameworks:**\n\tReact, Vue, Angular, Tailwind\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n **API Technologies:**\n\tOAuth2, JWT\n\n **Serverless and Cloud Functions:**\n\tAWS Lambda, Azure App Services\n\n **Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:**\n\tAWS (ECS, RDS, S3), Azure (Blob Storage, SQL Database)\n\n **Other:**\n\tMLflow, Airflow, Kubeflow, Nginx, Let’s Encrypt, Certbot, UI/UX, Responsive Web Design, Mobile Compatibility, Agile, Scrum, Performance Optimization, Debugging, Technical Documentation, Problem Solving, Attention to Detail",
  "apply_company": "Gizli"
}