{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior QA Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Accomplished Senior QA Engineer with 13+ years of expertise in Manual Testing, Web Testing, Mobile Testing, and Automation within high-performance applications across healthcare and financial sectors. Proficient in using **Jira** for project management and **TestRail** for test case management, while demonstrating deep knowledge of the Software Development Life Cycle (SDLC) and Software Testing Life Cycle (STLC). Experienced in A/B Testing methodologies to enhance user experience and software reliability.\n\nSkilled in SQL for database testing and API testing to ensure seamless integration and data integrity. Strong background in collaborating with development teams using **Git** for version control. Leverage a tech stack including **JavaScript/TypeScript**, **Python**, and frameworks like **React**, **Node.js**, **Django**, and **AWS** for continuous improvement and efficient operations. Committed to delivering reliable and compliant software solutions aligned with industry standards.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior QA Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Executed comprehensive web and mobile testing strategies, leveraging **Jira** for issue tracking and **TestRail** for test case management, ensuring quality delivery of critical applications in healthcare and fintech domains.\nApplied **Manual Testing** and **Mobile Testing** techniques to validate functionalities across both iOS and Android apps developed with **Flutter** and **React Native**, ensuring compliance with industry standards and user expectations.\nConducted thorough **Web Testing** and API validations, performing robust checks on backend systems built using **Python** and **Node.js**, while implementing **Automation** frameworks for efficient regression testing.\nImplemented continuous testing practices within CI/CD pipelines, embedded with **Git** for version control and seamless integration with **CircleCI** and **GitHub Actions** to facilitate higher release frequencies with consistent quality.\nDeveloped and maintained SQL queries for data validation and integrity checks, ensuring backend databases like **PostgreSQL** and **MongoDB** supported reliable ingestion and retrieval of data.\nParticipated actively in the **SDLC** and **STLC** phases, collaborating with cross-functional teams to influence product quality from the early design stages through deployment.\nExecuted A/B testing methodologies to assess feature performance and optimize user experiences across applications.\nDefined and enforced testing strategies utilizing a combination of test automation tools and manual methodologies, ensuring comprehensive coverage for unit, integration, and end-to-end tests.\nEngaged in documenting test plans and results using **TestRail**, facilitating clearer communication with stakeholders and improving overall project transparency.\nActively contributed to retrospectives and sprint planning meetings using **Jira** for tracking QA tasks and ensuring team alignment on quality goals."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Conducted comprehensive **manual testing** and **web/mobile testing** strategies to ensure functionality and performance across financial applications, leveraging **TestRail** and **Jira** for effective issue tracking and reporting.\nExecuted **A/B testing** to optimize user experience and interface performance, increasing engagement by **25%** within the first quarter.\nCollaborated closely within the **SDLC** and **STLC** frameworks to enhance product quality from inception to delivery, resulting in a **30%** reduction in post-deployment defects.\nUtilized **Git** for robust version control and collaboration on code reviews and team projects, ensuring consistent quality standards across the development team.\nPerformed **API testing** to validate the functionality of financial services, achieving a **99%** success rate in critical endpoints that handle transactions.\nEngaged in **automation testing** for regression and performance scenarios, enhancing testing efficiency by **40%** through scripting and execution of automated test cases.\nEnsured data integrity by conducting **SQL** queries to verify back-end data against user-facing applications, supporting data-driven decision-making processes.\n"
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Executed comprehensive **Manual Testing** and **Web Testing** on multiple platforms, ensuring high-quality standards and rigorous adherence to **SDLC** and **STLC** methodologies.\nEngaged in **Mobile Testing** to validate mobile application functionality, usability, and compatibility across various devices and operating systems.\nUtilized **Jira** for meticulous bug tracking, reporting, and project management, ensuring seamless collaboration within the QA team and across departments.\nDeveloped and maintained test cases in **TestRail**, streamlining testing processes and enhancing documentation accuracy over **200** test scenarios.\nEmployed **A/B Testing** strategies to assess user interactions and improve application features based on analytical data and user feedback, resulting in a **15%** increase in user satisfaction.\nCollaborated with developers using **Git** for version control, facilitating code review processes and maintaining code quality across a team of **9** developers.\nConducted extensive **API Testing** to validate integration points between components, ensuring data accuracy and reliability for more than **10** service endpoints.\nExecuted **Automation** testing scripts to optimize testing cycles, reducing manual effort by approximately **30%** while increasing test coverage across the application.\nWorked closely with the development team to understand system functionality and provide feedback that drives improvements, maintaining a focus on user experience and quality control.\nParticipated in sprint planning and retrospectives, contributing insights from testing phases to enhance the software development process and foster a culture of quality assurance throughout the team."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython: FastAPI, Flask, Django\n\tJavaScript/TypeScript: React, Vue, Angular\n\n **Backend Frameworks:**\n\tFastAPI\n\tFlask\n\tDjango\n\n **Frontend Frameworks:**\n\tReact\n\tVue\n\tAngular\n\n **API Technologies:**\n\tAPI\n\n **Serverless and Cloud Functions:**\n\tAWS: ECS, Lambda, RDS, S3\n\tAzure: App Services, Blob Storage, SQL Database\n\n **Databases:**\n\tPostgreSQL (Fintech)\n\tMySQL (Healthcare)\n\tMongoDB (Gaming)\n\tRedis\n\tSQL\n\n **DevOps:**\n\tDocker\n\tKubernetes\n\tGitHub Actions\n\tGitLab CI/CD\n\tTerraform\n\tAnsible\n\tHelm\n\tDocker Compose\n\n **Cloud & Infrastructure:**\n\tAWS\n\tAzure\n\n **Other:**\n\tManual Testing\n\tWeb Testing\n\tMobile Testing\n\tTestRail\n\tJira\n\tSDLC\n\tSTLC\n\tA/B Testing\n\tGit\n\tAutomation\n\tMLflow\n\tAirflow\n\tKubeflow\n\tKeycloak (OIDC, RBAC)\n\tOAuth2\n\tJWT\n\tNginx\n\tLet’s Encrypt\n\tCertbot",
  "apply_company": "OBRIO"
}