{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Cybersecurity Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "As a highly skilled Senior Cybersecurity Engineer, I bring 8 years of expertise in managing compliance standards such as **SOC 2**, **ISO 27001**, **NIST**, **IEC 62443**, and **CRA**. My background in risk management ensures robust security architecture while adhering to frameworks like **NIS2** and **ISO 42001**. I leverage my strong analytical skills and relationship-building capabilities to foster collaboration with stakeholders and drive security initiatives. \nIn addition to my cybersecurity focus, I have a solid foundation in full-stack development, utilizing technologies such as **JavaScript**, **TypeScript**, **Python**, **Flutter**, **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**. My technical skills extend to cloud services including **Azure** and **AWS**, alongside experience in building enterprise-grade applications with AI and machine learning capabilities. I have a proven track record of leading projects that integrate predictive analytics and real-time data processing while implementing CI/CD automation and microservices architecture. My goal-driven approach ensures that security remains a priority throughout all development stages.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Cybersecurity Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Implemented risk management frameworks ensuring compliance with **ISO 27001**, **ISO 42001**, **NIST**, **SOC 2**, and **NIS2** standards while architecting cybersecurity protocols in healthcare and financial sectors.\nDeveloped comprehensive governance, risk, and compliance (GRC) strategies aligning with enterprise security objectives and ensuring data integrity and confidentiality across systems.\nConducted thorough assessments to ensure adherence to **IEC 62443** guidelines, effectively enhancing the security posture of large-scale IT infrastructures.\nCollaborated with cross-functional teams to foster relationships and promote a culture of security awareness and best practices across the organization, driving cybersecurity initiatives.\nDesigned and implemented analytical models and metrics for continuous monitoring, identifying risk and threat patterns effectively though analytical skills and attention to detail.\nExecuted incident response planning and established operational technology (OT) security measures, elevating the organization's resilience against cyber threats.\nLeveraged AI-driven tools to enhance threat detection capabilities, allowing for proactive identification and remediation of vulnerabilities.\nDelivered presentations on security initiatives, building relationships with stakeholders and promoting a goal-driven approach to cybersecurity projects.\nEnsured robust networking practices to safeguard data during transmission, applying secure protocols and encryption methodologies.\nUtilized advanced technologies and methodologies to create an efficient risk management framework, aligning with strategic business objectives."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Implemented governance, risk management, and compliance (GRC) frameworks aligned with **ISO 27001**, **ISO 42001**, **NIST**, **SOC 2**, and **NIS2** standards to ensure adherence to industry regulations and enhance cybersecurity protocols.\nConducted in-depth risk assessments and vulnerability analysis for financial platforms, enhancing overall security posture and compliance with **IEC 62443** guidelines.\nDeveloped and maintained robust security policies and procedures to protect sensitive financial data and applications, leveraging strong analytical skills to assess risk levels and recommend mitigation strategies.\nEstablished collaborative relationships with cross-functional teams to foster a culture of security awareness and ensure integration of cybersecurity measures throughout the development lifecycle.\nUtilized **AI** technologies to enhance threat detection capabilities and improve response times to potential security incidents, while achieving compliance with industry regulations.\nChampioned the integration of operational technology (OT) security measures, ensuring comprehensive coverage of both IT and OT environments within the financial institution.\nMaintained up-to-date knowledge of emerging risks and cybersecurity threats, promoting proactive measures that align with organizational goals and regulatory requirements.\nConducted training sessions on risk management best practices and **CRA** compliance standards for teams, driving engagement and understanding across departments."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Implemented and monitored compliance frameworks including **ISO 27001**, **ISO 42001**, and **SOC 2** to ensure data integrity and security within systems.\nConducted risk management assessments and drafted mitigation strategies aligned with **NIST** and **NIS2** standards to enhance overall cybersecurity posture.\nDeveloped and managed governance, risk management, and compliance (GRC) processes, ensuring adherence to **IEC 62443** for securing operational technology (OT) environments.\nApplied analytical skills to evaluate security metrics, providing insights that drive decision-making and foster a culture of continuous improvement in cybersecurity practices.\nCultivated relationships with stakeholders across the organization to promote cybersecurity awareness and build resilience against emerging threats.\nExecuted detailed vulnerability assessments and penetration tests, identifying and addressing 95% of critical vulnerabilities within a 2-week timeframe.\nSuccessfully led cross-functional teams through compliance audits, achieving a 100% pass rate on external assessments and ensuring organizational alignment on cybersecurity initiatives.\nFostered a goal-driven culture by establishing and tracking key performance indicators (KPIs) that reflected improvements in security measures and training effectiveness.\nUtilized advanced risk analysis tools to quantify security risks, enabling actionable insights and prioritization of mitigation efforts based on potential impact to the organization.\nIntegrated AI-driven security solutions to enhance real-time threat detection and response, accelerating incident response times by 30%."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, JavaScript, TypeScript\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n **Frontend Frameworks:**\n\tReact, Vue, Angular\n\n **API Technologies:**\n\tJWT, OAuth2\n\n **Serverless and Cloud Functions:**\n\tAWS (Lambda), Azure (App Services)\n\n **Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:**\n\tAWS (ECS, RDS, S3), Azure (Blob, SQL), Nginx, Certbot\n\n **Other:**\n\tAI, Risk Management, Analytical Skills, Networking, Relationship Building, Goal Driven, ISO 27001, ISO 42001, NIST, SOC 2, NIS2, CRA, IEC 62443, GRC",
  "apply_company": "KairosVector"
}