{
  "name": "Patryk Zaslawski",
  "role_name": "Senior FrontEnd Engineer",
  "email": "patrykzas0428@outlook.com",
  "phone": "+48669862402",
  "address": "Gdanski, Poland",
  "linkedin": "https://www.linkedin.com/in/patryk-z-9b9455391/",
  "profile_summary": "As a Senior Frontend Engineer with 8+ years in software engineering, I possess a robust skill set in **C#**, **.Net**, **HTML**, **CSS**, and **JavaScript**, ensuring the development of responsive and adaptive designs that align with modern UI/UX principles. My proficiency in **Git** and **Azure DevOps** enhances collaboration and workflow efficiency, while ensuring cross-browser compatibility for diverse user experiences. Additionally, my background as a Senior Python Full Stack Developer enables me to leverage **Python** and frontend frameworks such as **Angular**, **Vue**, **React**, and **Next.js** for full-scale application solutions. I have a proven track record in building high-performance, secure applications for sectors including e-commerce, financial, and healthcare, focusing heavily on system optimization. My expertise in database management with **PostgreSQL**, **MySQL**, and **MongoDB** further complements my front-end development capabilities.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2014",
      "to_year": "2017",
      "location": "United Kingdom",
      "university": "The University of Manchester"
    }
  ],
  "experience": [
    {
      "role": "Senior FrontEnd Engineer",
      "company": "Binary Studio",
      "from_date": "Aug 2023",
      "to_date": "Present",
      "location": "United Kingdom (Remote)",
      "responsibilities": "- Developed responsive user interfaces using **HTML**, **CSS**, and **JavaScript**, ensuring cross-browser compatibility and adherence to adaptive design principles.\n- Leveraged **C#** and **.Net** frameworks to integrate backend services, collaborating with teams to enhance UI/UX in applications for seamless user experiences.\n- Utilized **Git** for version control, ensuring effective collaboration with a cross-functional team during the development of front-end solutions.\n- Championed the implementation of UI/UX best practices, conducting usability tests to optimize the patient and healthcare provider experience, achieving a **30%** increase in user satisfaction.\n- Streamlined the development process by configuring and maintaining CI/CD pipelines with **Azure DevOps**, achieving a **25%** reduction in deployment time.\n- Conducted code reviews and mentored junior engineers in front-end technologies, ensuring high-quality code and design consistency across projects.\n- Integrated responsive design techniques to enhance mobile and desktop experiences, accounting for **1000+** unique device resolutions.\n- Improved application performance by optimizing **JavaScript** execution, achieving a **40%** reduction in load time on key interfaces.\n- Championed accessibility standards in the development of UI components, ensuring compliance with WCAG 2.1 guidelines for **95%** of application elements.\n- Collaborated with backend teams to ensure seamless data integration, focusing on optimizing API calls to improve application responsiveness by **20%**."
    },
    {
      "role": "Software Engineer",
      "company": "Ardigen",
      "from_date": "Mar 2020",
      "to_date": "Aug 2023",
      "location": "Poland",
      "responsibilities": "Developed responsive user interfaces with a focus on **HTML**, **CSS**, and **JavaScript**, ensuring cross-browser compatibility and enhanced UI/UX for various banking applications, leading to a 30% increase in user satisfaction scores.\nUtilized version control tools like **Git** for collaborative development, ensuring efficient code management and deployment processes within a team of 9 engineers.\nDelivered front-end components integrated with robust backends using **Python** frameworks such as **FastAPI**, **Django**, and **Flask**, aligning with backend upgrades that improved application performance by 25%.\nCollaborated closely with backend developers to design and implement RESTful and gRPC APIs in **Python**, enabling seamless communication and efficient data transactions for mobile banking applications.\nMaintained and improved legacy C# and **.NET** applications, leading the transition to modern front-end frameworks (**Angular**, **Vue**, **React**, and **Next.js**) within a 6-month timeframe, significantly enhancing code maintainability.\nImplemented responsive design principles to create user-centric applications, resulting in a 40% reduction in bounce rates on key financial platforms.\nEnhanced application logic using state management libraries like Redux and NgRx to optimize performance across complex user interactions.\nWorked with **Azure DevOps** for continuous integration and deployment (CI/CD), automating build processes and reducing deployment times by 50%.\nParticipated in user research phase to gather feedback and iterate on design improvements, leading to a measurable increase in user engagement metrics by 20%.\nConducted thorough testing of UI components ensuring quality and compliance with best practices by integrating unit tests and cross-browser testing tools.\nFostered team collaboration by mentoring junior front-end engineers on UI/UX best practices, resulting in increased team productivity and innovation."
    },
    {
      "role": "Software Engineer",
      "company": "Altum Software",
      "from_date": "Oct 2017",
      "to_date": "Feb 2020",
      "location": "United Kingdom",
      "responsibilities": "Designed and developed responsive user interfaces using **HTML5**, **CSS3**, and **JavaScript**, ensuring cross-browser compatibility and optimal UI/UX in line with modern design standards.\nOptimized existing frontend workflows by implementing responsive design strategies to enhance user experience on various devices.\nCollaborated with backend teams to integrate **Python APIs** seamlessly, developing robust applications with a focus on performance and usability.\nUtilized version control systems such as **Git** to manage codebase and streamline collaboration, resulting in a **30%** improvement in deployment efficiency.\nAutomated testing processes using modern frameworks and tools, ensuring cross-browser compatibility and adherence to coding standards for front-end development.\nLed design sessions to create and iterate on adaptive design elements, improving overall accessibility and user satisfaction across platforms by **25%**.\nManaged deployment pipelines with **Azure DevOps**, ensuring consistent delivery of frontend assets and build automation, effectively reducing deployment time by **40%**.\nEnhanced application performance by conducting load and stress testing with tools like JMeter and **k6**, achieving improved response times during peak use.\nMentored junior developers in best practices for frontend development, fostering a collaborative environment focused on skill enhancement and code quality.\nDeveloped SEO-optimized websites leveraging modern frameworks like **React**, **Angular**, and **Vue** integrated with backend systems to enhance mobile access and performance."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, C#, JavaScript\n\n **Backend Frameworks:**\n\tFastAPI, Django, Flask, Spring Boot, .Net\n\n **Frontend Frameworks:**\n\tAngular (1–16), React (15–18), Next.js, Vue.js (2/3), HTML, CSS\n\n **API Technologies:**\n\tREST & gRPC APIs, JWT, OAuth2\n\n **Serverless and Cloud Functions:**\n\tAWS (Lambda), Azure (App Services)\n\n **Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Azure DevOps\n\n **Cloud & Infrastructure:**\n\tAWS (ECS, RDS, S3), Azure (Blob, SQL), Nginx, Certbot\n\n **Other:**\n\tSQLAlchemy, Pydantic, Celery, Keycloak (OIDC, RBAC), UI/UX, responsive design, adaptive design, cross-browser compatibility, Git",
  "apply_company": "Greenberg Traurig"
}