{
  "name": "Patryk Zaslawski",
  "role_name": "Senior Web Game Developer (Phaser + AI)",
  "email": "patrykzas0428@outlook.com",
  "phone": "+48669862402",
  "address": "Gdanski, Poland",
  "linkedin": "https://www.linkedin.com/in/patryk-zaslawski-6b04a8397/",
  "profile_summary": "As a seasoned **Senior Web Game Developer** with 8+ years of experience, I excel in implementing **backend logic** and developing **REST APIs** with a focus on **Node.js** to deliver engaging gaming experiences. Proficient in **Phaser** for game development and **TypeScript** for robust, scalable code, I am well-versed in integrating **AI tools** and **anti-cheat systems** to enhance gameplay and ensure fair competition. My experience encompasses using real-time communication via **WebSockets**, alongside cloud deployment with **Coolify** for optimal performance. I thrive in high-pressure environments, consistently delivering projects aligned with user expectations and industry standards.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2014",
      "to_year": "2017",
      "location": "United Kingdom",
      "university": "The University of Manchester"
    }
  ],
  "experience": [
    {
      "role": "Senior Web Game Developer (Phaser + AI)",
      "company": "Binary Studio",
      "from_date": "Aug 2023",
      "to_date": "Present",
      "location": "United Kingdom (Remote)",
      "responsibilities": "- Designed and implemented **REST APIs** for game backend logic using **Node.js** and **Elysia**, enhancing performance and user interaction through real-time data exchange.\n- Developed anti-cheat systems using advanced **AI tools** to ensure fair gameplay, incorporating machine learning algorithms and real-time monitoring techniques.\n- Integrated **WebSockets** into gameplay features for real-time communication between clients and servers, providing seamless interactions and experiences.\n- Spearheaded development with **TypeScript** to enhance code maintainability and readability across the game development project, improving team productivity by **25%**.\n- Streamlined the development process using **Phaser** game framework, creating immersive 2D gaming experiences and reducing build times by **40%**.\n- Established a CI/CD pipeline using **Coolify** for efficient deployment of game updates, achieving faster iterations and reducing downtime during releases.\n- Mentored a team of **5+** junior developers in best practices for **Node.js** and **TypeScript**, fostering an environment of learning and collaboration.\n- Collaborated with UX/UI designers to optimize player interfaces, implementing feedback loops that increased user engagement metrics by **30%**.\n- Conducted performance testing and optimization to ensure smooth gameplay experiences across various platforms, utilizing profiling tools to improve load times by **50%**.\n- Employed modular design principles in game architecture to facilitate scalability and the addition of new features without impacting existing functionality."
    },
    {
      "role": "Software Engineer",
      "company": "Ardigen",
      "from_date": "Mar 2020",
      "to_date": "Aug 2023",
      "location": "Poland",
      "responsibilities": "Developed and integrated robust **REST APIs** with **Node.js** and **TypeScript**, optimizing backend logic for seamless gameplay experiences in web games.\nUtilized **Phaser** to create engaging user-centric game dynamics, ensuring high performance and scalability in real-time interaction.\nImplemented real-time features with **WebSockets**, enhancing player engagement through live updates and interactive game elements.\nCollaborated with AI tools to enhance game intelligence and player interaction, providing a tailored gaming experience that responds to player behavior.\nDesigned and deployed microservices architecture using **Coolify**, improving deployment efficiency and reducing downtime by **30%**.\nIncorporated anti-cheat systems into the gaming framework, safeguarding the integrity of gaming environments and maintaining fairness among players.\nBuilt and optimized dynamic game features through efficient backend processes, ensuring compatibility with **Elysia** for enhanced functionality.\nConducted performance tuning on the game server to support up to **1000+ concurrent users**, ensuring smooth gameplay under high load conditions.\nLed the development of automated testing strategies for continuous integration and delivery using modern CI/CD practices, resulting in a **20%** increase in deployment frequency.\nDeveloped comprehensive documentation of game systems and APIs, facilitating onboarding and knowledge transfer among team members and stakeholders."
    },
    {
      "role": "Software Engineer",
      "company": "Altum Software",
      "from_date": "Oct 2017",
      "to_date": "Feb 2020",
      "location": "United Kingdom",
      "responsibilities": "• Developed innovative game backend logic using **Node.js** and **Phaser**, ensuring seamless gameplay experiences and effective anti-cheat systems.\n• Created and optimized **REST APIs** for real-time game interactions, facilitating smooth communication between client and server, enhancing performance by **30%**.\n• Implemented **WebSockets** for real-time player interactions and dynamic gameplay updates, successfully maintaining player engagement.\n• Integrated **AI tools** to enhance game mechanics and promote interactive gameplay, improving player retention rates by **25%**.\n• Utilized **TypeScript** for robust game code development, ensuring type safety and reducing runtime errors by **40%**.\n• Collaborated on cross-platform game development, ensuring compatibility across devices through efficient use of **Phaser** features and responsive design techniques.\n• Engaged in performance optimization, leveraging profiling tools to identify bottlenecks and enhance backend processing speeds by **15%**.\n• Managed containerized game applications using **Coolify**, streamlining deployment processes and enhancing scalability across various environments.\n• Participated in Agile development practices, contributing to sprint planning and retrospectives for continuous improvement in development cycles.\n• Conducted code reviews using best practices to maintain high code quality and foster collaborative team dynamics."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, TypeScript\n\n **Backend Frameworks:**\n\tFastAPI, Django, Flask, Spring Boot, Node.js, Elysia\n\n **Frontend Frameworks:**\n\tAngular (1–16), React (15–18), Next.js, Vue.js (2/3), Phaser, Blazor\n\n **API Technologies:**\n\tREST APIs, REST & gRPC APIs, WebSockets\n\n **Serverless and Cloud Functions:**\n\tAWS (Lambda), Coolify\n\n **Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, AWS (ECS, RDS, S3), Azure (App Services, Blob, SQL)\n\n **Cloud & Infrastructure:**\n\tKeycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot\n\n **Other:**\n\tAI tools, anti-cheat systems, backend logic"
}