{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Intermediate Software Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-623a26390/",
  "profile_summary": "Intermediate Software Engineer with 13+ years of experience specializing in delivering high-performance applications, particularly in compliance-driven environments such as healthcare and finance. Proficient in **Ruby on Rails**, **JavaScript**, **TypeScript**, with strong hands-on expertise in deploying **AWS** cloud-native systems and implementing **CI/CD** pipelines. Skilled in **Docker**, **Kubernetes**, and **Terraform** for efficient container orchestration and infrastructure management.\n\nExperienced in utilizing **PostgreSQL**, **Redis**, and **Elasticsearch** for robust data management solutions, and leveraging observability tools such as **Sentry** and **Datadog** to enhance application performance. Adept at fostering a collaborative work environment and maintaining strong communication skills, while championing innovative solutions that align with functional and technical requirements.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Intermediate Software Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Utilized **Ruby on Rails** to develop scalable server-side applications in alignment with modern web standards, ensuring seamless integration with various APIs.\nImplemented CI/CD pipelines using **GitHub Actions**, **CircleCI**, and **Sentry** for monitoring and alerting, achieving a deployment success rate of **99%**.\nEmployed **AWS** services for cloud infrastructure management and deployment, optimizing resource utilization that reduced operational costs by **20%**.\nCollaborated with cross-functional teams to ensure effective communication and project alignment, leveraging **Strong communication skills** and a **Collaborative mindset**.\nManaged containers and orchestration using **Docker** and **Kubernetes** to enhance application portability and scalability, facilitating a smoother transition to production environments.\nDesigned and configured databases using **PostgreSQL** and **Redis** to improve data retrieval times by **30%**, accommodating high-traffic scenarios efficiently.\nImplemented observability tools like **Datadog** for real-time performance monitoring, providing actionable insights that improved system reliability by **25%**.\nParticipated in code reviews and knowledge-sharing sessions, fostering an environment of continuous improvement and team collaboration.\nDeveloped front-end solutions with **Typescript** and **JavaScript**, optimizing load times and creating responsive, user-friendly interfaces.\nAutomated infrastructure growth and maintenance using tools like **Terraform**, ensuring efficient resource provisioning and version control in various environments.\nConfigured and deployed **Elasticsearch** for advanced search functionalities, enhancing data accessibility and improving user experience significantly."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Utilized **Ruby on Rails** and **PostgreSQL** to enhance the performance and scalability of core financial applications.\nImplemented **AWS** services, deploying applications using **Docker**, **Kubernetes**, and **Terraform** for streamlined infrastructure management and increased reliability.\nEnhanced CI/CD pipelines with **GitHub** and **CircleCI**, ensuring efficient code deployment and continuous integration for development environments.\nMonitored application performance and incidents through observability tools like **Datadog** and **Sentry**, achieving a 30% reduction in downtime.\nExecuted front-end development using **TypeScript**, **JavaScript**, and frameworks like **React** (18) and **Vue 3**, resulting in a 25% increase in user engagement through responsive design.\nCollaborated closely with cross-functional teams, leveraging strong communication skills to gather requirements and deliver solutions that align with business objectives.\nDesigned and maintained event-driven architectures utilizing **RabbitMQ** and **Kafka**, efficiently managing workflows and ensuring consistent message delivery.\nConstructed ETL pipelines with **Apache Airflow** for data processing from various financial data sources, achieving a processing time reduction of 40% through optimized batch and real-time processing.\nDeployed machine learning models using **scikit-learn** and **XGBoost** in **Azure ML** for fraud detection, improving detection rates by 20% through advanced analytics on user transaction patterns.\nCreated and managed ML pipelines for real-time credit scoring and churn prediction, integrating with backend services through **MLflow** and **Airflow**."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Developed and optimized backend services using **Ruby on Rails** within a cloud-native environment leveraging **AWS** services, ensuring high availability and scalability for complex applications.\nEngineered CI/CD pipelines using **CircleCI** and **GitHub**, facilitating seamless integrations and deployments, leading to a **30%** faster release cycle.\nImplemented containerization and orchestration strategies with **Docker** and **Kubernetes**, improving deployment consistency and resource utilization across **50+** cloud instances.\nDesigned data management solutions using **PostgreSQL** and **Redis** for efficient data retrieval and caching, enhancing application performance metrics by **40%**.\nApplied **Terraform** for infrastructure as code, streamlining environment setup and ensuring reproducibility across development and production.\nEnsured observability through integration of **Sentry** and **Datadog**, enabling real-time monitoring and alerting, which reduced downtime incidents by **20%**.\nCollaborated effectively within cross-functional teams, improving project outcomes and fostering a collaborative work culture through strong communication skills.\nEngaged in code reviews and mentorship, nurturing a collaborative mindset and enhancing overall code quality across the development team.\nUtilized **Elasticsearch** for advanced search capabilities, significantly increasing search speed and accuracy across the application domain.\nEnhanced frontend applications with **Typescript** and **JavaScript**, ensuring robust type-checking and improving maintainability across development teams.\nImplemented Git-based workflows, ensuring version control and collaborative development with best practices adhered to across the organization."
    }
  ],
  "skills": "Programming Languages:\n\tJavaScript, TypeScript, Python\n\n**Backend Frameworks:**\n\tRuby on Rails, FastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular, Webpack\n\n**API Technologies:**\n\tNginx, Keycloak (OIDC, RBAC), OAuth2, JWT\n\n**Serverless and Cloud Functions:**\n\tAWS: Lambda, ECS, RDS, S3, Azure: App Services, Blob Storage, SQL Database, Heroku\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis, Elasticsearch\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub, GitHub Actions, GitLab CI/CD, CircleCI, CI/CD, Terraform, Ansible, Helm, Pulumi\n\n**Cloud & Infrastructure:**\n\tAWS, Azure, Terraform, Docker, Kubernetes\n\n**Other:**\n\tStrong communication skills, Collaborative mindset, MLflow, Airflow, Kubeflow, Sentry, Datadog, Observability"
}