{
  "name": "Patryk Zaslawski",
  "role_name": "Test Automation Engineer",
  "email": "patrykzas0428@outlook.com",
  "phone": "+48669862402",
  "address": "Gdanski, Poland",
  "linkedin": "https://www.linkedin.com/in/patryk-zaslawski-77bb38396/",
  "profile_summary": "As a results-driven Test Automation Engineer with over 8 years of extensive experience in software engineering, I specialize in test automation and quality assurance methodologies. I have in-depth proficiency in **C#** and am certified in Microsoft Certified: Dynamics 365 Fundamentals, leveraging **Dynamics 365**, **Dataverse**, and **Power Platform Fundamentals** to enhance application testing workflows. My technical skills include automation frameworks such as **Playwright**, experience in test management tools like **Azure DevOps**, and proficiency in crafting **YAML** scripts for streamlined CI/CD processes. Additionally, I rigorously execute **SIT**, **E2E**, **UAT**, and **Regression Testing**, ensuring top-tier product quality through automated **API Testing** with tools like **Postman**. I bring strong analytical skills and a systematic approach to **Test Data Management** and **Performance Testing**, coupled with a comprehensive understanding of **SQL** for database validation, making certain that software solutions meet both performance and accessibility standards.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2014",
      "to_year": "2017",
      "location": "United Kingdom",
      "university": "The University of Manchester"
    }
  ],
  "experience": [
    {
      "role": "Test Automation Engineer",
      "company": "Binary Studio",
      "from_date": "Aug 2023",
      "to_date": "Present",
      "location": "United Kingdom (Remote)",
      "responsibilities": "Developed and executed test plans for software applications, ensuring compliance with requirements and adherence to best practices in software testing using **C#** and **Azure DevOps**.\nAutomated end-to-end (E2E) testing frameworks using **Playwright** and **SIT** methods to enhance testing efficiency and coverage for Dynamics 365 applications.\nImplemented API testing protocols utilizing **Postman** to validate RESTful services with a focus on response time under **2 seconds** for optimal performance and user experience.\nManaged and maintained test data environments with **Dataverse**, streamlining test data management processes and supporting the testing lifecycle for continuous integration.\nConducted regression testing and performance testing across applications with a target of achieving **99.9%** uptime and reliability in **UAT** and production environments.\nEstablished accessibility testing protocols to ensure applications meet compliance standards, resulting in a **30%** increase in usability scores for users with disabilities.\nLed cross-team collaboration on end-to-end testing initiatives, utilizing **YAML** for configuration management and ensuring traceability through clear documentation in test plans and reports.\nProvided mentorship to junior testers on BDD methodology using **ReqnRoll** and facilitated training sessions on **Test Data Management** strategies and **SQL** for effective database validation checks.\nAchieved ISTQB® Foundation and Microsoft Certified: Dynamics 365 Fundamentals certifications, ensuring top-tier testing practices are upheld within projects.\nEnabled rapid testing cycles by integrating testing workflows with **Azure DevOps**, enhancing deployment frequency by **25%** through the implementation of CI/CD pipelines.\nCollaborated with cross-functional teams to perform thorough **Accessibility Testing** and ensure compliance with relevant standards, focusing on enhancing overall user satisfaction.\nRegularly reviewed test documentation and results, providing actionable insights and facilitating continuous improvement in testing methodologies."
    },
    {
      "role": "Software Engineer",
      "company": "Ardigen",
      "from_date": "Mar 2020",
      "to_date": "Aug 2023",
      "location": "Poland",
      "responsibilities": "- Developed comprehensive **API Testing** strategies using tools like **Postman** and **Swagger**, ensuring robust validation of RESTful services and backend integrations.\n- Managed **Regression Testing** and **Performance Testing** for applications built in **C#** within **Dynamics 365**, enhancing application stability and user experience.\n- Collaborated with cross-functional teams to implement **Test Plans** and **SIT** (System Integration Testing), ensuring all components function seamlessly within **Dynamics 365** and **Dataverse** environments.\n- Conducted **End-to-End (E2E)** testing for features developed in **YAML** and **Azure DevOps**, ensuring delivery meets quality standards and project requirements for **Dynamics 365**.\n- Leveraged **Azure DevOps** for CI/CD pipelines, automating deployment processes and improving overall development efficiency by **30%**.\n- Developed automated scripts using **Playwright** for UI validation, achieving **95%** coverage of critical user flows and accessibility compliance.\n- Executed **User Acceptance Testing (UAT)** procedures, coordinating feedback sessions that resulted in a **20%** reduction in post-launch defects.\n- Utilized **Test Data Management** techniques to ensure effective data provisioning for testing scenarios, improving setup time by **40%**.\n- Participated in code reviews and applied principles from **ISTQB® Foundation** to enhance testing methodologies and maintain high standards of quality.\n- Supported integration testing and interface specifications in **Dynamics 365** for third-party tools, ensuring all business requirements were met consistently.\n- Created and maintained documentation for regression tests, test cases, and user stories using **Azure DevOps**, facilitating knowledge transfer and team collaboration.\n- Constructed reports using SQL for data analysis and quality metrics, enabling data-driven decisions to enhance overall project leads.\n- Coordinated with development teams to ensure successful implementation of **Accessibility Testing** practices, contributing to better user experiences for diverse user groups.\n- Authored automated test cases that logged metrics through Azure DevOps, yielding actionable insights on test coverage and application performance."
    },
    {
      "role": "Software Engineer",
      "company": "Altum Software",
      "from_date": "Oct 2017",
      "to_date": "Feb 2020",
      "location": "United Kingdom",
      "responsibilities": "Conducted comprehensive **API Testing** for backend services, ensuring all endpoints are functioning accurately and efficiently, utilizing tools such as **Postman** for validation.\nDesigned and executed **Performance Testing** strategies using **JMeter** and **Locust** to identify and mitigate system bottlenecks, ensuring optimal service response times under varying loads with a focus on achieving performance benchmarks.\nImplemented **Regression Testing** protocols during release cycles, using **Azure DevOps** for streamlined test management and ensuring no existing functionality was disrupted post-deployment.\nDeveloped and executed **E2E** and **SIT** test cases that leveraged automation frameworks such as **Playwright**, enhancing testing speed and accuracy.\nCreated and maintained **Test Plans** and documentation following the principles of **BDD** using **ReqnRoll**, facilitating clear communication among stakeholders and ensuring alignment with business requirements.\nManaged **Test Data Management** processes to ensure the availability of relevant datasets for accurate application testing and validation scenarios.\nLeveraged **SQL** for backend validation and direct database testing, confirming data integrity across transactional workflows in **Dynamics 365** applications.\nCarried out **Accessibility Testing** to ensure compliance with ADA standards, utilizing various tools to enhance user experience for all customers.\nAchieved **API Testing** automation via **Postman**, significantly reducing manual testing efforts and improving testing efficiency by 30%.\nContinued professional development through certifications such as **ISTQB® Foundation** and **Microsoft Certified: Dynamics 365 Fundamentals**, solidifying foundational knowledge in quality assurance and testing methodologies.\nCollaborated closely with development teams to enhance integration between test automation frameworks and existing systems ensuring smooth transitions from development to production environments."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, C#\n\n **Backend Frameworks:**\n\tFastAPI, Django, Flask, Spring Boot\n\n **Frontend Frameworks:**\n\tAngular (1–16), React (15–18), Next.js, Vue.js (2/3), Blazor\n\n **API Technologies:**\n\tREST & gRPC APIs, Postman, API Testing\n\n **Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n **Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis, SQL\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD\n\n **Cloud & Infrastructure:**\n\tAzure DevOps, YAML\n\n **Other:**\n\tKeycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, ReqnRoll (BDD), Playwright, Test Plans, SIT, E2E, UAT, Regression Testing, Performance Testing, Accessibility Testing, Test Data Management, ISTQB® Foundation, Microsoft Certified: Dynamics 365 Fundamentals, Power Platform Fundamentals"
}