{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior PHP Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Senior PHP Engineer with 13+ years of experience in delivering high-performance applications, specifically skilled in **PHP**, **Laravel**, **Magento**, and **Shopify**. Proficient in frontend technologies such as **React** and **Alpine.js**, with expertise in implementing robust API solutions and testing using **PHPUnit**. Experienced in utilizing project management tools like **JIRA** and leveraging version control systems such as **Git** for effective collaboration.\nDemonstrated ability in building scalable applications with a solid foundation in backend development, complemented by knowledge of cloud services like **AWS**. Proven track record in compliance-driven development and integrating sophisticated systems by implementing microservices and CI/CD practices. Strong background in developing AI/ML applications, with a focus on real-time analytics and automation.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior PHP Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Utilized **PHP** and **Laravel** to develop and maintain robust applications in the e-commerce ecosystem, specifically focusing on **Magento** platforms.\nImplemented site features using **Alpine.js** and **React** to enhance user experience, ensuring fast load times and responsiveness.\nCreated and executed test suites using **PHPUnit** to maintain code quality and reliability, achieving a **95%+** pass rate in production environments.\nCollaborated with cross-functional teams through **JIRA** for project tracking and task management, ensuring timely delivery of features and bug fixes.\nEstablished RESTful **API** integrations with third-party services, such as payment gateways and CRM systems, leading to a **30% reduction** in response times.\nVersioned releases and organized codebase using **Git**, following best practices for branching and merging to streamline development workflows.\nOptimized performance and scalability of applications leading to improved uptime from **98% to 99.9%**, which resulted in enhanced user satisfaction.\nManaged deployment processes on **AWS** for seamless application rollout, implementing monitoring and logging practices to track application performance.\n\n--- Original Strengths Follow ---\nDesigned and built full-stack platforms for healthcare and fintech using Python (FastAPI), TypeScript and Node.js, paired with modern front-end frameworks like React (17–18), Next.js, and Vue 3, ensuring full compliance with HIPAA, FHIR, GDPR, PCI DSS, and SOX.\nDelivered mobile applications for iOS and Android using Flutter and React Native, implementing native modules and managing state with Provider and Redux to support secure, real-time user interactions.\nCreated CI/CD pipelines tailored for mobile using Fastlane and App Center, incorporating test automation, release workflows, and crash analytics with Firebase Crashlytics and Sentry.\nLed the transformation of legacy systems into microservices architectures, leveraging Docker, Kubernetes (AKS/EKS), and serverless functions via AWS Lambda and Azure Functions for fault-tolerant, scalable deployments.\nBuilt and maintained data infrastructure using PostgreSQL, MongoDB, Redis, and GraphQL, designed to support heavy data ingestion and real-time analytics for both health and finance domains.\nDeployed ML models for risk scoring, fraud detection, and document classification using scikit-learn, PyTorch, and TensorFlow, with backend inference integrated into live systems.\nImplemented MLOps workflows using MLflow, DVC, and Airflow, managing model training, validation, and deployment pipelines across development and production.\nIntegrated intelligent features into frontend applications, such as personalized dashboards, predictive health alerts, and financial summaries, powered by models hosted on Azure ML and AWS Sagemaker.\nBuilt DevOps pipelines using GitHub Actions, CircleCI, and Azure DevOps, with full test automation, linting, security checks, and multi-environment deployment workflows.\nDeveloped advanced data visualization tools with D3.js, Chart.js, and Power BI Embedded, enabling real-time analysis of financial activity, fraud trends, and operational KPIs.\nCollaborated closely with ML teams to deploy NLP models (spaCy, Hugging Face Transformers) for document parsing and anomaly detection, exposed through secured REST APIs.\nDefined and enforced robust testing strategies across the stack using Jest, Cypress, Postman, and PyTest to cover unit, integration, E2E, and contract-level tests.\nIntegrated search capabilities with Azure Cognitive Search and Elasticsearch, supporting fast and flexible querying across structured and unstructured health and financial datasets."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Utilized **PHP** frameworks including **Laravel** and **Magento** to develop and maintain high-performance web applications for e-commerce platforms, enhancing user experience for over **10,000** daily active users.\nImplemented RESTful **API** services to facilitate seamless communication between front-end and back-end systems, reducing response time by **30%** through optimized query handling and data loading.\nCreated dynamic user interfaces with **React** and **Alpine.js**, achieving a **25%** increase in user engagement by improving navigation and accessibility.\nConducted rigorous unit testing using **PHPUnit**, achieving over **85%** code coverage and ensuring application stability during deployments.\nManaged development tasks and project timelines using **JIRA**, effectively coordinating work among a team of **5** developers to deliver projects on time.\nCollaborated with designers to employ **Livewire** for enhanced interactivity on web pages, resulting in a **15%** boost in conversion rates for targeted campaigns.\nIntegrated third-party tools and services through **Shopify** and **AWS**, leading to an **increase of $1M** in annual revenue through expanded product offerings and improved site reliability.\nOptimized version control processes with **Git**, streamlining collaboration and version history management for a team of developers."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Developed and maintained robust e-commerce applications using **PHP** (Laravel, Magento, Livewire), ensuring code quality through **PHPUnit** testing.\nLeveraged **API** integration to connect with various third-party services, enhancing application functionality and user experience.\nImplemented responsive front-end solutions with **Alpine.js**, ensuring seamless interaction and improved loading times across all devices.\nUtilized **React** for dynamic user interfaces, optimizing performance and enhancing the e-commerce journey on web and mobile platforms.\nManaged project workflows using **JIRA**, facilitating efficient task tracking and team collaboration, resulting in a **30%** increase in project delivery speed.\nBuilt and deployed applications to **AWS**, ensuring high availability and scalability to support a growing customer base and handle peak traffic during sales events.\nEmployed **Git** for version control and collaboration, improving code management and reducing merge conflicts by **25%**.\nImplemented efficient back-end services in **PHP** that support over **10,000** daily transactions without performance degradation, ensuring system reliability and customer satisfaction.\nCreated comprehensive documentation for APIs and workflows, improving team onboarding processes and project handovers.\nExecuted database migrations and optimizations to ensure data integrity and performance across multiple environments, tracking metrics to maintain an overall uptime of **99.9%**."
    }
  ],
  "skills": "Programming Languages:\n\tPHP, Python, JavaScript/TypeScript\n\n**Backend Frameworks:**\n\tLaravel, FastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular, Alpine.js\n\n**API Technologies:**\n\tAPI, OAuth2, JWT\n\n**Serverless and Cloud Functions:**\n\tAWS: Lambda, AWS: ECS\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS: S3, RDS, Azure: App Services, Blob Storage, SQL Database\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, JIRA, Keycloak (OIDC, RBAC), Nginx, Let’s Encrypt, Certbot, PHPUnit, Shopify, Livewire",
  "apply_company": "Cloud Bridge"
}