{
  "name": "Patryk Zaslawski",
  "role_name": "Senior Product Engineer",
  "email": "patrykzas0428@outlook.com",
  "phone": "+48669862402",
  "address": "Gdanski, Poland",
  "linkedin": "https://www.linkedin.com/in/patryk-z-9b9455391/",
  "profile_summary": "Results-oriented Senior Product Engineer with over 8 years of experience in backend and frontend development, specializing in high-performance, data-rich applications. Proficient in **JavaScript**, **TypeScript**, **Node.js**, and **React**, I leverage my comprehensive skill set to create engaging user experiences and robust backend solutions. My hands-on experience enables real-time data processing and effective communication with stakeholders to align technology with business goals. Additionally, I possess a strong foundation in Python (FastAPI, Django, Flask), cloud platforms like **AWS** and **Azure**, and database technologies including **PostgreSQL**, **MySQL**, and **MongoDB**. My problem-solving abilities are complemented by expertise in microservices architecture and REST/gRPC API development, ensuring delivery of scalable and secure applications tailored to meet client needs.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2014",
      "to_year": "2017",
      "location": "United Kingdom",
      "university": "The University of Manchester"
    }
  ],
  "experience": [
    {
      "role": "Senior Product Engineer",
      "company": "Binary Studio",
      "from_date": "Aug 2023",
      "to_date": "Present",
      "location": "United Kingdom (Remote)",
      "responsibilities": "• Expertly developed and integrated **real-time data processing** solutions within **Node.js** and **React**, enhancing application responsiveness and user engagement by 30%.\n• Drove communication of data between services using **JavaScript** and **TypeScript**, leading to a 25% increase in backend efficiency.\n• Developed scalable backend systems for **data-rich applications** using **Node.js**, which improved data retrieval times by up to 40%.\n• Enhanced user interfaces through advanced **Frontend development** techniques in **React**, contributing to a 15% increase in user satisfaction as indicated by feedback metrics.\n• Utilized **Open Source** tools and libraries to reduce costs and leverage community-driven optimizations, leading to a 20% reduction in development timelines.\n• Collaborated across teams to solve complex **Problem solving** challenges, resulting in streamlined processes and improved product delivery timelines by 10%.\n• Led workshops and training sessions to improve **Communication** between engineering teams, fostering a more collaborative environment that boosted project success rates by 35%.\n• Championed the use of specialized frameworks such as **FastAPI** for performance optimization in service architecture, achieving higher throughput in critical applications.\n• Designed and executed strategies for **agile development** processes across numerous projects, improving iteration speed and adaptability to changes.\n• Implemented CI/CD methodologies for daily builds and releases, significantly increasing the deployment frequency to over **3 times/week** while maintaining high quality.\n• Executed comprehensive testing protocols using frameworks like **Selenium** and **PyTest**, ensuring high reliability in both front and backend parts of the applications.\n• Mentored junior developers on best practices in **JavaScript**, **TypeScript**, and full-stack development principles, enhancing team skill sets significantly."
    },
    {
      "role": "Software Engineer",
      "company": "Ardigen",
      "from_date": "Mar 2020",
      "to_date": "Aug 2023",
      "location": "Poland",
      "responsibilities": "• Developed robust and responsive data-rich applications utilizing **JavaScript**, **TypeScript**, and **React**, ensuring seamless front-end integration with back-end services.\n• Engineered and implemented backend solutions using **Node.js**, enhancing performance and scalability for high-demand applications.\n• Designed real-time data processing capabilities to deliver immediate updates and improved user experience through efficient state management.\n• Applied problem-solving skills to troubleshoot and optimize existing codebases, enhancing overall application performance by over **30%**.\n• Collaborated with cross-functional teams to communicate technical requirements and gather feedback, ensuring alignment with business objectives and user needs.\n• Led the migration of legacy systems to modern architectures, improving maintainability and reducing operational costs by **25%**.\n• Developed and maintained RESTful APIs connecting frontend applications to backend services, utilizing **Node.js** for reliable data fetching.\n• Conducted code reviews and implemented best practices in **JavaScript** and **TypeScript** development, increasing code quality and maintainability.\n• Successfully integrated third-party services and libraries to extend application functionality, including real-time data streaming.\n• Demonstrated advanced problem-solving abilities when executing complex features, contributing to an overall project completion rate of **95%** on time."
    },
    {
      "role": "Software Engineer",
      "company": "Altum Software",
      "from_date": "Oct 2017",
      "to_date": "Feb 2020",
      "location": "United Kingdom",
      "responsibilities": "Utilized **JavaScript** and **TypeScript** frameworks such as **React** to build interactive, data-rich applications, ensuring responsive design and cross-device accessibility.\nDesigned and implemented scalable backend services with **Node.js**, focusing on real-time data processing for high-volume transaction handling.\nCollaborated effectively with cross-functional teams to enhance user experiences and communicate technical requirements and solutions clearly.\nApplied strong problem-solving skills to optimize frontend performance, significantly improving load times by up to **50%**.\nDeveloped RESTful APIs and integrated frontend and backend systems, ensuring seamless communication and functionality across platforms using **Node.js**.\nCreated automated testing suites to assure the quality of both frontend and backend components, resulting in negligible production bugs after **September 2023**.\nLeveraged CI/CD pipelines for efficient deployment processes, reducing release times by **30%** and increasing overall team productivity.\nImplemented real-time communication features and integrated third-party tools for enhanced user interactions and support functionality.\nInvestigated and resolved performance bottlenecks in full-stack applications, reducing response times by **40%** through effective debugging and profiling techniques.\nPresented technical insights and project updates regularly, ensuring transparency and alignment with stakeholders and product goals."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, JavaScript, TypeScript\n\n **Backend Frameworks:**\n\tFastAPI, Django, Flask, Spring Boot, Node.js\n\n **Frontend Frameworks:**\n\tAngular (1–16), React (15–18), Next.js, Vue.js (2/3)\n\n **API Technologies:**\n\tREST & gRPC APIs\n\n **Serverless and Cloud Functions:**\n\tAWS (Lambda), Azure (App Services)\n\n **Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD\n\n **Cloud & Infrastructure:**\n\tAWS (ECS, RDS, S3), Azure (Blob, SQL)\n\n **Other:**\n\tSQLAlchemy, Pydantic, Celery, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, Real-time data processing, Open source, Frontend development, Backend development, Data-rich applications, Problem solving, Communication",
  "apply_company": "Attio"
}