{
  "name": "Mariusz Jan Skobel",
  "role_name": "AI Software Engineer (F/H/X)",
  "email": "mariuszskobel15@outlook.com",
  "phone": "+48 735 343 548",
  "address": "Katowice, Poland",
  "linkedin": "https://www.linkedin.com/in/mariusz-skobel-789557397/",
  "profile_summary": "Results-driven AI Software Engineer with 10+ years of experience specializing in **Python**, **AI integration**, and **machine learning** including **NLP**. Demonstrated expertise in **microservices** with a strong understanding of **DevOps** principles, utilizing **Docker** and **Jenkins pipelines** for CI/CD automation. Proven ability to design and deploy scalable solutions on **Azure**, **GCP**, and **AWS** cloud platforms, leveraging **cloud-native** architectures to drive impactful results.  Experienced in developing AI-driven applications and integrating **Generative AI** capabilities to enhance data management and analytics.\nSkilled in leading MLOps initiatives, focusing on model deployment and management using tools like **MLflow**, **Airflow**, and **Kubeflow**. Strong background in **distributed architectures** and **Agile methodologies**, with a focus on ensuring compliance with industry standards. Notable strengths include exceptional organizational and time management skills, with a passion for innovation and a commitment to delivering high-quality solutions.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2012",
      "to_year": "2015",
      "location": "UK",
      "university": "University of Bristol"
    }
  ],
  "experience": [
    {
      "role": "AI Software Engineer (F/H/X)",
      "company": "EitBiz",
      "from_date": "Oct 2022",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "•\tDesigned and implemented scalable, full-stack solutions for AI applications using **Python** and **machine learning** frameworks, ensuring adherence to regulatory standards such as HIPAA and GDPR.\n•\tIntegrated **AI integration** features into applications, leveraging deep learning models for real-time inference, including risk prediction and anomaly detection, with technologies like **scikit-learn** and **TensorFlow**.\n•\tLed the transformation of applications into microservices-based architectures utilizing **Docker** and **Kubernetes** (version **1.21**), enhancing scalability and performance.\n•\tDeveloped cloud-native applications on platforms like **AWS** and **Azure**, enabling seamless data management and application deployment, incorporating **PostgreSQL** and **MongoDB** for robust data handling.\n•\tImplemented enterprise-level **DevOps** strategies employing **Jenkins pipelines**, **GitHub Actions**, and **Azure DevOps**, achieving deployment efficiencies across multiple environments.\n•\tCreated and maintained MLOps pipelines using **MLflow** and **Apache Airflow**, improving model versioning, training, and deployment processes while maintaining production standards.\n•\tCollaborated on **NLP** projects, utilizing libraries such as **spaCy** and **Hugging Face Transformers** for document processing, integrating into core services via RESTful APIs.\n•\tEstablished data architecture efficiencies using **GraphQL** for API interactions, optimizing data retrieval for high-availability applications.\n•\tDesigned and deployed complex financial data visualization tools using **D3.js** and **Chart.js**, enabling real-time insights in operational KPIs for innovative data analysis.\n•\tUtilized project management tools like **JIRA** and **Trello** to ensure agile methodologies and organizational skills were applied effectively across projects, completing deliverables ahead of schedule by **20%**."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Tvn S.A.",
      "from_date": "Oct 2019",
      "to_date": "Sep 2022",
      "location": "Poland",
      "responsibilities": "• Developed and implemented **AI integration** solutions utilizing **Python**, to enhance predictive modeling and real-time decision-making capabilities in financial systems.\n• Leveraged **Java** and **Scala** within a **microservices** architecture to facilitate high scalability for diverse financial applications, ensuring efficient transaction processing and system reliability.\n• Integrated **machine learning** technologies for fraud detection, deploying libraries such as **scikit-learn** and **XGBoost** for analyzing transaction patterns across **9M** customer transactions, improving risk assessment accuracy by **25%**.\n• Designed and executed ETL pipelines using **Python** and **Apache Airflow**, accounting for both batch and real-time ingestion from over **30** data sources to streamline data handling and analytics capabilities.\n• Spearheaded the modernization of legacy applications using **Docker** and **Jenkins pipelines** for CI/CD processes, leading to a **40%** reduction in deployment time.\n• Collaborated within **Agile methodologies** (SCRUM) to manage project timelines efficiently, utilizing **JIRA** for tracking progress and ensuring stakeholder alignment on deliverables.\n• Created dynamic data visualization tools by integrating **Power BI Embedded** with transaction monitoring dashboards, which empowered operations teams to analyze data trends and report anomalies based on **real-time** insights.\n• Fostered a culture of innovation by conducting experiments with **Generative AI** and **NLP** tools for enhancing user interaction and automating support processes, improving response efficiency by **30%**.\n• Championed the use of **cloud providers** such as **Azure** and **AWS** within system architecture, ensuring compliance with data management protocols and optimizing performance for scalable applications."
    },
    {
      "role": "Software Engineer",
      "company": "Timspark",
      "from_date": "Sep 2015",
      "to_date": "Aug 2019",
      "location": "UK",
      "responsibilities": "Utilized **Python** and **Java** to design and implement robust microservices architectures, enhancing system performance and scalability for AI-driven applications.\nIntegrated **AI** features using **machine learning** libraries like **scikit-learn** and **TensorFlow**, delivering personalized user experiences and improving product recommendation systems by **30%**.\nCollaborated in **Agile methodologies** (SCRUM) to manage projects effectively, ensuring timely delivery of software features and enhancements.\nDeveloped and maintained data management strategies using **PostgreSQL** and **MongoDB**, optimizing data retrieval processes that improved access times by **20%**.\nDesigned and implemented CI/CD pipelines using **Jenkins** and **Docker** for automated testing and deployment, achieving a **40%** reduction in release times and higher deployment reliability.\nEmployed **NLP** techniques in projects to analyze and enhance user interactions, contributing to an increase in customer satisfaction ratings by **25%**.\nApplied cloud technologies across **AWS**, **Azure**, and **GCP** for deploying scalable applications, reducing infrastructure costs by leveraging cloud resources effectively.\nEngaged in MLOps practices to streamline model deployment processes, ensuring operational efficiency and quick feedback loops for iterative improvements.\nImplemented project management tools like **JIRA** and **Trello** to facilitate team collaboration, enhancing organizational efficiencies and time management.\nCrafted user-friendly interfaces compliant with web standards, utilizing **React** and **Vue 3**, resulting in improved user engagement metrics by **15%**."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, Java, Scala, C#, JavaScript/TypeScript\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n **AI & Machine Learning:**\n\tMLflow, Airflow, Kubeflow, Generative AI, machine learning, AI integration, NLP, MLOps, LLMOps\n\n **Frontend Frameworks:**\n\tReact, Vue, Angular\n\n **API Technologies:**\n\tgraphQL, JSON schema, Avro\n\n **Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL), GCP\n\n **Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis, Data management\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Jenkins pipelines, Terraform, Ansible, Helm, Docker Compose, DevOps, cloud certifications\n\n **Cloud & Infrastructure:**\n\tCloud providers, distributed architectures\n\n **Other:**\n\tAgile methodologies, SCRUM, project management tools (JIRA, Trello), organizational skills, time management, analytical skills, problem-solving skills, creativity, curiosity, passion for innovation"
}