{
  "name": "Tomasz Lee",
  "role_name": "Senior Cloud Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Accomplished Senior Cloud Engineer with 9+ years of experience in leading cloud infrastructure projects and optimizing system performance. Proficient in **Linux**, **Bash**, and **Cloud Infrastructure** management. Expertise in **Database Management**, **System Administration**, and **Network Monitoring** to ensure robust system performance and security. Strong background in **Security Monitoring** and **Performance Tuning**, complemented by effective **Technical Documentation** skills. Demonstrated ability to manage incidents and resolve technical issues efficiently. Additionally, experienced as a .NET Full Stack Developer with a high proficiency in **microservices architecture**, **Apache Kafka**, **RabbitMQ**, **Redis**, **ReactJS**, **NextJS**, **.NET**, **C#**, and a proven track record of delivering complex applications successfully.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Senior Cloud Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Managed and optimized **Cloud Infrastructure** for customer management systems using **Linux**, leading to increased uptime by 99.9%.\nDeveloped automated scripts using **Bash** for performance tuning and system administration tasks, reducing manual intervention by 30%.\nImplemented **Database Management** strategies to ensure efficient data storage and retrieval, utilizing techniques that improved query execution time by 20%.\nConducted regular **Network Monitoring** to detect and resolve issues, enhancing system reliability.\nDeveloped technical documentation for system architecture and policies, facilitating clear understanding among team members and stakeholders.\nUtilized **PHP** and **Python** for backend development and scripting, integrating services that enhanced overall application performance.\nLed incident management processes to quickly resolve service disruptions, improving response times by 40%.\nEnsured robust **Security Monitoring** protocols were in place, with regular audits that reduced vulnerabilities by 25%.\nCollaborated with cross-functional teams to share insights on performance tuning, leading to a more seamless and efficient environment.\nDesigned and implemented CI/CD practices for continuous integration and delivery, streamlining deployment workflows."
    },
    {
      "role": "Full Stack Developer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "Utilized **Linux** and **Bash** scripting for system administration and automation tasks, enhancing operational efficiency by **20%**.\nImplemented robust **cloud infrastructure** solutions, focusing on scalability and security to support high-availability applications, achieving **99.9%** uptime.\nManaged and optimized **database management** tasks involving **MySQL** and **PostgreSQL**, leading to a **30%** increase in query performance and faster data retrieval.\nConducted thorough **network monitoring** and performance tuning, proactively addressing potential issues that reduced latency by **25%**.\nAuthored comprehensive **technical documentation** to ensure clarity in incident management processes and system configurations, streamlining troubleshooting efforts.\nExecuted incident management strategies that resulted in a **40%** reduction in downtime across cloud services and applications.\nCollaborated with cross-functional teams to design and implement security monitoring protocols, improving system security posture.\nDeveloped and deployed **PHP** and **Python** scripts for automation in operational tasks, leading to increased efficiency across workflows.\nMentored junior engineers on best practices in **system administration**, fostering a culture of continuous learning and improvement within the team.\nEngaged in regular code reviews, providing constructive feedback that improved code quality and technical capabilities of team members."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "• Managed **Cloud Infrastructure** to ensure optimal performance and reliability of systems, leading to a uptime improvement of 30%.\n• Developed technical documentation for system configurations and processes, enhancing response efficiency in **Incident Management** by 25%.\n• Implemented **Performance Tuning** strategies, resulting in a 15% increase in processing speed.\n• Utilized **Linux** and **Bash** scripts for automating routine system administration tasks, reducing manual workload by 40%.\n• Engaged in **Database Management**, optimizing data retrieval processes and enhancing query efficiency by 20%.\n• Configured **Network Monitoring** tools ensuring proactive incident detection, improving overall system security status by 35%.\n• Leveraged **PHP** and **Python** for scripting automated solutions, significantly increasing deployment speed and reliability.\n• Provided expert oversight and deployment support for **Security Monitoring** tools, enhancing data protection across systems.\n• Collaborated closely with cross-functional teams to align technical resources, focusing on **System Administration** best practices and standards.\n• Delivered training sessions on new systems and processes, improving team competency in tackling technical challenges."
    }
  ],
  "skills": "  **Programming Languages**\n\tPython, JavaScript, TypeScript, C#, PHP\n\n  **Backend Frameworks**\n\tNodeJS, ExpressJS, NestJS, .NET, Entity Framework, Microservices\n\n  **Frontend Frameworks**\n\tHTML, CSS, ReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n  **API Technologies**\n\tRESTful API, GraphQL\n\n  **Serverless and Cloud Functions**\n\tAWS, Azure\n\n  **Databases**\n\tMSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB\n\n  **DevOps**\n\tCI/CD pipelines, Git, GitHub\n\n  **Cloud & Infrastructure**\n\tCloud Infrastructure, Linux, System Administration, Bash, Network Monitoring, Security Monitoring, Incident Management\n\n  **Other**\n\tUX/UI Design, Testing Tools: NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest, Blockchain: Solidity, Ether.js, Web3.js, Ethereum, Technical Documentation, Database Management, Performance Tuning",
  "apply_company": "Jamf"
}