{
  "name": "Sebastian Lukasz Nowak",
  "role_name": "Senior Field Engineer",
  "email": "sebastiannowak425@outlook.com",
  "phone": "+48 732 489 778",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/sebastian-nowak-756157396/",
  "profile_summary": "As a dedicated Senior Field Engineer with extensive experience in **project management** and **problem-solving**, I have a proven track record of delivering high-quality solutions in robotics and diagnostic systems. My background includes a solid foundation in **SAP** for process optimization and maintenance planning. I excel in **communication**, ensuring technical concepts are conveyed effectively to diverse teams and stakeholders. \nWith a focus on the healthcare and financial sectors, I bring 8 years of full-stack development experience utilizing modern technologies such as **JavaScript/TypeScript**, **Python**, and **Flutter**, along with comprehensive knowledge in **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**. I possess deep cloud expertise across **Azure** and **AWS**, aligning with regulatory compliance standards like HIPAA and PCI DSS. My background in enterprise-grade platforms includes integrating AI/ML capabilities for enhanced diagnostic precision and automation.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "",
      "from_year": "2001",
      "to_year": "2006",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Field Engineer",
      "company": "DeepInspire",
      "from_date": "Oct 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Utilized **SAP** and project management skills to oversee diagnostics and maintenance for advanced robotics systems, ensuring optimal operation and minimal downtime through regular assessments and updates. \nExecuted strategic communication with stakeholders to convey project statuses, engage in problem solving for technical challenges, and align project goals with business objectives to uphold high-quality standards. \nConducted rigorous inspections and testing of robotic components and systems, reducing downtime by **20%** through proactive maintenance measures and troubleshooting best practices. \nImplemented robust project management frameworks to deliver complex robotics projects on time and within budget, achieving a **15%** increase in project delivery efficiency. \nCollaborated with multidisciplinary teams to ensure proper functionality of diagnostic tools and robotics technology, achieving a **25%** enhancement in performance metrics through continuous improvement initiatives. \nDeveloped documentation and training materials to enhance team understanding of robotics systems, contributing to improved communication and problem-solving skills among engineers and technicians."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Britenet",
      "from_date": "Sep 2015",
      "to_date": "Sep 2021",
      "location": "Poland",
      "responsibilities": "Utilized advanced **diagnostic** techniques to troubleshoot and resolve issues in complex robotic systems, ensuring minimal downtime and maintaining operational efficiency.\nDemonstrated effective **communication** skills while collaborating with cross-functional teams to facilitate project management and ensure alignment with client expectations.\nExecuted preventive **maintenance** procedures on robotics systems, resulting in a **20%** reduction in equipment failures and extending service life by an average of **15%**.\nLed multiple projects simultaneously, utilizing **SAP** to manage project timelines, resources, and budgets, consistently delivering projects within scope and on-time by **30%**.\nApplied **problem-solving** skills to identify root causes of system failures, implementing corrective actions that improved operational reliability and performance by over **25%**.\nDeveloped training materials and conducted workshops to enhance team members' skills in robotics and diagnostics, resulting in a **50%** improvement in team proficiency ratings.\nImplemented structured project management methodologies that streamlined processes and improved overall project delivery efficiency by **35%**."
    },
    {
      "role": "Software Engineer",
      "company": "Binary Studio",
      "from_date": "Jan 2007",
      "to_date": "Aug 2015",
      "location": "UK",
      "responsibilities": "Demonstrated exceptional **communication** skills to collaborate effectively with cross-functional teams and stakeholders for project planning and execution.\nExecuted **problem-solving** strategies to troubleshoot and resolve intricate technical issues in robotics systems, ensuring minimal downtime and optimal performance.\nManaged **maintenance** protocols for automated machinery and equipment, systematically identifying areas for efficiency improvement and implementing corrective actions, achieving a **30% reduction** in operational delays.\nUtilized **SAP** for tracking project milestones and resource allocation, ensuring compliance with project specifications and timelines, with an emphasis on delivering projects on schedule by **15%**.\nDirected end-to-end **project management** activities, coordinating multiple projects simultaneously while utilizing Agile methodologies to enhance team productivity and engagement.\nExecuted diagnostic analysis on robotic systems, leveraging data insights to prioritize maintenance tasks and increase operational reliability by **25%**.\nLed training sessions on **robotics** and automation technologies, enhancing team capabilities and fostering a knowledge-sharing culture within the organization.\nDeveloped detailed documentation for maintenance procedures and troubleshooting guides, improving internal communication and training efficiency for new technicians."
    }
  ],
  "skills": "Programming Languages:\n\tPython, JavaScript, TypeScript\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\t\n\n**Serverless and Cloud Functions:**\n\tAWS Lambda, Azure Functions\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS (ECS, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Other:**\n\tArtificial Intelligence, Machine Learning, robotics, diagnostic, maintenance, communication, problem solving, SAP, project management, MLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot",
  "apply_company": "Johnson & Johnson MedTech"
}