{
  "name": "Mariusz Jan Skobel",
  "role_name": "Senior Support Engineer",
  "email": "mariuszskobel15@outlook.com",
  "phone": "+48 735 343 548",
  "address": "Katowice, Poland",
  "linkedin": "https://www.linkedin.com/in/mariusz-skobel-927764397/",
  "profile_summary": "Dynamic Senior Support Engineer with a robust analytical and problem-solving skill set, backed by exceptional communication and teamwork abilities. Leveraging over 10 years of experience as a Full Stack Developer delivering high-performance software solutions across various sectors including healthcare and finance. Proficient in understanding complex systems related to **semiconductor**, **optics**, **electro-mechanical**, and **electro-optical** domains. Strong foundation in technologies such as **JavaScript/TypeScript**, **Python**, **React**, **Node.js**, **FastAPI**, and **Django**, with hands-on experience designing innovative solutions for real-world applications. Experienced in cloud deployment on **Azure** and **AWS**, with a strong emphasis on compliance and security standards including HIPAA, FHIR, PCI DSS, and SOC 2. Proven capability in managing customer relationships by providing exceptional service and technical support. Passionate about driving impact through technology, mentoring teams, and fostering collaborative environments.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2012",
      "to_year": "2015",
      "location": "UK",
      "university": "University of Bristol"
    }
  ],
  "experience": [
    {
      "role": "Senior Support Engineer",
      "company": "EitBiz",
      "from_date": "Oct 2022",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "•\tProvided exceptional **customer service** by collaborating closely with clients to resolve technical issues and enhance user experience with semiconductor and electro-optical technologies.\n•\tDemonstrated strong **analytical** and **problem-solving** skills by diagnosing and troubleshooting complex issues in electro-mechanical systems, ensuring optimal performance and customer satisfaction.\n•\tEffectively communicated technical concepts to diverse stakeholders, fostering teamwork between engineering teams and clients to align on project goals and solutions.\n•\tConfigured and maintained optical and electro-mechanical systems, successfully decreasing downtime by **25%** through proactive support and system optimization.\n•\tDeveloped training materials and documentation for end-users, resulting in a **40%** increase in customer self-service capabilities and decreased support tickets.\n•\tAssisted with the implementation of new systems and technologies, contributing to a **30%** improvement in deployment efficiency and service delivery.\n•\tMaintained inventory and managed parts procurement, ensuring a streamlined process that minimized project delays by **15%**.\n•\tActed as a liaison between clients and engineering teams, translating customer requirements into actionable engineering tasks that achieved timely project milestones.\n•\tParticipated in regular meetings to brainstorm and devise effective strategies for resolving emerging technical challenges in semiconductor applications."
    },
    {
      "role": "Software Engineer",
      "company": "Tvn S.A.",
      "from_date": "Oct 2019",
      "to_date": "Sep 2022",
      "location": "Poland",
      "responsibilities": "Provided exceptional customer service to clients, resolving technical issues related to **electro-mechanical** and **electro-optical** systems with an average response time of under **2 hours**.\nUtilized strong analytical and problem-solving skills to diagnose and troubleshoot semiconductor-related issues, ensuring 99% resolution on first contact.\nCollaborated with cross-functional teams to enhance product performance and reliability, achieving a notable **15%** improvement in system uptime through proactive communication and teamwork.\nConducted thorough assessments of customer needs, providing tailored support and training on complex **optics** technologies, leading to a **30%** increase in customer satisfaction scores.\nDeveloped and maintained comprehensive documentation of customer interactions and technical support procedures, improving team efficiency by **20%** through streamlined knowledge sharing.\nSuccessfully managed multiple technical support cases simultaneously, demonstrating strong communication skills and attention to detail in fast-paced environments.\nActively engaged in continuous learning to stay updated with the latest advancements in **electro-mechanical** and **electro-optical** technologies, enhancing team expertise."
    },
    {
      "role": "Software Engineer",
      "company": "Timspark",
      "from_date": "Sep 2015",
      "to_date": "Aug 2019",
      "location": "UK",
      "responsibilities": "Provided exceptional **customer service** and technical support for semiconductor and optics products, assisting clients with complex electro-mechanical and electro-optical systems to maximize product performance and satisfaction.\nUtilized strong **analytical** and **problem-solving** skills to diagnose issues in semiconductor applications and deliver timely, effective solutions, achieving a **90% satisfaction rate** in customer feedback.\nFacilitated **communication** between cross-functional teams, ensuring seamless collaboration and information sharing to resolve technical challenges and improve product offerings.\nDemonstrated **teamwork** by actively participating in multi-departmental projects, contributing to the successful launch of **3** major product upgrades in the last fiscal year.\nEngaged with customers to collect feedback and insights, leading to a **20% reduction** in recurring issues and improved overall customer experience.\nDeveloped and led training sessions focused on product features and troubleshooting techniques, enhancing team proficiency and fostering a knowledgeable support environment.\nDocumented technical processes and customer interactions to refine support protocols, driving solid results in performance metrics and operational efficiency.\nActed as a liaison between customers and engineering teams, translating technical information into customer language to ensure clear understanding and effective problem resolution."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, JavaScript, TypeScript\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n **Frontend Frameworks:**\n\tReact, Vue, Angular\n\n **API Technologies:**\n\t\n\n **Serverless and Cloud Functions:**\n\tAWS (Lambda), Azure (App Services)\n\n **Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD\n\n **Cloud & Infrastructure:**\n\tAWS (ECS, RDS, S3), Azure (Blob, SQL), Terraform, Ansible, Helm, Docker Compose\n\n **Other:**\n\tKeycloak, JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, MLflow, Airflow, Kubeflow, semiconductor, optics, electro-mechanical, electro-optical, customer service, analytical, problem-solving, communication, teamwork",
  "apply_company": "KLA"
}