{
  "name": "Mariusz Jan Skobel",
  "role_name": "Senior Frontend Engineer",
  "email": "mariuszskobel15@outlook.com",
  "phone": "+48 735 343 548",
  "address": "Katowice, Poland",
  "linkedin": "https://www.linkedin.com/in/mariusz-skobel-927764397/",
  "profile_summary": "Experienced Senior Frontend Engineer with over 10 years of expertise in building high-performance applications leveraging **React.js**, **Redux.js**, **JavaScript**, and **TypeScript**. Proficient in crafting modern web applications using **HTML5**, **CSS3**, and best practices in **Object-Oriented JavaScript**. Skilled in enhancing code quality and maintainability through tools like **Selenium**, **ESLint**, and **Prettier**. Adept in implementing Micro Frontend architectures and developing Single Page Applications (SPAs) that focus on user experience and interface aesthetics.\n\nPossess a robust background in full-stack development with proficiency in **Node.js**, and deep experience in cloud-native deployments on **AWS** and **Azure**. Successfully led projects integrating AI/ML capabilities for real-time analytics, ensuring compliance with industry standards such as HIPAA and PCI DSS. Committed to building secure and maintainable solutions while driving impactful results in the healthcare and finance sectors.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2012",
      "to_year": "2015",
      "location": "UK",
      "university": "University of Bristol"
    }
  ],
  "experience": [
    {
      "role": "Senior Frontend Engineer",
      "company": "EitBiz",
      "from_date": "Oct 2022",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "•\tDeveloped modern front-end applications, enhancing user interactivity and performance using **React.js** (versions 17–18), while adhering to best practices in **JavaScript**, **TypeScript**, **HTML5**, and **CSS3**.\n•\tImplemented state management solutions with **Redux.js**, ensuring a seamless and responsive application interface to facilitate user experience.\n•\tDesigned and integrated Single Page Applications (SPAs) using **JavaScript**, driving high engagement and customer satisfaction in web-based products.\n•\tEmployed **Micro Frontend** architecture to scale applications effectively, allowing for independent development and deployment of front-end modules across teams.\n•\tConducted comprehensive testing and validation processes using **Selenium**, ensuring high-quality software delivery and adherence to acceptance criteria.\n•\tUtilized **ESLint** and **Prettier** for code quality maintenance, enhancing code readability and reducing bugs in collaboration with development teams.\n•\tCollaborated on the architectural design of cross-platform solutions leveraging **React.js** and **Node.js**, contributing to an integrated web ecosystem serving **9M+** users.\n•\tSupported the deployment of complex frontend setups by implementing CI/CD pipelines through **Azure DevOps** and **GitHub Actions**, incorporating automated testing and code review processes.\n•\tImproved application performance and load times by optimizing rendering performance using techniques like lazy loading and code splitting, monitored through real-time analytics.\n•\tParticipated in cross-functional team discussions to drive the product roadmap, incorporating feedback from UX/UI design and backend engineering to elevate the overall product quality."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Tvn S.A.",
      "from_date": "Oct 2019",
      "to_date": "Sep 2022",
      "location": "Poland",
      "responsibilities": "Emphasized strong expertise in **React.js**, **TypeScript**, and **JavaScript** while leading the development of high-performance front-end applications for financial platforms:\n- Built dynamic, user-focused front-end applications using **React (18)**, integrating **Redux.js** for state management, ensuring responsive and performant user interfaces for financial dashboards and admin portals.\n- Collaborated on microservices architecture development utilizing **Node.js** and fostering modern practices in web application creation, enhancing scalability, maintainability, and throughput to support **9,000+** high-volume transactions per minute.\n- Engaged in rigorous code quality practices by utilizing **ESLint** and **Prettier** for maintaining consistency in coding standards across a team of **15+** developers.\n- Fostered a rich user experience by employing cutting-edge technologies including **HTML5**, **CSS3**, and **Selenium** for automated testing, ensuring exceptional performance and reduced bug rates by **30%**.\n- Championed the implementation of **Micro Frontend** strategies, enabling independent deployments and team structures for faster development cycles.\n- Integrated extensive knowledge of Object-Oriented JavaScript to enhance application structure and improve maintainability, reducing development time for new features by **25%**.\n- Executed best practices in Single Page Application (SPA) design to enhance user engagement and retention, contributing to an increase in platform usage by **40%**."
    },
    {
      "role": "Software Engineer",
      "company": "Timspark",
      "from_date": "Sep 2015",
      "to_date": "Aug 2019",
      "location": "UK",
      "responsibilities": "Developed dynamic single-page applications (SPAs) using **React.js** (version **18**) combined with **TypeScript**, ensuring a robust, modular architecture with enhanced state management via **Redux.js**.\nUtilized **JavaScript** best practices and standards, employing **ESLint** and **Prettier** for clean, maintainable code across the codebase.\nEngineered innovative micro frontend solutions, promoting independent deployment and scaling of frontend features while ensuring seamless integration of various components.\nDesigned intuitive user interfaces with **HTML5** and **CSS3**, focusing on responsive design to create mobile-first experiences that align with accessibility guidelines (WCAG 2.1).\nCollaborated with backend teams to integrate APIs, ensuring efficient data flow between the frontend and backend services implemented with **Node.js**.\nImplemented automated testing pipelines using **Selenium** to ensure application reliability and high performance, resulting in a **30% reduction** in post-deployment bugs.\nFostered continuous improvement through the application of best practices in object-oriented **JavaScript**, improving maintainability and team onboarding efficiency by over **25%**.\nParticipated in code reviews and mentoring sessions, enhancing team knowledge in frontend technologies and encouraging a culture of quality in development practices."
    }
  ],
  "skills": " **Programming Languages:**\n\tJavaScript, TypeScript, Python\n\n**Frontend Frameworks:**\n\tReact, Redux, Vue, Angular, React.js, Micro Frontend, SPA, HTML5, CSS3\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django, Node.js\n\n**API Technologies:**\n\tJWT, OAuth2\n\n**Serverless and Cloud Functions:**\n\tAWS Lambda, Azure App Services\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS (ECS, RDS, S3), Azure (Blob, SQL)\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, Nginx, Certbot, Let’s Encrypt, ESLint, Prettier, Object-Oriented JavaScript",
  "apply_company": "Pragmatike"
}