{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior GoogleCloud Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "As a results-driven Senior Google Cloud Engineer, I possess extensive experience in **Google Cloud**, **Google Workspace**, and **Windows** systems, complemented by a strong background in networking and Active Directory. With a proven track record in technical project management and customer service, I effectively lead migration projects and provide consulting support to ensure seamless transitions and optimal cloud solutions. My robust skill set is further strengthened by 8 years as a Full Stack Developer, proficient in technologies such as **JavaScript/TypeScript**, **Python**, and **Flutter**, with expertise in frameworks like **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**. I have a deep understanding of microservices architecture, CI/CD automation, and compliance standards (HIPAA, FHIR, PCI DSS, SOC 2) while driving the development of enterprise-grade platforms that leverage AI/ML capabilities.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior GoogleCloud Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Managed technical project implementations involving **Google Cloud** services, ensuring seamless migration of applications and data to the cloud environment.\nLeveraged expertise in **Google Workspace** to enhance collaboration and productivity across teams, implementing project management strategies to align with organizational goals.\nUtilized **Active Directory** for identity management and access control, ensuring secure and efficient user authentication for cloud resources and applications.\nProvided comprehensive customer service and technical support in cloud-related queries, driving user adoption and satisfaction through effective solutions.\nFacilitated networking solutions to optimize data flow between on-premises and cloud infrastructures, ensuring high availability and performance metrics.\nExecuted migration plans, transitioning legacy systems to **Google Cloud** within a scheduled timeline, achieving a **25%** reduction in operational costs.\nDeveloped and maintained project documentation and reporting for stakeholders, tracking project milestones, deadlines, and performance metrics to ensure compliance and transparency.\nConducted training sessions and workshops for team members on **Google Cloud** best practices, tools, and technologies, enhancing team capability and agility in project execution.\nCollaborated with cross-functional teams to ensure alignment on project requirements, timelines, and deliverables, fostering a culture of teamwork and accountability.\nImplemented robust project risk management strategies, identifying potential issues early and devising mitigation plans to maintain project schedules.\nMonitored cloud service performance, optimizing configurations to achieve cost-effectiveness while meeting service level agreements (SLAs)."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "• Managed technical project life cycles in the deployment of **Google Cloud** solutions, enhancing system efficiencies and streamlining workflows by 30%.\n• Provided expert consulting services to clients on **Google Workspace** and **Google Cloud** strategies, resulting in improved user adoption rates by 25%.\n• Streamlined migration processes to **Google Cloud**, achieving a transition time reduction of 40% while minimizing downtime for users.\n• Delivered top-tier customer service support for IT infrastructure, effectively resolving issues in **Active Directory**, **Exchange**, and **Networking**, maintaining customer satisfaction scores over 90%.\n• Developed and maintained documentation for system architecture and project management processes using effective frameworks, resulting in increased team alignment and project success rates.\n• Oversaw technical team collaboration, ensuring adherence to best practices in project management, which led to the successful completion of projects on time and within budget by 15%."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Managed technical project planning and execution for cloud migration initiatives utilizing **Google Cloud**, ensuring seamless integration and minimal downtime during the transition process.\nProvided comprehensive customer service and consulting to clients on **Google Workspace**, enhancing collaboration, productivity, and efficient use of cloud resources.\nOversaw the setup and management of **Active Directory** for user identity and access management, ensuring compliance and security across cloud environments.\nDesigned networking solutions that support **Windows** environments within **Google Cloud**, optimizing performance and security for enterprise applications and workloads.\nExecuted successful migrations to **Google Cloud**, coordinating with cross-functional teams to assess user needs, configure appropriate cloud services, and validate functionality post-migration.\nDeveloped project work plans, timelines, and resource allocation strategies for multiple simultaneous projects, leading to a **25%** increase in project delivery efficiency.\nImplemented best practices for system performance and security in cloud deployments, proactively establishing measures that reduced incident response times by **30%**.\nTrained and mentored team members on **Google Cloud** services and infrastructure management, contributing to an enhancement in team capabilities and knowledge sharing.\nUtilized **Exchange** and other tools to manage and optimize email communication systems, improving overall user satisfaction and communication efficiency by **15%**."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, JavaScript, TypeScript\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n **Frontend Frameworks:**\n\tReact, Vue, Angular\n\n **API Technologies:**\n\t\n\n **Serverless and Cloud Functions:**\n\tAWS Lambda, Azure App Services\n\n **Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:**\n\tAWS (ECS, RDS, S3), Azure (Blob, SQL)\n\n **Other:**\n\tGoogle Workspace, Google Cloud, Windows, Active Directory, Exchange, Networking, Technical Project Management, Customer Service, Consulting, Migration, MLflow, Airflow, Kubeflow, Keycloak, JWT, OAuth2, Let’s Encrypt, Nginx, Certbot",
  "apply_company": "PCG DACH"
}