{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior QA Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Senior QA Engineer with 13+ years of experience in software testing, specializing in **API Testing**, **Automated Testing**, and comprehensive **Test Case Design** and **Test Planning**. Proficient in utilizing collaboration tools to drive quality reporting and enhance team communication. Strong background in compliance-driven testing, aligning with industry standards. Skilled in **JavaScript/TypeScript**, **Python**, and **Flutter** for end-to-end testing of high-performance applications, leveraging frameworks like **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**. Demonstrated expertise in deploying cloud-native systems on **AWS** and **Azure**, and implementing microservices and CI/CD pipelines to support robust automation and quality assurance processes. Experienced in building platforms with AI/ML capabilities that enhance predictive analytics and real-time processing.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior QA Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Implemented robust **Software Testing** strategies across the technology stack, ensuring quality and performance benchmarks in every release.\nDesigned and executed **Automated Testing** and **API Testing** using tools like Jest, Cypress, Postman, and PyTest to cover **100%** of unit, integration, and E2E tests.\nConducted **Manual Testing** to validate end-user experiences in web and mobile applications, verifying alignment with specifications and user needs, achieving a **98%** pass rate.\nCollaborated effectively with development teams to define and prioritize **Test Case Design** and **Test Planning**, facilitating smooth project workflows and early issue detection, enhancing product quality.\nUtilized **Quality Reporting** techniques to document findings and communicate testing progress and results to stakeholders, ensuring transparency in the development process.\nLeveraged **Collaboration Tools** and **Office Software** for effective communication within cross-functional teams, optimizing testing processes and reporting.\nFollowed the **ISTQB** best practices to maintain high standards in software quality assurance and risk management throughout the project lifecycle."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Conducted comprehensive **API Testing** and **Automated Testing** to ensure high-quality financial applications, achieving a **99%** success rate in regression tests.\nDesigned and executed detailed **Test Case Design** strategies for over **150** unique test scenarios, enhancing overall software reliability.\nDeveloped thorough **Test Planning** documents in collaboration with cross-functional teams, facilitating efficient development cycles and ensuring alignment with project timelines.\nImplemented **Quality Reporting** processes to track defects and assess product quality metrics, resulting in a **20%** reduction in critical bugs at launch.\nUtilized **Collaboration Tools** such as Jira and Confluence for efficient communication within the team, improving task visibility and accountability.\nPerformed **Software Testing** on high-performance applications built with **Node.js (NestJS/Express)** and **Python (FastAPI, Django)**, ensuring seamless functionality and user experience.\nParticipated in regular team meetings utilizing effective **Communication** skills to share insights and resolve issues promptly, fostering a productive work environment.\nProvided training on **ISTQB** principles to junior team members, improving the overall testing competency of the team and enhancing adherence to industry standards."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Executed comprehensive **Automated Testing** strategies for backend services built with **Python (FastAPI, Django)** and **Node.js (NestJS, Express)**, ensuring robustness and reliability with over **150 test cases** designed to cover critical functionalities.\nConducted **API Testing** using tools like Postman and Swagger, validating endpoints and ensuring optimal performance in high-traffic conditions, achieving response time improvements of over **30%**.\nDesigned and implemented **Test Case Design** and **Test Planning** methodologies that enhanced functionality and performance testing, directly contributing to a **20%** reduction in production defects.\nUtilized **manual testing** techniques alongside automated frameworks to identify issues within the platform, improving overall quality reporting and stakeholder visibility with detailed documentation.\nCollaborated effectively with development teams using **collaboration tools** such as JIRA and Confluence to align on quality assurance objectives and streamline workflows, enhancing communication and project transparency.\nFostered a culture of quality within the team, leveraging the **ISTQB** principles and methodologies to elevate software quality standards across the organization.\nPresented quality reports and metrics to senior management, effectively communicating project status and quality benchmarks that resulted in strategic decisions improving the release schedule by **15%**.\nTrained and mentored junior QA engineers in best practices for both **Software Testing** and **Quality Reporting**, contributing to team growth and knowledge sharing.\nActively engaged in improving testing processes, reducing testing cycles by **10%** through the adoption of modern **Office Software** tools that facilitate documentation and reporting."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, JavaScript, TypeScript\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n **Frontend Frameworks:**\n\tReact, Vue, Angular\n\n **API Technologies:**\n\tAPI Testing\n\n **Serverless and Cloud Functions:**\n\tAWS: Lambda, Azure: App Services\n\n **Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:**\n\tAWS: ECS, RDS, S3, Azure: Blob Storage, SQL Database\n\n **Other:**\n\tSoftware Testing, Manual Testing, Automated Testing, Test Case Design, Test Planning, ISTQB, Quality Reporting, Collaboration Tools, Office Software, Communication, Authentication & Security: Keycloak (OIDC, RBAC), OAuth2, JWT, Nginx, Let’s Encrypt, Certbot",
  "apply_company": "Federation for Sustainable Entrepreneurship"
}