{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior .NET Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Senior .NET Engineer with 13+ years of experience in developing high-performance applications, particularly in compliance-heavy sectors like healthcare and finance. Proficient in **C#**, **.NET**, **ASP.NET MVC**, **ASP.NET Core**, **Entity Framework**, and **WebAPI**. Highly skilled in **JavaScript**, **TypeScript**, and **Angular**, complemented by solid expertise in **OOP** and various database systems including **MS SQL Server**, **PostgreSQL**, and **Oracle**. \n\nAdept at implementing modern software development practices with a strong emphasis on **NUnit** and mocking frameworks for robust testing. Demonstrated leadership and mentorship abilities guiding teams through the software development lifecycle while ensuring adherence to best practices and standards. Proven track record in building scalable, maintainable software solutions, focusing on user experience with insights from **CSS** and **SASS** for frontend development. Excels at blending technical and soft skills to deliver resilient architectures and drive projects to success.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior .NET Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Developed robust **.NET** applications using **C#**, ensuring adherence to **OOP** principles and best practices while enhancing system performance and maintainability.\n• Designed and implemented **WebAPI** services and **ASP.NET Core** applications for seamless integration with various third-party tools and databases.\n• Utilized **Entity Framework** to optimize data access layers, managing SQL databases, including **MS SQL Server**, **PostgreSQL**, and **Oracle**, to support complex queries and transactions.\n• Executed unit testing and integration testing strategies using **NUnit** and various **mocking frameworks**, ensuring the reliability of code through comprehensive coverage and validation.\n• Led development teams in delivering high-quality software solutions with a focus on collaboration, providing **leadership** and **mentorship** to junior developers.\n• Developed frontend components using modern frameworks like **Angular** and JavaScript/TypeScript, together with advanced styling techniques using **CSS** and **SASS** to build responsive user interfaces.\n• Streamlined the deployment process through effective use of CI/CD pipelines, supporting multiple environments and automated testing procedures.\n• Collaborated with cross-functional teams to create and optimize dynamic web applications for various environments, focusing on both performance and security aspects.\n• Enhanced application functionality and responsiveness across multiple devices to improve user experience and engagement metrics.\n• Played a pivotal role in architectural discussions, contributing to the long-term technical roadmap and ensuring alignment with business goals."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "- Developed and maintained robust applications using **.NET**, **C#**, and **ASP.NET Core**, enhancing system performance and scalability in line with best practices.\n- Led the design and implementation of RESTful web services using **WebAPI**, improving the efficiency of data transactions across multiple platforms.\n- Employed **Entity Framework** to optimize data access and manipulation tasks, achieving a **20%** reduction in response times for data queries.\n- Conducted unit testing and behavior-driven development using **NUnit** and various mocking frameworks, increasing code quality and reliability while reducing bugs by **15%**.\n- Championed Object-Oriented Programming (OOP) principles in application architecture to establish clear hierarchies and reusable modules.\n- Collaborated on front-end development using **JavaScript**, **TypeScript**, and **Angular**, aligning with modern user interface standards and enhancing user experience by **25%**.\n- Implemented CSS and SASS methodologies to create visually appealing and responsive designs, resulting in a **30%** increase in user engagement.\n- Provided leadership and mentorship within the engineering team, fostering a culture of continuous improvement and skill development.\n- Managed database systems such as **MS SQL Server**, **PostgreSQL**, and **Oracle**, ensuring high availability and performance through proactive monitoring and optimization.\n- Delivered solutions through Agile methodologies, leading sprint planning sessions to align team efforts with stakeholder priorities and project timelines."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "- Developed and optimized backend services using **ASP.NET Core** and **C#**, ensuring high-performance operations aligned with the principles of **OOP**.\n- Designed and implemented robust WebAPI services leveraging **Entity Framework** for efficient data access, achieving a **50% improvement** in response time across key functionalities.\n- Led a team in the adoption of **.NET** technologies, enhancing code quality and performance through **NUnit** and mocking frameworks for comprehensive unit testing.\n- Streamlined front-end development using **JavaScript**, **TypeScript**, and **Angular**, ensuring responsive design and high user engagement metrics, increasing user satisfaction ratings by **30%**.\n- Integrated and maintained databases such as **MS SQL Server**, **PostgreSQL**, and **Oracle**, ensuring data integrity and performance management across multiple applications.\n- Mentored junior developers in best practices of secure coding and access control to maintain a robust security posture and adherence to GDPR compliance in all deliverables.\n- Enhanced UI/UX using modern web technologies including **CSS** and **SASS**, fostering a mobile-first approach and improving mobile user interactions by **25%**.\n- Implemented version control and CI/CD pipelines to streamline deployment processes, reducing time-to-market for new features by **40%**.\n- Actively participated in architectural discussions, contributing to the strategic direction of the team, and driving initiatives for continuous improvement in software design practices."
    }
  ],
  "skills": "**Programming Languages:**\n\tC#, .NET, Python, JavaScript, TypeScript\n\n**Backend Frameworks:**\n\tASP.NET Core, ASP.NET MVC, Entity Framework, FastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tAngular, React, Vue, CSS, SASS\n\n**API Technologies:**\n\tWebAPI\n\n**Serverless and Cloud Functions:**\n\tAWS: ECS, Lambda, RDS, S3\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis, MS SQL Server, Oracle\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS, Azure: App Services, Blob Storage, SQL Database\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), OAuth2, JWT, Nginx, Let’s Encrypt, Certbot, leadership, mentorship, OOP, NUnit, mocking frameworks, DOM",
  "apply_company": "Creatio"
}