{
  "name": "Rei Taro",
  "role_name": "QA Engineer",
  "email": "rei515@outlook.com",
  "phone": "+48732529451",
  "address": "Warszawa, Poland",
  "linkedin": "https://www.linkedin.com/in/rei-taro-28639a395/",
  "profile_summary": "Results-driven QA Engineer with over 10 years of experience in testing methodologies and automation within financial platforms and AI/ML systems. Proficient in **Python**, **Golang**, and **JavaScript** for test automation and API testing, leveraging **Google Cloud** services for effective cloud-based solutions. Expertise in QA methodologies including functional, regression, and integration testing, as well as using defect tracking tools and performing load and stress testing to ensure high-quality software delivery. Strong interpersonal and time management skills, experienced in Agile and SCRUM environments, and committed to delivering comprehensive quality assurance throughout the SDLC. Proven history of impactful contributions at leading firms like VISA, Sii Poland, and Reply Polska.",
  "education": [
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2010",
      "to_year": "2015",
      "location": "Japan",
      "university": "Keio University"
    }
  ],
  "experience": [
    {
      "role": "QA Engineer",
      "company": "Leobit",
      "from_date": "Aug 2022",
      "to_date": "Present",
      "location": "Poland",
      "responsibilities": "Conducted thorough **functional testing** and **regression testing** leveraging **Python** and **Golang** to ensure high-quality deliverables.\nImplemented **test automation** frameworks using **JavaScript** and **Typescript** to enhance testing efficiency by **30%**.\nUtilized defect tracking tools to streamline the identification and resolution of issues, achieving a **20%** reduction in critical defects.\nCollaborated in an **Agile** environment, adhering to **SCRUM** methodologies to effectively manage project timelines and deliverables.\nParticipated in **API testing** to validate interfaces and ensure seamless integration between services, using **Postman** and **CURL**.\nEngaged in continuous improvement initiatives by conducting **load testing** and **stress testing** on applications, implementing findings to optimize scalability.\nFacilitated training sessions to enhance team members' understanding of **QA methodologies** and software development lifecycle (**SDLC**), improving overall performance.\nCoordinated with the development team to develop and maintain CLI tools for automated testing, contributing to a **25%** increase in test coverage."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Innovature",
      "from_date": "Nov 2018",
      "to_date": "Jun 2022",
      "location": "Japan",
      "responsibilities": "Implemented test automation strategies to enhance the quality assurance process, ensuring the reliability of backend systems developed in **Python** and **FastAPI**.\nExecuted functional testing and regression testing for event-driven microservices built with **Celery** and **Redis**, improving processing speed by over **30%**.\nUtilized defect tracking tools to manage issues effectively during the software development life cycle (SDLC), achieving a defect resolution rate of **95%**.\nConducted integration testing for microservices deployed on **Azure App Services**, facilitating a seamless deployment process with **99%** uptime.\nManaged API testing and load testing for data pipelines using **Apache Airflow** and **Azure Functions**, optimizing data flow and reducing latency by **25%**.\nApplied QA methodologies within an Agile environment using **SCRUM**, fostering collaboration with cross-functional teams for successful release management and adherence to regulatory compliance.\nDemonstrated strong time management and interpersonal skills, leading QA efforts for projects involving **Google Cloud** deployments and various CLI tools."
    },
    {
      "role": "Software Developer",
      "company": "Wizcorp",
      "from_date": "Apr 2015",
      "to_date": "Nov 2018",
      "location": "Japan",
      "responsibilities": "Utilized **Python**, **Golang**, and **JavaScript** to develop and enhance backend services for trade execution and portfolio management, ensuring alignment with QA methodologies.\nExecuted comprehensive **API testing** and integration testing, ensuring high-quality software delivery with **90%** test coverage across multiple services.\nImplemented automated test suites using **PyTest** and **tox**, reducing manual testing time by **40%** and accelerating the overall Software Development Life Cycle (SDLC).\nUtilized defect tracking tools and logging tools to identify, analyze, and resolve issues, contributing to a bug resolution rate of **95%** within development iterations.\nApplied **Agile** methodologies and participated in **SCRUM** meetings for effective time management and prioritization of QA tasks, enhancing team collaboration.\nEngineered and maintained integration for real-time price feed processors with **WebSockets**, ensuring optimized performance for high-frequency trading operations.\nConducted thorough functional, regression, and load testing with specific focus on applications backed by **PostgreSQL** and **Redis**, ensuring reliability and compliance with regulatory standards including **MiFID II** and **GDPR**.\nIntroduced job scheduling solutions using **Celery** and **RabbitMQ**, optimizing backend task execution times and enhancing overall system responsiveness.\n"
    }
  ],
  "skills": " \n**Programming Languages**\n\tPython, JavaScript, Golang, Typescript\n\n**Backend Frameworks**\n\tFastAPI, Flask, Django, Celery\n\n**Frontend Frameworks**\n\t\n\n**API Technologies**\n\tREST/gRPC APIs, API testing\n\n**Serverless and Cloud Functions**\n\tAWS (EC2, S3, Lambda), Google Cloud\n\n**Databases**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps**\n\tDocker, Kubernetes, GitHub Actions, Azure DevOps, CI/CD, Logging tools, CLI tools\n\n**Cloud & Infrastructure**\n\tAzure\n\n**Other**\n\tQA methodologies, Test automation, Defect tracking tools, Functional testing, Regression testing, Integration testing, SDLC, Time management, Interpersonal skills, Microservices, Kafka, Load testing, Stress testing, PyTest, Git, SCRUM, Agile"
}