{
  "name": "Rei Taro",
  "role_name": "Senior Engineer",
  "email": "rei515@outlook.com",
  "phone": "+48732529451",
  "address": "Warszawa, Poland",
  "linkedin": "https://www.linkedin.com/in/rei-taro-81a410391/",
  "profile_summary": "Results-driven Senior Engineer with over 10 years of experience in project management and advanced technical skills, including **AutoCAD**, **Fusion**, and **Solidworks** for 3D modeling and design. Proficient in metalworking, forming, and machining processes that ensure high-quality manufacturing outcomes. Versatile in utilizing tools such as **Bluebeam Revu**, **MS Word**, and **Excel** to enhance project efficiency and communication. Committed to delivering innovative engineering solutions while leveraging strong analytical and problem-solving abilities.",
  "education": [
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2010",
      "to_year": "2015",
      "location": "Japan",
      "university": "Keio University"
    }
  ],
  "experience": [
    {
      "role": "Senior Engineer",
      "company": "Leobit",
      "from_date": "Aug 2022",
      "to_date": "Present",
      "location": "Poland",
      "responsibilities": "• Engineered 3D models and prototypes in **Fusion 360** and **SolidWorks** for precision design and development of components, enhancing workflow efficiency by **30%**.\n• Executed advanced **metalworking** and **machining** techniques to transform designs into durable products, significantly reducing production time by **15%**.\n• Developed comprehensive project plans using **AutoCAD** and **Bluebeam Revu** to showcase design layouts and project timelines, ensuring projects stayed within budget.\n• Utilized **Microsoft Word** and **Excel** for meticulous documentation and reporting, achieving a documentation accuracy rate of **98%**.\n• Led project management initiatives, coordinating with cross-functional teams to maintain alignment on project goals and deadlines, resulting in successful completion of **10** major projects annually.\n• Streamlined project communications and tracking through robust use of digital tools and methodologies, contributing to improved team collaboration."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Innovature",
      "from_date": "Nov 2018",
      "to_date": "Jun 2022",
      "location": "Japan",
      "responsibilities": "• Demonstrated expertise in **3D modeling** using **Fusion** and **Solidworks** to create precise designs and prototypes, enhancing project efficiency by **25%**.\n• Leveraged **AutoCAD** and **Bluebeam Revu** for drafting and creating detailed technical drawings and ensuring accuracy in implementation, achieving a **95%** compliance rate with project specifications.\n• Applied **metalworking**, **forming**, and **machining** techniques to fabricate components, contributing to a **15%** reduction in production costs through efficient resource management.\n• Managed project timelines and deliverables using MS Word and **Excel**, ensuring all project milestones were met or exceeded within set budgets and schedules.\n• Led cross-functional teams in **project management**, fostering collaboration to drive projects to successful completion while adhering to regulatory standards.\n• Conducted quality control assessments, implementing process improvements that resulted in a **30%** decrease in defects and enhanced overall product reliability."
    },
    {
      "role": "Software Developer",
      "company": "Wizcorp",
      "from_date": "Apr 2015",
      "to_date": "Nov 2018",
      "location": "Japan",
      "responsibilities": "- Led project management initiatives to drive the development of innovative 3D models using **Fusion** and **Solidworks** to meet project deadlines and specifications, achieving a 30% reduction in design cycle time.\n- Utilized **AutoCAD** to create detailed engineering drawings and plans, ensuring adherence to industry standards across **9** major projects in the last fiscal year.\n- Executed advanced metalworking and machining processes to fabricate components, improving part accuracy by **15%** through precise forming techniques.\n- Collaborated effectively with cross-functional teams to enhance engineering processes and utilized **Bluebeam Revu** for efficient document management and markup, speeding up project approvals by **25%**.\n- Conducted comprehensive reporting and documentation using **MS Word** and **Excel**, boosting team productivity through organized project tracking and resource allocation.\n- Developed and maintained project schedules, overseeing tasks and milestones to ensure timely completion and alignment with budgets and client expectations."
    }
  ],
  "skills": " **Programming Languages**\n\tPython (3.8+), SQL, Bash, JavaScript\n\n **Backend Frameworks**\n\tFastAPI, Flask, Django, Celery\n\n **Frontend Frameworks**\n\t\n\n **API Technologies**\n\tREST/gRPC APIs, Microservices\n\n **Serverless and Cloud Functions**\n\tAWS (EC2, S3, Lambda), Azure\n\n **Databases**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n **DevOps**\n\tDocker, Kubernetes, GitHub Actions, Azure DevOps, CI/CD, PyTest, Git\n\n **Cloud & Infrastructure**\n\t\n\n **Other**\n\t3D modeling, Fusion, Solidworks, metalworking, forming, machining, AutoCAD, Bluebeam Revu, MS Word, Excel, project management",
  "apply_company": "Not specified"
}