{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Principal Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-623a26390/",
  "profile_summary": "Principal Engineer with 13+ years of robust experience in **Cloud-based solutions** and **Microservices** within the healthcare and financial sectors. Proficient in delivering high-performance applications utilizing **Java**, **AWS**, and **Azure** alongside expertise in **CI/CD** processes and **Distributed systems**. Adept at implementing **observability** practices and applying **system design patterns** to meet compliance-driven development standards such as HIPAA and PCI DSS.\n\nSkilled in advanced technologies including **JavaScript**, **TypeScript**, **Python**, and **Flutter**, with a strong foundation in both frontend and backend frameworks including **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**. Experienced in building AI/ML platforms for predictive analytics and real-time processing, leveraging **MLOps** tools such as **MLflow**, **Airflow**, and **Kubeflow**. Demonstrated leadership capabilities complemented by strong communication and analytical skills, focused on metrics-driven development and fostering innovation.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Principal Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Designed and implemented **cloud-based solutions** leveraging **GCP** and **Azure**, ensuring high availability and scalability across multiple regions.\n• Led the development of **microservices architectures** that promote distributed systems, enhancing system resilience and facilitating continuous integration/continuous deployment (**CI/CD**) practices.\n• Developed robust CI/CD pipelines using tools such as **GitHub Actions** and **Azure DevOps**, incorporating best practices in observability and metrics-driven development to monitor performance.\n• Executed system design patterns to optimize architecture for new projects, applying analytical skills to assess risks and make informed decisions.\n• Championed a culture of observability within teams, implementing monitoring solutions that enable proactive detection of issues and improve system reliability.\n• Collaborated effectively with cross-functional teams, enhancing communication channels and ensuring alignment on project goals and deliverables.\n• Mentored junior engineers, promoting leadership skills while fostering an environment of continuous learning and innovation.\n• Delivered measurable improvements to project delivery timelines by **30%**, utilizing Agile methodologies and employing best practices in project management.\n• Drove the successful adoption of **observability** tools, resulting in a **25%** increase in the team's ability to diagnose and resolve critical system issues.\n• Established key performance indicators (KPIs) related to system performance and team productivity, using data-driven insights to support project decisions.\n• Participated in stakeholder meetings regularly, providing updates on project status and actively seeking feedback to align with business objectives."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Leveraged **Cloud-based solutions** with an emphasis on **Azure** and **GCP** to create scalable architectures that support high-demand financial applications.\nUtilized **Microservices** and **Distributed systems** principles to redesign core financial platforms, enhancing scalability and efficiency in handling over **1M** transactions daily.\nImplemented robust CI/CD pipelines to automate deployments, resulting in a **40%** reduction in release times and improved system reliability.\nCultivated a metrics-driven development environment, utilizing observability tools to monitor application performance and identify bottlenecks, achieving a **30%** improvement in response times.\nDemonstrated leadership by mentoring a team of **10+** engineers, fostering best practices in software development and design patterns.\nFacilitated effective communication across multiple departments, driving collaborative efforts toward achieving company-wide technical objectives.\nApplied strong analytical skills to troubleshoot complex system issues, ensuring system uptime of over **99.9%**.\n"
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Led the design and implementation of **cloud-based solutions** leveraging **GCP** and **Azure** to optimize system architecture for scalability and reliability across a global e-commerce platform.\nDirected the development of microservices using **Java** to ensure seamless integration and functionality of key components, achieving a **25%** reduction in transaction latency.\nImplemented **CI/CD** pipelines to streamline deployment processes, enhancing team productivity and increasing deployment frequency by **40%**.\nEstablished observability metrics and monitoring strategies to track performance and reliability, ensuring systems met operational targets and minimizing downtime to under **2%** annually.\nEngineered distributed systems capabilities to support architectural resilience and fault tolerance, critical for high-traffic workflows and supporting up to **500K** simultaneous users.\nFostered a culture of metrics-driven development, mentoring teams in best practices for performance tracking, enabling data-driven decision-making for ongoing improvements.\nUtilized system design patterns to craft robust solutions that accommodate business growth and changes in technology, ensuring adaptability and longevity in the architectural vision.\nEnhanced cross-team communication and collaboration, aligning engineering efforts with business goals and improving project delivery times by **30%**.\nDemonstrated strong analytical skills in troubleshooting complex issues, identifying root causes and implementing innovative, effective solutions in a timely manner.\nCultivated leadership within the engineering team, driving performance evaluations and career development to ensure high levels of engagement and talent retention."
    }
  ],
  "skills": " **Programming Languages:**\n\tJava, Python, JavaScript/TypeScript\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tKeycloak (OIDC, RBAC), OAuth2, JWT\n\n**Serverless and Cloud Functions:**\n\tAWS: Lambda, Azure: App Services\n\n**Cloud & Infrastructure:**\n\tGCP, Azure, Docker, Kubernetes, GitHub Actions, GitLab CI/CD\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps:**\n\tCI/CD, Metrics-driven development, Terraform, Ansible, Helm, Docker Compose\n\n**Other:**\n\tCloud-based solutions, Microservices, Distributed systems, Observability, System design patterns, Leadership, Communication, Analytical skills"
}