{
  "name": "Mariusz Jan Skobel",
  "role_name": "Node.js Engineer",
  "email": "mariuszskobel15@outlook.com",
  "phone": "+48 735 343 548",
  "address": "Katowice, Poland",
  "linkedin": "https://www.linkedin.com/in/mariusz-skobel-789557397/",
  "profile_summary": "Node.js Engineer with 10+ years of experience in building high-performance software solutions, specializing in **Node.js**, **AWS**, and continuous integration/delivery. Proficient in developing responsive web applications using **React** and **TypeScript**, alongside expertise in NoSQL databases like **Amazon DynamoDB** and RDBMS such as **Amazon Aurora PostgreSQL**. Demonstrated ability to implement **AWS Lambda** functions for scalable services.\nExtensive background in AWS cloud services, complemented by a robust understanding of automated CI/CD pipelines. Passionate about driving innovation and operational efficiency, leveraging **AI tools** to enhance application functionalities. Known for strong English communication skills and a commitment to delivering secure, maintainable solutions that adhere to compliance standards.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2012",
      "to_year": "2015",
      "location": "UK",
      "university": "University of Bristol"
    }
  ],
  "experience": [
    {
      "role": "Node.js Engineer",
      "company": "EitBiz",
      "from_date": "Oct 2022",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Designed and implemented scalable, full-stack solutions using **Node.js**, **TypeScript**, and modern frontends in **React**, adhering to best practices in **responsive web apps** development.\n• Developed and deployed cloud-based applications utilizing **AWS Lambda**, ensuring high-performance and cost-effective serverless solutions.\n• Built applications with integration to **NoSQL** databases like **Amazon DynamoDB** and **RDBMS** options such as **Amazon Aurora PostgreSQL** for efficient data management.\n• Implemented enterprise-level **continuous integration** and **continuous delivery** (CI/CD) pipelines using **Jest** for testing, driving rapid development cycles and high-quality code delivery.\n• Collaborated closely with cross-functional teams, enhancing **English communication** skills to translate technical requirements into user-friendly applications.\n• Delivered mobile applications with smooth user interfaces across platforms, leveraging modern frameworks and libraries to optimize performance and responsiveness.\n• Led initiatives to improve application monitoring and error tracking leveraging cloud services to ensure top availability and seamless user experiences.\n• Established robust testing frameworks using **Jest** and other tools to ensure quality across multiple layers of applications, enhancing overall reliability.\n• Developed and integrated AI-driven functionalities into applications to improve user engagement and satisfaction, showcasing the use of advanced **AI tools**.\n• Contributed actively to projects involving the migration of legacy systems to microservices architecture, significantly increasing application scalability and maintainability."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Tvn S.A.",
      "from_date": "Oct 2019",
      "to_date": "Sep 2022",
      "location": "Poland",
      "responsibilities": "- Developed scalable and responsive web applications using **Node.js**, **React (18)**, and **TypeScript**, ensuring high performance and maintainability for financial services.\n- Implemented **AWS Lambda** for serverless computing solutions, enhancing application responsiveness while reducing infrastructure costs by **30%**.\n- Designed and managed databases with **Amazon DynamoDB** and **Amazon Aurora PostgreSQL**, optimizing data retrieval processes and ensuring high availability for critical financial datasets.\n- Introduced continuous integration and continuous delivery (CI/CD) practices that increased deployment frequency by **40%**, improving overall release quality and speed.\n- Onboarded users onto dynamic dashboards and admin portals, leveraging **Jest** for robust testing frameworks and ensuring quality in production releases.\n- Created ETL processes using **Apache Airflow** for batch and real-time ingestion of data, significantly reducing data processing times by **50%**.\n- Deployed AI-powered solutions using advanced **AI tools** for fraud detection and transaction analysis, resulting in a **25%** improvement in anomaly detection efficacy.\n- Focused on enhancing English communication skills to effectively collaborate with cross-functional teams and stakeholders, ensuring clarity in requirements and project updates."
    },
    {
      "role": "Software Engineer",
      "company": "Timspark",
      "from_date": "Sep 2015",
      "to_date": "Aug 2019",
      "location": "UK",
      "responsibilities": "Developed and optimized backend services for high-performance applications using **Node.js** (NestJS, Express), specializing in responsive web apps to ensure scalability and maintainability in codebase, achieving a response time improvement of **30%**.\nImplemented cloud solutions leveraging **AWS** services, including **AWS Lambda**, for serverless architecture improving deployment time by **50%** and reducing operational costs.\nDesigned and managed NoSQL databases like **Amazon DynamoDB** for dynamic data handling while utilizing **RDBMS** like **Amazon Aurora PostgreSQL** for structured data storage, ensuring data integrity and quick access to over **1 million** records.\nEnhanced application reliability and user experience by integrating **TypeScript** and developing testing strategies using **Jest**, resulting in a decrease of bug reports by **40%** post-deployment.\nExecuted continuous integration and continuous delivery (CI/CD) pipelines to automate build and deployment processes, leading to a **25%** faster time-to-market for new features and improvements.\nProduced AI-driven functionality using various AI tools to enhance application intelligence, contributing to a **15%** increase in user engagement and customer satisfaction ratings.\nCommunicated effectively with cross-functional teams, ensuring clarity in requirements and that project milestones were met, improving overall team efficiency through clear English communication.\nCrafted responsive UI components utilizing **React**, ensuring a seamless experience across devices and browser compatibilities, leading to an uplift in user retention rates by **20%**."
    }
  ],
  "skills": " **Backend Frameworks:**\n\tPython(FastAPI, Flask, Django), Node.js\n\n **Frontend Frameworks:**\n\tJavaScript/TypeScript (React, Vue, Angular), Typescript, Jest\n\n **API Technologies:**\n\tAWS (ECS, Lambda, RDS, S3), Keycloak (OIDC, RBAC), JWT, OAuth2\n\n **Serverless and Cloud Functions:**\n\tAWS Lambda, Amazon DynamoDB\n\n **Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis, RDBMS, Amazon Aurora PostgresSQL, NoSQL\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose, continuous integration, continuous delivery\n\n **Cloud & Infrastructure:**\n\tAWS, Azure (App Services, Blob, SQL)\n\n **Other:**\n\tAI tools, responsive web apps, English communication, Windsurf"
}