{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior FullStack Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Senior Full Stack Engineer with over 13 years of experience in delivering high-performance applications, particularly in compliance-driven industries such as healthcare and finance. Proficient in **Java**, **Spring Boot**, **JavaScript**, **TypeScript**, and **React**, with extensive hands-on experience in both frontend and backend development, utilizing **Node.js** and **FastAPI**. Skilled in designing **microservices** architectures and implementing robust **CI/CD** pipelines using tools like **GitHub**, **GitHub Actions**, **Jenkins**, and **SonarQube**.\n\nExperience deploying applications on **cloud** platforms, particularly **AWS** and **Azure**, ensuring scalability and reliability. Committed to delivering clean, maintainable code by adhering to best practices in **Agile** and **Scrum** methodologies, along with a strong understanding of **Design Patterns** and **Unit Testing** methodologies. Recognized for expertise in creating AI/ML-powered platforms and MLOps, enhancing application capabilities with predictive analytics and automation.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior FullStack Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Developed and maintained full-stack applications using **Java**, **Spring Boot**, and **React** (17–18), ensuring adherence to clean code principles and design patterns.\n• Implemented responsive designs with **HTML** and **CSS** to enhance user experience across multiple platforms.\n• Architected microservices solutions to improve application scalability and maintainability, leveraging **Cloud** technologies for deployment.\n• Created and optimized CI/CD pipelines utilizing **GitHub Actions** and **Jenkins**, achieving deployment efficiencies that reduced release times by **30%**.\n• Conducted thorough unit testing using **SonarQube** and other testing frameworks to ensure high-quality code before merging to production.\n• Engaged in Agile/Scrum methodologies to iteratively deliver features and enhancements in a timely manner, participating in sprint planning and retrospectives.\n• Collaborated closely with cross-functional teams to ensure seamless integration and high-quality deliverables, influencing project direction with strong problem-solving skills.\n• Maintained existing legacy systems by applying best practices in clean coding and refactoring, resulting in a **40%** decrease in technical debt.\n• Supported responsive design initiatives, enhancing site accessibility and usability across diverse devices, elevating user satisfaction scores by **25%**.\n• Documented development processes and architectural decisions to facilitate knowledge sharing and onboarding of new team members."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Utilized **Java** and **Spring Boot** to develop and modernize core applications, ensuring adherence to **Clean Code** principles and **Design Patterns** for maintainability.\nImplemented **React (18)** and **TypeScript** to build responsive front-end applications, enhancing user experience for both financial tools and admin panels with **HTML** and **CSS**.\nDesigned a microservices architecture to improve scalability and performance by leveraging **CI/CD** practices with **GitHub Actions**, **Jenkins**, and **SonarQube** for streamlined deployment processes.\nCollaborated in an **Agile** environment, participating in **Scrum** meetings to ensure timely delivery of high-quality software products, achieving a sprint goal adherence rate of **95%**.\nDeveloped and enforced **Unit Testing** strategies to maintain code quality, resulting in a **30%** reduction in bug reports post-deployment.\nIntegrated responsive design principles to ensure high functionality across diverse devices, leading to a **25%** increase in user engagement metrics.\nOptimized automated deployments to cloud environments, enhancing deployment frequency by **40%**, ensuring up-to-date feature releases and bug fixes.\nCreated and maintained documentation for all processes and systems, enhancing team onboarding experience and knowledge retention by **20%**."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "• Developed and optimized full-stack applications utilizing **Java** and **Spring Boot** for backend services, ensuring high availability and scalability for critical business processes.\n• Employed **Microservices** architecture to facilitate modularity and maintainability, enhancing the application's responsiveness and fostering quicker deployment cycles.\n• Constructed dynamic user interfaces utilizing **React** (17), **TypeScript**, and modern JavaScript, delivering a seamless and responsive experience across web and mobile platforms with significant performance improvements.\n• Integrated **CI/CD** pipelines using **GitHub Actions** and **Jenkins**, to automate testing and deployment processes, ensuring a robust and efficient workflow with reduced deployment times by **30%**.\n• Conducted unit testing and code reviews leveraging **SonarQube** for maintaining code quality and adherence to **Clean Code** principles.\n• Utilized **HTML5** and **CSS3** for crafting responsive designs, increasing mobile engagement metrics by **50%** through improved user experience and accessibility compliance (WCAG 2.1).\n• Leveraged cloud services for deployment and scaling, ensuring applications are optimally hosted and maintained with a high level of cost efficiency.\n• Executed Agile methodologies, engaging in Scrum practices to align team efforts with project timelines and deliverables, enhancing team productivity by **40%**.\n• Designed software solutions following **Design Patterns** to promote best practices and thus reducing code complexity and enhancing maintainability.\n• Collaborated with cross-functional teams to facilitate the integration of new features and resolve issues swiftly, ensuring a high standard of customer satisfaction."
    }
  ],
  "skills": "Programming Languages:\n\tJava, Python, JavaScript, TypeScript\n\n**Backend Frameworks:**\n\tSpring Boot, FastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tMicroservices, OAuth2, JWT, Keycloak (OIDC, RBAC)\n\n**Serverless and Cloud Functions:**\n\tAWS: Lambda, ECS, Azure: App Services\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Jenkins\n\n**Cloud & Infrastructure:**\n\tAWS: RDS, S3, Azure: Blob Storage, SQL Database, Terraform, Ansible, Helm, Docker Compose\n\n**Other:**\n\tHTML, CSS, Responsive Design, Agile, Scrum, Clean Code, Design Patterns, Unit Testing, MLflow, Airflow, Kubeflow, Nginx, Let’s Encrypt, Certbot, SonarQube",
  "apply_company": "Jedox"
}