{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Full-Stack Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-karol-kotlinski-bb2520397/",
  "profile_summary": "As a Full-Stack Engineer with 8 years of hands-on experience, I excel in utilizing **TypeScript**, **React**, **Node.js**, and **Postgres** to develop high-performance applications that meet dynamic user needs. My expertise in **GraphQL** enhances data fetching efficiency while leveraging **Redis** for optimized caching solutions. I thrive in Agile environments, effectively collaborating with cross-functional teams to deliver impactful solutions driven by design thinking and customer research.\n\nI have a strong foundation in full-stack development, bringing proficiency in both front-end and back-end technologies, including **JavaScript**, **Python**, **Flutter**, **Next.js**, **Vue**, **FastAPI**, and **Django**. My cloud experience encompasses deploying and managing applications on **Azure** and **AWS**. I’ve successfully launched enterprise-grade platforms with integrated AI/ML features, aligning with compliance standards such as HIPAA and PCI DSS. With hands-on experience in CI/CD automation and microservices architecture, I focus on building robust and secure applications while implementing MLOps workflows with tools like MLflow, Airflow, and Kubeflow.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Full-Stack Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Utilized **TypeScript** and **Node.js** to architect and develop scalable full-stack applications that enhance customer experience and drive product innovation, while adhering to Agile methodologies.\nImplemented user-centric designs leveraging **React** and **GraphQL** to create responsive, interactive web interfaces, leading to a 30% increase in user engagement.\nCollaborated cross-functionally with product management and design teams, conducting over 15 customer research sessions to refine feature sets and improve overall product usability.\nDesigned and maintained databases using **Postgres** and **Redis**, optimizing query performance by up to 25%, enabling efficient data retrieval for applications.\nActively participated in Agile sprints, contributing to team ceremonies and ensuring clear communication of technical concepts to stakeholders, resulting in a 20% improvement in project delivery timelines.\nEngaged in design thinking exercises, fostering innovation in product features that cater to customer needs, reflected in a 15% boost in customer satisfaction scores.\nLed frontend and backend integration efforts to ensure seamless functionality, utilizing best practices in communication and collaboration across teams, leading to a successful launch of 3 major projects within a year.\nDeveloped robust unit and integration tests to ensure high-quality code delivery, employing frameworks such as Jest, which reduced the number of production bugs by 40%.\nMentored junior engineers in best practices and effective use of **React** and **Node.js**, promoting a culture of continuous improvement within the team.\nIntegrated user feedback mechanisms into web applications, allowing for iterative data-driven enhancements, culminating in significant client retention increases."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Utilized **TypeScript** and **React (18)** to build dynamic, user-focused front-end applications that enhance the user experience in financial platforms, ensuring high responsiveness and performance.\nDeveloped back-end services using **Node.js (NestJS/Express)** and **Postgres** to facilitate scalable and maintainable microservices architecture, improving throughput for high-volume transactions by up to **50%**.\nEmployed Agile methodologies to lead cross-functional teams through product development cycles, applying **Design Thinking** and **Customer Research** to align solutions with user needs and business objectives.\nImplemented **GraphQL** for efficient data fetching, optimizing data retrieval processes by reducing the amount of data transferred over the network by **30%**.\nCollaborated regularly with stakeholders and team members to communicate project goals and progress, showcasing strong **Collaboration** and **Communication** skills throughout the development phases.\nEnhanced application performance and user experience by integrating **Redis** for caching, thereby improving load times by approximately **40%**.\nLed efforts in product management by prioritizing features based on customer feedback, ensuring alignment with the product roadmap and facilitating continuous improvement.\nUtilized modern development practices to continuously deliver features and improvements, thereby reducing time-to-market for new functionalities to under **4 weeks**."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Utilized **TypeScript** and **React** (18) to develop scalable and responsive frontend applications, enhancing user engagement and optimized workflows for e-commerce platforms.\nImplemented **Node.js** (NestJS, Express) for backend services, achieving high availability and low latency across critical modules such as checkout and order fulfillment, while ensuring a **Postgres** database design for optimal data retrieval and manipulation.\nEmployed **Redis** for caching frequently accessed resources, resulting in a significant performance increase by reducing database read pressure by over **30%**.\nCollaborated in an **Agile** environment, utilizing effective **collaboration** and **communication** skills to drive project progress and incorporate **customer research** findings into product designs.\nIntegrated **GraphQL** for flexible data retrieval in frontend applications, resulting in a **20%** decrease in API response times for data-driven interfaces.\nEngaged in **Product Management** practices, applying **design thinking** methodologies to create innovative e-commerce solutions that meet customer needs and improve user experiences.\nApplied design principles to build SEO-friendly and accessible e-commerce UIs using **HTML5/CSS3**, adhering to accessibility compliance standards (WCAG 2.1) while maintaining a **mobile-first** approach.\nFostered open communication across teams to ensure project alignment and effectively manage sprint priorities and deliverables for successful product launches."
    }
  ],
  "skills": "**Programming Languages:**\n\tPython, TypeScript\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django, Node.js\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tGraphQL\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda), Azure (App Services)\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS (RDS, S3), Azure (Blob, SQL)\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, Agile, Product Management, Design Thinking, Customer Research, Collaboration, Communication, Authentication & Security (Keycloak, JWT, OAuth2, Let’s Encrypt, Nginx, Certbot)"
}