{
  "name": "Rei Taro",
  "role_name": "Senior Solutions Engineer",
  "email": "rei515@outlook.com",
  "phone": "+48732529451",
  "address": "Warszawa, Poland",
  "linkedin": "https://www.linkedin.com/in/rei-taro-81a410391/",
  "profile_summary": "Dynamic Senior Solutions Engineer with over 10 years of experience specializing in blockchain technologies, including **Solidity**, **Rust**, and **MOVE**. Skilled in delivering **DeFi** solutions and developing **DApps** to meet diverse client needs. Proficient in conducting technical discovery, providing architectural recommendations, and performing technical configurations to ensure optimal system performance. Experienced in creating impactful **Proof of Concept** projects and facilitating product demonstrations to enhance customer success. Previous roles at leading organizations like VISA, Sii Poland, and Reply Polska have honed exceptional skills in account management and commercial negotiations, driving project success and client satisfaction with innovative technical solutions.",
  "education": [
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2010",
      "to_year": "2015",
      "location": "Japan",
      "university": "Keio University"
    }
  ],
  "experience": [
    {
      "role": "Senior Solutions Engineer",
      "company": "Leobit",
      "from_date": "Aug 2022",
      "to_date": "Present",
      "location": "Poland",
      "responsibilities": "Managed technical discovery processes and gathered requirements to support the development of innovative blockchain solutions using **Solidity** and **Rust** in **DeFi** applications.\nProvided architectural recommendations for deploying **DApps**, ensuring optimal performance and scalability across platforms.\nConducted Proof of Concept demonstrations that highlighted the advantages of blockchain technologies, showcasing project success rates of over **85%**.\nFacilitated commercial negotiations with clients, resulting in increased customer success and account management efficiencies, contributing to a **20%** growth in revenues.\nEngineered backend services utilizing **FastAPI** to streamline custom solutions for client needs with a focus on rapid deployment and performance improvements.\nCollaborated with cross-functional teams to address integration challenges and ensure compliance while overseeing release strategies for new features and updates.\nLed security assessments for applications and enforced protocols in line with enterprise standards, enhancing system reliability by **30%**."
    },
    {
      "role": "Software Engineer",
      "company": "Innovature",
      "from_date": "Nov 2018",
      "to_date": "Jun 2022",
      "location": "Japan",
      "responsibilities": "Utilized **blockchain**, particularly **Solidity** and **Rust**, to develop and enhance decentralized applications (DApps) that meet client specifications and industry standards.\nConducted technical discovery sessions to gather requirements and provide architectural recommendations for **DeFi** solutions.\nDeveloped **Proof of Concept** implementations to demonstrate the capabilities of innovative blockchain solutions, resulting in 50% faster approval time for client projects.\nEngaged in commercial negotiations, ensuring client satisfaction and retention by addressing technical configuration needs and providing tailored solutions.\nLed product demonstrations showcasing the competitive advantages of our blockchain technology, enhancing customer success rates by 30%.\nMaintained active account management for over 15 major clients, driving continual success and adoption of new features in the blockchain ecosystem."
    },
    {
      "role": "Software Developer",
      "company": "Wizcorp",
      "from_date": "Apr 2015",
      "to_date": "Nov 2018",
      "location": "Japan",
      "responsibilities": "• Conducted technical discovery to identify and implement effective solutions for blockchain applications, leveraging **Solidity**, **Rust**, and **MOVE** for smart contract development.\n• Provided architectural recommendations for DeFi and DApps, ensuring optimal performance and scalability in transaction-heavy environments.\n• Developed Proof of Concept projects to validate blockchain integration and functionality, leading to a **30%** reduction in development time for new features.\n• Facilitated product demonstrations to stakeholders, highlighting key benefits and capabilities while achieving a **90%** approval rate.\n• Managed account portfolios and guided customers through technical configurations, contributing to a **25%** increase in customer success metrics.\n• Engaged in commercial negotiations to secure partnerships and contracts, enhancing the company's position within the decentralized finance sector.\n• Collaborated with cross-functional teams to ensure regulatory compliance and robust security measures in blockchain implementations."
    }
  ],
  "skills": " **Programming Languages**\n\tRust, Solidity, MOVE, Python (3.8+), SQL, Bash, JavaScript\n\n**Backend Frameworks**\n\tFastAPI, Flask, Django, Celery\n\n**Frontend Frameworks**\n\t\n\n**API Technologies**\n\tREST/gRPC APIs, Microservices\n\n**Serverless and Cloud Functions**\n\tAWS (EC2, S3, Lambda), Azure, Docker, Kubernetes\n\n**Databases**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps**\n\tGitHub Actions, Azure DevOps, CI/CD, PyTest, Git\n\n**Cloud & Infrastructure**\n\t\n\n**Other**\n\tblockchain, DeFi, DApps, technical discovery, architectural recommendations, technical configuration, Proof of Concept, product demonstrations, account management, customer success, commercial negotiations, Kafka, Pandas, NumPy, scikit-learn, TensorFlow, Airflow, MLflow",
  "apply_company": "Chainlink Labs"
}