{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Remote Data Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-kotlinski-08ba40390/",
  "profile_summary": "As a Remote Data Engineer with 8 years of Full Stack Development experience, I excel in managing the job cycle process and real-time job monitoring within the digital oilfield domain. My technical proficiency includes building high-performance solutions using **JavaScript**, **TypeScript**, **Python**, and **Flutter**, integrating with **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django** frameworks. I have substantial experience in utilizing cloud services such as **Azure** and **AWS** to deploy robust data solutions that ensure compliance with industry standards.\n\nI am skilled in problem-solving and communication, capable of overseeing technical equipment and implementing effective transmission protocols. My background includes developing and maintaining machine learning pipelines, serving ML models in production, and driving MLOps workflows using tools such as **MLflow**, **Airflow**, and **Kubeflow**. My expertise in microservices architecture and CI/CD automation allows for agile project delivery and high-quality outputs, all while leveraging strong analytical skills to enhance data processing efficiencies.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Remote Data Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Managed the Job Cycle process for data engineering tasks, ensuring timely and efficient completion of projects while enhancing productivity through effective communication.\nImplemented real-time job monitoring solutions to track data processing and pipeline performance, utilizing monitoring tools and techniques for proactive problem-solving.\nUtilized strong IT skills to work with digital oilfield technologies, optimizing data flows and enhancing operational efficiency.\nDeveloped and maintained technical equipment interfaces and transmission protocols, ensuring reliable data exchange across various platforms.\nApplied analytical skills to assess complex data sets and provide actionable insights, contributing to strategic decision-making in the organization.\nArchitected scalable data pipelines and ETL processes leveraging **Python**, **Apache Airflow**, and **PostgreSQL**, ensuring data integrity and optimal performance in real-time environments.\nCollaborated with cross-functional teams to facilitate knowledge sharing and enhance data-driven initiatives, fostering a culture of continuous improvement in data engineering practices.\nUtilized **Git** for version control, enhancing team collaboration and maintaining code integrity across development and production environments.\nMonitored data workflows utilizing metrics and analytics tools, achieving a **30%** reduction in data processing time through optimizations.\nParticipated in agile methodologies, contributing to sprint planning and retrospectives to improve workflow and deliver high-quality results in line with business objectives."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Managed the Job Cycle process by overseeing the development and modernization of financial platforms, employing **Node.js (NestJS/Express)** and **Python (FastAPI, Django)** for a microservices-based architecture, which enhanced scalability and maintainability for systems handling **1M+** transactions daily.\nImplemented real-time job monitoring systems using **React (18)** and **D3.js**, enabling the tracking of financial activity and immediate anomaly detection, thereby improving operational responsiveness by **30%**.\nProblem-solved complex integration challenges through the use of **Kafka**, **RabbitMQ**, and **Azure Service Bus**, establishing an event-driven architecture that streamlined 90% of asynchronous transaction processes.\nCommunicated technical requirements effectively with cross-functional teams to build user-focused front-end applications with **React**, **Next.js**, and **TypeScript**, leading to a **40%** increase in user engagement on dashboards and admin portals.\nAnalyzed job-related data and performance metrics leveraging **Python**, **Apache Airflow**, and **Azure Data Factory**, orchestrating ETL pipelines that facilitated **real-time** and batch ingestion of data from various internal and third-party sources, impacting data processing times by **50%**.\nApplied analytical skills to design AI/ML-powered fraud detection systems using **scikit-learn**, **XGBoost**, and **Azure Machine Learning**, improving fraud flagging accuracy by **25%** through deeper insights into transaction patterns and user behavior.\nDeveloped communication workflows for credit scoring and churn prediction by creating ML pipelines using **MLflow** and **Airflow**, enabling seamless integration of model inference for real-time decision-making in banking systems."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Managed the Job Cycle process by designing and optimizing backend services for real-time job monitoring and reporting, ensuring high availability and scalability across digital oilfield applications.\nCommunicated effectively with cross-functional teams to troubleshoot and solve complex problems using analytical skills, enhancing overall platform resilience and performance.\nLeveraged **Python (FastAPI, Django)** and **Node.js (NestJS, Express)** to build responsive systems that support real-time job monitoring, optimizing latency and availability.\nImplemented real-time data transmission protocols using **WebSockets** and **Kafka**, enabling instant job updates and monitoring for operational efficiency across systems.\nUtilized technical equipment and tools, including **MongoDB**, **PostgreSQL**, and **Redis**, to manage distributed data storage and facilitate fault-tolerant access to high-traffic data workflows.\nApplied IT skills in managing performance gains through effective caching strategies with **Redis**, resulting in a **30%** reduction in read pressure on databases.\nDeveloped scalable communication strategies using **Kubernetes** namespaces for seamless deployment in evolving digital oilfield environments, ensuring controlled rollouts without disruption.\nImplemented secure access protocols using **OAuth 2.0** and **RBAC**, conforming to industry standards and ensuring data protection across all user interactions.\nUtilized analytical skills to create solutions that enhance job cycle performance and user experience, driving process improvements across the platform.\nFacilitated collaboration across departments, maintaining open lines of communication for ongoing job cycle management and problem resolution."
    }
  ],
  "skills": "Programming Languages:\n\tPython, JavaScript, TypeScript\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tJWT, OAuth2\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda), Azure (App Services)\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS (RDS, S3), Azure (Blob, SQL)\n\n**Other:**\n\tManaging the Job Cycle process, real time job monitoring, communication, problem-solving, digital oilfield, transmission protocols, technical equipment, IT skills, analytical skills, MLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), Let’s Encrypt, Nginx, Certbot"
}