{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Value Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Results-driven Full Stack Developer with 13+ years of experience in value-engineering and consulting, delivering high-performance applications in the healthcare and financial industries. Proficient in SaaS solutions and value-based selling, leveraging analytical skills and innovative business processes. Demonstrated ability in project management and cross-functional collaboration to enhance operational efficiency.\nTechnical expertise includes a robust tech stack: **JavaScript/TypeScript**, **Python**, **Flutter**, **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, **Django**, with hands-on experience in developing AI/ML-powered platforms for predictive analytics and automation. Adept at deploying cloud-native systems on **AWS** and **Azure**, implementing microservices and event-driven architectures, and establishing CI/CD pipelines.\nWell-versed in compliance-driven development aligning with HIPAA, FHIR, PCI DSS, and SOC 2 standards, with a strong background in MLOps, including model training, serving, and orchestration using **MLflow**, **Airflow**, and **Kubeflow**.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Value Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Engaged in **value-engineering** to optimize full-stack platforms for healthcare and fintech, ensuring delivery of high-quality solutions using **Python (FastAPI)**, **TypeScript**, and **Node.js** with front-end frameworks like **React (17–18)**, **Next.js**, and **Vue 3**.\nConducted in-depth **consulting** sessions to guide teams in developing mobile applications for both iOS and Android utilizing **Flutter** and **React Native**, enabling secure, real-time user interactions through effective state management with **Provider** and **Redux**.\nImplemented **SaaS** delivery models while creating CI/CD pipelines with **Fastlane** and **App Center**, integrating complete test automation, release workflows, and crash analytics using **Firebase Crashlytics** and **Sentry**.\nLed project management initiatives to transform legacy systems into microservices architectures, employing **Docker**, **Kubernetes (AKS/EKS)**, and **AWS Lambda** for scalable, fault-tolerant deployments.\nDemonstrated exceptional analytical skills by building and maintaining data infrastructures with **PostgreSQL**, **MongoDB**, **Redis**, and **GraphQL**, designed to facilitate heavy data ingestion and real-time analytics for health and finance sectors.\nConducted effective presentations on deploying ML models for risk scoring, fraud detection, and document classification using **scikit-learn**, **PyTorch**, and **TensorFlow**, integrating backend inference into live systems for performance tracking.\nApplied value-based-selling tactics by implementing **MLOps** workflows using **MLflow**, **DVC**, and **Airflow**, overseeing model training, validation, and deployment pipelines from development to production environments.\nPromoted cross-functional collaboration by integrating intelligent features into front-end applications, including personalized dashboards and predictive alerts, driven by models deployed on **Azure ML** and **AWS Sagemaker**.\nOversaw the development of DevOps pipelines using **GitHub Actions**, **CircleCI**, and **Azure DevOps**, ensuring rigorous test automation, linting, security checks, and multi-environment deployment processes.\nCreated advanced data visualization tools using **D3.js**, **Chart.js**, and **Power BI Embedded**, facilitating real-time analysis of key financial trends and operational KPIs.\nCollaborated with ML teams for deploying NLP models such as **spaCy** and **Hugging Face Transformers** for document parsing and anomaly detection, effectively exposing functionality through secured **REST APIs**.\nDefined and implemented comprehensive testing strategies across the technology stack utilizing **Jest**, **Cypress**, **Postman**, and **PyTest**, covering unit, integration, E2E, and contract-level tests with a focus on high-quality deliverables.\nIntegrated search capabilities with **Azure Cognitive Search** and **Elasticsearch**, enhancing querying speed and flexibility across structured and unstructured datasets in health and finance."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Applied **analytical skills** to modernize core financial platforms by migrating to microservices architecture using **Node.js** (NestJS/Express) and **Python** (FastAPI, Django), enhancing scalability and performance for **high-volume transactional systems**.\nUtilized **consulting** expertise to build interactive front-end applications with **React** (18), **Vue 3**, **Next.js**, and **TypeScript**, incorporating **Redux Toolkit** and **Tailwind CSS** to create sleek, responsive interfaces for financial tools and admin panels.\nEmployed **value-engineering** strategies to deliver real-time analytics dashboards with **React**, **D3.js**, and **Power BI Embedded**, providing operations teams with instant insights into transactions and anomalies based on **5 million** transactions analyzed daily.\nExecuted project management techniques to design and deploy a robust event-driven architecture using **Kafka**, **RabbitMQ**, and **Azure Service Bus**, ensuring asynchronous communication across critical workflows such as payments and compliance, achieving a **99.9%** uptime.\nDeveloped ETL pipelines for ingesting financial data from internal and third-party sources utilizing **Python**, **Apache Airflow**, and **Azure Data Factory**, supporting both batch and real-time processing for **10 TB** of data monthly.\nLeveraged **value-based selling** to build and deploy machine learning models for fraud detection using **scikit-learn**, **XGBoost**, and **Azure ML**, enabling proactive detection of suspicious activity based on user behavior and transaction patterns.\nOrchestrated the creation of ML pipelines for real-time credit scoring, churn prediction, and transaction classification, employing **MLflow** and **Airflow** to integrate model inference into backend services with processing times under **200ms**."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Leveraged **analytical skills** to design and optimize backend services for a global e-commerce platform using **Python (FastAPI, Django)** and **Node.js (NestJS, Express)**, ensuring high availability, low latency, and scalability across key modules like checkout, cart, and order fulfillment.\nUtilized **cross-functional collaboration** to engine real-time features utilizing **WebSockets** and event-driven architecture powered by **Kafka** and **RabbitMQ**, enabling responsive order updates, dynamic inventory tracking, and real-time customer support.\nApplied **project management** principles in the development of frontend applications using **React (18)**, **Vue 3**, and **Angular**, enhanced with **TypeScript**, **Redux Toolkit**, and **Tailwind CSS**, delivering fast, responsive user experiences on both web and mobile platforms.\nExecuted **value-engineering** strategies, leveraging **MongoDB**, **PostgreSQL**, **Redis**, and **Cassandra** for distributed data storage, ensuring fast, fault-tolerant data access for high-traffic e-commerce workflows with a focus on caching frequently accessed resources for performance gains.\nEngaged in **consulting** efforts to integrate AI/ML-based recommendation engines using **scikit-learn**, **LightGBM**, and **TensorFlow** to personalize product listings, optimize search relevance, and improve conversion rates based on real-time behavioral data.\nImplemented **value-based selling** techniques by establishing Redis caching for product metadata, shopping cart sessions, and search results, significantly improving application responsiveness and reducing read pressure on databases.\nDemonstrated **presentation** skills by implementing feature flags and blue-green deployments using **LaunchDarkly** and **Kubernetes** namespaces, enabling controlled rollouts, A/B testing, and risk mitigation during major platform updates.\nCreated responsive, SEO-friendly e-commerce UIs using **Next.js**, **Vue 3 + Nuxt**, and **HTML5/CSS3**, optimized for mobile-first engagement and accessibility compliance (**WCAG 2.1**).\nBuilt secure payment workflows integrated with **Stripe**, **PayPal**, and **Razorpay**, applying tokenized transactions and **PCI**-compliant handling of sensitive data, ensuring smooth financial operations for the e-commerce platform.\nApplied **role-based access control (RBAC)** and **OAuth 2.0** for secure customer and admin access, ensuring **GDPR** compliance and user data protection throughout the platform."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython: FastAPI, Flask, Django\n\tJavaScript/TypeScript: React, Vue, Angular\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n **Frontend Frameworks:**\n\tReact, Vue, Angular\n\n **API Technologies:**\n\tKeycloak (OIDC, RBAC), OAuth2, JWT\n\n **Serverless and Cloud Functions:**\n\tAWS: Lambda\n\tAzure: App Services\n\n **Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n **DevOps:**\n\tDocker, Kubernetes\n\tGitHub Actions, GitLab CI/CD\n\tTerraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:**\n\tAWS: ECS, RDS, S3\n\tAzure: Blob Storage, SQL Database\n\n **Other:**\n\tvalue-engineering, consulting, SaaS, value-based-selling, analytical-skills, business-process, presentation, project-management, cross-functional-collaboration",
  "apply_company": "dbt Labs"
}