{
  "name": "DANIEL HE",
  "role_name": "Backend Engineer",
  "email": "daniel.he8@outlook.com ",
  "phone": "+48 730 743 032",
  "address": "Rzeszów, Poland",
  "linkedin": "https://www.linkedin.com/in/daniel-he-9189a3390/",
  "profile_summary": "Results-driven Backend Engineer with extensive expertise in building robust **Node.js** and **Python** applications utilizing **FastAPI** for efficient back-end processes. Proven ability to design and implement **Microservices** architecture, develop scalable **APIs**, and leverage **AWS** for serverless computing solutions, ensuring high availability and performance. Adept at integrating **Databases** and optimizing **Data Synchronization** in **event-driven systems**. Recognized for driving automation initiatives that enhance software efficiency. Passionate about advancing technologies in **AI** and real estate applications, my background also includes delivering user-centric solutions across various sectors, including healthcare and finance.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2012",
      "to_year": "2016",
      "location": "Beijing, China ",
      "university": "Tsinghua University "
    }
  ],
  "experience": [
    {
      "role": "Backend Engineer",
      "company": "Britenet",
      "from_date": "Feb 2023 ",
      "to_date": "Present",
      "location": "Warsaw, Poland",
      "responsibilities": "Developed scalable **Node.js** microservices to enhance real estate technology applications, achieving an increase in response time by **50%**.\nDesigned and implemented **FastAPI** RESTful APIs for seamless data synchronization, reducing API response latency by **30%**.\nUtilized **AWS** serverless solutions to automate resource management, resulting in a **20%** reduction in operational costs.\nOptimized databases for high-performance data retrieval, improving query efficiency by **40%**.\nImplemented event-driven systems to streamline processing workflows, reducing operational bottlenecks by **25%**.\nLeveraged **Python** for data automation and analysis, increasing processing speed by **60%**.\nCreated comprehensive documentation and automated testing strategies to ensure software reliability and maintainability in line with best practices."
    },
    {
      "role": "Software Engineer",
      "company": "Alibaba Group",
      "from_date": "Oct 2020 ",
      "to_date": "Dec 2022",
      "location": "Hangzhou, China",
      "responsibilities": "Utilized **Node.js** and **Python** to develop scalable backend services, enhancing API response times by **25%** for ticketing and customer support systems.\nImplemented **FastAPI** to streamline microservices architecture, allowing for increased collaboration and efficiency in development timelines.\nDesigned and built serverless event-driven systems using AWS infrastructure and **AWS Lambda**, improving scalability and reducing server costs by **30%**.\nAutomated deployment processes with **AWS CodePipeline** and **Jenkins**, thus achieving an uninterrupted release cycle and a **50%** reduction in deployment errors.\nConducted data synchronization across multiple databases using **AWS RDS**, ensuring real-time data availability and integrity for critical applications.\nIntegrated **AI** functionalities into backend processes, enhancing machine learning capabilities for real estate technology.\nMonitored performance metrics and improved system reliability, driving a **20%** increase in overall user satisfaction and engagement."
    },
    {
      "role": "Software Engineer ",
      "company": "Huawei Technologies Co., Ltd",
      "from_date": "May 2016 ",
      "to_date": "Sep 2020",
      "location": "Shenzhen, China ",
      "responsibilities": "• Developed and maintained **APIs** using **Node.js** and **FastAPI**, ensuring seamless integration with various services and enhancing response_times by **30%**.\n• Implemented microservices architecture, improving system scalability and maintainability in data synchronization processes.\n• Leveraged **AWS** for deploying serverless applications, optimizing costs by **25%** and enhancing system performance.\n• Collaborated with data teams to design databases that support real estate technology solutions, ensuring efficient data retrieval and storage.\n• Automated deployment processes using CI/CD pipelines, reducing deployment times by **50%** and improving overall efficiency of project deliveries.\n• Ensured event-driven systems were accurately implemented, facilitating real-time data processing and synchronization across platforms."
    }
  ],
  "skills": "****Programming Languages****\n\tJava, JavaScript (React, Vue.js, Angular, Pixi.js, Vanilla JS, Node.js, TypeScript), Go, Python, SQL, Swift, Kotlin\n\n****Backend Frameworks****\n\tSpring Boot, Spring Security, Hibernate, Node.js, Express.js, JPA, Kafka, RabbitMQ, FastAPI\n\n****Frontend Frameworks****\n\tReact, Vue.js, Angular, Pixi.js, Redux, Next.js, React Router, Material-UI, Ant Design, D3.js, Webpack, Babel, Jest\n\n****API Technologies****\n\tRESTful API design, APIs\n\n****Serverless and Cloud Functions****\n\tAWS Lambda, Serverless\n\n****Databases****\n\tMySQL, PostgreSQL, Redis, MongoDB\n\n****DevOps****\n\tDocker, Kubernetes (AWS EKS), Jenkins, GitHub Actions, Terraform, AWS CodePipeline, Automation\n\n****Cloud & Infrastructure****\n\tAWS (EKS, RDS, CloudFront, S3), API Gateway, Git, CloudWatch, ELK Stack\n\n****Other****\n\tMicroservices, Data Synchronization, Event-driven systems, CI/CD, Infrastructure as Code (IaC), Data structures and algorithms, Agile/Scrum methodologies, AI, Real estate technology"
}