{
  "name": "Tomasz Lee",
  "role_name": "Python Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Results-driven Python Engineer with 9+ years of experience in developing scalable applications and distributed systems. Proficient in **Python**, **Django**, and **SQL** including **PostgreSQL** and **MySQL**, with a strong background in API development and microservices architecture. Experienced in containerization technologies such as **Docker** and orchestration with **K8s**. Skilled in **Ansible** for automation, CI practices, and monitoring & alerting solutions to ensure seamless deployment and robust performance. Demonstrated ability to write concurrent code and prototype innovative solutions for **SaaS platforms**. Committed to leveraging cloud services like **GCP** to deliver impactful solutions while collaborating across teams and leading projects to success.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Python Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "- Developed robust **API development** solutions utilizing **Django** framework, ensuring seamless integration and communication between services.\n- Engineered high-performance data structures and algorithms for efficient handling of **SQL** queries on **PostgreSQL** and **MySQL**, achieving a 30% increase in data retrieval speed.\n- Designed and maintained containerized applications using **Docker**, enabling consistent development and deployment environments.\n- Managed orchestration of applications via **Kubernetes (K8s)**, contributing to scalability and elasticity of deployed solutions.\n- Automated deployment processes with **Ansible**, significantly reducing manual efforts and error rates by 50%.\n- Implemented comprehensive **CI** strategies for continuous integration and delivery, enhancing code quality and deployment reliability.\n- Established monitoring and alerting systems for application performance, improving incident response times by 40%.\n- Collaborated in the development of distributed systems, ensuring high availability and redundancy across all services.\n- Applied principles of **OOPLs** to guide software design for maintainability and extensibility.\n- Contributed to prototyping efforts using agile methodologies, resulting in a 20% faster development cycle for new features.\n- Engaged in the development of SaaS platforms, increasing customer accessibility and use by 25%.\n- Leveraged **Google Cloud Platform (GCP)** for hosting and scaling applications, enhancing operational efficiency and reliability."
    },
    {
      "role": "Full Stack Developer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "Utilized **Python** and **Django** to design and develop cloud-based applications, leading to a 15% increase in system efficiency.\nImplemented robust **API development** strategies to enhance data retrieval and processing, integrating seamlessly with **PostgreSQL** and **MySQL** databases.\nLeveraged **Docker** for containerization, ensuring consistent deployment throughout the development cycle, and reducing environment discrepancies.\nDeveloped and managed **CI/CD** pipelines using efficient tools, significantly reducing deployment issues by **30%**.\nIncorporated **Kubernetes (K8s)** for orchestration of containerized applications, improving scalability and reliability in **distributed systems**.\nImplemented monitoring and alerting systems to maintain application health and improve response time to incidents, showcasing efficient system management practices.\nLed the proactive prototyping of new features for our **SaaS platforms**, enhancing user satisfaction and engagement by **25%**.\nEnhanced code base quality through rigorous code reviews and mentoring sessions, increasing team productivity and promoting best practices.\nCollaborated with cross-functional teams to gather precise system requirements, ensuring project timelines are met effectively.\nDeveloped concurrent code for high-performance applications while adhering to best practices in **OOPLs**."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "Developed robust applications using **Python** and **Django**, ensuring code scalability and maintainability in large projects.\nImplemented **API development** protocols, enhancing system interoperability and functionality across multiple platforms.\nUtilized **PostgreSQL** and **MySQL** for effective data management and storage solutions, leading to a **30%** increase in query performance.\nEmployed **Docker** for containerization of applications, resulting in a streamlined deployment process and reduced environment inconsistencies.\nManaged orchestration of services using **Kubernetes (K8s)**, improving system reliability and resource efficiency by **25%**.\nWrote asynchronous and concurrent code in line with modern **OOPLs** principles, enhancing application responsiveness.\nDesigned and developed monitoring and alerting systems, proactively identifying and resolving potential issues before impacting users.\nCollaborated with cross-functional teams on **SaaS platforms**, ensuring operational efficiency and client satisfaction.\nEngaged in prototyping new features and functionalities, achieving rapid deployment cycles and better product-market fit.\nParticipated in code reviews and pair programming sessions to promote knowledge sharing and maintain high coding standards."
    }
  ],
  "skills": "  **Programming Languages**\n\tPython, TypeScript, JavaScript, C#, Solidity\n\n  **Backend Frameworks**\n\tDjango, NodeJS, ExpressJS, NestJS, .NET\n\n  **Frontend Frameworks**\n\tReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n  **API Technologies**\n\tRESTful API, GraphQL, API development\n\n  **Serverless and Cloud Functions**\n\tDynamoDB, CosmosDB\n\n  **Databases**\n\tPostgreSQL, MySQL, MSSQL Server, MongoDB\n\n  **DevOps**\n\tDocker, K8s, CI/CD pipelines, Ansible, Monitoring, Alerting\n\n  **Cloud & Infrastructure**\n\tAWS, Azure, GCP\n\n  **Other**\n\tUX/UI Design, Git, GitHub, Microservices, Messaging & Caching, Apache Kafka, RabbitMQ, Redis, Concurrent code writing, Distributed systems, OOPLs, Prototyping, SaaS platforms, Testing Tools: NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest"
}