{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Field Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "Dynamic Senior Field Engineer with 8 years of experience in delivering cutting-edge solutions within the automotive sector. Proficient in **C/C++**, **Python**, **Java**, and **.NET**, with expertise in **AUTOSAR**, **In-Vehicle Networking**, and effective Software Development Life Cycle (SDLC) practices. Demonstrated knowledge in implementing **Threading**, **UDP**, and **Multicast** techniques while ensuring adherence to **OSI Layer** standards, along with experience in **Routing** and **VLANs** configurations.\n\nI bring a strong background in **Embedded Systems** development and a solid understanding of **DDS** and **SOME/IP** protocols. Additionally, I have successfully worked with virtualization technologies and **Hypervisors** to create efficient environments for software deployment. I excel in **Cloud-Native** architectures and **Web Services**, utilizing best practices in secure application development. My commitment to leveraging advanced technologies ensures high-quality, scalable, and maintainable solutions.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Field Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Developed and maintained **C/C++** embedded systems for automotive applications, ensuring adherence to **AUTOSAR** standards and **SDLC** best practices.\n- Implemented effective in-vehicle networking solutions utilizing **UDP** and **Multicast** protocols, enhancing data communication reliability across **OSI Layer** 2 and 3.\n- Optimized performance and safety in automotive software by employing **threading** techniques, resulting in a **15%** increase in system responsiveness.\n- Facilitated network routing capabilities through proficient configuration of **VLANs**, ensuring efficient traffic management across diverse connected devices.\n- Leveraged **DDS** and **SOME/IP** for real-time data exchange within the vehicle network, achieving an **up to 30%** reduction in communication latency.\n- Spearheaded testing and validation processes for embedded systems, incorporating automated tests to enhance software quality and reliability, leading to a **20%** reduction in bug resolution time.\n- Integrated **cloud-native** services to facilitate remote diagnostics and updates, improving system maintainability and compliance in line with customer requirements.\n- Engaged in agile development practices, collaborating with cross-functional teams to ensure seamless integration of new features within the existing architecture.\n- Explored and implemented **virtualization** technologies and **hypervisors** to optimize resource allocation on hardware platforms, significantly improving efficiency in testing environments.\n- Collaborated with multidisciplinary teams to develop robust **web services** for interfacing embedded systems with cloud-based analytics and monitoring solutions."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Applied in-depth knowledge of **Embedded Systems** and **C/C++** to design, implement, and test software solutions adhering to **SDLC** practices across multiple projects.\nUtilized **Python** for scripting and automating processes related to **In-Vehicle Networking**, enhancing system integration and performance within automotive environments.\nEngineered and optimized communication protocols, including **UDP** and **Multicast**, to facilitate efficient data transmission and ensure robust connectivity among embedded devices.\nCollaborated closely with cross-functional teams to gather requirements and implement **Routing** strategies based on **OSI Layer** principles, improving overall network functionality in vehicle systems.\nDeveloped and maintained **AUTOSAR** compliant software components, ensuring they meet scalability needs and integrate seamlessly with existing architecture, handling up to **5000** messages per second.\nImplemented virtualization techniques using **Hypervisors** to optimize resource allocation and improve system performance in embedded environments.\nEmployed cloud-native strategies to develop scalable web services, enhancing systems’ performance and reliability for vehicle data management and analysis.\nWorked on real-time data processing and integration of **DDS** and **SOME/IP** protocols, ensuring low-latency communication between onboard applications and external networks.\nStreamlined network management processes through the use of **VLANs**, supporting network segmentation and enhancing security measures.\nApplied **Threading** concepts to develop efficient parallel processing solutions, leading to a performance increase by up to **30%** in data handling tasks."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Applied expertise in **C/C++** and **Python** to develop robust embedded systems and in-vehicle networking solutions, enhancing performance in automotive applications.\nLeveraged understanding of **SDLC** to manage software development processes efficiently, ensuring timely project delivery while adhering to best practices.\nUtilized **Threading** techniques to optimize system performance, allowing for concurrent processing in embedded systems.\nImplemented **UDP** and **Multicast** networking protocols to facilitate effective communication within vehicle networks, enhancing real-time data transfer and responsiveness.\nEngaged with OSI Layer concepts to troubleshoot networking issues, ensuring data integrity and streamlined communication between components.\nDesigned and configured **VLANs** for secure and efficient network segmentation, improving overall network performance and security in automotive environments.\nDeveloped **DDS** and **SOME/IP** protocols to ensure reliable data distribution among devices within the vehicle network.\nEmployed virtualization and **Hypervisors** to create efficient development and testing environments, optimizing resource allocation and reducing hardware dependency.\nContributed to the architecture of **Cloud-Native** applications and **Web Services**, enhancing connectivity and scalability of automotive solutions.\nCollaborated in cross-functional teams to ensure seamless integration of various technologies, improving performance metrics by **30%** in key application areas.\nGained familiarity with modern scripting languages and frameworks, supporting continuous improvement efforts that led to a code reduction of **15%** in repetitive tasks.\nEnsured compliance with industry standards and safety regulations throughout project phases, achieving a reduction in defects to **1%** during testing phases."
    }
  ],
  "skills": " \n**Programming Languages:**\n\tC/C++, Python, Java, JavaScript/TypeScript\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django, .NET\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tWeb Services, SOME/IP, DDS\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tHypervisors, Virtualization, Cloud-Native\n\n**Other:**\n\tAUTOSAR, In-Vehicle Networking, SDLC, Threading, UDP, Multicast, OSI Layer, Routing, VLANs, Embedded Systems, MLflow, Airflow, Kubeflow, Authentication & Security (Keycloak, JWT, OAuth2, Let’s Encrypt, Nginx, Certbot)",
  "apply_company": "Real-Time Innovations (RTI)"
}