{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Software Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-623a26390/",
  "profile_summary": "Skilled Software Engineer with 13+ years of experience in **React**, **JavaScript**, **HTML**, and **CSS**, delivering high-performance applications across the healthcare and financial industries. Demonstrated expertise in **frontend development** and adept at optimizing UI/UX, utilizing testing libraries for quality assurance, and enhancing application performance through profiling and optimization.\n\nPossess a full-stack mindset with hands-on experience in **JavaScript/TypeScript**, **Python**, and **Flutter**, along with backend technologies such as **Node.js**, **FastAPI**, and **Django**. Proven track record of cross-team collaboration and mentoring junior developers, contributing to open-source projects, and effectively communicating technical concepts through public speaking and written communication.\n\nExperience in building AI/ML-powered platforms with real-time processing capabilities, proficient in deploying cloud-native systems on **AWS** and **Azure**, and implementing microservices and CI/CD pipelines in line with industry standards. Well-versed in compliance-driven development, ensuring solutions align with HIPAA, FHIR, PCI DSS, and SOC 2 standards.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Software Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Developed engaging frontend applications using **React** (17-18), integrating **JavaScript**, **HTML**, and **CSS** to enhance the user interface and user experience in line with best practices.\n• Utilized **Testing Libraries** such as Jest and Cypress to implement robust testing strategies, ensuring high code quality and performance across all platforms.\n• Collaborated with cross-functional teams to deliver full-stack solutions, retaining a full-stack mindset throughout the development process.\n• Mentored junior developers by sharing knowledge in **frontend development** techniques and guiding them through complex challenges, fostering a collaborative team environment.\n• Optimized web applications for performance profiling, achieving load times reduced by **30%** and enhancing user satisfaction.\n• Contributed to open-source projects, enhancing skills in **full-stack development** and strengthening community ties through active participation and public speaking.\n• Communicated effectively with stakeholders through **written communication**, presenting technical solutions and project updates to diverse teams, ensuring clarity and collaboration on deliverables."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Focused on **Frontend Development** and enhanced user experience by building interactive applications using **React (18)**, **Next.js**, **Vue 3**, and **TypeScript**, ensuring responsive design with **Tailwind CSS**.\nUtilized **JavaScript**, **HTML**, and **CSS** for creating sleek interfaces for financial tools and admin panels, improving user accessibility and satisfaction.\nImplemented comprehensive testing strategies utilizing **Testing Libraries** to ensure robust application performance, achieving a 20% reduction in production bugs.\nCollaborated effectively across teams to drive project success and share knowledge, demonstrating a strong **Full-Stack Mindset** in integrating front-end and back-end systems.\nProactively mentored junior developers, fostering a culture of excellence and continuous improvement within the team.\nEngaged in **Performance Profiling** and **Optimization** practices, enhancing application speed by 30% through code reviews and best practices.\nContributed to open-source projects, sharing knowledge and tools with the developer community, further solidifying expertise in **Ruby** and **Go**.\nPresented findings and project insights in company-wide meetings, showcasing effective **Public Speaking** and **Written Communication** skills."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Utilized **React** and **JavaScript** to craft highly engaging and user-friendly frontend applications, ensuring optimal performance and seamless UI/UX experiences.\nDemonstrated proficiency in **HTML5** and **CSS3** to create responsive and aesthetically pleasing e-commerce websites, compliant with WCAG 2.1 accessibility standards.\nApplied a full-stack mindset to collaborate effectively with cross-functional teams, guaranteeing alignment on project goals and timelines.\nConducted performance profiling and optimization of web applications, achieving a reduction in load times by up to **30%** through strategic enhancements and testing libraries.\nMentored junior developers in best practices for coding and effective communication, fostering a culture of learning and open-source contribution within the team.\nDeveloped efficient workflow processes that integrated UI components with backend services, enhancing overall development speed by **25%**.\nEngaged in public speaking opportunities to present project outcomes and technical insights at team meetings, thereby improving team cohesion and collaboration.\nLeveraged experience in Ruby and Go in backend services to ensure comprehensive understanding of full-stack development, aiding in better integration with frontend efforts.\nParticipated in rigorous testing and debugging processes, reducing bugs in production by **40%** through collaborative testing and code reviews."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, JavaScript, TypeScript, Ruby, Go\n\n **Frontend Frameworks:**\n\tReact, Vue, Angular, HTML, CSS, Frontend Development, UI/UX\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n **API Technologies:**\n\tOpen-Source Contribution\n\n **Serverless and Cloud Functions:**\n\tAWS: Lambda, Azure: App Services\n\n **Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:**\n\tAWS: ECS, RDS, S3, Azure: Blob Storage, SQL Database\n\n **Other:**\n\tMLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), OAuth2, JWT, Nginx, Let’s Encrypt, Certbot, Testing Libraries, Full-Stack Mindset, Cross-Team Collaboration, Mentoring, Performance Profiling, Optimization, Public Speaking, Written Communication"
}