{
  "name": "DANIEL HE",
  "role_name": "Senior FullStack Engineer",
  "email": "daniel.he8@outlook.com ",
  "phone": "+48 730 743 032",
  "address": "Rzeszów, Poland",
  "linkedin": "https://www.linkedin.com/in/daniel-he-a5a536397/",
  "profile_summary": "Results-driven Senior Full-Stack Engineer with proven expertise in **Python**, **TypeScript**, and **APIs**, adept at creating secure, customizable, and compliant web applications. Extensive experience in **Web Development** within B2B and SaaS domains, ensuring optimal user experience (UX) through innovative solutions. Skilled in Agile methodologies, with a track record of delivering high-quality software in dynamic environments. Strong background in designing scalable, reliable applications leveraging **Java**, **Spring Boot**, **React**, **Vue**, and **Angular**, while implementing complex solutions across healthcare, eCommerce, and finance sectors, enhancing efficiencies through automation and robust architecture.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2012",
      "to_year": "2016",
      "location": "Beijing, China ",
      "university": "Tsinghua University "
    }
  ],
  "experience": [
    {
      "role": "Senior FullStack Engineer",
      "company": "Britenet",
      "from_date": "Feb 2023 ",
      "to_date": "Present",
      "location": "Warsaw, Poland",
      "responsibilities": "Developed and maintained secure **APIs** using **Python** and **TypeScript**, ensuring compliance with industry standards and enhancing data protection measures.\nLeveraged **Agile** methodologies to deliver high-quality software solutions for **SaaS** applications, collaborating effectively with cross-functional teams.\nEngineered a customisable web application architecture, improving user experience and facilitating B2B integration with a 25% increase in client engagement.\nImplemented security protocols throughout the development lifecycle, achieving 98% compliance with regulatory requirements.\nEnhanced user experience (UX) through iterative design improvements, resulting in a **30%** increase in user satisfaction metrics as measured by user feedback.\nExecuted robust **HR** tools that meet business needs, contributing to a streamlined recruiting and employee management process.\nUtilized **Temporal** for maintaining microservice workflows, improving the reliability of task executions with a **15%** reduction in failure rates.\nOptimized application performance by integrating **Redis** for caching to manage data effectively throughout scaling processes."
    },
    {
      "role": "Software Engineer",
      "company": "Alibaba Group",
      "from_date": "Oct 2020 ",
      "to_date": "Dec 2022",
      "location": "Hangzhou, China",
      "responsibilities": "• Developed robust backend services using **Python** and **TypeScript** to enhance system performance and maintainability, ensuring high security and compliance standards for B2B SaaS applications.\n• Created and integrated APIs to streamline data interaction and customization features, promoting a seamless user experience (UX).\n• Implemented Agile methodologies across the development lifecycle to improve project efficiency by **30%**.\n• Utilized **Temporal** for workflow orchestration to manage background processing, achieving a **40%** reduction in task completion time.\n• Conducted web development with a focus on responsive design and security, enhancing application robustness for HR solutions.\n• Collaborated with cross-functional teams to align on business requirements and deliver innovative software solutions in an **SaaS** model, increasing client satisfaction metrics by **25%**."
    },
    {
      "role": "Software Engineer ",
      "company": "Huawei Technologies Co., Ltd",
      "from_date": "May 2016 ",
      "to_date": "Sep 2020",
      "location": "Shenzhen, China ",
      "responsibilities": "• Designed secure and compliant **APIs** for user authentication, enhancing **security** measures following industry best practices by implementing **Customisation** features.\n• Developed scalable web applications using **Python** and **TypeScript**, adhering to Agile methodologies to improve teamwork and project delivery timelines.\n• Created and maintained **B2B SaaS** applications with a focus on **HR** functionalities, achieving a 25% increase in user engagement.\n• Conducted usability testing to enhance **UX**, resulting in a 30% satisfaction increase reported by users.\n• Collaborated with cross-functional teams to ensure adherence to **Compliance** standards, successfully passing audits with zero violations for **2 consecutive years**.\n• Introduced **Temporal** for workflow orchestration in projects, reducing operational overhead by 15%.\n• Engaged in regular code reviews and performance optimizations, significantly enhancing application efficiency by up to **50%**."
    }
  ],
  "skills": "**Programming Languages**\n\tPython, TypeScript, Java, JavaScript, Go, SQL, Swift, Kotlin\n\n**Backend Frameworks**\n\tSpring Boot, Spring Security, Hibernate, Node.js, Express.js, JPA, Kafka, RabbitMQ\n\n**Frontend Frameworks**\n\tReact, Vue.js, Angular, Pixi.js, Redux, Next.js, React Router, Material-UI, Ant Design, D3.js, Webpack, Babel, Jest\n\n**API Technologies**\n\tRESTful API design, APIs\n\n**Serverless and Cloud Functions**\n\tAWS Lambda\n\n**Databases**\n\tMySQL, PostgreSQL, Redis, MongoDB\n\n**DevOps**\n\tDocker, Kubernetes (AWS EKS), Jenkins, GitHub Actions, Terraform, AWS CodePipeline\n\n**Cloud & Infrastructure**\n\tAWS (EKS, RDS, CloudFront, S3), API Gateway, Git, CloudWatch, ELK Stack\n\n**Other**\n\tMicroservices, CI/CD, Infrastructure as Code (IaC), Data structures and algorithms, Agile/Scrum methodologies, Security, Customisation, Compliance, Temporal, Web Development, B2B, SaaS, HR, UX, Agile",
  "apply_company": "Ben"
}