{
  "name": "Rei Taro",
  "role_name": "Senior Customer Engineer",
  "email": "rei515@outlook.com",
  "phone": "+48732529451",
  "address": "Warszawa, Poland",
  "linkedin": "https://www.linkedin.com/in/rei-taro-81a410391/",
  "profile_summary": "Results-driven Senior Customer Engineer with over 10 years of experience in data management and integration, specializing in **SAP**, **SAP S/4HANA**, **SAP BW**, and **SAP Business Technology Platform**. Proficient in ensuring data governance, data quality, and compliance with regulatory standards across financial platforms. Skilled in developing scalable solutions and managing PaaS environments while maintaining high standards for data privacy and security. Strong collaborator with a proven ability to deliver customer-focused solutions and enhance process management. Previous engagements include roles at leading organizations such as VISA, Sii Poland, and Reply Polska, where I delivered impactful projects and established best practices for financial audits and data cataloging.",
  "education": [
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2010",
      "to_year": "2015",
      "location": "Japan",
      "university": "Keio University"
    }
  ],
  "experience": [
    {
      "role": "Senior Customer Engineer",
      "company": "Leobit",
      "from_date": "Aug 2022",
      "to_date": "Present",
      "location": "Poland",
      "responsibilities": "Developed and implemented integration solutions leveraging **SAP S/4HANA** and **SAP BW** to enhance data management and streamline business processes.\nEnsured data quality and governance by utilizing **SAP Business Technology Platform** tools, effectively managing and cataloging data resources.\nExecuted project management strategies to oversee successful deployment of **PaaS** solutions in the cloud, achieving project timelines of under **3 months**.\nCollaborated with cross-functional teams to ensure regulatory compliance and data privacy, enhancing overall organizational transparency by **25%**.\nMaintained oversight of sales engineering projects, delivering customer-focused solutions that improved integration and process management efficiency by **30%**.\nLed initiatives for financial audits and reporting compliance, ensuring adherence to industry standards and contributing to successful outcomes in **100%** of audits conducted.\nStrengthened communication channels across departments to facilitate collaboration, resulting in a **15%** increase in stakeholder satisfaction."
    },
    {
      "role": "Software Engineer",
      "company": "Innovature",
      "from_date": "Nov 2018",
      "to_date": "Jun 2022",
      "location": "Japan",
      "responsibilities": "• Engaged in **data management** and **regulatory compliance** to ensure seamless integration of **SAP S/4HANA** for effective backend processes, significantly boosting user onboarding efficiency by **30%**.\n• Spearheaded the implementation of **data governance** through **SAP Business Technology Platform**, ensuring data privacy and quality standards were met successfully, improving accuracy by **25%**.\n• Developed and maintained data pipelines for secure data exchange, enhancing overall **integration** with **SAP BW**, leading to a **20%** decrease in data discrepancies.\n• Orchestrated project management tasks, employing **PaaS** solutions to optimize workflows and manage resources effectively, resulting in the completion of projects **15%** under budget.\n• Collaborated with cross-functional teams to elevate customer-focused solutions, ensuring **process management** was aligned with strategic business goals, enhancing stakeholder communication by **40%**.\n• Conducted rigorous financial audits and assessments, implementing standards within the **SAP** ecosystem, allowing for expedited compliance verification processes by **50%**."
    },
    {
      "role": "Software Developer",
      "company": "Wizcorp",
      "from_date": "Apr 2015",
      "to_date": "Nov 2018",
      "location": "Japan",
      "responsibilities": "• Ensured high levels of **data governance** and **data quality** in trade execution systems by utilizing **SAP S/4HANA** and **SAP Business Technology Platform**, enhancing overall system reliability.\n• Implemented **data management** strategies in compliance with **regulatory standards** such as **MiFID II** and **GDPR**, reinforcing data privacy and security protocols across the platform.\n• Collaborated with cross-functional teams, focusing on **customer-focused** solutions and effective communication to optimize system integrations within the **SAP** ecosystem.\n• Developed backend services for trade execution, portfolio management, and account tracking using **Python**, **Flask**, and **PostgreSQL** to enhance trading operations.\n• Engineered real-time price feed processors with **asyncio**, **WebSockets**, and **Redis** to deliver up-to-the-minute trading data for high-frequency transactions.\n• Implemented comprehensive test suites with **PyTest**, **tox**, and mock servers, streamlining QA and CI processes for efficient development cycles and achieving a **30%** reduction in bugs.\n• Introduced job queuing and scheduling solutions with **Celery** and **RabbitMQ**, optimizing backend task execution and process management, increasing throughput by **50%**.\n• Managed multiple projects ensuring timely delivery and compliance with financial audit requirements, successfully completing **5** major integrations in the last **12** months."
    }
  ],
  "skills": " **Programming Languages**\n\tPython (3.8+), SQL, Bash, JavaScript\n\n **Backend Frameworks**\n\tFastAPI, Flask, Django, Celery\n\n **Frontend Frameworks**\n\t\n\n **API Technologies**\n\tREST/gRPC APIs, Microservices\n\n **Serverless and Cloud Functions**\n\tAWS (EC2, S3, Lambda), Azure\n\n **Databases**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n **DevOps**\n\tDocker, Kubernetes, GitHub Actions, Azure DevOps, CI/CD, PyTest, Git\n\n **Cloud & Infrastructure**\n\tPaaS\n\n **Other**\n\tSAP, SAP S/4HANA, SAP BW, SAP Business Technology Platform, data governance, data catalog, data quality, data privacy, integration, data lakes, data management, process management, project management, regulatory compliance, financial audit, sales engineering, communication, customer-focused, collaboration",
  "apply_company": "Collibra"
}