{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Quality Assurance Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-623a26390/",
  "profile_summary": "Quality Assurance Engineer with 13+ years of experience ensuring high-quality application delivery across the healthcare and financial sectors. Proficient in **C#**, **Java**, **Unity**, **iOS**, **Android**, and adept at using **AWS Device Farm**, **Kobiton**, and **Unity Test Runner** for effective testing and quality assurance processes. Skilled in CI/CD practices leveraging **Jenkins** and **Azure DevOps** to streamline deployment and enhance product quality. \n\nExpertise in debugging, problem-solving, and collaborating with cross-functional teams to create robust testing strategies. Strong background in developing testing frameworks and methodologies for enhancing application performance, complemented by a commitment to communication and collaboration across all project stages.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Quality Assurance Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Implemented efficient **CI/CD** processes to enhance deployment cycles, utilizing **Jenkins** and **Azure DevOps** to achieve a **30%** improvement in deployment time.\nConducted thorough testing of applications across **iOS** and **Android** platforms, employing **Unity Test Runner** for automated testing of game engines, leading to a **15%** reduction in bugs post-launch.\nCollaborated with development teams to ensure quality assurance across various platforms, fostering a **collaborative environment** to enhance overall product quality.\nDesigned debugging strategies to swiftly address and resolve software issues, applying strong **problem-solving** skills to optimize the user experience across **C#** and **Java** applications.\nAutomated testing frameworks were integrated into **Unity** and **Unreal Engine Blueprints**, ensuring consistency and reliability across multiple releases, achieving **100%** test coverage on critical features.\nUtilized **AWS Device Farm** and **Kobiton** for comprehensive testing across diverse devices, ensuring a consistent performance in real-world conditions.\nDeveloped and maintained detailed documentation for testing processes and protocols, contributing to improved team **communication** and knowledge transfer across the QA team.\nProvided feedback to enhance product features based on testing outcomes, driving iterative improvements and encouraging a quality-first approach throughout the development lifecycle."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Implemented continuous integration and continuous deployment (CI/CD) processes using **Jenkins** and **Azure DevOps** to ensure seamless quality assurance practices across applications.\nCollaborated within cross-functional teams to enhance testing strategies for both **iOS** and **Android** applications, ensuring compliance with **AWS Device Farm** and **Kobiton** for efficient device testing.\nDesigned and executed automated test scripts using **C#** and **Unity Test Runner**, improving test coverage by **30%** and reducing regression testing time by **50%**.\nConducted detailed debugging sessions to identify issues within applications developed in **Unity** and **Unreal Engine Blueprints**, leading to a **20%** reduction in bug reports post-release.\nLed problem-solving workshops to address complex software challenges, fostering effective communication and collaboration among team members.\nUtilized **Android (adb)** and **iOS/Xcode** for mobile application performance testing, ensuring optimal operation within varied device environments.\nPerformed manual and automated testing processes, resulting in identification of critical defects prior to release and an overall improvement in end-user satisfaction by **25%**."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Conducted thorough testing of C# and Java applications, ensuring robust quality assurance processes were applied across all stages of development, enhancing software reliability and performance through precision.\nCollaborated with development teams to identify, troubleshoot, and resolve issues in mobile applications on both iOS and Android platforms, leveraging strong **problem-solving** and **debugging** capabilities.\nImplemented CI/CD pipelines using **Jenkins** and **Azure DevOps** to automate testing processes, leading to a **30%** reduction in release times and improved deployment accuracy.\nUtilized **Unity Test Runner** for effective testing of games, managing test cases and generating reports to ensure compliance with gaming quality standards.\nExecuted tests for various device environments using **AWS Device Farm** and **Kobiton**, validating application functionality and user experience across numerous devices.\nDemonstrated **collaboration** skills by coordinating with cross-functional teams to ensure seamless integration of QA processes within the development cycle, thus enhancing team efficiency by **25%**.\nCommunicated testing progress and issues to stakeholders through effective **communication** strategies, ensuring alignment on quality expectations and timely delivery of overtime fixes.\nDeveloped automated testing scripts utilizing **Unreal Engine Blueprints** to streamline testing workflows, garnered **15%** increase in testing coverage across critical functionality areas.\nAnalyzed results from testing phases using advanced debugging techniques to provide actionable insights for developers, significantly reducing bug resolution time by **20%**.\nChampioned best practices in **QA** methodologies across the team ensuring adherence to high standards and elevated product quality, resulting in customer satisfaction enhancement measured by increased **NPS** scores."
    }
  ],
  "skills": "Programming Languages:\n\tC#, Java, Python, JavaScript, TypeScript\n\nBackend Frameworks:\n\tFastAPI, Flask, Django\n\nFrontend Frameworks:\n\tReact, Vue, Angular\n\nAPI Technologies:\n\tNginx, Let’s Encrypt, Certbot, Keycloak (OIDC, RBAC), OAuth2, JWT\n\nServerless and Cloud Functions:\n\tAWS: ECS, Lambda, RDS, S3, Azure: App Services, Blob Storage, SQL Database\n\nDatabases:\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\nDevOps:\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose, Jenkins\n\nCloud & Infrastructure:\n\tAzure DevOps\n\nOther:\n\tAI/ML: MLflow, Airflow, Kubeflow, Collaboration, Communication, Debugging, Problem Solving, Unity, iOS, Android, Device Farm, AWS Device Farm, Kobiton, Unity Test Runner, Unreal Engine Blueprints"
}