{
  "name": "Tomasz Lee",
  "role_name": "Senior/Lead Frontend Developer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Results-driven Senior/Lead Frontend Developer with 9+ years of technical experience in building dynamic web applications using **JavaScript**, **React.js**, **Redux.js**, **Node.js**, **HTML5**, **CSS3**, **TypeScript**. Proficient in developing Micro Frontend Applications and implementing **Unit Testing** strategies to ensure high-quality deliverables. Strong background in **Performance Optimization** and full application lifecycle management. Original strengths include effective collaboration across multi-disciplinary teams, leading projects from conception to deployment, and delivering innovative solutions that enhance user experience.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Senior/Lead Frontend Developer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Utilized **JavaScript**, **React.js**, and **TypeScript** to develop and maintain high-quality frontend components, leading to a 25% increase in user satisfaction in the web-based customer management platform.\nEmployed **Redux.js** for state management to optimize application performance and enhance scalability.\nImplemented **HTML5** and **CSS3** best practices across the user interface, ensuring a responsive and user-friendly experience.\nIntegrated unit testing frameworks to ensure application stability and performance, achieving a reduction in bugs by **30%** during the development phase.\nCollaborated with cross-functional teams to design **Micro Frontend Applications**, enhancing modularization and maintainability of the frontend architecture.\nConducted performance optimization techniques, reducing load times by **40%** and improving overall application responsiveness.\nMaintained application lifecycle management practices to ensure smooth development and deployment processes.\nManaged code quality using **ESLint** and **Prettier**, increasing maintainability and adherence to coding standards.\nParticipated in regular code reviews, fostering an environment of continuous improvement and knowledge sharing within the team.\nExplored and adopted new JavaScript frameworks and tools to stay at the forefront of technology trends, enhancing team productivity."
    },
    {
      "role": "Full Stack Developer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "• Leveraged **JavaScript**, **React.js**, and **Redux.js** to design and develop interactive micro frontend applications, significantly improving user engagement by **25%**.\n• Implemented unit testing and performance optimization strategies, ensuring code quality and enhancing application responsiveness.\n• Collaborated with cross-functional teams to define application lifecycle management standards, aligning development timelines with project milestones.\n• Developed engaging user interfaces using **HTML5** and **CSS3**, maintaining high standards of accessibility and responsiveness.\n• Conducted thorough code reviews using **ESLint** and **Prettier**, establishing best practices that improved overall team productivity.\n• Managed application state effectively with **Object-Oriented JavaScript** principles, improving maintainability of complex frontend applications.\n• Integrated **Selenium** for automated testing, ensuring robust application stability and reducing bug incidence in production environments.\n• Mentored junior developers on modern frontend frameworks, fostering a culture of continuous learning and improvement."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "• Developed and optimized Micro Frontend Applications using **React.js** and **Redux.js**, enhancing user experience across platforms by **30%**.\n• Employed **JavaScript**, **TypeScript**, **HTML5**, and **CSS3** to create visually appealing and responsive web applications, achieving a load time reduction from **5 seconds** to **2 seconds**.\n• Implemented unit testing strategies with **Selenium** to ensure application reliability and maintainability, increasing test coverage to **85%**.\n• Led the migration of legacy components to modern frameworks, improving application performance and scalability by **40%**.\n• Collaborated on strategies for Application Lifecycle Management, ensuring smooth transitions through each phase of development and deployment.\n• Conducted code reviews and utilized **ESLint** and **Prettier** to maintain code quality across all projects.\n• Spearheaded performance optimization initiatives that resulted in a **50%** increase in application efficiency.\n• Participated in daily standups to align team objectives and foster a collaborative development environment.\n• Delivered comprehensive technical documentation and user guides to facilitate onboarding and knowledge sharing within the team."
    }
  ],
  "skills": " \n**Programming Languages**\n\tJavaScript, TypeScript, Python \n\n**Frontend Frameworks**\n\tReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS, Redux.js \n\n**Backend Frameworks**\n\tNodeJS, ExpressJS, NestJS, C#, .NET, Entity Framework, Microservices \n\n**API Technologies**\n\tRESTful API, GraphQL \n\n**Serverless and Cloud Functions**\n\tAWS, Azure \n\n**Databases**\n\tMSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB \n\n**DevOps**\n\tCI/CD pipelines \n\n**Cloud & Infrastructure**\n\tCloud & DevOps \n\n**Other**\n\tUX/UI Design, Git, GitHub, Messaging & Caching, Apache Kafka, RabbitMQ, Redis, Testing Tools: NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest, Blockchain: Solidity, Ether.js, Web3.js, Ethereum, ESLint, Prettier, Micro Frontend Applications, Object-Oriented JavaScript, Unit Testing, Application Lifecycle Management, Performance Optimization "
}