{
  "name": "Tomasz Lee",
  "role_name": "Senior PHP Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Results-oriented Senior PHP Engineer with 9+ years of comprehensive experience in designing and developing innovative solutions. Proficient in **PHP**, **HTTP**, **RESTful APIs**, and **web infrastructure**, with a robust understanding of **OOP**, **SOLID**, and **design patterns**. Demonstrated expertise in **Docker** for containerization and a strong commitment to **web security** and **secure coding** practices. Skilled in mentoring and fostering collaboration within teams, leading to enhanced productivity and project success. Original strengths include a proven ability to optimize performance and streamline development processes while utilizing **C#**, **.NET Core**, and cloud-based services for full-stack development.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Senior PHP Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Utilized **PHP** to develop robust web infrastructures, ensuring effective communication and collaboration on software projects.\nDesigned and implemented **RESTful APIs** to facilitate seamless data exchange between front-end and back-end services, leveraging **OOP** principles and **SOLID** design patterns.\nSpearheaded the implementation of **web security** techniques and **secure coding** practices, enhancing the overall integrity and reliability of applications.\nIntegrated **Docker** for containerization, streamlining the deployment process and improving scalability across multiple environments.\nMentored junior developers on best practices and coding standards to foster a culture of **Clean Code** and maintainable codebases.\nCollaborated effectively within teams to address and solve complex problems through innovative solutions and clear communication.\nLeveraged **.NET Core** where needed, incorporating microservices architecture for improved modularity and maintainability in projects.\nConducted thorough code reviews to ensure the application of design patterns and efficient problem-solving strategies.\nUtilized **Knime** for data analysis when applicable, enhancing overall project effectiveness.\nConsistently engaged in team efforts to optimize performance by refining **HTTP** protocols and improving API response times."
    },
    {
      "role": "Software Engineer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "• Implemented **PHP** and designed **RESTful APIs** to meet robust web infrastructure demands, ensuring adherence to **SOLID** principles and best practices for clean code.\n• Collaborated with cross-functional teams to enhance project flow and efficiency, utilizing excellent **communication** and **collaboration** skills to meet tight deadlines.\n• Developed high-quality software solutions using **C#** and **.NET Core**, ensuring that all code is maintainable and efficient according to **OOP** principles.\n• Led efforts to integrate **Docker** for containerization, streamlining the development and deployment process, reducing setup time by **40%**.\n• Utilized design patterns to create scalable software architectures, improving system modularity and reducing code duplication by **20%**.\n• Conducted mentorship sessions for junior developers, fostering growth in **problem-solving** abilities and enhancing team synergy.\n• Enforced **web security** practices and **secure coding** techniques while developing systems, ensuring compliance with industry standards and reducing vulnerabilities.\n• Optimized the performance of existing applications by implementing efficient algorithms and data structures, improving application speed by **30%**.\n• Actively participated in code reviews and provided constructive feedback, resulting in a **15%** decrease in code-related issues in production.\n• Spearheaded workshops on full-stack development, promoting knowledge sharing and skills development among team members."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "Utilized **PHP** to develop and maintain RESTful APIs, enhancing the web infrastructure and improving system integration.\nImplemented **OOP**, **SOLID**, and **Design Patterns** in software architecture to ensure maintainability and scalability.\nDeveloped a secure coding framework adhering to **web security** best practices, reducing vulnerabilities by **30%**.\nCollaborated with cross-functional teams to optimize code quality through **Clean Code** principles and regular code reviews.\nUtilized **Docker** for containerization of applications, ensuring consistent environments across development, testing, and production, which streamlined deployment processes by **40%**.\nLed mentoring sessions for junior developers, fostering a culture of collaboration and knowledge sharing.\nEngaged in problem-solving activities to improve system performance, achieving a **25%** reduction in response time for user queries.\nContributed to the integration of **Knime** for data analytics, enhancing project insights and decision-making capabilities.\nProvided effective communication with stakeholders to define project requirements and align on objectives.\nDelivered technical documentation for internal systems to facilitate knowledge transfer, benefiting teams by providing clear guidelines and best practices."
    }
  ],
  "skills": " **Programming Languages** \n\tC#, PHP, Python, JavaScript, TypeScript \n\n **Backend Frameworks** \n\t.NET, .NET Core, NodeJS, ExpressJS, NestJS \n\n **Frontend Frameworks** \n\tReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS \n\n **API Technologies** \n\tRESTful API, RESTful APIs, GraphQL, HTTP \n\n **Serverless and Cloud Functions** \n\tAWS, Azure \n\n **Databases** \n\tMSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB \n\n **DevOps** \n\tDocker, CI/CD pipelines \n\n **Cloud & Infrastructure** \n\tweb infrastructure \n\n **Other** \n\tMessaging & Caching: Apache Kafka, RabbitMQ, Redis; Testing Tools: NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest; Blockchain: Solidity, Ether.js, Web3.js, Ethereum; UX/UI Design; Git; GitHub; OOP; SOLID; Clean Code; design patterns; web security; secure coding; mentoring; problem-solving; collaboration; communication;",
  "apply_company": "LastPass"
}