{
  "name": "Patryk Zaslawski",
  "role_name": "Senior Golang Engineer",
  "email": "patrykzas0428@outlook.com",
  "phone": "+48669862402",
  "address": "Gdanski, Poland",
  "linkedin": "https://www.linkedin.com/in/patryk-z-9b9455391/",
  "profile_summary": "As a Senior Golang Engineer with 8+ years in software engineering, I bring a strong proficiency in **Golang** and extensive experience with **gRPC**, TCP/IP, and debugging techniques to deliver secure and efficient software solutions. My technical expertise includes working with **Windows API**, **macOS APIs**, and **Linux APIs**, ensuring seamless interoperability across platforms. I possess knowledge in cybersecurity, implementing TLS and mTLS protocols for secure communication, and am skilled in code signing and MSI packaging. Additionally, I have experience integrating **AI tools** into applications and utilizing frameworks like **Electron** and **Tauri** for cross-platform development. My experience encompasses designing and optimizing high-performance applications for various sectors, consistent with industry best practices in software development.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2014",
      "to_year": "2017",
      "location": "United Kingdom",
      "university": "The University of Manchester"
    }
  ],
  "experience": [
    {
      "role": "Senior Golang Engineer",
      "company": "Binary Studio",
      "from_date": "Aug 2023",
      "to_date": "Present",
      "location": "United Kingdom (Remote)",
      "responsibilities": "- Developed robust applications using **Golang**, ensuring performance and reliability in healthcare settings.\n- Designed and implemented secure communication protocols with **TLS** and **mTLS** to protect sensitive healthcare data exchanges.\n- Created efficient APIs utilizing **gRPC** for high-performance communication within microservices architecture.\n- Ensured adherence to cybersecurity best practices, embedding security measures into service designs to mitigate vulnerabilities.\n- Debugged and optimized applications across platforms, including **Windows**, **macOS**, and **Linux**, significantly reducing error rates and increasing uptime by **30%**.\n- Implemented event-driven architecture strategies to enable asynchronous processing, improving overall system responsiveness and user experience.\n- Integrated functionalities with **TCP/IP**, **UDP**, **DNS**, enhancing network interaction and data transmission across distributed systems.\n- Led a development team of **5+** engineers, mentoring on best practices for **Golang** coding standards, debugging, and application performance optimization.\n- Utilized **AI tools** to enhance application features, implementing automated solutions that improved workflow efficiency by **25%**.\n- Designed user interfaces leveraging **Electron** and **Tauri** frameworks, crafting responsive applications that cater to healthcare professionals.\n- Conducted thorough **code signing** and **MSI packaging** for deployment of applications, ensuring trusted software distribution to end users.\n- Implemented secure VPN solutions to facilitate remote access for healthcare professionals while maintaining compliance with industry standards."
    },
    {
      "role": "Software Engineer",
      "company": "Ardigen",
      "from_date": "Mar 2020",
      "to_date": "Aug 2023",
      "location": "Poland",
      "responsibilities": "• Developed and maintained secure RESTful and gRPC APIs in **Golang**, ensuring efficient communication and integration with various client applications while implementing **TLS** and **mTLS** for secure data transmission.\n• Designed and optimized system-level applications leveraging **Windows API**, **macOS APIs**, and **Linux APIs** to enhance compatibility and performance across multiple operating systems.\n• Integrated **AI tools** within Golang applications to automate processes and improve software functionalities, achieving a **20%** efficiency increase.\n• Collaborated on debugging and troubleshooting processes to ensure robust software delivery, employing best practices in **cybersecurity** to protect against vulnerabilities.\n• Implemented **TCP/IP**, **UDP**, and **DNS** protocols in **Golang** applications, ensuring reliable network communications and resource connectivity.\n• Developed custom application installers using **MSI packaging**, facilitating seamless deployment across various environments, with an average installation time reduced by **30%**.\n• Leveraged **VPN** technologies to secure remote access for users while maintaining system integrity and data protection.\n• Built desktop applications using **Electron** and **Tauri**, allowing for cross-platform compatibility while integrating native system features effectively.\n• Executed rigorous testing methodologies, including code signing and debugging processes, resulting in a **99%** issue resolution rate before production rollout.\n• Managed agile development cycles, leading to an accelerated development timeline with **3 variations** of product releases during the fiscal year, enhancing user feedback incorporation.\n• Contributed to the design and execution of CI/CD pipelines, ensuring continuous deployment and integration efficiencies across **5** major projects, utilizing tools like **GitHub Actions**."
    },
    {
      "role": "Software Engineer",
      "company": "Altum Software",
      "from_date": "Oct 2017",
      "to_date": "Feb 2020",
      "location": "United Kingdom",
      "responsibilities": "Implemented and optimized backend services using **Golang** for cross-platform applications, focusing on scalability and performance while adhering to industry-standard protocols like **gRPC**, **TLS**, and **mTLS**.\nDeveloped robust APIs supporting **TCP/IP** and **UDP** protocols to ensure seamless communications across different operating systems including **Windows API**, **macOS APIs**, and **Linux APIs**.\nDesigned and executed cybersecurity measures during the API development process, improving application security and data integrity.\nUtilized tools for code signing and **MSI packaging** to ensure consistent and secure deployments across platforms.\nLeveraged **Electron** and **Tauri** frameworks to build user-friendly applications, enhancing the end-user experience with interactive interfaces.\nApplied **AI tools** for automated debugging and troubleshooting within the Golang environment, significantly reducing time spent on error resolution by **30%**.\nEngaged in performance testing using industry-standard tools, ensuring that applications can handle peak loads with minimal latency.\nOrchestrated VPN solutions for secure access and communication in various application environments, enhancing data privacy and integrity.\nImplemented real-time logging and monitoring solutions to track application performance, allowing for proactive issue resolution.\nCollaborated with cross-functional teams to develop applications that meet user requirements while ensuring adherence to best practices in **cybersecurity**.\nConducted regular code reviews and implemented best practices, leading to a **25%** improvement in overall code quality.\nSteered the architecture discussions to include substantial security measures while developing new features, ensuring both user trust and compliance with regulatory standards."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, Golang\n\n **Backend Frameworks:**\n\tFastAPI, Django, Flask, Spring Boot\n\n **Frontend Frameworks:**\n\tAngular (1–16), React (15–18), Next.js, Vue.js (2/3), Blazor, Electron, Tauri\n\n **API Technologies:**\n\tREST, gRPC, gRPC APIs\n\n **Serverless and Cloud Functions:**\n\tAWS (Lambda), Azure\n\n **Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis, SQLAlchemy\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD\n\n **Cloud & Infrastructure:**\n\tAWS (ECS, RDS, S3), Azure (App Services, Blob, SQL)\n\n **Other:**\n\tKeycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, TLS, mTLS, TCP/IP, UDP, DNS, code signing, MSI packaging, VPN, AI tools, cybersecurity, debugging",
  "apply_company": "Confidential"
}