{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior DevOps Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "Results-driven Senior DevOps Engineer with 8 years of experience in designing and implementing highly efficient cloud-native infrastructure, leveraging **AWS**, **GCP**, **Terraform**, **Docker**, **Ansible**, **Packer**, **Jenkins**, **Kubernetes**, **Grafana**, and **Prometheus**. Proven track record in automating CI/CD pipelines and managing complex network stacks, ensuring data security and compliance with industry standards. \nAdditionally, I possess strong programming skills in **Python** and **Bash**, with proficiency in version control using **Git**. My background also includes developing and maintaining **HTTP APIs** and ensuring seamless integration and deployment of applications. Prior experience in full-stack development enhances my capability to bridge the gap between development and operations, ensuring smooth and efficient execution of DevOps practices.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior DevOps Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Implemented enterprise-level DevOps pipelines using **GitHub Actions**, **Jenkins**, and **CircleCI** to enhance CI/CD processes across web and API services, including security scans and multi-environment deployments.\nUtilized **Docker** and **Kubernetes** for containerization and orchestration, creating scalable applications in cloud-native environments with high availability and fault tolerance across **AWS** and **GCP**.\nManaged infrastructure as code through **Terraform**, enabling automated provisioning of cloud resources and ensuring consistency across development, staging, and production environments.\nMonitored applications and infrastructure using **Grafana** and **Prometheus**, establishing performance benchmarks and alert systems that reduced downtime by **30%**.\nAutomated configuration management and deployments with **Ansible** and **Packer**, standardizing environments and streamlining operational workflows.\nWrote scripts in **Python** and **Bash** for automation tasks and integration with existing tools, enhancing operational efficiency and reducing manual errors by **40%**.\nEnsured data security compliance by implementing best practices around **HTTP APIs**, **DNS**, and securing data in transit and at rest.\nCollaborated with cross-functional teams to devise strategies for scaling applications, employing best-in-class practices and technologies to enhance system performance.\nDesigned and maintained CI/CD pipelines to support frictionless development processes, enabling frequent and reliable software releases without downtime.\nEngaged in regular code reviews and mentoring opportunities, fostering a culture of continuous improvement and knowledge sharing within the team."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Implemented CI/CD pipelines using **Jenkins** and **Git**, streamlining software deployment processes and enhancing release frequency by **30%**.\nDeveloped infrastructure as code using **Terraform** to provision and manage cloud resources across **AWS** and **GCP**, ensuring consistent and repeatable deployments at scale for **10+** applications.\nContainerized applications using **Docker** and orchestrated with **Kubernetes**, improving resource utilization and deployment times by **25%**.\nMonitored system performance and reliability using **Grafana** and **Prometheus**, achieving **99.9%** uptime for critical services and enhancing alerting mechanisms for proactive incident management.\nAutomated configuration management using **Ansible**, reducing manual intervention and configuration drift across environments, increasing operational efficiency by **40%**.\nImplemented data security protocols and policies to ensure compliance with financial regulations and best practices, enhancing the organization's risk posture.\nCollaborated on building and maintaining HTTP APIs and managing the network stack, which improved the adaptability of new services and applications within the infrastructure.\nWrote scripts in **Python** and **Bash** to automate routine tasks, enhancing team productivity and minimizing errors in deployment processes."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Implemented CI/CD pipelines leveraging **Jenkins** and **Terraform** to streamline deployment processes and ensure high-quality software delivery across cloud services like **AWS** and **GCP**.\nConfigured and managed containerized applications using **Docker** and **Kubernetes**, optimizing resource allocation and scalability for microservices architecture in production environments.\nAutomated infrastructure provisioning and configuration management with **Ansible** and **Packer**, resulting in reduced setup time by **30%** and consistent resource deployment across multiple environments.\nMonitored system performance and health using **Prometheus** and **Grafana**, achieving a **99.9%** uptime by effectively identifying and mitigating issues proactively.\nDeveloped scripts in **Python** and **Bash** for automation tasks, enhancing operational efficiency and reducing manual intervention by **40%**.\nSecured cloud infrastructures by implementing data security best practices, role-based access control (RBAC), and compliance measures ensuring GDPR adherence across platforms.\nManaged network configurations, DNS settings, and HTTP APIs to support seamless interaction between services and enhance overall application performance.\nCollaborated with development teams to integrate cloud-native solutions and optimize workflows, increasing deployment frequency by **50%** and significantly improving time-to-market."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, Bash\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n **Frontend Frameworks:**\n\tJavaScript/TypeScript (React, Vue, Angular)\n\n **API Technologies:**\n\tHTTP APIs\n\n **Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), GCP\n\n **Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Jenkins, Terraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:**\n\tCloud Native, Grafana, Prometheus, Network Stack, DNS\n\n **Other:**\n\tMLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, Data Security",
  "apply_company": "Cint"
}