{
  "name": "Rei Taro",
  "role_name": "Principal Backend Engineer",
  "email": "rei515@outlook.com",
  "phone": "+48732529451",
  "address": "Warszawa, Poland",
  "linkedin": "https://www.linkedin.com/in/rei-taro-28639a395/",
  "profile_summary": "Skilled Principal Backend Engineer with over 10 years of experience in creating high-performance backend systems. Proficient in **Go**, **TypeScript**, **PostgreSQL**, **Redis**, along with a strong understanding of **C++**, **Rust**, and best practices in **Algorithms** and **Data Structures**. Demonstrated ability to design scalable and efficient APIs and services. Proven success in executing impactful projects for leading organizations, including VISA, Sii Poland, and Reply Polska. Additionally, I have expertise in developing financial platforms and AI/ML pipelines using **Python** frameworks such as **FastAPI**, **Django**, and **Flask**, coupled with cloud services like **AWS** and **Azure**.",
  "education": [
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2010",
      "to_year": "2015",
      "location": "Japan",
      "university": "Keio University"
    }
  ],
  "experience": [
    {
      "role": "Principal Backend Engineer",
      "company": "Leobit",
      "from_date": "Aug 2022",
      "to_date": "Present",
      "location": "Poland",
      "responsibilities": "Utilized **Go** to develop scalable, efficient backend solutions while implementing **TypeScript** for robust client-side applications in alignment with system requirements.\nEngineered optimized data models and queries within **PostgreSQL**, resulting in improved data retrieval times by **30%**.\nManaged and analyzed caching strategies with **Redis**, enhancing the performance of asynchronous operations for transaction processing with an increase in throughput by **40%**.\nImplemented best practices in code quality and architecture while adhering to principles of **Clean Code** to maintain maintainable and extensible application codebases.\nLeveraged advanced **C++** and **Rust** programming techniques to optimize critical backend components, enhancing overall system performance and reliability.\nApplied foundational knowledge of **Algorithms** and **Data Structures** to design efficient solutions for complex problems, leading to a reduction in execution times by **25%**.\nCollaborated with cross-functional teams to address system integration challenges and oversee release strategies, ensuring compliance with industry standards and user satisfaction."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Innovature",
      "from_date": "Nov 2018",
      "to_date": "Jun 2022",
      "location": "Japan",
      "responsibilities": "Designed and implemented backend systems utilizing **Go** and **TypeScript**, ensuring high performance and scalable architecture to support complex applications.\nDeveloped **PostgreSQL** database schemas and queries to optimize data retrieval and storage, achieving a reduction in query latency by **25%**.\nCreated **Redis**-backed caching mechanisms for improved response times, resulting in a **30%** boost in application performance during peak loads.\nConducted code reviews and enforced **Clean Code** practices to maintain a high standard of code quality across multiple development teams.\nEngineered efficient algorithms and **Data Structures**, enhancing application functionalities and providing innovative solutions to complex problems.\nUtilized **C++** and **Rust** for building high-performance applications, successfully integrating them with existing systems for seamless operation.\nLed cross-functional teams in implementing system enhancements, ensuring all developments were in line with best practices in **Graph Algorithms** and performance optimization.\nMentored junior engineers on advanced programming techniques and effective use of tools, fostering a culture of continuous learning and improvement."
    },
    {
      "role": "Software Developer",
      "company": "Wizcorp",
      "from_date": "Apr 2015",
      "to_date": "Nov 2018",
      "location": "Japan",
      "responsibilities": "Designed and developed robust backend architectures using **Go** and **TypeScript** for high-performance applications, optimizing trade execution and portfolio management.\nImplemented data storage solutions with **PostgreSQL** to securely manage over **1 million** trades per month, ensuring efficient account tracking.\nEngineered real-time data processing modules utilizing **Redis** to handle instant price feeds, increasing data retrieval speed by up to **50%** for high-frequency transactions.\nCollaborated with cross-functional teams to integrate data through REST APIs and WebSocket channels, enhancing user interaction across **10+** platforms.\nEnsured compliance with regulations such as MiFID II and GDPR by adopting clean coding practices and stringent data security protocols in every software deployment.\nCreated and maintained comprehensive test suites using **PyTest** and **tox**, resulting in a **30%** reduction in bugs through streamlined QA and CI processes.\nIntroduced advanced job queuing and scheduling with **Celery** and **RabbitMQ**, improving backend task execution efficiency by over **40%**."
    }
  ],
  "skills": "Programming Languages:\n\t**Go**, **TypeScript**, C++, Rust, Python (3.8+), SQL, Bash, JavaScript\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django, Celery\n\n**Frontend Frameworks:**\n\t\n\n**API Technologies:**\n\tREST/gRPC APIs, Microservices, Kafka\n\n**Serverless and Cloud Functions:**\n\tAWS (EC2, S3, Lambda), Azure\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, Azure DevOps, CI/CD, PyTest, Git\n\n**Cloud & Infrastructure:**\n\t\n\n**Other:**\n\t**Algorithms**, **Data Structures**, **Graph Algorithms**, **Clean Code**, Pandas, NumPy, scikit-learn, TensorFlow, Airflow, MLflow"
}