{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior AI Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "As a highly skilled Senior AI Engineer with 8 years of full-stack development experience, I bring expertise in **AI**, **ML**, and **NLP** technologies. My hands-on proficiency includes **LangChain**, **LlamaIndex**, and **Retrieval-Augmented Generation** methodologies, focusing on building robust machine learning models through fine-tuning and prompt engineering. I have developed scalable **data pipelines** and am experienced in **MLOps**, leveraging cloud services like **AWS**, **Azure**, and **GCP**.   \nIn my career, I have successfully implemented enterprise-grade platforms incorporating AI/ML capabilities for predictive analytics and data processing, ensuring compliance with standards such as HIPAA and PCI DSS. My technical toolkit encompasses **Python**, **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**, along with deep knowledge of microservices architecture and CI/CD automation. Additionally, I possess strong commercial awareness and a startup mindset, driving innovative solutions in dynamic environments.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior AI Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Implemented AI-driven solutions utilizing **Python** and **NLP** techniques for document parsing and financial anomaly detection, enhancing operational efficiency across various applications.\nDesigned and optimized **MLOps** pipelines to facilitate continuous integration, training, and deployment of machine learning models, ensuring rapid and scalable updates for production environments.\nExecuted **Retrieval-Augmented Generation** and **fine-tuning** processes on language models to deliver personalized insights, based on real-time data from large-scale healthcare and financial datasets.\nLeveraged cloud platforms such as **AWS**, **Azure**, and **GCP** to establish scalable data pipelines and services, ensuring compliance with security standards for handling sensitive information.\nArchitected scalable data architectures for healthcare and fintech applications using tools like **PostgreSQL**, **MongoDB**, and **Apache Airflow**, increasing data processing efficiency by **30%**.\nDeveloped and integrated NLP models using **spaCy** and **Hugging Face Transformers**, enhancing user interactions through intelligent feature recommendations and insights.\nCollaborated with cross-functional teams to instill a **startup mindset** and commercial awareness in projects, driving innovation while meeting business objectives.\nDelivered high-quality, testable code utilizing frameworks such as **Jest** and **Cypress**, ensuring robust application performance and reliability.\nFostered the integration of advanced AI features into applications, resulting in improved user engagement and satisfaction metrics measured by real-time analytics, realizing an increase of **25%** in end-user activity.\nDesigned and executed various prompt engineering strategies to enhance the performance of AI models, ensuring they are well-optimized for task-specific scenarios.\nEstablished best practices for deploying machine learning applications, guiding projects from conception to production with a focus on maintaining industry standards and best practices.\nBuilt complex data visualization dashboards using **D3.js** and **Chart.js**, allowing stakeholders to derive actionable insights from data, recognized for enhancing decision-making accuracy by **40%**."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Utilized **cloud** services like **Azure** and **AWS** to deploy and scale AI/ML applications in production, ensuring high availability and reliability.\nImplemented AI and ML solutions to enhance data-driven decision-making, applying advanced techniques like **fine-tuning** and **prompt engineering** for optimal model performance.\nDesigned and built data engineering pipelines using **Python**, facilitating seamless data ingestion and processing for real-time analytics and machine learning tasks.\nDeveloped and maintained robust **data pipelines** utilizing **Apache Airflow** and **Azure Data Factory**, optimizing data flow and reducing processing time by up to **35%**.\nApplied **NLP** techniques and tools such as **LangChain** and **LlamaIndex** for developing intelligent chatbots and transaction classifiers, improving user interaction and transaction accuracy.\nCreated and deployed scalable machine learning models for fraud detection using **scikit-learn** and **XGBoost**, significantly enhancing financial security by detecting **95%** of fraudulent activities.\nCollaborated in a **startup mindset** environment, engaging in commercial awareness to drive AI initiatives that align with business goals and user needs.\nEnsured code quality by writing **testable code** and maintaining version control, achieving a code maintainability score of over **90%**."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "• Engineered and optimized AI and ML capabilities for a global e-commerce platform, utilizing **Python** and robust libraries such as **scikit-learn**, **LightGBM**, and **TensorFlow**, enhancing product recommendation systems and improving conversion rates by **25%**.\n• Developed and maintained data pipelines for real-time data processing, employing **AWS** services like **S3** and **Lambda** to handle over **100,000** requests per hour efficiently, ensuring data integrity and availability.\n• Implemented **MLOps** practices for continuous integration and deployment of machine learning models, leveraging tools like **Kubeflow** and **Docker** for scalability and manageability in a production environment.\n• Designed and deployed scalable backend services integrating AI functionalities within the e-commerce architecture using **FastAPI** and **Django**, achieving a **40%** reduction in response time for user queries.\n• Conducted fine-tuning of models for natural language processing (NLP) tasks using **LangChain** and **LlamaIndex**, optimizing customer interaction and support through personalized responses and insights.\n• Leveraged cloud platforms such as **GCP**, **AWS**, and **Azure** to ensure high availability and reliability of machine learning environments, supporting real-time analytics and processing needs.\n• Applied prompt engineering techniques and Retrieval-Augmented Generation strategies to improve user experience through sophisticated search functionalities based on real-time behavioral data.\n• Collaborated with cross-functional teams to adopt best practices in data engineering, enhancing data workflows and ensuring the delivery of clean, testable code across **Python** projects.\n• Maintained commercial awareness and a startup mindset by identifying technology trends that align with business objectives, fostering a culture of innovation within the engineering team."
    }
  ],
  "skills": "&#x27;**Programming Languages:**\n\tPython, JavaScript/TypeScript\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tNginx, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda), Azure (App Services)\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD\n\n**Cloud & Infrastructure:**\n\tAWS (RDS, S3), Azure (Blob, SQL), Terraform, Ansible, Helm, Docker Compose\n\n**Other:**\n\tAI, ML, LLM, LangChain, LlamaIndex, NLP, prompt engineering, Retrieval-Augmented Generation, fine-tuning, MLOps, data engineering, data pipelines, testable code, production, commercial awareness, startup mindset",
  "apply_company": "Nory"
}