{
  "name": "Patryk Zaslawski",
  "role_name": "Senior BackEnd Engineer",
  "email": "patrykzas0428@outlook.com",
  "phone": "+48669862402",
  "address": "Gdanski, Poland",
  "linkedin": "https://www.linkedin.com/in/patryk-zaslawski-6b04a8397/",
  "profile_summary": "Results-driven Senior BackEnd Engineer with 8+ years of expertise in developing scalable and secure solutions utilizing **TypeScript**, **Node.js**, and **React**. Well-versed in **PostgreSQL** for robust database management and committed to implementing event-driven systems and clean architectures that enhance application performance. Proficient in applying advanced testing strategies and domain-driven design principles to ensure high-quality code while adhering to security and compliance best practices. My extensive background as a Senior Python Full Stack Developer empowers me to create high-performance applications across e-commerce, financial, and healthcare sectors using technologies such as **Python** (FastAPI, Django, Flask, SQLAlchemy) and **cloud platforms** (**AWS**, **Azure**). I bring a strong emphasis on microservices architecture and REST/gRPC API development, aligning projects with industry standards to meet complex business needs.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2014",
      "to_year": "2017",
      "location": "United Kingdom",
      "university": "The University of Manchester"
    }
  ],
  "experience": [
    {
      "role": "Senior BackEnd Engineer",
      "company": "Binary Studio",
      "from_date": "Aug 2023",
      "to_date": "Present",
      "location": "United Kingdom (Remote)",
      "responsibilities": "● Developed and maintained secure, efficient **Node.js** microservices utilizing **TypeScript** for a robust backend architecture, ensuring adherence to industry-standard **security and compliance best practices**.\n● Applied **domain-driven design principles** to architect and implement scalable systems, enhancing modularity and maintainability of projects.\n● Led the real-time data processing efforts using **event-driven systems**, integrating **PostgreSQL** for optimized data management and compliance with performance standards.\n● Designed and implemented testing strategies using **Jest** and **Mocha**, ensuring high code quality and reliability across all **Node.js** applications.\n● Spearheaded the development of user-facing features in **React**, focusing on clean architectures and high-performance components, ensuring a seamless user experience.\n● Collaborated with product teams to gather requirements and translate them into actionable engineering tasks, resulting in a **30%** improvement in project delivery times.\n● Implemented best security practices, including tokenization and encryption, resulting in zero security breaches within the past **24 months**.\n● Mentored junior engineers on **TypeScript**, **Node.js**, and testing frameworks, leading to improved team performance and project outcomes.\n● Enhanced system performance by **25%** through proactive identification and resolution of bottlenecks, particularly in API response times and data processing operations.\n● Optimized cloud deployments with **AWS** and **Azure**, streamlining CI/CD workflows and reducing deployment times by **40%** through automation.\n● Actively participated in code reviews, offering constructive feedback to ensure adherence to coding standards and **clean architectures**."
    },
    {
      "role": "Software Engineer",
      "company": "Ardigen",
      "from_date": "Mar 2020",
      "to_date": "Aug 2023",
      "location": "Poland",
      "responsibilities": "- Developed scalable backend applications using **Node.js** and **TypeScript**, implementing **React** for dynamic user interfaces, improving performance by **30%** in response time.\n- Designed and maintained event-driven systems, utilizing **PostgreSQL** for robust data management solutions, increasing transaction reliability.\n- Leveraged principles of clean architecture while migrating legacy systems to modern platforms, enhancing maintainability by **25%**.\n- Implemented testing strategies including unit and integration tests, utilizing frameworks like **Jest** and **Mocha**, which improved code quality and reduced defects by **40%**.\n- Ensured security compliance by integrating best practices into the development lifecycle, including regular audits and adherence to **OWASP** guidelines.\n- Developed and optimized RESTful APIs for seamless communication across microservices, achieving **99.9%** uptime for services.\n- Collaborated with cross-functional teams to enhance domain-driven design principles in the application architecture, leading to a **20%** increase in development speed.\n- Designed robust CI/CD pipelines using **GitHub Actions** and **Azure DevOps**, enabling faster deployments with automated quality checks.\n- Created comprehensive documentation and training materials for future development, resulting in **50%** quicker onboarding for new team members.\n- Led code reviews and mentoring sessions, fostering a culture of continuous improvement and knowledge sharing within the team."
    },
    {
      "role": "Software Engineer",
      "company": "Altum Software",
      "from_date": "Oct 2017",
      "to_date": "Feb 2020",
      "location": "United Kingdom",
      "responsibilities": "- Developed and optimized scalable backend systems using **Node.js** and **Java**, ensuring high-performance and user engagement across various application modules.\n- Integrated front-end frameworks like **React** with backend services to enhance user experience and responsiveness, employing best practices in **TypeScript** for maintainable code.\n- Designed and architected event-driven systems utilizing **PostgreSQL** to manage transactional databases, ensuring data integrity and optimal query performance.\n- Executed comprehensive testing strategies for backend services, including unit and integration tests, to maintain high code quality and reliability.\n- Implemented domain-driven design principles to structure projects, fostering collaboration between teams and improving maintainability of codebases.\n- Adhered to security and compliance best practices, ensuring secure handling of sensitive data and seamless integrations with third-party services.\n- Automated CI/CD pipelines with tools like GitHub Actions and Azure DevOps, achieving deployment frequency of **5+ releases per week** and reducing lead time for changes.\n- Leveraged **event-driven architectures** through **RabbitMQ** and **Kafka** to manage asynchronous operations and improve scalability and responsiveness under load.\n- Managed a team of **9** engineers using clean architecture methodologies to streamline development processes and enhance system performance.\n- Conducted performance and load testing with **Apache JMeter**, simulating traffic for systems handling up to **10,000 concurrent users**, and optimizing for peak loads.\n- Developed secure REST APIs ensuring compliance with standards such as OAuth 2.0, enhancing security measures for user authentication and data access.\n- Collaborated in the migration of legacy applications, refactoring codebases to align with modern practices and improve overall system reliability."
    }
  ],
  "skills": "**Programming Languages:**\n\tJava, Node.js, Python, TypeScript\n\n**Backend Frameworks:**\n\tFastAPI, Django, Flask, Spring Boot\n\n**Frontend Frameworks:**\n\tAngular (1–16), React (15–18), Next.js, Vue.js (2/3), Blazor\n\n**API Technologies:**\n\tREST & gRPC APIs\n\n**Serverless and Cloud Functions:**\n\tAWS (Lambda), Azure (App Services)\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD\n\n**Cloud & Infrastructure:**\n\tAWS (ECS, RDS, S3), Azure (Blob, SQL), Nginx, Certbot\n\n**Other:**\n\tSQLAlchemy, Pydantic, Celery, Keycloak (OIDC, RBAC), JWT, OAuth2, event-driven systems, clean architectures, testing strategies, domain-driven design principles, security and compliance best practices"
}