{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior AI Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Experienced Senior AI Engineer with 13+ years of proven expertise in delivering high-performance applications across the healthcare and financial sectors. Proficient in **Python** and leveraging **AI** technologies, including LLMs and **generative AI**. Skilled in containerization and orchestration using **Docker**, with robust development practices including **CI/CD** and **Git** for streamlined code management.\n\nHands-on experience in deploying cloud-native infrastructure on **AWS**, **Azure**, and **GCP**, with a strong focus on Infrastructure as Code (**IaC**) and optimizing systems through **caching**, **parallelism**, and **decoupling** for improved performance.\n\nDemonstrated ability in **Prompt Engineering** and supporting **AI/ML** initiatives, along with a solid background in compliance-driven development across HIPAA and PCI DSS standards. Renowned for problem-solving capabilities, critical thinking, and effective communication in collaborative environments.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior AI Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Utilized **Python** to design and develop advanced AI-driven solutions and full-stack platforms, implementing **Docker** for containerization to ensure seamless deployment and scalability in cloud environments such as **AWS** and **Azure**.\nLeveraged CI/CD practices, incorporating **Git** for version control and automated deployment workflows to enhance productivity and reduce time to market by **30%**.\nEngaged in **Prompt Engineering** and integrated **LLM** for developing generative AI applications that increase operational efficiency, achieving a **25%** improvement in model performance metrics.\nImplemented robust caching solutions to optimize data retrieval processes, significantly enhancing system responsiveness and reducing latency by **40%**.\nDemonstrated expertise in **parallelism** and **asynchrony** to design high-performance algorithms that handle multiple requests efficiently, significantly boosting processing speed in **AI** applications.\nConverted legacy systems into microservices architecture with a focus on **decoupling**, improving maintainability and scalability across deployment environments, leading to a **50%** decrease in downtime.\nCollaborated with cross-functional teams to refine and enhance AI product features based on user feedback, ensuring effective communication and problem-solving across projects.\nDeveloped and maintained infrastructure utilizing **AWS** Lambda and **Azure** Functions for serverless computing, driving fault tolerance and resilience in application performance.\nApplied advanced testing strategies using **CI/CD** principles to automate checks and ensure code quality throughout the deployment process, drastically reducing bugs in production by **35%**.\nConducted technical evaluations and adapted **GCP** services to enhance data storage solutions, respecting industry standards and compliance metrics for data security and integrity."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Utilized **Python** and **Docker** to develop and deploy machine learning models, enhancing the detection of fraud through generative AI techniques and complex pattern recognition, resulting in a **30%** increase in detection accuracy.\nImplemented continuous integration and continuous deployment (**CI/CD**) processes using **Git** and **Azure**, streamlining the development workflow and reducing deployment times by **40%**.\nDesigned highly scalable systems leveraging cloud services, including **AWS**, **Azure**, and **GCP**, with a focus on asynchronous communication and decoupling architectures to support high-volume transactions across financial platforms.\nDeveloped advanced data ingestion pipelines using **Apache Airflow** and Azure services, ensuring efficient data handling for machine learning models while managing a data volume increase of **50TB** per month.\nCreated efficient caching strategies and parallel processing mechanisms to improve application responsiveness and performance, achieving **90%** reduction in data retrieval times.\nLeveraged **MLflow** and Airflow for seamless model training and inference integration, enabling real-time credit scoring and automated churn prediction for business growth initiatives, enhancing overall strategic decision-making.\nApplied critical thinking and problem-solving skills to assess and optimize existing workflows, resulting in enhanced operational efficiency and better utilization of resources across multiple teams."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Utilized **Python** and **Docker** to build and optimize backend services for scalable AI applications, ensuring high availability and efficiency in deployment processes.\nLeveraged cloud platforms such as **AWS**, **Azure**, and **GCP** to distribute workloads effectively, achieving a 25% increase in processing speed for real-time data handling.\nImplemented continuous integration/continuous deployment (**CI/CD**) pipelines with **Git**, enhancing deployment frequency by 40%, and reducing the rollback rates through stable version management.\nDesigned and developed caching mechanisms for AI models, utilizing tools and strategies like **Redis** to improve model inference speeds by 50% in high-traffic scenarios.\nApplied **LLM**, **generative AI**, and **Prompt Engineering** techniques to create tailored models that respond accurately to user inputs, contributing to a significant reduction in error rates by 30%.\nEngineered solutions implementing parallelism and asynchrony principles, significantly enhancing processing efficiency and reducing latency in AI inference calls.\nPlayed a key role in decoupling services to foster a microservices architecture, increasing system robustness and maintainability, as well as supporting feature updates without downtime.\nCommunicated complex AI concepts to stakeholders, ensuring alignment on project objectives and expectations, while fostering collaboration across teams through clear documentation and critical thinking strategies.\nExecuted infrastructure as code (**IaC**) principles for seamless environment replication, leading to a 15% decrease in infrastructure setup times for new projects."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython\n\n **Backend Frameworks:**\n\tFastAPI\n\tFlask\n\tDjango\n\n **Frontend Frameworks:**\n\tJavaScript/TypeScript: React\n\tVue\n\tAngular\n\n **API Technologies:**\n\tKeycloak (OIDC, RBAC)\n\tOAuth2\n\tJWT\n\n **Serverless and Cloud Functions:**\n\tAWS: ECS\n\tLambda\n\tRDS\n\tS3\n\tAzure: App Services\n\tBlob Storage\n\tSQL Database\n\tGCP\n\n **Databases:**\n\tPostgreSQL (Fintech)\n\tMySQL (Healthcare)\n\tMongoDB (Gaming)\n\tRedis\n\n **DevOps:**\n\tDocker\n\tKubernetes\n\tGitHub Actions\n\tGitLab CI/CD\n\tCI/CD\n\n **Cloud & Infrastructure:**\n\tTerraform\n\tAnsible\n\tHelm\n\tDocker Compose\n\tIaC\n\n **Other:**\n\tArtificial Intelligence & Machine Learning: MLflow\n\tAirflow\n\tKubeflow\n\tAI\n\tLLM\n\tcaching\n\tparallelism\n\trouting\n\tasynchrony\n\tdecoupling\n\tPrompt Engineering\n\tgenerative AI\n\tproblem-solving\n\tcritical thinking\n\tcommunication",
  "apply_company": "dLocal"
}