{
  "name": "Tomasz Lee",
  "role_name": "Senior Cloud Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Results-driven Senior Cloud Engineer with 9+ years of experience in designing and implementing cloud solutions utilizing **Google Cloud**, **Azure**, and Infrastructure as Code (IaC) principles with **Terraform** and **Ansible**. Proficient in automation and API management, delivering highly scalable and efficient applications. Experienced in microservices architecture, distributed systems, and utilizing technologies such as **Apache Kafka**, **RabbitMQ**, and **Redis**. Strong problem-solving skills combined with effective communication, enabling seamless collaboration across teams and driving successful project completions.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Senior Cloud Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Leveraged **Kubernetes** and **Google Cloud** to deploy and manage scalable cloud infrastructure, increasing system reliability by **30%**.\nImplemented **Terraform** and **Ansible** for **Infrastructure as Code** practices, ensuring consistent environments and reducing configuration drift by **25%**.\nAutomated deployment pipelines in **Azure** to facilitate **IaaS**, **PaaS**, and **SaaS** solutions, improving deployment speed by **50%**.\nManaged API integration and optimization, enhancing data interactivity and usability across services, leading to a **20%** increase in performance.\nDemonstrated strong **problem-solving** capabilities by troubleshooting and resolving critical system issues, reducing downtime by **15%**.\nMaintained clear and effective **communication** with cross-functional teams to align cloud strategies with overall business goals.\nDeveloped automated monitoring solutions, enhancing system visibility and enabling quicker response times to potential outages.\nConducted training sessions on cloud best practices and tools, improving team proficiency and knowledge sharing across departments.\nMonitored resource utilization and implemented strategies to optimize cost efficiency, achieving a cost reduction of **20%** in cloud expenses."
    },
    {
      "role": "Software Engineer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "Utilized **Google Cloud** and **Azure** platforms to design and deploy scalable cloud infrastructures, implementing **Kubernetes** for container orchestration, enhancing service availability by **30%**.\nImplemented **Infrastructure as Code** principles using **Terraform** and **Ansible** to automate environment provisioning, significantly reducing deployment times by **40%**.\nDeveloped and managed APIs to facilitate seamless communication between cloud services and on-premise systems, ensuring robust **API management** practices.\nExecuted automation strategies to streamline repetitive tasks, contributing to an overall productivity increase of **25%**.\nCollaborated with cross-functional teams to define project requirements and manage development timelines, leveraging effective **communication** skills to ensure stakeholder satisfaction.\nApplied problem-solving skills to troubleshoot cloud infrastructure issues, resulting in a **20%** reduction in incident resolution times.\nConducted regular reviews of cloud resources and costs to optimize IaaS and PaaS offerings, achieving a **15%** reduction in operational expenses.\nMentored junior engineers on best practices in cloud technologies and infrastructure management, fostering a culture of collaboration and knowledge sharing.\n"
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "Utilized **Terraform** and **Ansible** to implement Infrastructure as Code, automating deployments and provisioning for cloud environments, achieving a deployment speed improvement of **30%**.\nDeveloped and managed cloud infrastructure on **Google Cloud** and **Azure**, streamlining operations and optimizing resource usage, reducing costs by **15%**.\nEnabled IaaS, PaaS, and SaaS solutions to enhance system scalability and reliability for various projects, supporting over **100** users.\nImplemented effective API management strategies to ensure optimal integration with third-party services and seamless data flow across platforms.\nCollaborated with cross-functional teams to troubleshoot and resolve infrastructure issues, employing problem-solving skills that led to a **25%** reduction in resolution time.\nIntegrated **Kubernetes** to orchestrate containerized applications, improving application deployment consistency and resource management.\nParticipated in daily standups to ensure clear communication with team members regarding project status and objectives, enhancing team alignment.\nCreated technical documentation to capture architecture details and operational guidelines for future reference, improving onboarding efficiency.\nLeveraged automation tools to set up CI/CD pipelines, increasing software delivery velocity by integrating **Azure** with existing workflows.\nWorked closely with stakeholders to deliver cloud solutions that meet business needs, exemplifying strong communication skills."
    }
  ],
  "skills": " **Programming Languages** \n\t Python, JavaScript, TypeScript, C#, Solidity  \n\n **Frontend Frameworks** \n\t ReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS  \n\n **Backend Frameworks** \n\t NodeJS, ExpressJS, NestJS, .NET, Entity Framework, Microservices  \n\n **API Technologies** \n\t RESTful API, GraphQL, API management  \n\n **Serverless and Cloud Functions** \n\t AWS, Azure, Google Cloud  \n\n **Databases** \n\t MSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB  \n\n **DevOps** \n\t CI/CD pipelines, Kubernetes, Terraform, Ansible, Infrastructure as Code, Automation  \n\n **Cloud & Infrastructure** \n\t IaaS, PaaS, SaaS  \n\n **Other** \n\t UX/UI Design, Git, GitHub, Problem-solving, Communication, Testing Tools: NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest, RabbitMQ, Apache Kafka, Redis  ",
  "apply_company": "Be | Shaping the Future Poland"
}