{
  "name": "Mariusz Jan Skobel",
  "role_name": "Front-End Software Engineer",
  "email": "mariuszskobel15@outlook.com",
  "phone": "+48 735 343 548",
  "address": "Katowice, Poland",
  "linkedin": "https://www.linkedin.com/in/mariusz-skobel-789557397/",
  "profile_summary": "Front-End Software Engineer with 10+ years of experience in developing high-performance software solutions, specializing in **JavaScript** and **TypeScript**. Proficient in employing **React**, with hands-on experience in utilizing front-end testing frameworks such as **Jest**, **React Testing Library**, and **Cypress** to ensure robust application performance. Well-versed in agile development methodologies and version control using **Git**. \nAdditionally, skilled in back-end technologies including **Python** and **Django**, demonstrating a comprehensive understanding of the software development lifecycle. With a strong background in microservices architecture and CI/CD automation, I excel at building secure, maintainable solutions that comply with industry standards. My experience extends to **Synthetic Monitoring** and **Observability**, which are critical for enhancing application performance and reliability. Passionate about creating impactful solutions that bridge complexity with usability, driving both technical excellence and real-world results.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2012",
      "to_year": "2015",
      "location": "UK",
      "university": "University of Bristol"
    }
  ],
  "experience": [
    {
      "role": "Front-End Software Engineer",
      "company": "EitBiz",
      "from_date": "Oct 2022",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "•\tDeveloped interactive front-end solutions using **JavaScript**, **TypeScript**, and **React** (versions 17–18), adhering to agile development methodologies to enhance user interface and experience.\n•\tImplemented front-end testing frameworks, including **Jest** and **Cypress**, to ensure high-quality code and robust performance across applications.\n•\tCollaborated in an agile team, utilizing **Git** for version control in managing codebase and facilitating efficient project workflows.\n•\tDesigned and optimized front-end architectures that seamlessly integrate with back-end services, ensuring smooth data flow and user interaction.\n•\tParticipated in code reviews and group discussions to foster a culture of continuous improvement and learning within the development team.\n•\tEnhanced application observability through implementing synthetic monitoring strategies, ensuring performance excellence and minimum downtime.\n•\tDeveloped reusable components and libraries for scalability and maintainability of applications, improving development speed by over **30%**.\n•\tContinuously evaluated new front-end technologies and methodologies, leading to the adoption of modern practices that increased team productivity and software quality."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Tvn S.A.",
      "from_date": "Oct 2019",
      "to_date": "Sep 2022",
      "location": "Poland",
      "responsibilities": "Developed dynamic and responsive front-end applications using **React (18)**, **TypeScript**, and **Next.js** to enhance user interfaces for financial dashboards and admin portals, integrating seamlessly with back-end services.\nUtilized agile development methodologies to optimize software development workflows and improve team collaboration, resulting in a **30%** increase in project delivery efficiency.\nImplemented front-end testing frameworks such as **Jest**, **React Testing Library**, and **Cypress**, achieving **95%** code coverage and enhancing software reliability by reducing bugs in production.\nCollaborated with cross-functional teams to adopt version control using **Git**, enabling efficient code management and versioning across multiple feature branches.\nMaintained and improved application performance through synthetic monitoring and observability practices, successfully reducing page load times by **25%**.\nEngaged in code reviews and knowledge-sharing sessions with team members to promote best coding practices and maintain high-quality standards in software development.\nContributed to the adoption of **Django** and upcoming technologies like **Go** for backend services, leveraging modern frameworks to create scalable full-stack solutions."
    },
    {
      "role": "Software Engineer",
      "company": "Timspark",
      "from_date": "Sep 2015",
      "to_date": "Aug 2019",
      "location": "UK",
      "responsibilities": "Focused on utilizing **JavaScript**, **TypeScript**, and **React** to develop dynamic and responsive user interfaces, providing a seamless experience for end-users across the e-commerce platform.\nEmployed **agile development methodologies** to collaborate effectively within cross-functional teams, ensuring timely delivery of features and enhancements.\nImplemented front-end testing frameworks such as **Jest**, **React Testing Library**, and **Cypress** to ensure high code quality and reliability across **React (18)** applications, reducing bugs by **40%** through rigorous testing protocols.\nEnhanced application observability through **Synthetic Monitoring**, ensuring performance metrics were tracked, and user experience was optimized.\nDesigned backend services in **Python** utilizing **Django** to support front-end applications, improving data retrieval times by **30%**.\nIntegrated front-end components with various back-end services and APIs, facilitating a smooth interaction layer for user operations like checkout and order fulfillment.\nContributed to code quality and version control using **Git**, managing both backend and front-end integrations in a multi-repo setup.\nMaintained documentation and conducted code reviews, fostering a culture of knowledge sharing and continuous improvement in the team.\nActively participated in sprint planning and retrospective meetings to refine the development process and align projects with business objectives."
    }
  ],
  "skills": "**Programming Languages:**\n\tPython, JavaScript, TypeScript, Go\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**API Technologies:**\n\tJWT, OAuth2, Keycloak (OIDC, RBAC)\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda), Azure (App Services)\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm\n\n**Cloud & Infrastructure:**\n\tAWS (RDS, S3), Azure (Blob, SQL), Nginx, Certbot, Docker Compose\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, Agile development methodologies, Synthetic Monitoring, Observability, front-end testing frameworks, Jest, React Testing Library, Cypress"
}