{
  "name": "Tomasz Lee",
  "role_name": "Senior Sales Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Results-driven Senior Sales Engineer with 9+ years of experience in cloud solutions utilizing **AWS**, **Azure**, and **Cloud Networking**. Proficient in solution design and deployment, focusing on security tools, disaster recovery, and backup strategies. Demonstrated expertise in **Windows** and **Linux** environments, coupled with strong problem-solving skills to address client needs effectively. Experienced in collaborating across teams for solution implementation while leveraging skills in **microservices architecture** and distributed systems. Proven track record in optimizing performance and delivering robust applications with technologies such as **.NET**, **C#**, **ReactJS**, **NextJS**, and integrating tools like **Apache Kafka**, **RabbitMQ**, and **Redis**.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Senior Sales Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Utilized **AWS** and **Azure** services to design highly available solution architectures, enabling seamless deployments for customer-driven platforms.\nImplemented disaster recovery strategies and backup solutions, ensuring data integrity and security across systems.\nLeveraged **Linux** and **Windows** environments to enhance platform compatibility and performance, resulting in a 30% increase in system efficiency.\nApplied cloud networking strategies and IAM best practices to secure applications, boosting security posture and user trust.\nSpearheaded the design and development of a web-based customer management platform using **.NET 7** and **ReactJS**, improving user satisfaction by **25%**.\nDesigned and implemented a microservices architecture using **.NET Core** to modularize the system, enhancing scalability and maintainability.\nIntegrated **Apache Kafka** for real-time data streaming and **RabbitMQ** for task queuing, achieving improved system resilience and throughput.\nUtilized **Redis** for caching frequently accessed data, reducing database load and improving response times by **35%**.\nDeveloped RESTful APIs with **.NET**, integrated with a **MongoDB** database to provide seamless data access for various services.\nImplemented CI/CD pipelines on **Azure DevOps**, reducing deployment time by **40%**.\nOptimized **MSSQL** database queries and indexing, reducing average query execution time by **20%**.\nCollaborated with UX/UI designers to enhance the platform’s user interface, leading to an improved user experience.\nDeveloped a reporting engine using **D3.js** and **Three.js** for interactive data visualizations.\nImplemented JWT-based authentication and authorization for securing the application."
    },
    {
      "role": "Software Engineer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "Leveraged **AWS** and **Azure** for cloud networking solutions, ensuring secure and efficient data flow within the infrastructure.\nImplemented robust security tools and protocols, with a focus on IAM for user access management, enhancing compliance and security posture.\nDesigned disaster recovery strategies that improved system resilience by 40%, ensuring business continuity even during outages.\nManaged cloud storage solutions that optimized data retrieval times by 20%, contributing to overall performance enhancements.\nDeveloped technical solutions and strategies using both **Windows** and **Linux** systems, facilitating cross-platform compatibility for applications.\nConducted in-depth problem-solving sessions, effectively resolving technical challenges and providing customized solutions to clients.\nAchieved **Cloud Certifications** to solidify expertise in various cloud services, supporting client trust and engagement.\nCollaborated with sales teams to provide technical insights and support during the pre-sales process, leading to a 25% increase in successful sales pitches.\nActively mentored junior engineers, fostering a culture of learning and improving team efficiency by 30%.\nAssisted in solution design workshops with clients to gather requirements, shaping cost-effective and efficient solutions tailored to meet their needs."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "Utilized **AWS** and **Azure** cloud services to design and implement scalable solutions, enhancing system reliability and performance.\nImplemented robust **Cloud Networking** strategies to ensure seamless connectivity and data flow across systems, reducing latency by **15%**.\nDeveloped and maintained security protocols utilizing **Security Tools** to protect sensitive customer data, achieving **99.9%** uptime.\nCollaborated with cross-functional teams to deliver high-quality solutions, streamlining communication and fostering teamwork, which improved project delivery time by **30%**.\nDesigned and executed **Disaster Recovery** plans to safeguard data integrity and availability, decreasing recovery times by **40%**.\nConducted assessments and devised **Backup** strategies, ensuring data is securely stored and easily retrievable.\nProvided expert **Solution Design** insights, identifying areas for improvement that led to a **25%** enhancement in operational efficiency.\nLeveraged **Windows** and **Linux** environments to support diverse application deployments, optimizing performance based on system requirements.\nParticipated in continuous learning and professional development to maintain current **Cloud Certifications**, staying up-to-date with industry best practices.\nDemonstrated strong **Problem-Solving** skills while addressing technical challenges, ensuring minimal disruption to business operations."
    }
  ],
  "skills": "****Backend Frameworks****\n\tNodeJS, ExpressJS, NestJS, C#, .NET, Entity Framework, Microservices\n\n****Frontend Frameworks****\n\tHTML, CSS, JavaScript, TypeScript, ReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n****API Technologies****\n\tRESTful API, GraphQL\n\n****Database Systems****\n\tMSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB\n\n****Cloud & Infrastructure****\n\tAWS, Azure, Cloud Networking, IAM, Storage, Security Tools, Disaster Recovery, Backup, Cloud Certifications\n\n****DevOps****\n\tCI/CD pipelines\n\n****Other****\n\tUX/UI Design, Git, GitHub, Python, Redux, Problem-Solving, Solution Design\n\n****Messaging & Caching****\n\tApache Kafka, RabbitMQ, Redis\n\n****Testing Tools****\n\tNUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest\n\n****Blockchain****\n\tSolidity, Ether.js, Web3.js, Ethereum\n\n****Operating Systems****\n\tWindows, Linux",
  "apply_company": "Cloud Bridge"
}