{
  "name": "Rei Taro",
  "role_name": "Senior Civil Engineer",
  "email": "rei515@outlook.com",
  "phone": "+48732529451",
  "address": "Warszawa, Poland",
  "linkedin": "https://www.linkedin.com/in/rei-taro-81a410391/",
  "profile_summary": "Results-oriented Senior Civil Engineer with over 10 years of extensive experience in applying **AI** in civil engineering projects and ensuring **regulatory compliance** with industry standards. Skilled in driving **data-driven culture** within teams and promoting **cross-functional collaboration** to enhance project outcomes. Well-versed in **agile methodologies** for efficient project management and swift defect coding. Proven ability to manage complex engineering projects, emphasizing environmental engineering principles while delivering innovative solutions. A strong foundation in backend systems and cloud-native architectures, leveraging knowledge in technologies such as **Python** and **AWS** to improve engineering processes.",
  "education": [
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2010",
      "to_year": "2015",
      "location": "Japan",
      "university": "Keio University"
    }
  ],
  "experience": [
    {
      "role": "Senior Civil Engineer",
      "company": "Leobit",
      "from_date": "Aug 2022",
      "to_date": "Present",
      "location": "Poland",
      "responsibilities": "• Ensured **regulatory compliance** in all engineering activities, aligning project execution with industry standards and guidelines.\n• Developed a **data-driven culture** by leveraging advanced analytics to enhance decision-making processes across engineering projects.\n• Collaborated with diverse cross-functional teams to ensure alignment on project objectives, utilizing **agile methodologies** for optimized project management.\n• Managed defect coding processes to ensure high-quality deliverables, reducing onsite errors by **30%** through systematic assessment.\n• Successfully delivered multiple projects under strict timelines, achieving timely milestones within budgets of **$1M**.\n• Facilitated environmental engineering assessments to ensure sustainable practices are integrated into civil engineering solutions.\n• Implemented AI-driven tools to enhance sewer inspection processes, improving efficiency and accuracy by **40%**.\n• Led project management efforts with thorough planning, resulting in a **20%** reduction in project turnaround time."
    },
    {
      "role": "Software Engineer",
      "company": "Innovature",
      "from_date": "Nov 2018",
      "to_date": "Jun 2022",
      "location": "Japan",
      "responsibilities": "Led the integration of **AI** technologies in sewer inspection projects, enhancing efficiency and accuracy in assessing infrastructure integrity.\nEnsured **regulatory compliance** with environmental engineering standards throughout project lifecycles, resulting in a **100% compliance** rate during audits.\nImplemented **agile methodologies** within cross-functional teams, improving project delivery timelines by **30%** and fostering a **data-driven culture** in decision-making processes.\nManaged project plans and timelines, overseeing the execution of environmental assessments and inspections to identify defects, reducing identification time by **25%**.\nCollaborated with stakeholders from various disciplines to develop solutions that improve sewer system sustainability and efficiency, driving a **15% reduction** in operational costs.\nConducted thorough defect coding and analysis, utilizing data analytics to inform project management strategies and improve overall project outcomes."
    },
    {
      "role": "Software Developer",
      "company": "Wizcorp",
      "from_date": "Apr 2015",
      "to_date": "Nov 2018",
      "location": "Japan",
      "responsibilities": "• Ensured adherence to **regulatory compliance** standards in all engineering designs and solutions, meeting industry regulations and guidelines such as environmental regulations and standards.\n• Fostered a **data-driven culture** by implementing data collection and analysis strategies to inform civil engineering projects and improve decision-making processes.\n• Utilized **agile methodologies** in project management, which improved project delivery times by **20%** and enhanced team collaboration.\n• Collaborated closely with cross-functional teams, including environmental engineers and project managers, to deliver comprehensive solutions that integrate **AI** for efficient design processes.\n• Conducted regular inspections and assessments using advanced techniques to ensure high-quality standards in **sewer inspection** and **defect coding** in infrastructure projects.\n• Led project management initiatives that resulted in successful completion of **9 major projects** on time and within budget while adhering to company policies and procedures.\n• Implemented comprehensive QA protocols throughout project lifecycles, enhancing defect identification and remediation processes.\n• Promoted sustainable practices in engineering designs to align with emerging trends in environmental engineering and mitigate project impacts."
    }
  ],
  "skills": " **Programming Languages**\n\tPython (3.8+), SQL, Bash, JavaScript\n\n **Backend Frameworks**\n\tFastAPI, Flask, Django, Celery\n\n **Frontend Frameworks**\n\t\n\n **API Technologies**\n\tREST/gRPC APIs, Microservices\n\n **Serverless and Cloud Functions**\n\tAWS (EC2, S3, Lambda), Azure\n\n **Databases**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n **DevOps**\n\tDocker, Kubernetes, GitHub Actions, Azure DevOps, CI/CD, PyTest, Git\n\n **Cloud & Infrastructure**\n\t\n\n **Other**\n\tAI, AI/ML Tools: Pandas, NumPy, scikit-learn, TensorFlow, Airflow, MLflow, regulatory compliance, data-driven culture, agile methodologies, cross-functional collaboration, defect coding, project management, environmental engineering, sewer inspection",
  "apply_company": "Pallon"
}