{
  "name": "Tomasz Lee",
  "role_name": "Senior WebTest Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Results-driven Senior WebTest Engineer with 9+ years of extensive experience in software development, specializing in automated testing frameworks and methodologies. Proficient in **Playwright**, **Selenium**, **TypeScript**, **Python**, and **PostgreSQL**, with demonstrated expertise in utilizing **Redis** and **RabbitMQ** for efficient message handling. Adept in deploying applications on **Azure**, **Heroku**, and **GCP**, leveraging tools such as **GitHub Actions**, **Terraform**, and **Helm** for continuous integration and deployment. Strong knowledge of **Django**, **SQL Alchemy**, and **Celery** to enhance backend functionality, while maintaining a solid grasp of **k8s** for container orchestration. Excellent in working within **Agile** environments to deliver timely solutions, streamline development processes, and foster effective team collaborations. Proven ability to lead testing efforts and ensure high-quality software delivery.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Senior WebTest Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Utilized **Selenium** and **Playwright** for automated testing, ensuring high-quality web applications at a 95% success rate.\nDeveloped and maintained test scripts in **TypeScript** and **Python** to facilitate continuous integration and delivery, resulting in faster release cycles by 30%.\nImplemented test automation frameworks with **GitHub Actions**, streamlining code deployment and testing processes.\nCreated and executed comprehensive test plans and strategies in an **Agile** environment, improving team productivity by 25%.\nDesigned database testing strategies utilizing **PostgreSQL** and **Redis**, enhancing data integrity and query performance by 20%.\nCollaborated with cross-functional teams to define, design, and ship new features, contributing to a 15% increase in user engagement.\nManaged cloud deployments using services like **Azure**, **Heroku**, and **GCP**, ensuring scalable and resilient application hosting.\nIntegrated **RabbitMQ** for efficient message queuing in testing environments, which improved the reliability of test executions.\nUtilized **Django** and **SQL Alchemy** in backend services for enhanced test coverage and application stability.\nParticipated in code reviews and maintained best practices for test automation, achieving a reduction in bug rates by up to 40%."
    },
    {
      "role": "Software Engineer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "Utilized **Playwright** and **Selenium** to design and implement automated testing frameworks, achieving a **40% reduction** in testing time through enhanced test coverage.\nDesigned testing strategies using **TypeScript** and **Python** to ensure high-quality web applications and maintainable code, resulting in a **20% decrease** in production defects.\nExecuted performance testing and optimization for database queries in **PostgreSQL**, improving response times by **30%**.\nImplemented caching strategies using **Redis** to enhance data retrieval speeds, contributing to an overall system efficiency gain of **25%**.\nCollaborated with cross-functional teams in an **Agile** environment to define testing requirements and timelines, ensuring timely release cycles.\nAutomated CI/CD workflows using **GitHub Actions**, streamlining the deployment process and reducing manual intervention by **35%**.\nSupported cloud deployments on **Azure**, **Heroku**, and **GCP**, ensuring scalable test environments meeting deployment requirements.\nUtilized **Django** and **SQL Alchemy** to develop and maintain test environments with robust data access patterns, enhancing test reliability.\nManaged and orchestrated testing environments using **k8s**, ensuring high availability and scalability during testing phases.\nFacilitated the use of **Celery** for background task processing in testing scenarios, significantly reducing test execution times.\nConducted comprehensive code reviews and provided mentorship to junior testers, fostering a culture of quality and continuous improvement."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "Utilized **Playwright** and **Selenium** to develop and execute automated test scripts, enhancing testing efficiency by **30%**.\nEmployed **TypeScript** and **Python** to create testing frameworks for web applications, ensuring high-quality code and functionality.\nManaged test databases using **PostgreSQL**, optimizing data retrieval and testing processes with an **85%** improvement in query performance.\nImplemented **Redis** for caching, leading to a **40%** reduction in load times during peak testing phases.\nLeveraged **GitHub Actions** to automate continuous integration and deployment processes, resulting in a **50%** faster release cycle.\nIntegrated testing pipelines within **Azure**, enhancing workflow efficiency and maintaining scalable testing environments.\nUtilized **Heroku** and **GCP** for hosting testing applications, ensuring availability and performance across cloud services.\nCollaborated with Agile teams, participating in daily standups and retrospectives to align testing processes with development goals.\nMaintained and documented test scripts and frameworks, facilitating knowledge transfer and onboarding for new team members.\nEngaged in code reviews to ensure adherence to coding standards and best practices, contributing to overall team quality assurance."
    }
  ],
  "skills": "**Frontend Frameworks**\n\tHTML, CSS, JavaScript, TypeScript, ReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n**Backend Frameworks**\n\tNodeJS, ExpressJS, NestJS, C#, .NET, Entity Framework, Microservices, Django, SQL Alchemy, Celery\n\n**API Technologies**\n\tRESTful API, GraphQL\n\n**Databases**\n\tMSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB\n\n**Messaging & Caching**\n\tApache Kafka, RabbitMQ, Redis\n\n**Cloud & Infrastructure**\n\tAWS, Azure, Heroku, GCP, k8s, Terraform, Helm\n\n**DevOps**\n\tCI/CD pipelines, GitHub Actions\n\n**Testing Tools**\n\tNUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest, Playwright\n\n**Other**\n\tUX/UI Design, Git, GitHub, Python, Redux, Agile, Blockchain, Solidity, Ether.js, Web3.js, Ethereum",
  "apply_company": "Sphera"
}