{
  "name": "Mariusz Jan Skobel",
  "role_name": "Senior Backend Developer",
  "email": "mariuszskobel15@outlook.com",
  "phone": "+48 735 343 548",
  "address": "Katowice, Poland",
  "linkedin": "https://www.linkedin.com/in/mariusz-skobel-789557397/",
  "profile_summary": "Senior Backend Developer with 10+ years of experience in delivering high-performance software solutions, specializing in **Java 17**, **Dropwizard**, and **Restler**. Proficient in database management including **MongoDB**, **ClickHouse**, and **Redis**, with hands-on expertise in building distributed systems and implementing **Apache Kafka** and **Kafka Streams** for robust data processing. Strong knowledge of search technologies like **Elasticsearch** and **OpenSearch**. Skilled in cloud infrastructure deployment and management with a solid background in **CI/CD** practices and **Test Driven Development**. Experienced in enhancing system capabilities through **A/B Testing** to drive data-informed decision-making.\n\nBrings analytical and problem-solving skills honed in complex environments like healthcare and finance, along with a commitment to team collaboration and empathetic communication. Adept at leveraging **Airflow** for workflow automation and operational efficiency, with a passion for creating secure and scalable backend solutions that meet industry standards.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2012",
      "to_year": "2015",
      "location": "UK",
      "university": "University of Bristol"
    }
  ],
  "experience": [
    {
      "role": "Senior Backend Developer",
      "company": "EitBiz",
      "from_date": "Oct 2022",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Developed robust backend solutions using **Java 17** and **Dropwizard**, ensuring efficient processing and management of data in high-traffic environments.\n• Designed and implemented RESTful APIs with **Restler**, enhancing system integration for seamless communication across diversified platforms and facilitating service scalability.\n• Designed and maintained databases with **MongoDB**, **ClickHouse**, and **Redis**, optimizing data storage and retrieval processes for improved application performance and rapid response times.\n• Utilized **Apache Kafka** and **Kafka Streams** for real-time data streaming, facilitating effective handling and processing of financial transactions and healthcare data.\n• Established **CI/CD** pipelines using **Airflow** to automate deployment processes, ensuring high-quality code delivery and minimizing downtime.\n• Championed **Test Driven Development** (TDD) practices to enhance software reliability and maintainability, resulting in a **30% reduction in bugs** during production deployments.\n• Conducted **A/B Testing** to evaluate feature effectiveness and improve user experience, driving a **15% increase in user engagement** across applications.\n• Collaborated as a **team player** and communicated effectively with cross-functional teams, leveraging **analytical skills** and **problem-solving skills** to deliver high-impact solutions tailored to business needs.\n• Implemented efficient search capabilities using **Elasticsearch** and **OpenSearch**, allowing for rapid querying of structured and unstructured data across various applications.\n• Led initiatives in **Cloud Infrastructure** planning and deployment, ensuring systems are scalable and resilient to meet the dynamic needs of users.\n• Applied best practices in **Distributed Systems** design to enhance application reliability and operational efficiency, contributing to a **50% improvement in service uptime**."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Tvn S.A.",
      "from_date": "Oct 2019",
      "to_date": "Sep 2022",
      "location": "Poland",
      "responsibilities": "Implemented **Java 17**, **Dropwizard**, and **Restler** to develop scalable and efficient backend services, enhancing performance by **45%** in data processing times.\nDesigned and maintained **MongoDB** and **ClickHouse** databases to manage high-volume transactions, ensuring data integrity and fast retrieval with a decrease in query latency by **30%**.\nUtilized **Redis** for caching strategies, improving system response times by **50%** for real-time applications.\nArchitected and deployed event-driven microservices using **Apache Kafka** and **Kafka Streams**, facilitating high-throughput messaging and real-time data processing across distributed systems.\nEnhanced search functionalities and analytics through integration of **Elasticsearch** and **OpenSearch**, enabling complex querying capabilities and giving visibility into transaction patterns.\nStreamlined data workflows and orchestration by employing **Airflow**, supporting CI/CD pipelines to promote faster releases and maintain code quality through Test Driven Development practices.\nApplied analytical skills and problem-solving methodologies to troubleshoot backend issues, resulting in a **25%** reduction in downtime.\nFostered a collaborative team environment by leveraging strong communication skills and empathy, resulting in a **15%** increase in project delivery times and overall team productivity."
    },
    {
      "role": "Software Engineer",
      "company": "Timspark",
      "from_date": "Sep 2015",
      "to_date": "Aug 2019",
      "location": "UK",
      "responsibilities": "Leveraged **Java 17** and **Dropwizard** to design and optimize scalable backend services for a high-traffic e-commerce platform, ensuring high availability and low latency across crucial modules.\nIntegrated **MongoDB** and **ClickHouse** for efficient distributed data storage, achieving up to **20%** faster data retrieval and significantly enhancing performance under load.\nEmployed **Redis** for caching strategies, improving application responsiveness by reducing read pressure on databases, resulting in a **35%** decrease in average response time.\nImplemented **Apache Kafka** and **Kafka Streams** for real-time data processing, enabling dynamic inventory tracking and facilitating responsive updates to user interfaces during peak operational hours.\nUtilized **Elasticsearch** and **OpenSearch** for robust search capabilities, ensuring optimized search relevance and improved user experience through personalized product listings.\nDeveloped CI/CD pipelines to streamline deployment processes, enhancing collaboration within the team and reducing deployment times by **50%**.\nConducted A/B Testing strategies to refine user experience and improve conversion rates through data-driven decisions, yielding valuable insights for continuous improvement.\nApplied **Airflow** for robust workflow management, ensuring smooth orchestration of backend processes, leading to enhanced operational efficiency within distributed systems.\nExhibited strong analytical and problem-solving skills, fostering effective communication and teamwork to navigate complex technical challenges during project cycles.\nDemonstrated empathy towards user needs to inform backend architecture decisions, ensuring optimal user experiences across the platform."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, Java 17, JavaScript/TypeScript\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django, Dropwizard\n\n **Frontend Frameworks:**\n\tReact, Vue, Angular\n\n **API Technologies:**\n\tRestler\n\n **Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n **Databases:**\n\tPostgreSQL, MySQL, MongoDB, ClickHouse, Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:**\n\tCloud Infrastructure\n\n **Other:**\n\tMLflow, Airflow, Kubeflow, Apache Kafka, Kafka Streams, Elasticsearch, OpenSearch, CI/CD, Test Driven Development, A/B Testing, Distributed Systems, Analytical Skills, Problem-Solving Skills, Communication Skills, Team Player, Empathy"
}