{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior DevOps Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "As a dedicated Senior DevOps Engineer with 8 years of experience, I excel in cloud technologies and automation, specializing in **AWS**, **GCP**, **Terraform**, **Ansible**, **Docker**, **Jenkins**, and **Kubernetes**. My strong foundation in CI/CD practices ensures seamless continuous deployment for high-performance solutions, while my expertise in **Python**, **Bash**, and **Golang** aids in developing efficient automation scripts and processes.\nI have contributed significantly to cloud security protocols and compliance standards, aligning with frameworks such as PCI DSS and SOC 2. Alongside my DevOps skills, I possess hands-on experience in **Linux** environments, as well as monitoring with **Grafana**, **Prometheus**, and **ELK** stack. My previous background as a Full Stack Developer enables me to approach challenges from a holistic perspective, ensuring robust and secure applications while optimizing deployment workflows across various sectors including healthcare and finance.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior DevOps Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Implemented and maintained CI/CD pipelines using **Jenkins**, **Docker**, and **Kubernetes**, ensuring continuous deployment and integration across multiple environments while enhancing deployment speeds by **40%**.\nDesigned and managed infrastructure as code using **Terraform** and **Ansible**, achieving infrastructure consistency and repeatability across **5+** cloud environments, including **AWS** and **GCP**.\nColaborated with software engineering teams to optimize application deployment strategies, leveraging **Bash** and **Python** scripting to automate routine operational tasks, reducing manual intervention by **60%**.\nMonitored system performance and reliability using tools like **Grafana** and **Prometheus**, effectively troubleshooting and resolving issues in production environments to maintain **99.9%** uptime.\nDeveloped security best practices in alignment with **Cloud Security** standards, implementing necessary safeguards within cloud infrastructures to protect sensitive data.\nOrchestrated the containerization of applications using **Docker**, enabling seamless scaling and management of resources as demand fluctuated.\nLed initiatives for monitoring and logging solutions utilizing the **ELK Stack**, providing real-time insights and enhancing fault detection capabilities across services.\nEngaged in cross-functional collaboration with developers and data scientists to ensure smooth deployment of applications and services, leveraging **Golang** and **Node.js** to optimize certain backend processes.\nConducted training sessions for teams on DevOps practices and tools, resulting in enhanced team capabilities in adopting CI/CD methodologies.\nEstablished best practices for testing and quality assurance in deployment processes, ensuring that only thoroughly vetted code was rolled out into production."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Implemented Continuous Integration/Continuous Deployment (CI/CD) pipelines using **Jenkins** and **Docker**, ensuring efficient deployment processes and enhancing operational reliability while reducing deployment time by **40%**.\nAutomated infrastructure provisioning and configuration management with **Terraform** and **Ansible**, establishing a robust infrastructure-as-code approach that improved deployment consistency and reduced manual intervention by **70%**.\nLed the migration of services to **AWS** and **GCP**, optimizing cloud resource utilization and managing costs, achieving a **30%** reduction in cloud spending through resource optimization strategies.\nMonitored system performance and availability using **Grafana** and **Prometheus**, enabling proactive identification of bottlenecks and maintaining uptime of over **99.9%** in cloud environments.\nDeveloped and maintained microservices using **Node.js** and **Python**, creating resilient backend solutions that enhance application performance and scalability for various enterprise applications.\nCollaborated with development teams to implement container orchestration solutions using **Kubernetes**, streamlining application deployment and improving scalability.\nUtilized **Bash** and **Python** scripting for automating repetitive tasks, integrating software deployments with cloud computing services for seamless updates and improved efficiency.\nConducted security assessments and implemented best practices within cloud environments to enhance **Cloud Security**, ensuring compliance with industry standards and protecting sensitive data.\nEmployed **Golang** for building performance-critical components, contributing to efficient backend operations and robust service delivery."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Implemented CI/CD pipelines and automation processes using **Jenkins**, **Docker**, and **Terraform** to streamline deployment on cloud platforms like **AWS** and **GCP**, improving deployment frequency by **40%**.\nDesigned and maintained scalable infrastructure with **Kubernetes**, enhancing service reliability and reducing downtime during updates by **25%**.\nManaged configuration management and orchestration with **Ansible** and **Packer**, ensuring consistent environment setups that minimized deployment inconsistencies.\nDeveloped microservices architecture using **Golang** and **Python**, facilitating service scalability and improving API response times by **30%**.\nMonitored system performance utilizing **Grafana**, **Prometheus**, and **ELK** stack, generating insights that led to a resolution of system bottlenecks, reducing incident response times by **50%**.\nEmployed **Bash** and **Ruby** scripts for automating routine tasks and enhancing operational efficiency across development and production environments.\nEnsured cloud security standards were met following best practices on **AWS** and **GCP**, leading to a significant reduction in vulnerability exposures.\nCollaborated in a cross-functional team to enhance DevOps culture, driving three major initiatives per quarter focusing on cloud migration, monitoring, and automation strategies.\nConducted regular training sessions on continuous deployment methodologies, increasing team proficiency in **CI/CD** practices and tools.\n"
    }
  ],
  "skills": "**Backend Frameworks:**\n\tFastAPI, Flask, Django, Golang, Node\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tJWT, OAuth2, Keycloak (OIDC, RBAC)\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), GCP\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Jenkins, Terraform, Ansible, Helm, Docker Compose, CI/CD, Grafana, Prometheus, ELK, Packer, Bash\n\n**Cloud & Infrastructure:**\n\tAWS, Azure (App Services, Blob, SQL), Linux, Cloud Security\n\n**Other:**\n\tPython, Java, Ruby",
  "apply_company": "Cint"
}