{
  "name": "Andrzej Ito",
  "role_name": "Senior Travel Engineer",
  "email": "andrzej.ito@outlook.com",
  "phone": "+48 732 126 371",
  "address": "Rzeszów, Poland",
  "linkedin": "https://www.linkedin.com/in/andrzej-ito-2872a4391/",
  "profile_summary": "As a Senior Travel Engineer, I leverage 9 years of extensive experience in the travel industry, specifically using **GDS** and **Sabre**, to design and implement scalable solutions that adhere to travel policies and regulations. My expertise in customer service ensures that user experience remains a top priority, while my strong communication skills facilitate effective collaboration with cross-functional teams. In addition to mentoring junior engineers, I am committed to enhancing accessibility and driving technical excellence in all projects.",
  "education": [
    {
      "degree": "Bachelor of Science",
      "category": "Computer Science",
      "from_year": "2010",
      "to_year": "2014",
      "location": "Osaka, Japan",
      "university": "Osaka University"
    }
  ],
  "experience": [
    {
      "role": "Senior Travel Engineer",
      "company": "Allegro.pl",
      "from_date": "08/2022",
      "to_date": "",
      "location": "Poznan, Poland",
      "responsibilities": "• Provide exemplary customer service by leveraging in-depth knowledge of the travel industry and regulations to assist clients effectively.\n• Collaborate with stakeholders to design travel policies, ensuring compliance with industry standards and enhancing user experience.\n• Maintain clear and effective communication with team members and clients to facilitate smooth project execution and service delivery.\n• Lead the integration of **GDS** and **Sabre** systems to optimize service offerings within travel applications.\n• Utilize analytical skills to troubleshoot and resolve complex issues related to travel regulations and service delivery.\n• Contribute to the enhancement and maintenance of existing travel software, focusing on customer-centric features and functions.\n• Engage with customers to gather feedback, ensuring travel solutions meet user needs and expectations."
    },
    {
      "role": "Software Engineer",
      "company": "Paypay Corporation",
      "from_date": "05/2017",
      "to_date": "07/2022",
      "location": "Tokyo, Japan",
      "responsibilities": "• Leveraged **GDS** and **Sabre** systems to enhance customer service and streamline travel booking processes, ensuring compliance with travel policies.\n• Provided expert guidance on travel regulations, enabling informed decision-making and adherence to industry standards for optimal client support.\n• Utilized advanced communication skills to effectively collaborate with team members and clients, addressing inquiries and resolving challenges within the travel industry.\n• Developed user-friendly web applications that adhered to customer service best practices, ensuring high levels of user satisfaction and engagement.\n• Analyzed customer feedback to continuously improve service delivery, contributing to an overall increase in operational efficiency by **15%**.\n• Implemented new strategies to enhance travel policy adherence, resulting in a **20%** reduction in non-compliance issues over a **6-month** period.\n• Conducted thorough training sessions for team members on using **GDS** tools and travel regulations, improving teamwork and overall service quality."
    },
    {
      "role": "Software Engineer",
      "company": "Fujitsu Ltd",
      "from_date": "06/2014",
      "to_date": "04/2017",
      "location": "Tokyo, Japan",
      "responsibilities": "• Demonstrated comprehensive knowledge of **GDS** systems and **Sabre** to enhance user experience in travel booking and management.\n• Ensured compliance with travel policies and regulations while delivering exceptional **customer service** in fast-paced environments.\n• Cultivated strong **communication** skills, facilitating accurate and efficient interactions with clients and stakeholders.\n• Leveraged expertise in the travel industry to optimize processes, improve service delivery, and maintain customer satisfaction metrics above **90%**.\n• Collaborated with cross-functional teams to implement travel technology solutions, increasing operational efficiency by up to **30%**.\n• Analyzed travel patterns and preferences using data analytics tools, resulting in personalized client solutions and a **15%** increase in customer retention.\n• Researched and implemented best practices for compliance with evolving travel regulations to ensure adherence within the organization."
    }
  ],
  "skills": "**Programming Languages**\n\tJava, C++, C#, Python, SQL, PLSQL, Kotlin\n\n**Backend Frameworks**\n\tSpring, Spring Boot, Hibernate, Struts, JPA, Node.js\n\n**Frontend Frameworks**\n\tReact, Vue, Angular\n\n**API Technologies**\n\tSOAP, REST APIs, Microservices\n\n**Databases**\n\tMS SQL Server, Oracle, MongoDB, Rabbit MQ, PostgreSQL, Redis\n\n**Other**\n\tGDS, Sabre, travel policies, customer service, communication, travel industry knowledge, regulations",
  "apply_company": "BCD Travel"
}