{
  "name": "Tomasz Lee",
  "role_name": "Senior QA Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-477994390/",
  "profile_summary": "Results-driven Senior QA Engineer with 9+ years of experience in manual testing and automated testing frameworks such as **Playwright**, **Cypress**, and **Appium**. Proficient in backend services and microservice architecture, leveraging **Docker**, **Kubernetes**, and cloud platforms to ensure seamless deployment and monitoring. Skilled in designing robust CI/CD pipelines and utilizing monitoring tools like **Prometheus**, **Grafana**, **Datadog**, and **New Relic** to enhance observability and performance. Experienced in mobile applications testing and proficient in scripting languages for test automation. Strong communication skills facilitate effective collaboration with cross-functional teams, ensuring project success and the delivery of high-quality software solutions.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Senior QA Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Apr 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Conducted **manual testing** of the web-based customer management platform to ensure functionality and user satisfaction, enhancing overall product quality by 25%.\nDeveloped **test automation frameworks** to streamline testing processes for **backend services** and **mobile applications**, meeting project timelines effectively.\nImplemented testing tools such as **Playwright**, **Cypress**, and **Appium** for cross-platform testing, achieving a **40%** reduction in testing time.\nDesigned and executed test cases for microservices architecture, ensuring scalability and reliability of the system.\nCollaborated closely with development teams to analyze application performance and integrated **monitoring tools** like **Prometheus**, **Grafana**, and **New Relic** to improve observability.\nParticipated in the implementation of **CI/CD pipelines** on **Azure DevOps**, which accelerated deployment processes by **40%**.\nUtilized **Docker** and **Kubernetes** for containerization and orchestration, providing a seamless testing environment across different stages.\nCreated scripts in various **scripting languages** to automate repetitive testing tasks, improving team efficiency by **30%**.\nCommunicated effectively with cross-functional teams to identify critical areas for regression testing, ensuring high-quality deliverables.\nRegularly updated project documentation to reflect testing processes and outcomes, enhancing team collaboration and knowledge sharing."
    },
    {
      "role": "Full Stack Developer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "Implemented **test automation frameworks** using **Playwright**, **Cypress**, and **Appium** to ensure robust quality assurance for both web and mobile applications, significantly improving testing efficiency by **40%**.\nDesigned and executed **manual testing** strategies for backend services and **microservices architecture**, enhancing system reliability and reducing bugs by **25%**.\nContributed to the development of **CI/CD pipelines** leveraging **Docker** and **Kubernetes**, resulting in faster and more reliable deployments with a **30%** drop in deployment issues.\nDeveloped monitoring solutions utilizing tools such as **Prometheus**, **Grafana**, and **Datadog** to ensure application performance and observability, leading to proactive root cause analysis and a **20%** improvement in incident response times.\nCollaborated with development teams to define testing requirements and validate backend services, ensuring seamless integration and user-friendly mobile applications.\nAutomated testing scripts using various scripting languages, significantly increasing test coverage and reducing manual effort by **50%**.\nCommunicated effectively with cross-functional teams to streamline the QA process, enhancing team productivity and project timelines.\nMentored junior QA engineers to elevate their testing skills and knowledge of automation frameworks, contributing to department growth and development."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "Utilized **Playwright**, **Cypress**, and **Appium** to execute manual and automated testing of mobile applications, increasing test coverage by **30%**.\nDesigned and implemented **test automation frameworks** for backend services, enhancing efficiency in the QA process and reducing test cycle time by **25%**.\nCollaborated in microservice architecture, ensuring seamless integration and functional testing across disparate components in applications.\nDeveloped scripts using **scripting languages** to automate testing procedures, facilitating consistent and repeatable testing processes.\nParticipated in the development of **CI/CD pipelines** using **Docker** and **Kubernetes**, optimizing deployment processes and reducing time to market by **15%**.\nEmployed monitoring and observability tools such as **Prometheus**, **Grafana**, **Datadog**, and **New Relic** to track system performance and identify issues proactively.\nMethodically reviewed and communicated test results with cross-functional teams, promoting collaboration in achieving project goals.\nGenerated extensive technical documentation and reporting for mobile and backend services, aiding in knowledge transfer across the QA team.\nEngaged in ongoing training and skill development to remain abreast of industry trends in testing methodologies and tools."
    }
  ],
  "skills": "**Frontend Frameworks**:\n\tHTML, CSS, JavaScript, TypeScript, ReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n**Backend Frameworks**:\n\tNodeJS, ExpressJS, NestJS, C#, .NET, Entity Framework, Microservices\n\n**API Technologies**:\n\tRESTful API, GraphQL\n\n**Database Systems**:\n\tMSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB\n\n**Cloud & Infrastructure**:\n\tAWS, Azure, cloud platforms\n\n**DevOps**:\n\tCI/CD pipelines, Docker, Kubernetes, monitoring tools, observability tools, Prometheus, Grafana, Datadog, New Relic\n\n**Testing Tools**:\n\tNUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest, Playwright, test automation frameworks, manual testing, Appium\n\n**Other**:\n\tUX/UI Design, Git, GitHub, Python, Redux, communication skills, mobile applications, backend services, microservice architecture, scripting languages, Blockchain: Solidity, Ether.js, Web3.js, Ethereum"
}