{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Software Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-623a26390/",
  "profile_summary": "Senior Software Engineer with over 13 years of full-stack engineering experience, specializing in **Ruby on Rails** and adept at working with relational databases such as **PostgreSQL** and **MySQL**. Proficient in **TypeScript**, **Git**, and **GitHub**, with a strong focus on automated testing and unit testing methodologies. Experienced in leveraging modern frameworks including **Stimulus**, **Turbo**, and **Tailwind CSS** to enhance application performance and user experience.\n\nSkilled in building scalable applications with a solid understanding of **JSON:API** and **GraphQL** for API development. Proficient in cloud technologies, including **AWS**, and experienced with containerization and orchestration tools such as **Docker** and **Kubernetes**.\n\nAdept in messaging systems like **RabbitMQ** and **Kafka**, with a proven track record in technical SEO and site performance optimization strategies. Known for strong mentorship abilities and communication skills, ensuring collaborative and productive team environments while delivering high-quality, compliant software solutions.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Software Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Leveraged **Ruby on Rails**, **PostgreSQL**, and **MySQL** to design and build full-stack platforms, ensuring high performance and robust data management.\n• Utilized **TypeScript** in conjunction with modern front-end frameworks like **Stimulus**, **Turbo**, and **Tailwind CSS** to deliver optimal user interfaces and enhance site performance.\n• Implemented comprehensive automated testing strategies including unit testing using frameworks like **Jest** and **Cypress**, achieving a **90%+ test coverage** across applications.\n• Collaborated with cross-functional teams to develop and maintain RESTful APIs and endpoints adhering to the **JSON:API** specification, ensuring seamless integration and performance.\n• Engaged in mentorship programs to upskill junior developers, fostering a culture of continuous learning and technical excellence within the team.\n• Developed projects incorporating **Docker** and **Kubernetes** for container orchestration, enabling seamless deployment pipelines and environment consistency across development and production.\n• Enhanced site performance optimization, applying strategies for technical SEO that resulted in a **30% increase** in organic search traffic.\n• Employed **Git** and **GitHub** for version control and collaboration, facilitating smooth workflows and efficient code reviews.\n• Adapted messaging and data streaming infrastructures with **RabbitMQ** and **Kafka**, optimizing real-time data processing and communication in systems.\n• Maintained expertise in **AWS** cloud services for application deployment, leveraging its scalability and reliability to satisfy operational requirements.\n• Conducted comprehensive code reviews and delivered feedback to ensure adherence to best coding practices, performance standards, and security protocols.\n• Defined effective communication strategies with stakeholders to align on project requirements and progress, ensuring transparency in development workflows."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Led full-stack engineering initiatives by integrating **Ruby on Rails** with **PostgreSQL** and **MySQL**, enhancing data management capabilities in financial systems.\nImplemented automated testing and unit testing strategies, improving code quality and application reliability across multiple projects, achieving a **30%** reduction in post-deployment bugs.\nUtilized **Git** and **GitHub** for version control and collaborative development, facilitating seamless project workflows and team communication in a **9-member** engineering team.\nEnhanced user experience and site performance optimization using **Tailwind CSS** and **TypeScript**, improving load times by **25%** through efficient design and coding practices.\nContributed to robust API development using **JSON:API** and **GraphQL**, streamlining data retrieval processes for front-end applications and reducing server requests by **15%**.\nOrchestrated containerized application deployments using **Docker** and **Kubernetes**, ensuring scalable and efficient resource management in cloud environments such as **AWS**.\nMentored junior developers in best practices and technologies, fostering a culture of continuous learning and improvement within the team, leading to increased overall team performance.\nImplemented real-time messaging and data flow solutions using **RabbitMQ** and **Kafka**, optimizing inter-service communication and enhancing system responsiveness for financial operations.\n\nModernized core financial platforms by migrating to microservices architecture using **Node.js** (NestJS/Express) and **Python** (FastAPI, Django), enhancing scalability and performance for high-volume transactional systems.\nBuilt interactive front-end applications with **React** (18), **Vue 3**, **Next.js**, and **TypeScript**, leveraging **Redux Toolkit** and **Tailwind CSS** to create sleek, responsive interfaces for financial tools and admin panels.\nDelivered real-time analytics dashboards with **React**, **D3.js**, and **Power BI Embedded**, providing operations teams with instant insights into transactions and anomalies.\nDesigned and deployed a robust event-driven architecture using **Kafka**, **RabbitMQ**, and **Azure Service Bus**, ensuring asynchronous communication across critical workflows such as payments, alerts, and compliance.\nDeveloped ETL pipelines for ingesting financial data from internal and third-party sources using **Python**, **Apache Airflow**, and **Azure Data Factory**, supporting both batch and real-time processing.\nBuilt and deployed machine learning models for fraud detection using **scikit-learn**, **XGBoost**, and **Azure ML**, enabling proactive detection of suspicious activity based on user behavior and transaction patterns.\nCreated ML pipelines for real-time credit scoring, churn prediction, and transaction classification, leveraging **MLflow** and **Airflow** to integrate model inference into backend services."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "• Developed and maintained full-stack applications using **Ruby on Rails** and **PostgreSQL**, incorporating best practices in **automated testing** and **unit testing** to ensure code reliability and efficiency across **9** key modules.\n• Collaborated on versions of software releases aimed at enhancing site performance with targeted optimizations and technical SEO strategies, achieving a **25%** reduction in load times.\n• Utilized **Git** and **GitHub** for version control, ensuring collaborative coding practices and seamless integration across development teams with over **15** contributors.\n• Engineered robust APIs using **JSON:API** and **GraphQL** for efficient data retrieval, increasing client-side application performance by **30%** through optimized data fetching strategies.\n• Leveraged **Docker** and **Kubernetes** for containerization and orchestration, streamlining deployments and ensuring scalability with **99.9%** uptime in production environments.\n• Implemented real-time messaging features using **RabbitMQ** and **Kafka** for event-driven architecture, enhancing user interaction and real-time updates in applications.\n• Designed responsive and accessible UIs with **Tailwind CSS** and **TypeScript**, focusing on mobile-first design that meets **WCAG 2.1** standards.\n• Provided mentorship to junior engineers, fostering skill development in full-stack engineering and effective communication within the team.\n• Collaborated closely with cross-functional teams to gather requirements and deliver features according to Agile methodologies, maintaining a streamlined product development lifecycle."
    }
  ],
  "skills": "**Programming Languages:**\n\tPython, Ruby, JavaScript, TypeScript\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django, Ruby on Rails\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular, Stimulus, Turbo, Tailwind CSS\n\n**API Technologies:**\n\tJSON:API, GraphQL\n\n**Serverless and Cloud Functions:**\n\tAWS: Lambda\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps:**\n\tDocker, Kubernetes, Git, GitHub, GitHub Actions, GitLab CI/CD\n\n**Cloud & Infrastructure:**\n\tAWS: ECS, RDS, S3, Azure: App Services, Blob Storage, SQL Database\n\n**Other:**\n\tAutomated testing, unit testing, MLflow, Airflow, Kubeflow, RabbitMQ, Kafka, technical SEO, site performance optimization, mentorship, communication, Nginx, Let’s Encrypt, Certbot, Terraform, Ansible, Helm, Docker Compose"
}