{
  "name": "Patryk Zaslawski",
  "role_name": "Data Automation Specialist",
  "email": "patrykzas0428@outlook.com",
  "phone": "+48669862402",
  "address": "Gdanski, Poland",
  "linkedin": "https://www.linkedin.com/in/patryk-zaslawski-6b04a8397/",
  "profile_summary": "Results-driven Data Automation Specialist with 8+ years of experience in software engineering, specializing in data integration and automation using **Python** and **Google Apps Script**. Skilled in **Google Sheets** for data visualization and analytics, ensuring seamless data-driven decision-making. Proven ability to develop high-performance solutions for various sectors, with a strong emphasis on data automation strategies. Experienced in collaborating with teams through tools like **Confluence** to enhance internal communications and streamline workflows. Adept at testing and proposing innovative solutions to improve efficiency and accuracy in data handling.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2014",
      "to_year": "2017",
      "location": "United Kingdom",
      "university": "The University of Manchester"
    }
  ],
  "experience": [
    {
      "role": "Data Automation Specialist",
      "company": "Binary Studio",
      "from_date": "Aug 2023",
      "to_date": "Present",
      "location": "United Kingdom (Remote)",
      "responsibilities": "Developed and implemented **data automation** solutions leveraging **Python** to streamline internal communication processes and improve efficiency across departments.\nDesigned and maintained **data integration** pipelines utilizing **Python** scripts to extract, transform, and load data from various sources into **Google Sheets**, ensuring accurate and timely reporting for decision-making.\nAutomated data insights and visualization processes using **Google Analytics** and **Data Visualization** tools to provide real-time metrics and performance indicators, facilitating informed leadership decisions.\nUtilized **Google Apps Script** to enhance functionality in **Google Sheets**, automating routine tasks and improving data accuracy by reducing manual errors.\nCreated detailed documentation and operational procedures in **Confluence** to promote knowledge sharing and ensure seamless functionality for cross-functional teams.\nDeveloped and conducted comprehensive testing strategies for **data automation** processes, ensuring high-quality outcomes aligned with stakeholder requirements.\nProposed innovative solutions for internal communications leveraging automated data workflows, contributing to increased team productivity and engagement.\nImplemented solutions focused on data integrity and accuracy to support long-term internal communication strategy goals, ultimately driving enhanced operational effectiveness.\nUtilized various **data visualization** techniques to represent findings and trends effectively, promoting actionable insights for team members and stakeholders alike."
    },
    {
      "role": "Software Engineer",
      "company": "Ardigen",
      "from_date": "Mar 2020",
      "to_date": "Aug 2023",
      "location": "Poland",
      "responsibilities": "• Developed and automated data processes using **Python** and **Google Apps Script**, ensuring efficiency in data workflows and streamlining operations across multiple Google Sheets.\n• Created data visualization solutions leveraging **Google Analytics** to provide actionable insights and support data-driven decision-making.\n• Designed and implemented data integration workflows between various platforms, ensuring seamless data flows and enhancing reporting capabilities.\n• Conducted thorough testing and proposed innovative solutions to improve data handling and automation processes, enhancing overall data quality and reliability.\n• Collaborated with internal teams, utilizing **Confluence** for efficient communication and documentation of data projects and automation strategies.\n• Trained team members on data automation techniques, effectively improving team competency and understanding of internal communications related to data management.\n• Managed **Google Sheets** and associated data workflows, implementing best practices for data integrity and accessibility across the team.\n• Monitored performance metrics and provided recommendations for optimization, resulting in a **20%** increase in data processing efficiency.\n• Developed automated reports and dashboards, enhancing data visibility and improving stakeholder engagement with a focus on user-centric design principles."
    },
    {
      "role": "Software Engineer",
      "company": "Altum Software",
      "from_date": "Oct 2017",
      "to_date": "Feb 2020",
      "location": "United Kingdom",
      "responsibilities": "Utilized **Python** for data automation and integration processes, ensuring seamless workflow management across different systems and enhancing operational efficiency.\nDeveloped automated scripts employing **Google Apps Script** to streamline data handling within **Google Sheets**, reducing data entry time by **30%** and minimizing errors.\nCreated visual data reports utilizing **Google Analytics** for enhanced decision-making, improving data accessibility and understanding among internal teams by **40%**.\nImplemented effective data integration strategies to merge different data sources, increasing data reliability and consistency, and promoting clear internal communications among stakeholders.\nDesigned and produced actionable data visualizations and dashboards, enabling leadership to track metrics and KPIs in real-time, leading to quicker strategy adjustments.\nConducted extensive testing and proposed innovative solutions to enhance data automation workflows, resulting in a **25%** increase in productivity across departments.\nCollaborated with team members through **Confluence** for efficient documentation and knowledge sharing, ensuring all team members are aligned and informed about ongoing projects.\nAdapted existing data processes to improve accuracy and efficiencies, demonstrating a thorough understanding of internal communications and team dynamics.\nProvided training on data automation tools and procedures for team members, enhancing their skill set and confidence in using new technologies.\nLeveraged various data formats and technologies in automation processes to ensure high-quality data outputs and maintain compliance with company standards."
    }
  ],
  "skills": "**Programming Languages**\n\tPython, Google Apps Script\n\n**Backend Frameworks**\n\tFastAPI, Django, Flask, Spring Boot\n\n**Frontend Frameworks**\n\tAngular (1–16), React (15–18), Next.js, Vue.js (2/3), Blazor\n\n**API Technologies**\n\tREST & gRPC APIs\n\n**Serverless and Cloud Functions**\n\tAWS (Lambda), Azure (App Services)\n\n**Databases**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**DevOps**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD\n\n**Cloud & Infrastructure**\n\tAWS (ECS, RDS, S3), Azure (Blob, SQL)\n\n**Other**\n\tSQLAlchemy, Pydantic, Celery, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, Google Sheets, Google Analytics, Confluence, Data Visualization, Data Automation, Data Integration, Testing and Solution Proposing, Understanding of Internal Communications"
}