{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Fullstack Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-karol-kotlinski-bb2520397/",
  "profile_summary": "Results-driven Full Stack Engineer with 8 years of experience specializing in building high-performance web applications. Proficient in **JavaScript**, **Node.js**, **Vue.js**, and **Angular**, I leverage a strong foundation in **Docker**, **Jenkins**, and **Gulp** to deliver scalable solutions. My background includes hands-on development using **NGinx** and integrating with enterprise applications such as **Veeva**, **Cvent**, and **Marketo**.  \n\nRich in analytical thinking, I excel in problem-solving and collaboration across cross-functional teams to achieve project milestones. My experience also encompasses modern tooling with innovative features including **AI-powered code completion** powered by **GitHub Copilot**, **Tabnine**, and the **JetBrains IDEs** which enhance development efficiency. I am committed to writing clean, maintainable code while adhering to compliance standards.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Fullstack Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Developed and maintained scalable full-stack applications using **JavaScript**, **Node.js**, and **Vue.js** while facilitating clear communication and collaboration across teams.\n- Successfully deployed containerized applications utilizing **Docker** to streamline development workflows and improve deployment efficiency by **30%**.\n- Created automated CI/CD pipelines with **Jenkins** for seamless integration and delivery, reducing deployment times from **1 hour** to **15 minutes**.\n- Collaborated with cross-functional teams to accomplish project milestones, fostering an environment of analytical thinking and problem-solving.\n- Enhanced user interfaces and experiences with advanced **CSS** techniques and the integration of responsive design principles to improve user satisfaction scores by **25%**.\n- Actively participated in code reviews and employed **GitHub Copilot** and **AI-powered code completion** tools to enhance code quality and productivity.\n- Leveraged **NGinx** for efficient web service delivery and load balancing, achieving a **99.9%** uptime performance.\n- Assisted in the implementation of cloud services, ensuring seamless integration with existing frameworks, contributing to overall system resilience.\n- Engaged in continuous learning and adoption of emerging technologies, such as **Gulp** for streamlining front-end build processes.\n- Encouraged team collaboration through regular stand-ups and problem-solving sessions to address issues effectively and boost project efficiency."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "• Developed full-stack applications using **JavaScript** (Node.js, Vue.js) and **CSS**, ensuring seamless interaction and aesthetic appeal in user interfaces for financial platforms.\n• Leveraged **Docker** for containerization and **Jenkins** for CI/CD to streamline development processes, enhancing deployment frequency by **30%**.\n• Collaborated with cross-functional teams to implement Microservices architecture using **Node.js** and **Python** frameworks like **FastAPI** and **Django**, improving system performance and scaling capabilities for high-volume transactions.\n• Designed responsive and dynamic UI components with **Vue.js** and **React 18**, utilizing **Redux Toolkit** and **Tailwind CSS** to optimize user experience across financial dashboards.\n• Executed real-time analytics and monitoring solutions using **D3.js** and **Power BI Embedded**, enabling operations teams to track financial trends and anomalies effectively.\n• Integrated messaging systems like **Kafka**, **RabbitMQ**, and **Azure Service Bus** to create a resilient event-driven architecture, facilitating asynchronous communication with a **99%** uptime.\n• Orchestrated ETL pipelines with **Python**, **Apache Airflow**, and **Azure Data Factory**, achieving real-time ingestion capabilities from multiple data sources, improving data accessibility by **40%**.\n• Developed and implemented AI/ML models for fraud detection using **scikit-learn** and **XGBoost**, proactively identifying suspicious transactions and reducing fraud incidents by **20%**.\n• Automated ML pipelines for credit scoring and churn prediction with **MLflow** and **Airflow**, integrating model insights for instantaneous decision-making capabilities across backend services."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Utilized **JavaScript**, **Node.js** (NestJS, Express), **Vue.js**, and **Angular** to design and develop dynamic, responsive web applications, ensuring a seamless user experience across various devices.\nBuilt and maintained CI/CD pipelines using **Docker** and **Jenkins**, achieving a deployment frequency increase of **30%** while minimizing downtime through automated processes.\nImplemented task automation using **Gulp** and optimization of web servers with **NGinx**, resulting in **20%** faster page load times and improved server response.\nExecuted features for marketing integrations with **Veeva**, **Cvent**, and **Marketo**, contributing to an optimized customer journey and enhanced lead generation strategies.\nEngaged in analytical thinking and problem-solving to troubleshoot and resolve issues efficiently, facilitating improved collaboration among cross-functional teams.\nAdopted AI-powered code completion tools like **GitHub Copilot** and **Tabnine** to enhance development speed and accuracy, leading to a **15%** reduction in coding errors.\nPromoted effective communication within teams and stakeholders, ensuring project objectives and timelines were met on schedule.\nCollaborated on project planning and design discussions, leveraging **Analytical Thinking** to translate functional requirements into technical specifications.\nEmployed role-based access control (RBAC) to manage user permissions and secure application access, ensuring compliance with data protection regulations.\nContributed to UX/UI design reviews to ensure that the applications align with both business goals and technical standards."
    }
  ],
  "skills": "**Programming Languages**:\n\tPython, JavaScript, TypeScript\n\n**Backend Frameworks**:\n\tFastAPI, Flask, Django, Node.js\n\n**Frontend Frameworks**:\n\tReact, Vue, Angular\n\n**API Technologies**:\n\tNginx, JWT, OAuth2\n\n**Serverless and Cloud Functions**:\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Databases**:\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps**:\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Jenkins, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure**:\n\tAWS, Azure\n\n**Other**:\n\tGulp, Veeva, Cvent, Marketo, AI-powered code completion, GitHub Copilot, Tabnine, JetBrains IDEs, Cursor, Trae, Qodo, Analytical Thinking, Communication, Collaboration, Problem Solving"
}