{
  "name": "Mariusz Jan Skobel",
  "role_name": "Senior .NET Engineer",
  "email": "mariuszskobel15@outlook.com",
  "phone": "+48 735 343 548",
  "address": "Katowice, Poland",
  "linkedin": "https://www.linkedin.com/in/mariusz-skobel-927764397/",
  "profile_summary": "Dedicated Senior .NET Engineer with over 10 years of experience in financial software development, leveraging .NET technologies to deliver high-performance and secure applications. Proficient in cloud computing, with extensive experience in **AWS**, **Azure**, and **Azure DevOps**, coupled with a strong foundation in **CI/CD** methodologies and **Terraform** for infrastructure as code. Adept in designing and implementing **REST APIs** and automated testing processes, ensuring high-quality software delivery. Demonstrated ability to solve complex problems through algorithmic thinking and effective collaboration, leading teams to build robust systems. Additionally, skilled in modern tech stacks including **JavaScript/TypeScript**, **Python**, and **Flutter**, with hands-on expertise in **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**. Passionate about driving real-world impact through scalable and maintainable software solutions.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2012",
      "to_year": "2015",
      "location": "UK",
      "university": "University of Bristol"
    }
  ],
  "experience": [
    {
      "role": "Senior .NET Engineer",
      "company": "EitBiz",
      "from_date": "Oct 2022",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "•\tDeveloped and maintained robust **.NET** applications and services, integrating **REST APIs** to enhance the functionality and performance of healthcare and financial software solutions.\n•\tDesigned and executed scalable **CI/CD** pipelines using **Azure DevOps**, ensuring timely delivery and consistent quality in product updates, achieving a sprint completion rate of up to **95%**.\n•\tImplemented infrastructure as code with **Terraform**, automating deployment and configuration management across AWS cloud services, leading to a **40%** reduction in deployment-related incidents.\n•\tEnhanced software quality through automated testing frameworks, collaborating on **Automated Testing** setups to ensure comprehensive coverage, resulting in a **30%** decrease in defects in production releases.\n•\tOptimized system performance by resolving complex challenges through advanced **Problem Solving** techniques and **Algorithmic Thinking**, directly contributing to improved application response times by **25%**.\n•\tCollaborated cross-functionally to integrate financial data processing features within applications, leveraging financial software development principles to meet specific compliance standards, such as GDPR and PCI DSS.\n•\tProvided mentorship to junior developers in adopting best practices for **.NET** development and Azure cloud solutions, fostering a culture of continuous improvement and knowledge sharing within the team.\n•\tParticipated in the architectural design and code reviews, ensuring that implementations met established standards and were scalable, maintainable, and aligned with project timelines.\n•\tContributed to the identification and implementation of performance improvements across existing systems, facilitating smoother operational workflows and enhancing user satisfaction metrics by over **20%**."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Tvn S.A.",
      "from_date": "Oct 2019",
      "to_date": "Sep 2022",
      "location": "Poland",
      "responsibilities": "Develop and maintain scalable financial software applications using **.NET** technologies, leveraging **AWS** cloud infrastructure to enhance performance and reliability.\nImplement CI/CD pipelines to facilitate automated testing and continuous deployment, ensuring high code quality and quick delivery cycles for financial products.\nCollaborate with cross-functional teams to design and develop REST APIs for seamless integration of various platforms, enhancing overall system interoperability.\nUtilize **Terraform** and **Azure DevOps** to automate infrastructure provisioning and management, leading to a **25%** increase in deployment efficiency.\nEngage in problem-solving and algorithmic thinking to troubleshoot complex issues, leading to a **30%** reduction in system downtime through proactive maintenance.\nLead comprehensive testing strategies, including automated testing frameworks, to ensure the robustness of financial applications that handle over **1 million** transactions daily.\nParticipate in architecting solutions that prioritize security and compliance, crucial for the financial industry, ensuring systems meet required standards for data protection.\nConduct code reviews and mentor junior developers, fostering a culture of continuous improvement and knowledge sharing within the development team."
    },
    {
      "role": "Software Engineer",
      "company": "Timspark",
      "from_date": "Sep 2015",
      "to_date": "Aug 2019",
      "location": "UK",
      "responsibilities": "- Developed and maintained **REST APIs** for a financial software solution using **.NET**, ensuring adherence to industry standards for performance and security while enabling efficient data interchange.\n- Leveraged **AWS** cloud services for scalability and reliability, optimizing deployment processes through **Terraform** and **Azure DevOps**, contributing to a reduction in deployment time by **30%**.\n- Implemented **CI/CD** pipelines, resulting in increased deployment frequency and stability, with an uptick in automated testing coverage by **40%** to ensure software quality and reduce bugs.\n- Employed **Automated Testing** strategies to achieve robust software solutions, enhancing functionality testing and issue detection efficiency, implementing test cases that covered **90%** of critical features.\n- Utilized problem-solving and algorithmic thinking to design scalable solutions that improved system performance by **25%**, addressing complexities in financial data processing.\n- Collaborated cross-functionally to address technical challenges and improve end-user experience, integrating feedback loops that led to a **15%** increase in software usability ratings.\n- Developed innovative features with a focus on performance and user experience while maintaining compliance with financial regulations, facilitating user access and enhancing security protocols including **OAuth 2.0**.\n- Conducted code reviews and mentoring sessions, fostering a culture of continuous improvement and adhering to best practices within the engineering team.\n"
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, JavaScript, TypeScript\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django, .NET\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tREST APIs\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose, Azure DevOps\n\n**Cloud & Infrastructure:**\n\tAWS, Azure\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, CI/CD, Automated Testing, Financial Software Development, Problem Solving, Algorithmic Thinking",
  "apply_company": "Software Development"
}