{
  "name": "Mariusz Jan Skobel",
  "role_name": "Senior Multimedia Engineer",
  "email": "mariuszskobel15@outlook.com",
  "phone": "+48 735 343 548",
  "address": "Katowice, Poland",
  "linkedin": "https://www.linkedin.com/in/mariusz-skobel-927764397/",
  "profile_summary": "Results-driven Senior Multimedia Engineer with 10+ years of experience in delivering high-performance software solutions specializing in multimedia processing. Expert in **C**, **C++**, and **Python**, with comprehensive knowledge of **FFmpeg**, **GStreamer**, and video/audio codecs for efficient media handling. Proven proficiency in developing and optimizing applications for **Linux**, **Windows**, and **OSX** environments. Adept at working with streaming protocols such as **DASH**, **HLS**, and **WebRTC** to build seamless multimedia solutions. Solid understanding of build systems and tools, including **CMake**, **autotools**, and **meson**, along with practical experience in **Visual Studio** and **XCode**.\n\nPossessing strong problem-solving capabilities and excellent communication skills, I have a strong background in modern development practices, including CI/CD automation and cloud-native applications. Passionate about leveraging my technical expertise to create innovative systems that enhance user experience and drive impactful results.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2012",
      "to_year": "2015",
      "location": "UK",
      "university": "University of Bristol"
    }
  ],
  "experience": [
    {
      "role": "Senior Multimedia Engineer",
      "company": "EitBiz",
      "from_date": "Oct 2022",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Designed and implemented video/audio processing solutions using **C** and **C++**, optimizing performance and ensuring compatibility with various **video/audio codecs** and **muxers** for multimedia applications.\n• Developed cross-platform multimedia applications on **Linux**, **Windows**, and **OSX** utilizing **FFmpeg** and **GStreamer** for seamless audio/video encoding and streaming.\n• Led the integration of **DASH** and **HLS** streaming protocols, improving user experience through adaptive bitrate streaming and reducing latency for real-time communications using **WebRTC**.\n• Created build and configuration systems using **CMake**, **autotools**, and **meson** to streamline development processes, achieving build times reduced by **30%**.\n• Collaborated effectively with cross-functional teams to solve complex technical challenges, ensuring high-quality multimedia solutions while consistently communicating progress and issues.\n• Established quality assurance protocols for multimedia applications, resulting in a **15%** reduction in bugs and improved user satisfaction ratings through thorough testing and validation strategies.\n• Utilized **Visual Studio** and **XCode** for efficient development and debugging, enabling rapid iterations and enhancements based on user feedback.\n• Engineered scalable multimedia solutions to handle increased loads, enhancing capacity and performance for over **1,000** concurrent users during peak traffic.\n• Resolved critical performance issues by implementing best practices in code optimization and resource management, achieving a performance boost of up to **25%**."
    },
    {
      "role": "Software Engineer",
      "company": "Tvn S.A.",
      "from_date": "Oct 2019",
      "to_date": "Sep 2022",
      "location": "Poland",
      "responsibilities": "Utilized **Python** for developing high-performance multimedia processing solutions, ensuring robust system functionality for video/audio codecs integration.\nCreated and maintained cross-platform applications on **Linux**, **Windows**, and **OSX** leveraging **C** and **C++** languages, enabling multimedia applications to run seamlessly across various environments.\nImplemented video streaming protocols including **DASH** and **HLS** to enhance the delivery of multimedia content over the internet, supporting a diverse user base.\nIntegrated real-time communication features using **WebRTC**, facilitating live audio/video feeds and improving user engagement through high-quality streaming.\nDeveloped custom muxers and demuxers with **GStreamer** and **FFmpeg**, increasing efficiency in media handling and optimizing performance for multimedia applications.\nEnhanced build systems using **autotools**, **meson**, **CMake**, and IDEs like **Visual Studio** and **XCode**, achieving a streamlined workflow for project compilation with over **95%** build success rate.\nExecuted rigorous testing and debugging that improved software reliability by **30%**, using problem-solving skills to resolve issues efficiently.\nCommunicated cross-functionally with teams to drive project goals and integrate user feedback, leading to a **25%** improvement in feature deployment time."
    },
    {
      "role": "Software Engineer",
      "company": "Timspark",
      "from_date": "Sep 2015",
      "to_date": "Aug 2019",
      "location": "UK",
      "responsibilities": "Utilized **Python** and **C/C++** to design and optimize multimedia processing algorithms, ensuring high performance and efficient resource management across various platforms including **Linux**, **Windows**, and **OSX**.\nImplemented multimedia streaming capabilities using **GStreamer**, **FFmpeg**, and video/audio codecs, enhancing user experience and delivering high-quality media playback across diverse environments.\nEngineered adaptive streaming solutions using **DASH** and **HLS**, ensuring seamless content delivery and improved buffer management for optimal viewing experiences by accommodating varying network conditions.\nConducted troubleshooting and optimization of multimedia applications, leveraging strong problem-solving skills to identify bottlenecks and implement robust solutions.\nDeveloped and maintained build systems using **CMake** and **autotools**, facilitating efficient compilation and deployment processes while ensuring compatibility with multiple OS environments.\nCollaborated effectively with cross-functional teams to communicate technical concepts and share knowledge, enhancing team dynamics and project outcomes.\nApplied advanced techniques in real-time communication using **WebRTC**, enabling interactive media experiences and facilitating peer-to-peer connections.\nCreated comprehensive test suites and performance benchmarks to validate codec implementations and system behavior under load, achieving a minimum of **30% reduction in latency** and ensuring that all deliverables meet client requirements.\nLed the adoption of best practices in code documentation and version control, using tools like **Visual Studio** and **XCode** to streamline workflows and increase project transparency.\nEnsured compliance with industry standards and protocols for multimedia delivery, providing a high level of security and reliability in data handling."
    }
  ],
  "skills": "Programming Languages:\n\tPython, C, C++\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tJavaScript/TypeScript (React, Vue, Angular)\n\n**API Technologies:**\n\tWebRTC, DASH, HLS\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tLinux, Windows, OSX\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, GStreamer, FFmpeg, video/audio codecs, muxers, autotools, meson, Visual Studio, XCode, CMake, problem-solving, communication",
  "apply_company": "Not Specified"
}