{
  "name": "Mariusz Jan Skobel",
  "role_name": "Senior Engineer",
  "email": "mariuszskobel15@outlook.com",
  "phone": "+48 735 343 548",
  "address": "Katowice, Poland",
  "linkedin": "https://www.linkedin.com/in/mariusz-skobel-789557397/",
  "profile_summary": "Senior Engineer with 10+ years of experience in full stack development and a robust proficiency in **AWS**, **Linux**, **Terraform**, and **Ansible**. Expert in utilizing **cloud platforms** for deploying scalable applications and applying Infrastructure as Code (IaC) practices to streamline deployment processes. Skilled in ensuring application security and implementing automation practices that enhance operational efficiency. Proficient in **Bash**, **Python**, and other **scripting languages** for efficient development and deployment workflows.\n\nDemonstrated expertise in **CI/CD** that guarantees the quality of software releases and utilizes **API security** measures to safeguard applications. Strong background in **cloud environments** and IAM for managing access and secrets management effectively. Exceptional collaboration and communication skills, with a proven ability to take ownership of projects and adapt to evolving requirements. Committed to applying critical thinking to solve complex problems and deliver innovative solutions in the realms of healthcare and finance.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2012",
      "to_year": "2015",
      "location": "UK",
      "university": "University of Bristol"
    }
  ],
  "experience": [
    {
      "role": "Senior Engineer",
      "company": "EitBiz",
      "from_date": "Oct 2022",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "•\tDeveloped and maintained infrastructure as code (IaC) solutions using **Terraform**, **Ansible**, and **Puppet**, ensuring both stability and scalability in **AWS** and **Cloudflare** environments.\n•\tImplemented CI/CD pipelines leveraging **GitHub Actions** and **CircleCI** for automation practices, achieving a **30%** reduction in deployment times and ensuring quality across web and API services.\n•\tUtilized **Bash** scripting and **Python** for automating system tasks, significantly reducing manual effort and enhancing operational efficiency by **25%**.\n•\tManaged cloud security best practices, including API security and IAM roles, ensuring compliance with security standards and regulations.\n•\tDesigned networking solutions for cloud platforms, optimizing performance, enhancing connectivity, and reducing latency in applications.\n•\tLed the implementation of machine learning models using Python, integrating real-time inference services into the infrastructure with **scikit-learn**, **PyTorch**, and **TensorFlow** to improve data processing applications.\n•\tCollaborated with cross-functional teams to enhance security measures while developing infrastructure for various cloud environments.\n•\tEngaged in kernel-level debugging and performance tuning on **Debian**, leading to improved system reliability and reduced downtime by **15%**.\n•\tDeveloped automated testing strategies across applications using **Jest**, **Cypress**, and **Postman**, ensuring comprehensive coverage of unit, integration, and E2E tests.\n•\tUtilized critical thinking and adaptability to troubleshoot complex networking issues, ensuring maximum uptime and seamless network operations.\n•\tFostered collaboration and communication skills by leading projects, mentoring junior engineers, and driving an ownership mindset within the team."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Tvn S.A.",
      "from_date": "Oct 2019",
      "to_date": "Sep 2022",
      "location": "Poland",
      "responsibilities": "Developed and maintained infrastructure solutions on **AWS**, leveraging **Terraform** and **Ansible** for **Infrastructure as Code** to automate deployments, ensuring quality and security best practices in cloud environments.\nImplemented CI/CD pipelines using **Python** and **Bash** scripts, which reduced deployment times by **30%** and enhanced application security through automated testing and API security measures.\nLed the adoption of robust networking concepts in cloud infrastructures, utilizing skills in **Linux** and **Debian** for kernel-level debugging and network configurations to ensure high availability and reliability.\nEmployed **Cloudflare** for enhanced security layers and improved application performance, resulting in a **25%** reduction in latency for users.\nProvided hands-on expertise in incident response practices, maintaining a critical uptime of **99.99%** for service availability and leveraging **Go** for efficient microservices development.\nCollaborated across teams to promote a culture of automation practices and effective communication, contributing to a more adaptable engineering environment.\nChampioned secrets management and IAM policies to safeguard sensitive data and foster a secure development lifecycle, prioritizing security best practices across all stages of project implementation."
    },
    {
      "role": "Software Engineer",
      "company": "Timspark",
      "from_date": "Sep 2015",
      "to_date": "Aug 2019",
      "location": "UK",
      "responsibilities": "Utilized **AWS** and **Cloudflare** for building and managing cloud platforms, ensuring robust scalability and reliability for global e-commerce applications.\nDesigned and optimized backend services using **Python** and **Node.js** frameworks, including FastAPI, Django, NestJS, and Express, achieving a **99.9%** uptime while maintaining low latency across **3** key modules: checkout, cart, and order fulfillment.\nImplemented Infrastructure as Code (IaC) using **Terraform** and **Ansible**, automating deployments and infrastructure management processes, resulting in a **30%** reduction in deployment time.\nApplied security best practices, including **API security** and **application security**, ensuring compliance with GDPR and implementing **role-based access control (RBAC)** and **OAuth 2.0** for protecting sensitive data.\nDesigned and executed automated testing frameworks to ensure quality and performance of applications, leveraging CI/CD pipelines for streamlined deployments, resulting in improved software release cycles.\nIntegrated monitoring and logging practices to maintain infrastructure health, utilizing **Bash** and **Debian** scripting for kernel-level debugging and system maintenance tasks.\nDemonstrated expertise in networking and Linux environments to optimize e-commerce platforms, enhancing performance and security across cloud environments. \nFostered collaboration and communication within cross-functional teams, enhancing project ownership and adaptability for evolving requirements in a fast-paced setting.\nImplemented automation practices to streamline routine tasks, enabling focus on critical problem-solving and strategic initiatives in e-commerce development."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, JavaScript, TypeScript, Go\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tAPI security, JWT, OAuth2\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda), Azure (App Services)\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose, Puppet\n\n**Cloud & Infrastructure:**\n\tAWS, Cloud platforms, Cloudflare, Infrastructure as Code, IAM, Secrets management\n\n**Other:**\n\tLinux, Networking, Scripting languages, Automation practices, Ensuring quality, Collaboration, Communication skills, Ownership mindset, Adaptability, Critical thinking, Keycloak (OIDC, RBAC), Let’s Encrypt, Nginx, Certbot, Debian, Kernel-level debugging, Security best practices, CI/CD"
}