{
  "name": "Mariusz Jan Skobel",
  "role_name": "Senior C++ Engineer",
  "email": "mariuszskobel15@outlook.com",
  "phone": "+48 735 343 548",
  "address": "Katowice, Poland",
  "linkedin": "https://www.linkedin.com/in/mariusz-skobel-927764397/",
  "profile_summary": "Senior C++ Engineer with 10+ years of experience in software development, specializing in **C++**, **Qt**, and **QML** for delivering high-performance solutions. Adept in architecture design and methodology frameworks like **MVC**, **MVVM**, and **MVP**, along with proficiency in **TDD** and **BDD** to ensure code quality and facilitate automated testing. Proven track record of using agile methodologies such as **Scrum** and **Kanban** to drive project success. Skilled in **Python**, **Bash**, and **Powershell**, with a strong focus on software security and thread safety in development practices. Possesses excellent communication skills, problem-solving abilities, and a commitment to mentorship and team collaboration.\n\nStrong background in building and deploying cloud-native applications, with hands-on experience in tools and frameworks such as **React**, **Next.js**, **Node.js**, **FastAPI**, and **Django**. A proactive leader skilled in developing enterprise platforms that leverage AI/ML for enhanced decision-making capabilities while ensuring compliance with standards such as HIPAA, FHIR, PCI DSS, and SOC 2. Passionate about creating systems that balance technical robustness and real-world impact.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2012",
      "to_year": "2015",
      "location": "UK",
      "university": "University of Bristol"
    }
  ],
  "experience": [
    {
      "role": "Senior C++ Engineer",
      "company": "EitBiz",
      "from_date": "Oct 2022",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "•\tDeveloped and maintained high-performance applications using **C++**, adhering to architectural design patterns such as **MVC**, **MVVM**, and **MVP**, ensuring efficient application structure and coding practices.\n•\tUtilized **Qt** and **QML** frameworks to design intuitive user interfaces, enhancing user experience with features that support both thread safety and automated testing, contributing to **code quality** throughout the lifecycle.\n•\tApplied **TDD** and **BDD** approaches to streamline software development processes, implementing comprehensive unit tests and integration tests with **C++** testing frameworks to ensure code reliability and security.\n•\tLed agile development practices by employing **Scrum** and **Kanban** methodologies, promoting effective **communication** and collaboration among team members, resulting in a **30%** increase in team productivity.\n•\tMentored junior engineers in software design principles and best practices, fostering an inclusive development environment while improving overall team **problem-solving** capabilities.\n•\tDesigned and implemented robust software solutions focused on **software security**, addressing potential vulnerabilities through rigorous code reviews and security audits.\n•\tIntegrated automated testing frameworks into the CI/CD pipeline using **Powershell**, enhancing deployment reliability through continuous integration and delivery strategies.\n•\tCreated technical documentation that outlines system architecture, workflows, and design specifications, improving knowledge transfer and project onboarding processes.\n•\tWorked with **IP networking** concepts to ensure seamless integration and functionality of networked applications within enterprise environments, facilitating secure VPN access for remote users.\n•\tDeveloped scripts in **Bash** and **Python** to automate common system administration tasks, achieving a **25%** improvement in operational efficiency."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Tvn S.A.",
      "from_date": "Oct 2019",
      "to_date": "Sep 2022",
      "location": "Poland",
      "responsibilities": "Implemented and maintained code quality standards through **automated testing** and **TDD**, ensuring reliability and performance of C++ applications using **Qt** and **QML**.\nEngaged in **architecture design** and development of feature-rich financial platforms, employing best practices in **Scrum** and **Kanban** methodologies for effective project management and delivery.\nLeveraged **Python** and **Bash** for scripting, enhancing automation processes and system integrations, which improved overall workflow efficiency by **30%**.\nDemonstrated strong problem-solving skills in addressing complex technical challenges, contributing to system reliability by **25%** through optimized code and design patterns like **MVC**, **MVVM**, and **MVP**.\nProvided mentorship and guidance to junior engineers, fostering a culture of learning and collaboration within the team.\nEnsured **thread safety** in multi-threaded C++ applications to enhance performance and avoid race conditions in high-stakes environments.\nDeveloped technical documentation to facilitate knowledge transfer and improve team communication on code standards and architectural decisions.\nPromoted knowledge of **software security** practices, mitigating risks associated with vulnerabilities in software design and configuration.\n"
    },
    {
      "role": "Software Engineer",
      "company": "Timspark",
      "from_date": "Sep 2015",
      "to_date": "Aug 2019",
      "location": "UK",
      "responsibilities": "Enhanced software architecture design by utilizing **C++** with **Qt**, ensuring high performance and efficient thread safety for reusable components across various modules.\nImplemented **TDD** and **BDD** methodologies, resulting in a 30% reduction in bug rates and improved code quality through rigorous automated testing strategies.\nApplied **MVVM**, **MVC**, and **MVP** design patterns in projects to facilitate robust and maintainable code structure while mentoring junior team members on best practices.\nCollaborated using **Scrum** and **Kanban** methodologies to streamline development processes, leading to a 25% improvement in project delivery timelines.\nDeveloped technical documentation and design specifications for new features, enhancing team communication and ensuring alignment on project goals and objectives.\nUtilized **Python** for scripting and automation of key workflows and leveraging its ease of integration with legacy systems.\nMaintained software security standards through thorough code reviews and vulnerability assessments, ensuring compliance with industry best practices.\nConducted troubleshooting sessions for **IP networking** issues, leveraging **VPN** technology for secure remote access and connectivity assessments.\nFacilitated code quality discussions and peer reviews, leading to enhanced problem-solving and communication skills within the team.\nMentored team members on new technologies and frameworks, fostering a culture of continuous learning and improvement among peers."
    }
  ],
  "skills": "**Programming Languages:**\n\tC++, Ruby, Python, Bash, Powershell\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tJavaScript/TypeScript (React, Vue, Angular)\n\n**API Technologies:**\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, TDD, MVC, MVVM, MVP, thread safety, Scrum, Kanban, automated testing, code quality, architecture design, technical documentation, IP networking, BDD, VPN, communication, problem solving, mentorship",
  "apply_company": "Europe"
}