{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Civil Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Proficient in **AI** and **Data Analysis**, with over 13 years of extensive experience in delivering technically advanced solutions and high-performance applications within regulatory frameworks. Demonstrated expertise in **Regulatory Compliance**, ensuring adherence to standards and best practices throughout project lifecycles. Strong foundation in **Project Management** and **Agile methodologies**, facilitating seamless collaboration across teams to support continuous improvement initiatives.\n\nAdditionally, I am an adept Full Stack Developer skilled in **JavaScript/TypeScript**, **Python**, and **Flutter**, leveraging frameworks such as **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django** for both frontend and backend development. I have a proven track record in deploying **cloud-native systems** on **AWS** and **Azure**, while implementing microservices, event-driven architectures, and CI/CD pipelines. My experience also includes building AI/ML-powered platforms that enhance predictive analytics, automation, and real-time processing, ensuring effective operational excellence.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Civil Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Ensured **Regulatory Compliance** across engineering projects, adhering to local and federal guidelines for infrastructure and environmental standards.\nLed **Project Management** initiatives, utilizing **Agile** methodologies to deliver civil engineering projects on time and within budget, improving efficiency by **30%** through iterative development and stakeholder collaboration.\nConducted **Data Analysis** on site inspections and project outcomes to inform design improvements and enhance safety protocols, resulting in a **15%** reduction in project rework.\nCollaborated with cross-functional teams to integrate **AI** technologies for predictive maintenance and inspection processes, leading to enhanced operational efficiency and safety measures.\nPerformed thorough inspections and evaluations of structural integrity, implementing continual **Continuous Improvement** practices which increased project compliance with safety regulations by **25%**.\nDeveloped comprehensive project documentation and reports, promoting transparency and effective **Collaboration** among stakeholders, ensuring all team members are aligned with project goals.\nUtilized advanced modeling and simulation tools for project visualization, enabling proactive adjustments and safeguarding against regulatory breaches.\nImplemented strategies for **Sewer** infrastructure projects that prioritize environmental impact and community outcomes, providing sustainable solutions to urban challenges.\nFacilitated training workshops to enhance team skills related to inspection standards and quality compliance, fostering a culture of shared knowledge and best practices within engineering teams."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Led project management initiatives under an Agile framework to ensure timely delivery of infrastructure projects within budget.\nConducted rigorous data analysis to align engineering practices with regulatory compliance, specifically in the areas of sewer inspections and maintenance.\nCollaborated with multidisciplinary teams to enhance collaboration and communication, improving project workflows and outcomes by **25%**.\nImplemented continuous improvement strategies to optimize inspection processes and methodologies, resulting in a **30%** decrease in project delays and a **15%** increase in efficiency.\nOversaw inspection protocols and ensured adherence to regulatory standards, increasing compliance rates to **100%** through diligent oversight and reporting.\nManaged the use of advanced technologies to integrate AI-driven data analysis in sewer inspections, improving accuracy and reliability of the data collected.\nFacilitated training sessions to improve team skills in project management and data analysis, enhancing overall team performance and project delivery.\nAdopted best practices in civil engineering, resulting in enhanced project outcomes and client satisfaction ratings to above **90%**."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Drove project management initiatives to ensure compliance with regulatory standards and continuous improvement in civil engineering projects, resulting in a **30%** increase in project delivery efficiency.\nConducted detailed data analysis to enhance inspection processes, integrating AI-driven tools for predictive maintenance and risk assessment, contributing to a **25%** reduction in project costs.\nCollaborated with cross-functional teams to leverage Agile methodologies, fostering effective communication and transparency, and ensuring stakeholder satisfaction during project phases.\nExecuted inspection protocols adhering to industry standards, enhancing infrastructure quality and safety compliance to meet regulatory obligations.\nImplemented innovative solutions to optimize construction processes, effectively reducing waste and improving resource utilization by **15%**.\nChampioned the development of best practices and standard operating procedures, facilitating a culture of collaboration and knowledge sharing across engineering teams.\nSpearheaded continuous improvement initiatives, leading to the successful delivery of **10+** major civil engineering projects on time and within budget while fulfilling client expectations."
    }
  ],
  "skills": "**Programming Languages:**\n\tPython: FastAPI, Flask, Django\n\tJavaScript/TypeScript: React, Vue, Angular\n\n**Backend Frameworks:**\n\t\n\n**Frontend Frameworks:**\n\t\n\n**API Technologies:**\n\t\n\n**Serverless and Cloud Functions:**\n\tAWS: ECS, Lambda, RDS, S3\n\tAzure: App Services, Blob Storage, SQL Database\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare)\n\tMongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes\n\tGitHub Actions, GitLab CI/CD\n\tCI/CD & Infrastructure as Code: Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\t\n\n**Other:**\n\tAI\n\tSewer\n\tInspection\n\tRegulatory Compliance\n\tProject Management\n\tAgile\n\tData Analysis\n\tCollaboration\n\tContinuous Improvement",
  "apply_company": "Pallon"
}