{
  "name": "Marcin Karol Kotlinski",
  "role_name": "QA Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-karol-kotlinski-bb2520397/",
  "profile_summary": "As a QA Engineer with 8 years of experience, I excel in implementing **automated testing frameworks** including **Playwright**, **Cypress**, and **Selenium** for robust quality assurance across healthcare and financial sectors. My strong expertise in **testing RESTful APIs** using **Postman**, **pytest**, and **Supertest** enhances application reliability. I integrate **CI/CD pipelines** into my workflow leveraging tools such as **GitHub Actions** and **Jenkins** to automate the testing processes effectively. I possess a strategic approach to **test data management** and **environment configuration**, ensuring high standards of software integrity. \nIn addition to my QA skills, I bring a solid foundation in development with **Python**, **JavaScript**, and **TypeScript**. My full-stack development experience includes building **ML-driven systems** and developing **data pipelines** underpinned by **event-driven architectures**. I am proficient in agile methodologies and possess strong communication skills, allowing me to collaborate effectively within cross-functional teams while adhering to compliance standards.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "QA Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Implemented QA methodologies to ensure software quality and reliability across healthcare and financial platforms.\nDeveloped automated testing frameworks using **Cypress**, **Playwright**, and **Selenium** to boost efficiency in the testing processes for both web and mobile applications.\nConducted testing of RESTful APIs, leveraging tools like **Postman** and **Supertest** for comprehensive API testing and validation.\nDesigned and executed CI/CD pipelines utilizing **GitHub Actions** and **Jenkins** allowing for seamless integration and deployment processes.\nManaged test data effectively and employed mocking techniques to create stable test environments for various application scenarios.\nCollaborated closely with cross-functional teams in an agile environment to ensure timely communication and efficient workflow throughout the development cycle.\nExecuted testing strategies and prepared reports using **pytest** to maintain high standards of quality and functionality.\nArchitected automated regression test suites covering critical functionalities, contributing to a **30%** reduction in bug rates prior to release.\nLed the integration of ML-driven systems into the test automation process, enhancing the capability of tests to adapt to application changes.\nUtilized environment configuration best practices to set up test environments that mirror production settings for accurate testing outcomes.\nConducted metrics-driven analysis of test results, identifying trends and potential areas for improvement in both manual and automated testing.\nEstablished protocols for continuous monitoring of quality assurance processes and delivered insights to enhance overall software performance."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Applied QA methodologies to ensure high-quality delivery of financial platforms, leveraging **automated testing frameworks** including **Playwright**, **Cypress**, and **Selenium** to achieve 95% test coverage on critical functionalities.\nExecuted comprehensive testing of **RESTful APIs** using **Postman** and **pytest**, ensuring seamless integration within microservices architecture developed in **Node.js (NestJS/Express)** and **Python (FastAPI, Django)**.\nCollaborated with cross-functional teams utilizing **agile methodologies** to refine testing processes, enhancing communication and teamwork, resulting in a 30% reduction in bug resolution time.\nImplemented CI/CD pipelines with **GitHub Actions** and **Jenkins**, automating deployment and testing processes, which accelerated release cycles by 40%.\nManaged test data effectively using structured approaches to facilitate accurate testing outcomes and environment configuration for diverse use cases.\nConducted tests on **ML-driven systems** and various data pipelines, focusing on system performance under high transaction loads, achieving optimal results.\nUtilized **Python** and **JavaScript** to develop and maintain custom testing tools, contributing to improved testing efficiency by 20%.\nEmployed protocol for mocking services for efficient testing of complex financial systems, ensuring system reliability under varied scenarios within production-like environments."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Implemented and conducted **automated testing frameworks** using **Playwright**, **Cypress**, and **Selenium**, achieving **90%** test coverage for critical workflows on a global e-commerce platform.\nDeveloped and executed test strategies for **RESTful APIs** utilizing **Postman**, **pytest**, and **Supertest**, ensuring robust functionality and performance under various scenarios.\nEngaged in continuous integration and delivery (**CI/CD**) workflows leveraging **GitHub Actions** and **Jenkins**, automating the deployment pipeline which reduced release times by **30%**.\nCreated and managed **test data** in diverse environments, ensuring consistency and accuracy for effective testing while leveraging environment configuration best practices.\nCollaborated within an **agile methodology** framework, participating in stand-ups and retrospectives to enhance team communication and project visibility.\nUtilized **Python** and **JavaScript** for developing custom test scripts, contributing to higher automation efficiency and integration with **ML-driven systems** for testing purposes.\nDesigned and implemented data pipelines for effective management of testing data, contributing to improved efficiency in testing workflows.\nApplied **event-driven architectures** knowledge to streamline the integration of testing environments with application modules, enhancing overall testing efficacy.\nCultivated strong **communication skills** to present testing results and strategies clearly to stakeholders, facilitating informed decision-making processes throughout the development lifecycle.\nConducted regular checks and updates in testing frameworks, ensuring compatibility with the latest platform changes and maintaining testing relevance."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, JavaScript, TypeScript\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n **Frontend Frameworks:**\n\tReact, Vue, Angular\n\n **API Technologies:**\n\ttesting RESTful APIs, Postman\n\n **Automated Testing Frameworks:**\n\tPlaywright, Cypress, Selenium, pytest, Supertest\n\n **Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n **Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Jenkins, CI/CD pipelines, Terraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:**\n\tenvironment configuration, CI/CD & Infrastructure as Code\n\n **Other:**\n\tQA methodologies, test data management, mocking, ML-driven systems, data pipelines, event-driven architectures, agile methodologies, communication skills, Authentication & Security (Keycloak, JWT, OAuth2, Let’s Encrypt, Nginx, Certbot)\n"
}