{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Software Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Senior Software Engineer with 13+ years of experience in delivering high-performance applications, proficient in **Java**, **Python**, and **C/C++**. Adept in Agile methodologies, and version control systems including **Git** and **Subversion**. Experienced in utilizing Linux environments and containerization tools such as **Docker**.\nDemonstrated expertise in developing applications using cloud-native architectures and integrating continuous delivery practices. Strong background in industry best practices and compliance, particularly within healthcare and financial sectors, with a focus on aligning solutions with standards such as HIPAA and PCI DSS. Proven ability in building and deploying AI/ML-powered platforms with a hands-on approach in full-stack development, including frontend frameworks like **React**, **Next.js**, and **Vue**, as well as backend solutions utilizing **Node.js**, **FastAPI**, and **Django**.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Software Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Utilized **C**, **C++**, and **Python** to design and develop full-stack platforms, ensuring scalability and performance in line with Agile methodologies.\nCollaborated in Agile teams, employing **Git** and **Subversion** for version control, facilitating seamless integration and code management across projects.\nDeveloped and maintained CI/CD pipelines using **Docker** for containerization, enhancing deployment efficiency and reliability in production environments.\nParticipated in sprint planning and retrospectives using **Jira** and **Confluence**, improving team communication and project documentation.\nCreated robust applications for healthcare and fintech, adhering to compliance standards including HIPAA and PCI DSS.\nEngineered modular microservices architectures with **Docker** and Kubernetes, enhancing system resilience and scalability for user transactions.\nDeveloped data solutions using **PostgreSQL** and **MongoDB**, aiming for high performance in data ingestion and analytics, achieving response times under **200ms**.\nDelivered complex features such as predictive analytics dashboards and real-time alerts, increasing user engagement by **30%**.\nImplemented advanced testing strategies using **PyTest** and CI/CD practices, resulting in a **40%** reduction in bugs post-release.\nLeveraged **Agile** practices for iterative improvement, ensuring timely delivery of critical updates and features while adhering to best engineering practices.\nParticipated in code reviews and mentoring sessions, fostering a culture of continuous learning and improvement among team members."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "- Led software development projects utilizing **Agile** methodologies to improve project delivery timelines and team collaboration, ensuring a 30% increase in productivity.\n- Collaborated in **Git** and **Subversion** for version control, maintaining code integrity and facilitating streamlined code reviews across teams.\n- Developed back-end services using **Python** and **Java** to enhance payment processing systems, which resulted in a 25% reduction in transaction latency.\n- Engineered containerized applications using **Docker**, fostering consistent environments and accelerating deployment processes by up to 40%.\n- Guided teams in utilizing **Linux** for server management and application deployment, achieving a heightened level of reliability in production systems.\n- Participated in regular code reviews and refactoring sessions to improve code quality and maintainability, achieving a 15% reduction in bug reports post-release.\n- Collaborated effectively through **Jira** and **Confluence** for project management and documentation, ensuring transparent communication and tracking of progress across teams.\n- Drove improvements in development processes through continuous integration and delivery practices based on industry standards, elevating release frequency from bi-weekly to weekly."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Utilized **Python** and **Java** to design and optimize backend services, ensuring performance and scalability across a global e-commerce platform, achieving a latency reduction of **30%** in critical modules like checkout and order fulfillment.\nEmployed **Agile** methodologies to drive project success, focusing on collaboration and iteration, leading to a **20%** faster delivery rate of features and enhancements.\nImplemented version control practices using **Git** and **Subversion**, maintaining a clean and structured codebase with over **200** commits processed weekly to streamline team collaboration.\nDeveloped and maintained robust applications in **Docker** containers, improving deployment speed and consistency across different environments, achieving a **50%** reduction in deployment failures.\nLeveraged **Linux** environments for reliable application hosting and performance tuning, which increased uptime to **99.9%** across deployed services.\nParticipated in regular stand-ups and sprints using **Jira** and **Confluence**, enhancing team communication and transparency while tracking project progress effectively.\nBuilt and integrated secure payment workflows utilizing **C** and **C++**, ensuring compliance with PCI standards and enhancing payment processing time by **40%**.\nImplemented automated testing frameworks and CI/CD pipelines, contributing to an overall reduction of production bugs by **25%**, enhancing code quality and reliability.\nCollaborated with cross-functional teams to gather requirements and deliver high-quality software solutions, utilizing a customer-focused approach to improve user satisfaction ratings by **15%**."
    }
  ],
  "skills": " **Programming Languages:**\n\t C, C++, Java, Python, JavaScript/TypeScript\n\n **Backend Frameworks:**\n\t FastAPI, Flask, Django\n\n **Frontend Frameworks:**\n\t React, Vue, Angular\n\n **API Technologies:**\n\t Keycloak (OIDC, RBAC), OAuth2, JWT\n\n **Serverless and Cloud Functions:**\n\t AWS: ECS, Lambda, Azure: App Services\n\n **Databases:**\n\t PostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n **DevOps:**\n\t Docker, Kubernetes, Git, GitHub Actions, GitLab CI/CD, Jira, Confluence, Subversion\n\n **Cloud & Infrastructure:**\n\t AWS: RDS, S3, Azure: Blob Storage, SQL Database, Terraform, Ansible, Helm, Docker Compose\n\n **Other:**\n\t Agile, Linux, MLflow, Airflow, Kubeflow, Nginx, Let’s Encrypt, Certbot",
  "apply_company": "Haystack"
}