{
  "name": "Rei Taro",
  "role_name": "Senior PowerBI Engineer",
  "email": "rei515@outlook.com",
  "phone": "+48732529451",
  "address": "Warszawa, Poland",
  "linkedin": "https://www.linkedin.com/in/rei-taro-81a410391/",
  "profile_summary": "Results-driven Senior PowerBI Engineer with over 10 years of experience in data management, data transformation, and implementing Microsoft best practices. Proficient in PowerBI for developing robust data models and ensuring data quality while adhering to web accessibility guidelines. Strong ability to manage user permissions and produce comprehensive technical documentation. Demonstrated expertise in leveraging agile methodologies and automation tools, with a strong background in backend development using **Python** (**FastAPI**, **Django**, **Flask**) and cloud services like **AWS** and **Azure**. Proven success in optimizing systems for financial platforms and AI/ML pipelines, contributing to high-impact projects at industry leaders such as VISA, Sii Poland, and Reply Polska.",
  "education": [
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2010",
      "to_year": "2015",
      "location": "Japan",
      "university": "Keio University"
    }
  ],
  "experience": [
    {
      "role": "Senior PowerBI Engineer",
      "company": "Leobit",
      "from_date": "Aug 2022",
      "to_date": "Present",
      "location": "Poland",
      "responsibilities": "Utilized **PowerBI** for advanced data management and transformation, ensuring compliance with Microsoft best practices while constructing efficient data models.\nEngineered solutions to enforce user permissions and adhere to web accessibility guidelines, enhancing system usability for diverse users.\nImplemented measures for data quality assurance, analyzing metrics to drive accurate reporting and visualization outcomes.\nAuthored clear and comprehensive technical documentation to facilitate knowledge sharing and maintain project transparency.\nCollaborated effectively with cross-functional teams via **MS Teams**, ensuring streamlined communication and efficient project execution.\nDeveloped and optimized data pipelines for real-time analytics solutions, incorporating best practices in data management.\nConducted extensive reviews to enhance security protocols, aligning with industry standards and best practices for system integrity."
    },
    {
      "role": "Software Engineer",
      "company": "Innovature",
      "from_date": "Nov 2018",
      "to_date": "Jun 2022",
      "location": "Japan",
      "responsibilities": "Utilized **PowerBI** for data management and transformation, ensuring implementation of **Microsoft best practices** in developing high-quality data models and visual reports.\nImplemented comprehensive data quality measures, conducting regular checks to maintain accuracy and integrity of reporting metrics.\nCreated detailed technical documentation to guide users on navigating **PowerBI** dashboards and features, enhancing user experience and compliance with web accessibility guidelines.\nManaged user permissions effectively within **PowerBI** to ensure data security and adherence to company policies.\nCollaborated with cross-functional teams, employing **MS Teams** for smooth communication and project tracking, enhancing team efficiency by **20%**.\nEngaged in regular performance assessments, producing actionable insights that contributed to a **15%** increase in data-driven decision-making capabilities across the organization.\n"
    },
    {
      "role": "Software Developer",
      "company": "Wizcorp",
      "from_date": "Apr 2015",
      "to_date": "Nov 2018",
      "location": "Japan",
      "responsibilities": "• Executed data management and transformation strategies using **PowerBI** to create robust data models that align with Microsoft best practices, enhancing reporting capabilities.\n• Developed and implemented measures to ensure data quality, providing accurate insights and analytics for strategic decision-making.\n• Collaborated with cross-functional teams using **MS Teams**, ensuring clear communication regarding user permissions and web accessibility guidelines.\n• Created and maintained technical documentation to streamline processes and support compliance with data governance standards.\n• Utilized feedback from stakeholders to optimize data visualization and reporting, leading to a **30%** improvement in report delivery efficiency.\n• Drove integration of analytical insights into business processes, impacting project outcomes positively with **15%** increase in data-driven decisions.\n• Conducted training sessions on data management best practices, benefiting at least **25** team members, fostering a data-centric culture within the organization."
    }
  ],
  "skills": " **Programming Languages** \n\tPython (3.8+), SQL, Bash, JavaScript\n\n **Backend Frameworks** \n\tFastAPI, Flask, Django, Celery\n\n **Frontend Frameworks** \n\t\n\n **API Technologies** \n\tREST/gRPC APIs, Microservices\n\n **Serverless and Cloud Functions** \n\tAWS (EC2, S3, Lambda), Azure\n\n **Databases** \n\tPostgreSQL, MySQL, MongoDB, Redis\n\n **DevOps** \n\tDocker, Kubernetes, GitHub Actions, Azure DevOps, CI/CD, PyTest, Git\n\n **Cloud & Infrastructure** \n\t\n\n **Other** \n\tPandas, NumPy, scikit-learn, TensorFlow, Airflow, MLflow, PowerBI, data management, data transformation, Microsoft best practices, data model, web accessibility guidelines, user permissions, data quality, measures, technical documentation, MS Teams",
  "apply_company": "eir evo talent"
}