{
  "name": "Rei Taro",
  "role_name": "Senior Value Engineer",
  "email": "rei515@outlook.com",
  "phone": "+48732529451",
  "address": "Warszawa, Poland",
  "linkedin": "https://www.linkedin.com/in/rei-taro-81a410391/",
  "profile_summary": "Dynamic Senior Value Engineer with over 10 years of experience in leveraging analytical skills and management consulting to optimize business processes and drive customer success. Proficient in project management, value-based selling, and crafting boardroom presentations that resonate with executive stakeholders. Proven track record of deploying innovative backend solutions with a strong technical background in **Python (FastAPI, Django, Flask)** and cloud technologies such as **AWS** and **Azure**. Highly skilled in change management and maintaining a consulting mindset, ensuring impactful outcomes for clients in top-tier organizations like VISA, Sii Poland, and Reply Polska.",
  "education": [
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2010",
      "to_year": "2015",
      "location": "Japan",
      "university": "Keio University"
    }
  ],
  "experience": [
    {
      "role": "Senior Value Engineer",
      "company": "Leobit",
      "from_date": "Aug 2022",
      "to_date": "Present",
      "location": "Poland",
      "responsibilities": "Utilized **analytics** to drive value-based selling strategies, enhancing customer engagement and satisfaction by **25%**.\nImplemented **business process optimization** techniques, resulting in a **30%** reduction in operational inefficiencies.\nManaged consulting projects with a focus on continuous improvement and **change management**, ensuring timely delivery and exceeding client expectations by achieving a **95%** customer success rate.\nFacilitated **executive communication** and delivered impactful **boardroom presentations** to stakeholders, aiding in the strategic decision-making process.\nApplied strong **analytical skills** to evaluate project outcomes, presenting findings and recommendations to enhance business performance.\nCollaborated with management teams to refine project management methodologies, leading to an improvement in project delivery timelines by **20%**.\nLeveraged a **consulting mindset** to address client needs effectively, developing tailored solutions that promote sustained growth."
    },
    {
      "role": "Software Engineer",
      "company": "Innovature",
      "from_date": "Nov 2018",
      "to_date": "Jun 2022",
      "location": "Japan",
      "responsibilities": "• Managed project execution by using **analytics** to optimize business processes, enhancing project delivery timelines by **30%**.\n• Developed and implemented **management consulting** strategies to align technology solutions with client goals, leading to a **25%** improvement in client satisfaction scores.\n• Provided insights through **value-based-selling** techniques, resulting in increased revenue through effective client engagement and relationship building.\n• Demonstrated **executive communication** skills through impactful **boardroom presentations**, clearly articulating technical solutions and business benefits to stakeholders.\n• Led **change management** initiatives by facilitating cross-functional collaboration, ensuring smooth transitions and adoption of new technologies within the organization.\n• Applied analytical skills to assess project performance, enabling data-driven decisions that improved efficiency and effectiveness in consulting efforts.\n• Developed a consulting mindset focused on understanding client needs, resulting in tailored solutions that drive customer success and business growth.\n"
    },
    {
      "role": "Software Developer",
      "company": "Wizcorp",
      "from_date": "Apr 2015",
      "to_date": "Nov 2018",
      "location": "Japan",
      "responsibilities": "• Leveraged **analytics** to develop backend services for trade execution, portfolio management, and account tracking using **Python**, **Flask**, and **PostgreSQL**, enhancing trading operations across **9** distinct platforms.\n• Utilized a **consulting mindset** to engineer real-time price feed processors with **asyncio**, **WebSockets**, and **Redis**, successfully delivering up-to-the-minute trading data for high-frequency transactions, achieving a **30%** improvement in data latency.\n• Collaborated with cross-functional teams to deliver data through **REST APIs** and **WebSocket channels**, ensuring that user interaction with the platform is seamless and efficient, resulting in a **15%** increase in user satisfaction ratings.\n• Applied strong **change management** skills to ensure compliance with regulatory requirements such as **MiFID II** and **GDPR**, while strictly adhering to internal data security protocols, reducing compliance-related incidents by **50%**.\n• Implemented comprehensive test suites using **PyTest**, **tox**, and mock servers, streamlining QA and CI processes and decreasing development cycle time by **20%**.\n• Recommended business process optimization strategies by introducing job queuing and scheduling solutions with **Celery** and **RabbitMQ**, which improved backend task execution efficiency by **25%**."
    }
  ],
  "skills": " **Programming Languages**\n\t Python (3.8+), SQL, Bash, JavaScript\n\n **Backend Frameworks**\n\t FastAPI, Flask, Django, Celery\n\n **Frontend Frameworks**\n\t \n\n **API Technologies**\n\t REST/gRPC APIs, Microservices, Kafka\n\n **Serverless and Cloud Functions**\n\t AWS (EC2, S3, Lambda), Azure\n\n **Databases**\n\t PostgreSQL, MySQL, MongoDB, Redis\n\n **DevOps**\n\t Docker, Kubernetes, GitHub Actions, Azure DevOps, CI/CD\n\n **Cloud & Infrastructure**\n\t \n\n **Other**\n\t value-based-selling, analytics, management consulting, business process optimization, project management, analytical skills, customer success, executive communication, boardroom presentations, change management, consulting mindset, AI/ML Tools: Pandas, NumPy, scikit-learn, TensorFlow, Airflow, MLflow, PyTest, Git",
  "apply_company": "dbt Labs"
}