{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Intermediate Software Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-623a26390/",
  "profile_summary": "Intermediate Software Engineer with 13+ years of experience in developing high-performance applications, particularly in the healthcare and financial industries. Proficient in **Ruby on Rails**, **JavaScript**, **TypeScript**, and **React**, with a strong background in full stack development. Hands-on expertise in building and deploying cloud-native applications using **AWS**, **Terraform**, **Docker**, **Kubernetes**, and CI/CD tools such as **CircleCI** and **GitHub Actions**. Experienced with databases like **PostgreSQL** and search engines like **Elasticsearch**. \n\nDemonstrated ability in implementing robust **Infrastructure as Code** strategies and ensuring continuous integration and deployment. Adept at collaborating with cross-functional teams while maintaining clear and effective communication. Strongly committed to compliance-driven development, ensuring alignment with industry standards.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Intermediate Software Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Developed scalable applications utilizing **Ruby on Rails** and **PostgreSQL** for robust backend services, ensuring optimal performance and efficiency in data handling.\n- Implemented **AWS** solutions, including EC2, S3, and **Kubernetes** for orchestration, enhancing deployment strategies and operational scaling across **7** microservices.\n- Established **Terraform** for infrastructure as code, enabling **3x** faster environment provisioning and reducing manual configuration errors.\n- Advanced CI/CD processes by integrating **CircleCI** and **GitHub Actions**, automating testing and deployment across **4** environments, ensuring rapid and reliable software delivery.\n- Maintained code quality and performance through continuous integration practices, employing static code analysis and automated testing frameworks like Jest and Cypress.\n- Collaborated effectively within cross-functional teams, improving communication flow and project outcomes, evidenced by a **25%** increase in project delivery speed.\n- Enhanced application functionality with **JavaScript** and **React**, focusing on creating user-friendly, responsive interfaces that increased user engagement by **30%**.\n- Utilized **Elasticsearch** for efficient data searching capabilities across applications, allowing for optimized queries over high-volume datasets in the health and finance sectors.\n- Leveraged **Sentry** and **Datadog** for monitoring application performance and error tracking, leading to a **40%** reduction in response time for critical issues.\n- Documented processes and systems thoroughly, enabling knowledge transfer and continuity within the team, resulting in enhanced team productivity.\n- Participated in code reviews and team meetings to further enhance product quality and foster a culture of collaboration and innovation."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Utilized **Ruby on Rails** for backend development, enhancing application efficiency and performance by integrating seamless API endpoints.\nImplemented cloud solutions on **AWS**, leveraging services like **Amazon RDS** for **PostgreSQL** databases, ensuring scalable data storage and retrieval with optimized performance metrics.\nCoordinated deployment processes with **Terraform** and **Docker**, establishing Infrastructure as Code practices to streamline deployment workflows, reducing setup time by **30%**.\nConfigured **Kubernetes** for container orchestration, enhancing system reliability, and uptime by orchestrating microservices across multiple nodes.\nEnhanced CI/CD pipelines using **CircleCI** and **GitHub Actions**, facilitating continuous integration and deployment, leading to a **25%** reduction in release times.\nMonitored application performance using **Datadog** and **Sentry**, ensuring quick resolution of issues and maintaining an uptime of **99.9%**.\nDeveloped and maintained frontend applications with **React** and **TypeScript**, resulting in a **40%** improvement in user experience through fast, responsive UI.\nEmployed agile methodologies to foster collaboration within cross-functional teams, leading to improved communication and project delivery times.\n"
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Engineered scalable backend services leveraging **Ruby on Rails**, ensuring high availability and low latency across key modules such as checkout, cart, and order fulfillment for a global e-commerce platform.\nUtilized **AWS** for cloud infrastructure management, enhancing system reliability and deployment efficiency while managing cost through resource optimization.\nImplemented **Terraform** for Infrastructure as Code, streamlining resource provisioning and maintenance for development and production environments.\nDeveloped frontend applications using **React** (version 18) and **TypeScript**, delivering fast, responsive user experiences on both web and mobile platforms.\nOptimized data storage with **PostgreSQL** and developed data management strategies to ensure fault-tolerant access for high-traffic workflows.\nBuilt CI/CD pipelines using **CircleCI** and **GitHub Actions**, automating testing and deployment to facilitate rapid feature development and delivery practices.\nMonitored application performance with **Datadog** and **Sentry**, identifying and resolving issues proactively to enhance user satisfaction and operational efficiency.\nCollaborated in an Agile environment, participating in code reviews, team discussions, and project sprints to improve software quality and team productivity, achieving a **20%** reduction in bug-related incidents.\nImplemented **Docker** for containerization of applications, ensuring consistent development environments and easy scalability.\nApplied **Kubernetes** for orchestration of containerized applications, enabling controlled rollouts and improved application management.\nPromoted best practices of continuous integration and deployment, reducing release cycle times by **30%** while enhancing software quality through automated testing and monitoring.\nEngaged in clear and consistent communication with cross-functional teams to drive project progress and achieve team goals effectively."
    }
  ],
  "skills": " **Programming Languages:**\n\t•\tPython\n\t•\tJavaScript\n\t•\tTypeScript\n\n **Backend Frameworks:**\n\t•\tFastAPI\n\t•\tFlask\n\t•\tDjango\n\t•\tRuby on Rails\n\n **Frontend Frameworks:**\n\t•\tReact\n\t•\tVue\n\t•\tAngular\n\n **API Technologies:**\n\t•\tKeycloak (OIDC, RBAC)\n\t•\tOAuth2\n\t•\tJWT\n\n **Serverless and Cloud Functions:**\n\t•\tAWS: Lambda\n\n **Databases:**\n\t•\tPostgreSQL\n\t•\tMySQL\n\t•\tMongoDB\n\n **DevOps:**\n\t•\tDocker\n\t•\tKubernetes\n\t•\tGitHub Actions\n\t•\tGitLab CI/CD\n\t•\tCircleCI\n\n **Cloud & Infrastructure:**\n\t•\tAWS: ECS, RDS, S3\n\t•\tAzure: App Services, Blob Storage, SQL Database\n\t•\tTerraform\n\t•\tAnsible\n\t•\tHelm\n\t•\tDocker Compose\n\n **Other:**\n\t•\tMLflow\n\t•\tAirflow\n\t•\tKubeflow\n\t•\tElasticsearch\n\t•\tRedis\n\t•\tDatadog\n\t•\tSentry\n\t•\tContinuous integration\n\t•\tContinuous deployment\n\t•\tInfrastructure as Code\n\t•\tCollaboration\n\t•\tCommunication"
}