{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Staff Software Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-623a26390/",
  "profile_summary": "Staff Software Engineer with 13+ years of experience in Product Development and delivering high-performance applications across healthcare and financial industries. Skilled in **Java**, with a strong focus on **AI** and **Machine Learning** technologies. Expertise in data analysis and utilizing tools like **Amplitude** and **Looker** to derive insights and support cross-functional collaboration.\nDemonstrated experience in both frontend and backend development using **JavaScript**, **TypeScript**, **Python**, **Flutter**, **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**. Proven ability to build AI/ML-powered platforms that leverage predictive analytics, automation, and real-time processing.\nProficient in deploying cloud-native systems on **AWS** and **Azure**, implementing microservices, event-driven architectures, and CI/CD pipelines. Well-versed in compliance-driven development, aligning solutions with HIPAA, FHIR, PCI DSS, and SOC 2 standards.\nStrong background in MLOps, including model training, serving, and orchestration using **MLflow**, **Airflow**, and **Kubeflow**, with a commitment to coaching and mentorship to develop team capabilities.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Staff Software Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Leveraged **Java** to develop innovative software solutions, enhancing product development processes across multiple projects.\n- Applied **Machine Learning** techniques to improve data analysis capabilities, utilizing tools like **Amplitude** and **Looker** for advanced analytics and insights.\n- Collaborated cross-functionally to drive product development initiatives, improving overall efficiency by **25%** through effective communication and strategic planning.\n- Provided coaching and mentorship to junior engineers, fostering a culture of learning and growth within the engineering team leading to a **30%** increase in team productivity.\n- Supported the integration of intelligent features into applications, implementing **AI** solutions that enhanced user experiences with real-time personalized insights.\n- Participated in the full software development lifecycle using methodologies that adhered to industry best practices, ensuring timely delivery of projects with a **99%** success rate.\n- Conducted comprehensive data analysis and visualization, utilizing **Excel** to derive actionable insights from complex data sets, facilitating informed decision-making.\n- Championed initiatives for enhancing product quality through rigorous testing and development practices, contributing to a significant reduction in production issues by **40%**.\n- Regularly engaged in cross-functional collaboration to align product features with business objectives, effectively increasing stakeholder satisfaction ratings.\n- Drove the adoption of advanced analytics tools within the team, resulting in improved project outcomes and resource allocation efficiencies."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Utilized **Java** in the development of robust back-end services, improving system reliability and maintainability for financial applications.\nApplied **AI** and **Machine Learning** techniques in the creation of predictive models for fraud detection, achieving a **30%** increase in detection accuracy based on historical transaction data.\nFacilitated **Cross-Functional Collaboration** between product development teams to streamline workflows and enhance product features based on user feedback.\nLeveraged **Amplitude** and **Looker** for advanced **Data Analysis**, transforming complex datasets into actionable insights that drove product decisions.\nConducted **Coaching** and **Mentorship** sessions, empowering junior developers to enhance their programming skills and effectively contribute to project goals.\nDeveloped and integrated interactive analytics dashboards utilizing **Power BI** for visualization, enabling real-time data access for stakeholders.\nDesigned and optimized ETL pipelines for processing financial data, improving throughput by **50%** using tools like **Apache Airflow** and **Azure Data Factory**.\n\nOverall, emphasized modern software practices including **Microservices**, real-time data processing, and robust event-driven solutions to support high-volume transactional systems."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Leveraged **Java** to enhance backend services, ensuring robust performance in product development for a global e-commerce platform.\nApplied AI and Machine Learning strategies to integrate intelligent features and improve user engagement through data-driven insights.\nConducted thorough data analysis using **Amplitude** and **Looker**, providing actionable reports that informed product development and cross-functional collaboration.\nFostered a culture of **coaching** and **mentorship** within the engineering team to elevate skill sets and enhance collaborative efforts across departments.\nDesigned and optimized backend services for a global e-commerce platform using **Python (FastAPI, Django)** and **Node.js (NestJS, Express)**, ensuring high availability, low latency, and scalability across key modules like checkout, cart, and order fulfillment.\nEngineered real-time features using **WebSockets** and event-driven architecture powered by **Kafka** and **RabbitMQ**, enabling responsive order updates, dynamic inventory tracking, and real-time customer support.\nDeveloped frontend applications using **React (18)**, **Vue 3**, and **Angular**, enhanced with **TypeScript**, **Redux Toolkit**, and **Tailwind CSS**, delivering fast, responsive user experiences on both web and mobile platforms.\nLeveraged **MongoDB**, **PostgreSQL**, **Redis**, and **Cassandra** for distributed data storage, ensuring fast, fault-tolerant data access for high-traffic e-commerce workflows and caching frequently accessed resources for performance gains.\nIntegrated AI/ML-based recommendation engines using **scikit-learn**, **LightGBM**, and **TensorFlow** to personalize product listings, optimize search relevance, and improve conversion rates based on real-time behavioral data.\nImplemented **Redis** caching for product metadata, shopping cart sessions, and search results, significantly improving application responsiveness and reducing read pressure on databases.\nImplemented feature flags and blue-green deployments using **LaunchDarkly** and **Kubernetes** namespaces, enabling controlled rollouts, A/B testing, and risk mitigation during major platform updates.\nCreated responsive, SEO-friendly e-commerce UIs using **Next.js**, **Vue 3 + Nuxt**, and **HTML5/CSS3**, optimized for mobile-first engagement and accessibility compliance (**WCAG 2.1**).\nBuilt secure payment workflows integrated with **Stripe**, **PayPal**, and **Razorpay**, applying tokenized transactions and **PCI**-compliant handling of sensitive data.\nApplied role-based access control (**RBAC**) and **OAuth 2.0** for secure customer and admin access, ensuring **GDPR** compliance and user data protection throughout the platform."
    }
  ],
  "skills": " **Programming Languages:**\n\tJava,\n\tPython,\n\tJavaScript,\n\tTypeScript\n\n**AI & Machine Learning:**\n\tAI,\n\tMachine Learning,\n\tMLflow,\n\tAirflow,\n\tKubeflow\n\n**Backend Frameworks:**\n\tFastAPI,\n\tFlask,\n\tDjango\n\n**Frontend Frameworks:**\n\tReact,\n\tVue,\n\tAngular\n\n**API Technologies:**\n\tKeycloak (OIDC, RBAC),\n\tOAuth2,\n\tJWT\n\n**Serverless and Cloud Functions:**\n\tAWS: ECS,\n\tLambda,\n\tRDS,\n\tS3,\n\tAzure: App Services,\n\tBlob Storage,\n\tSQL Database\n\n**Databases:**\n\tPostgreSQL (Fintech),\n\tMySQL (Healthcare),\n\tMongoDB (Gaming),\n\tRedis\n\n**DevOps:**\n\tDocker,\n\tKubernetes,\n\tGitHub Actions,\n\tGitLab CI/CD,\n\tTerraform,\n\tAnsible,\n\tHelm,\n\tDocker Compose\n\n**Cloud & Infrastructure:**\n\tAWS,\n\tAzure\n\n**Other:**\n\tAmplitude,\n\tLooker,\n\tExcel,\n\tProduct Development,\n\tData Analysis,\n\tCross-Functional Collaboration,\n\tCoaching,\n\tMentorship"
}