{
  "name": "Tomasz Lee",
  "role_name": "Financial Systems Manager",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-477994390/",
  "profile_summary": "Results-driven Financial Systems Manager with 9+ years of expertise in **SQL** and **Data Management**, specializing in **Financial Planning** and **System Configurations**. Proven track record of managing **User and Role Management** and **Safety Administration** effectively. Skilled in adopting **Agile**, **Scrum**, **DevOps**, **Kanban**, and **Lean** methodologies to optimize processes and enhance team collaboration. Strong background in delivering robust financial solutions while ensuring compliance with audit processes. Originally a .NET Full Stack Developer, leveraging extensive knowledge in developing, implementing, and scaling applications with expertise in **microservices architecture**, **Apache Kafka**, **RabbitMQ**, **Redis**, **ReactJS**, **NextJS**, and **.NET** technologies.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Financial Systems Manager",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Apr 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Oversaw financial planning processes leveraging **Anaplan** and **Planful**, ensuring alignment with organizational goals and compliance requirements.\nManaged SQL database configurations to optimize data management and support financial reporting needs.\nImplemented user and role management systems to enhance security and streamline access in financial applications.\nFacilitated Agile methodologies, including **Scrum**, **Kanban**, and **Lean**, to promote efficient project execution and delivery timeliness, helping to improve team productivity by **30%**.\nDeveloped and coordinated audit processes to ensure financial accuracy and transparency in reporting, resulting in a **20%** increase in compliance adherence.\nConducted safety administration protocols within system configurations to safeguard sensitive financial data.\nAdapted and integrated DevOps practices, reducing overall deployment cycles by **25%** and ensuring smoother transitions between development and production.\nUtilized data management best practices to support robust financial analysis and forecasting initiatives.\nCollaborated with cross-functional teams to maximize the effectiveness of financial systems and technologies, improving stakeholder satisfaction by **15%**.\n"
    },
    {
      "role": "Full Stack Developer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "Managed and configured financial planning systems like **Anaplan** and **Planful**, ensuring accurate data management and user role management across multiple projects.\nOptimized SQL queries for financial data analysis, improving report generation speed by **40%**.\nLed system configurations that enhanced safety administration processes, aligning with best audit practices to ensure compliance and operational efficiency.\nImplemented Agile methodologies including **Scrum**, **Kanban**, and **Lean** within project teams to streamline development cycles, achieving project milestones **20%** faster.\nDeveloped and maintained documentation for processes related to financial planning, improving team onboarding efficiency by **50%**.\nCollaborated with cross-functional teams to define system requirements and deliver robust financial solutions on time.\nConducted regular audits of financial data systems to ensure integrity and compliance with established policies, leading to a **30%** reduction in discrepancies.\nFacilitated DevOps practices and CI/CD pipeline implementation to optimize deployment processes, reducing downtime by **15%**.\nMentored junior team members in financial systems management and data analysis practices to build a robust team skillset."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "Implemented **SQL** for effective **Data Management** and retrieval of financial information, resulting in a **15%** increase in data analysis speed.\nOversaw **System Configurations** for financial planning tools such as **Anaplan** and **Planful**, enhancing the accuracy of forecasts and reporting.\nManaged user and role access across platforms to ensure compliance and safety in financial processes, leading to improved audit readiness.\nUtilized **Agile** methodologies, including **Scrum** and **Kanban**, to streamline project management and increase team productivity by **25%**.\nCollaborated with the DevOps team to automate deployment processes, incorporating best practices for financial systems management.\nConducted audits and safety administration reviews to ensure adherence to regulatory requirements, enhancing overall system integrity.\nLed training sessions on financial planning tools to improve user adoption rates, achieving a **90%** user satisfaction score.\nDeveloped comprehensive documentation and user guides for financial systems use, facilitating knowledge transfer and continuity across teams.\nParticipated in daily standups and retrospectives to maintain project alignment and promote continuous improvement.\n"
    }
  ],
  "skills": " **Programming Languages**\n\tJavaScript, TypeScript, C#, .NET, Python, SQL\n\n **Backend Frameworks**\n\tNodeJS, ExpressJS, NestJS, Microservices\n\n **Frontend Frameworks**\n\tHTML, CSS, ReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n **API Technologies**\n\tRESTful API, GraphQL\n\n **Serverless and Cloud Functions**\n\t\n\n **Databases**\n\tMSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB\n\n **DevOps**\n\tAWS, Azure, CI/CD pipelines, DevOps, Agile, Scrum, Kanban, Lean\n\n **Cloud & Infrastructure**\n\t\n\n **Other**\n\tUX/UI Design, Git, GitHub, Blockchain: Solidity, Ether.js, Web3.js, Ethereum, Anaplan, Planful, Financial Planning, Data Management, System Configurations, User and Role Management, Safety Administration, Audit Processes"
}