{
  "name": "Mariusz Jan Skobel",
  "role_name": "Software Engineer (C++ and C#)",
  "email": "mariuszskobel15@outlook.com",
  "phone": "+48 735 343 548",
  "address": "Katowice, Poland",
  "linkedin": "https://www.linkedin.com/in/mariusz-skobel-118083397/",
  "profile_summary": "Motivated Software Engineer with 10+ years of experience in designing and delivering high-performance software solutions, with expertise in **C++** and **C#** for object-oriented programming and robust design patterns. Experienced in Agile and Scrum methodologies, adept at leveraging **Microsoft Visual Studio** and the **.NET Framework** for efficient software development. Proven ability in XML and XSLT for data handling, equipped with strong unit testing skills to ensure high code quality. A proficient problem-solver with excellent communication skills, dedicated to creating efficient systems. Additionally, I have a strong foundation in delivering software with modern technologies such as **JavaScript/TypeScript**, **Python**, and **Flutter**, along with hands-on knowledge of frameworks like **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**. My cloud-native application deployments on **Azure** and **AWS**, along with expertise in microservices architecture and CI/CD automation, further enhance my ability to contribute effectively. Passionate about building secure and maintainable solutions that adhere to compliance standards and drive significant real-world impact.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2012",
      "to_year": "2015",
      "location": "UK",
      "university": "University of Bristol"
    }
  ],
  "experience": [
    {
      "role": "Software Engineer (C++ and C#)",
      "company": "EitBiz",
      "from_date": "Oct 2022",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Developed robust software solutions utilizing **C++** and **C#** within the **.NET Framework**, adhering to best practices in **object-oriented programming** and various **design patterns**.\n• Collaborated actively in **Agile** and **Scrum** environments to enhance workflow efficiency, resulting in a **25%** improvement in completion timelines for software development projects.\n• Created and maintained unit tests to ensure code quality and reliability, achieving a test coverage rate of **90%**, which significantly reduced production issues.\n• Analyzed and resolved technical problems through effective problem-solving skills, improving overall system performance by **30%**.\n• Utilized **Microsoft Visual Studio** for optimal development and debugging processes, contributing to an increase in team productivity by **15%**.\n• Engaged in regular communication with cross-functional teams to clarify requirements and contribute to continuous improvement in project deliverables.\n• Leveraged **XML** and **XSLT** for sophisticated data manipulation and transformation tasks within application workflows, enhancing system interoperability.\n• Participated in code reviews for maintaining software quality and shared knowledge, fostering a culture of collaboration and learning within the team."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Tvn S.A.",
      "from_date": "Oct 2019",
      "to_date": "Sep 2022",
      "location": "Poland",
      "responsibilities": "Utilized **C++** and **C#** to develop and maintain efficient software applications, incorporating object-oriented programming principles and design patterns to enhance code reusability and reliability.\nCollaborated in an Agile/Scrum environment, participating in daily stand-ups and iterative development cycles to ensure timely delivery of project milestones.\nConducted unit testing to validate software functionality and performance, achieving a 95% pass rate in quality assessments during the **2023** development cycle.\nEmployed **Microsoft Visual Studio** and **.NET Framework** to design robust applications, ensuring adherence to coding standards and best practices for maintainability.\nManaged and transformed data using **XML** and **XSLT**, improving data interchange processes and enhancing system interoperability.\nResolved complex software-related issues through strong problem-solving skills, achieving a 30% reduction in bug resolution time.\nPromoted effective communication between cross-functional teams, facilitating knowledge sharing and helping to foster a collaborative team environment."
    },
    {
      "role": "Software Engineer",
      "company": "Timspark",
      "from_date": "Sep 2015",
      "to_date": "Aug 2019",
      "location": "UK",
      "responsibilities": "Applied object-oriented programming and design patterns in **C++** and **C#** to build efficient and scalable software solutions.\nUtilized **Microsoft Visual Studio** for development, debugging, and deployment of high-quality applications in accordance with Agile methodologies and Scrum practices.\nImplemented robust unit testing procedures to ensure code quality and reliability throughout the software development life cycle.\nDemonstrated strong problem-solving skills to troubleshoot and resolve technical issues, enhancing overall application performance.\nEffectively communicated project updates and collaborated with cross-functional teams to align on requirements and deliverables.\nLeveraged **XML** and **XSLT** for data transformation and integration within software applications, ensuring data consistency and interoperability.\nParticipated in sprint planning and retrospectives, contributing to continuous improvement in development processes and team dynamics.\nDesigned and developed modular software components, embracing reusable code practices and maximizing efficiency across projects."
    }
  ],
  "skills": " **Programming Languages:** \n\tC++, C#, Python, JavaScript, TypeScript\n\n**Backend Frameworks:** \n\tFastAPI, Flask, Django, .NET Framework\n\n**Frontend Frameworks:** \n\tReact, Vue, Angular\n\n**API Technologies:** \n\tXML, XSLT, JWT, OAuth2\n\n**Serverless and Cloud Functions:** \n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Databases:** \n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps:** \n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:** \n\tAWS, Azure, Nginx, Let’s Encrypt, Certbot\n\n**Other:** \n\tArtificial Intelligence, Machine Learning, MLflow, Airflow, Kubeflow, object-oriented programming, design patterns, Agile, Scrum, unit testing, problem-solving, communication"
}