{
  "name": "Tomasz Lee",
  "role_name": "Senior FullStack Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Results-driven Senior Full Stack Engineer with 9+ years of experience in developing and implementing high-performance applications using **JavaScript**, **TypeScript**, **Node.js**, and **React**. Proficient in leveraging **Agile** methodologies to facilitate efficient development cycles and deliver solutions on time. Strong background in **Data Visualization** and creating **Dashboards** to provide actionable insights. Expertise in integrating **Machine Learning** and **AI** capabilities into applications, as well as a solid understanding of **IoT** technologies. Recognized for exceptional collaboration skills and ability to lead development teams to achieve project goals while working effectively in **Remote Work** settings. Previous experience with **Apache Kafka**, **RabbitMQ**, and **Redis** enhances capability to work with complex systems.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Senior FullStack Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "• Leveraged **JavaScript**, **TypeScript**, and **React** to enhance web application functionality, leading to a **25%** increase in user satisfaction.\n• Developed dynamic web applications with **Node.js**, employing a modular approach to accommodate future scaling.\n• Spearheaded the creation of interactive dashboards and data visualizations using **D3.js** and **Three.js**, facilitating insightful user engagement.\n• Collaborated in an **Agile** environment, enhancing project delivery efficiency by implementing iterative development cycles.\n• Integrated real-time data capabilities leveraging **Machine Learning** techniques to elevate the application’s performance and user interactivity.\n• Employed best practices in remote work collaboration to maintain team productivity and project timelines.\n• Designed intuitive user interfaces, focusing on user experience and functionality to align with the latest industry standards.\n• Conducted rigorous testing and code reviews to ensure high-quality deliverables and maintain system integrity.\n• Maintained comprehensive documentation for all projects and processes, contributing to team knowledge sharing and onboarding efforts."
    },
    {
      "role": "Full Stack Developer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "Utilized **JavaScript**, **TypeScript**, and **Node.js** to design and develop a cloud-based project management tool with **Angular** and **.NET Core**, resulting in a **15%** increase in team collaboration efficiency.\nImplemented a microservices architecture utilizing **RabbitMQ** for task orchestration and **Apache Kafka** for event-driven data handling, enhancing system scalability by supporting **up to 1000** concurrent users.\nIntegrated **Redis** as a caching layer to decrease latency in API calls, achieving a **25%** improvement in system performance.\nDeveloped RESTful APIs with **.NET Core** and integrated them with a **PostgreSQL** database to enable real-time data access.\nConstructed and maintained **React** and **Tailwind CSS** components, contributing to a **25%** rise in user engagement on the platform.\nLed the implementation of CI/CD pipelines utilizing **GitHub Actions**, which decreased production deployment errors by **30%**.\nManaged data storage and retrieval through **MSSQL** and **MySQL** databases, optimizing queries resulting in performance improvements of **up to 40%**.\nCollaborated closely with stakeholders to define system requirements and establish development timelines, ensuring on-time delivery in an **Agile** environment.\nDesigned custom dashboards and visual data representations using **D3.js** for interactive project status tracking and informative reporting.\nConducted thorough code reviews and provided mentorship sessions for junior developers, significantly enhancing team productivity."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "• Developed robust applications with **JavaScript**, **TypeScript**, and **Node.js** to enhance user interactivity and experience, leading to a **15%** increase in user engagement.\n• Integrated **React** for building dynamic front-end components, reducing rendering time by **30%**.\n• Implemented data visualization techniques to create intuitive **dashboards**, significantly improving data accessibility for stakeholders.\n• Utilized Agile methodologies to manage projects, ensuring timely delivery of features through iterative development and constant feedback.\n• Contributed to machine learning models to leverage AI for analytical insights, boosting prediction accuracy by **25%**.\n• Created innovative IoT solutions that improved product connectivity, enhancing user experience across devices.\n• Collaborated with cross-functional teams in a remote work environment, ensuring clear communication and project alignment.\n• Participated in daily standups and code reviews to maintain high-quality coding standards and foster team collaboration.\n• Delivered comprehensive technical documentation and user guides, facilitating smoother onboarding processes and knowledge transfer among team members.\n• Actively contributed to the overall architecture of solutions, focusing on maintainability and scalability."
    }
  ],
  "skills": " **Programming Languages** \n\tJavaScript, TypeScript, Python\n\n **Backend Frameworks** \n\tNodeJS, ExpressJS, NestJS, C#, .NET, Entity Framework, Microservices\n\n **Frontend Frameworks** \n\tReact, ReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n **API Technologies** \n\tRESTful API, GraphQL\n\n **Serverless and Cloud Functions** \n\t\n\n **Databases** \n\tMSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB\n\n **DevOps** \n\tAWS, Azure, CI/CD pipelines\n\n **Cloud & Infrastructure** \n\t\n\n **Other** \n\tUX/UI Design, Git, GitHub, NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest, Blockchain: Solidity, Ether.js, Web3.js, Ethereum, Machine Learning, AI, Agile, IoT, Data Visualization, Dashboards, Remote Work",
  "apply_company": "Client Server"
}