{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Security Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-623a26390/",
  "profile_summary": "Security Engineer with 13+ years of experience delivering high-performance applications, particularly within the healthcare and financial industries. Proficient in **AWS** for cloud-native system deployment and adept in scripting languages including **JavaScript**, **TypeScript**, and **Python**. Skilled in implementing security measures including Static Application Security Testing (**SAST**), Software Composition Analysis (**SCA**), and aligning with compliance standards like **ISO 27001** and **ISO 27002**. Demonstrated ability to assess third-party applications effectively while communicating fluently in English. Strong foundational background in full stack development with hands-on expertise in frameworks like **React**, **Next.js**, **Vue**, and backend technologies including **Node.js**, **FastAPI**, and **Django**. Experienced in deploying AI/ML-powered platforms, integrating predictive analytics, automation, and real-time processing methodologies.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Security Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Leveraged **Python** and **JavaScript** to design and build secure, full-stack platforms in compliance with **ISO 27001** and **ISO 27002** standards, enhancing system security for critical data environments across both healthcare and fintech sectors.\nImplemented robust data security measures, including static application security testing (**SAST**) and software composition analysis (**SCA**), maintaining high-quality code and mitigating vulnerabilities in development processes.\nCollaborated with cross-functional teams to ensure adherence to **Third Party Assessment Processes**, promoting a culture of security awareness and risk management across the organization.\nUtilized **AWS** services for scalable deployment architectures, enabling cost-effective security solutions tailored to specific project needs, effectively managing user access and securing sensitive information.\nDeveloped automated security testing strategies integrated into CI/CD workflows, employing tools such as **Bash** scripts for orchestration, and monitoring security compliance at every lifecycle stage.\nProvided technical guidance in configuring security protocols, actively participating in audits and compliance reviews to ensure continual adherence to industry standards and best practices.\nProduced detailed security documentation and reports, enhancing communication and understanding of security requirements for non-technical stakeholders, thereby fostering a secure development lifecycle.\nEngaged in continuous learning and technical skill enhancement, staying updated on the latest security threats and trends in software engineering to uphold a proactive security posture across all projects."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Implemented and managed security protocols in cloud environments, leveraging **AWS** services to ensure compliance with **ISO 27001** and **ISO 27002** standards, enhancing overall data protection and risk management.\nUtilized **JavaScript**, **TypeScript**, and **Python** to conduct static application security testing (SAST) and software composition analysis (SCA) within development pipelines, ensuring code accuracy and vulnerability assessments.\nConducted thorough third-party assessment processes to evaluate the security frameworks of partners and vendors, aligning with compliance initiatives and risk mitigation strategies.\nDeveloped robust scripts in **Bash** for automating security tasks and improving operational efficiencies across security protocols, resulting in a **30%** reduction in manual overhead.\nCollaborated with cross-functional teams to implement security measures for high-volume transaction systems, validating security controls and minimizing vulnerabilities.\nDesigned and executed security training and awareness programs in **English**, fostering a culture of security-first mentality among developers and stakeholders, leading to a **40%** decrease in security incidents reported.\nAdopted tools and best practices from the latest security trends, actively contributing to the modernization of security frameworks and policies within the organization."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Implemented security best practices across the development lifecycle, aligning with **ISO 27001** and **ISO 27002** standards to establish robust security protocols for e-commerce platforms.\nConducted regular Static Application Security Testing (SAST) and Software Composition Analysis (SCA) using tools to identify vulnerabilities in code written in **JavaScript**, **TypeScript**, and **Python** and enforce security measures.\nDeveloped and maintained security policies in relation to **AWS** infrastructure, ensuring compliance with third-party assessment processes and safeguarding sensitive data.\nCollaborated with development teams to integrate secure coding practices and tools, enhancing application security from the ground up in projects involving **FastAPI**, **Django**, **NestJS**, and **Express** frameworks.\nDesigned automated security scans and vulnerability assessments for critical components of the platform's architecture, leveraging **Bash** scripts and compliance checking tools to maintain a secure environment.\nCommunicated effectively in **English** with cross-functional teams to raise security awareness and establish a culture of security within the organization.\nEngaged in risk management practices by assessing the impact of security threats and providing swift remediation strategies to maintain high availability and integrity of services.\nMaintained up-to-date knowledge of security trends, emerging threats, and compliance requirements to ensure the ongoing enhancement of the platform's security posture."
    }
  ],
  "skills": " **Programming Languages:** \n\t•\tPython\n\t•\tJavaScript\n\t•\tTypeScript\n\t•\tBash\n\n **Backend Frameworks:** \n\t•\tFastAPI\n\t•\tFlask\n\t•\tDjango\n\n **Frontend Frameworks:** \n\t•\tReact\n\t•\tVue\n\t•\tAngular\n\n **API Technologies:** \n\t•\tOAuth2\n\t•\tJWT\n\n **Serverless and Cloud Functions:** \n\t•\tAWS: Lambda\n\n **Databases:** \n\t•\tPostgreSQL\n\t•\tMySQL\n\t•\tMongoDB\n\t•\tRedis\n\n **DevOps:** \n\t•\tDocker\n\t•\tKubernetes\n\t•\tGitHub Actions\n\t•\tGitLab CI/CD\n\n **Cloud & Infrastructure:** \n\t•\tAWS: ECS, RDS, S3\n\t•\tAzure: App Services, Blob Storage, SQL Database\n\t•\tTerraform\n\t•\tAnsible\n\t•\tHelm\n\t•\tDocker Compose\n\n **Other:** \n\t•\tMLflow\n\t•\tAirflow\n\t•\tKubeflow\n\t•\tKeycloak (OIDC, RBAC)\n\t•\tNginx\n\t•\tLet’s Encrypt\n\t•\tCertbot\n\t•\tSAST\n\t•\tSCA\n\t•\tISO 27001\n\t•\tISO 27002\n\t•\tThird Party Assessment Processes\n\t•\tEnglish"
}