{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Analytics Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Results-oriented Senior Analytics Engineer with 13+ years of experience in delivering impactful data solutions across the healthcare and financial sectors. Proficient in **SQL**, **dbt**, **Airflow**, and cloud platforms including **Azure**. Experienced in data visualization tools such as **Looker** and **PowerBI**, enabling effective KPI reporting and insightful analytics. Skilled in **workflow automation** using tools like **Talend**, **n8n**, and **Make** while leveraging strong programming expertise in **Python** and **R**. Recognized for exceptional communication skills and stakeholder management, ensuring alignment of analytics strategies with business objectives.\nAdditionally, a full-stack development background with expertise in **JavaScript/TypeScript**, **Flutter**, and comprehensive technologies including **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**. Proven track record in developing AI/ML-powered platforms and deploying cloud-native systems on **AWS** and **Azure**, utilizing microservices and event-driven architectures to enhance operational efficiency.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Analytics Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Utilized **SQL** and **dbt** for data transformation and preparation, optimizing ETL processes to ensure high-quality data sets for analytics.\nDesigned and maintained robust data pipelines using **Airflow** to automate workflows, achieving a **30%** increase in data processing efficiency.\nLeveraged **Azure**, **Snowflake**, and **BigQuery** to build scalable data solutions, integrating diverse data sources to support analytics and business intelligence initiatives.\nDeveloped insightful dashboards and reports in **PowerBI** and **Looker**, delivering actionable insights on **KPI** performance and trends, enabling stakeholders to make informed decisions.\nCreated advanced **data visualization** tools and techniques, enhancing the representation of operational metrics and performance indicators by **25%** for improved stakeholder communication.\nImplemented **workflow automation** using **Talend**, **n8n**, and **Make**, drastically reducing manual data handling efforts and increasing overall team productivity by **40%**.\nCollaborated with cross-functional teams to gather requirements, ensuring alignment with stakeholder needs leveraging strong **communication** and **stakeholder management** skills.\nAnalyzed large datasets using **Python** and **R** to identify key insights and drive strategic initiatives, leading to a **15%** improvement in project outcomes.\nParticipated in regular meetings with stakeholders to present findings and recommendations, fostering a data-driven culture within the organization."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Leveraged **SQL** and **dbt** to optimize database queries and improve data transformation workflows, enhancing reporting efficiency by **30%**.\nImplemented **Airflow** for orchestrating complex data workflows, enabling automated data pipelines that process over **1 million** records daily.\nUtilized **Azure** and **Snowflake** to ensure scalable data storage and analytics solutions, reducing query times by **25%** for critical reporting metrics.\nDeveloped interactive data visualizations and dashboards using **Looker** and **PowerBI**, enabling stakeholders to derive insights from data and track **KPI** metrics effectively.\nAutomated workflows with tools like **Talend**, **n8n**, and **Make** to streamline data integration processes, increasing operational efficiency by **40%**.\nApplied advanced **Python** and **R** techniques to perform data analyses, empowering business decisions by delivering actionable insights.\nEngaged in effective **communication** and **stakeholder management**, ensuring alignment between technical solutions and business objectives through regular updates and strategy sessions.\n"
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Utilized **SQL** and **BigQuery** for data extraction and analysis, contributing to data-driven decision-making processes that improved overall business KPIs by **25%**.\nAutomated data workflows with **Airflow**, resulting in optimized data pipeline efficiency and reducing processing time by **30%**.\nDeveloped and maintained data models in **Snowflake**, enhancing reporting capabilities and data visualization accuracy within **Looker** and **PowerBI**.\nImplemented **dbt** for data transformation, ensuring high-quality analytics and streamlined reporting across the organization.\nEngineered KPI dashboards that provided real-time insights and facilitated strategic discussions with stakeholders, improving communication and project alignment.\nCollaborated with cross-functional teams to identify workflow automation opportunities with tools like **n8n** and **Make**, reducing manual processes by **40%**.\nLeveraged **Azure** cloud services to enhance data storage solutions, ensuring seamless integration and accessibility for analytics applications.\nApplied **Python** and **R** for advanced statistical analyses and predictive modeling, driving actionable insights and enhancing business performance.\nStrengthened stakeholder management skills through effective communication of data findings, fostering stronger collaboration between technical and non-technical teams."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, R, JavaScript/TypeScript\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django, Airflow\n\n **Frontend Frameworks:**\n\tReact, Vue, Angular\n\n **API Technologies:**\n\tKeycloak (OIDC, RBAC), OAuth2, JWT\n\n **Serverless and Cloud Functions:**\n\tAWS: Lambda\n\n **Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis, SQL, Snowflake, BigQuery\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:**\n\tAWS: ECS, RDS, S3, Azure: App Services, Blob Storage, SQL Database\n\n **Other:**\n\tMLflow, Kubeflow, dbt, Looker, PowerBI, KPI, data visualization, workflow automation, Talend, n8n, Make, communication, stakeholder management",
  "apply_company": "Contabo"
}