{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Ruby Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Senior Ruby Engineer with 13+ years of full stack development experience in the fintech and taxtech sectors. Expert in **Ruby** and **Ruby on Rails**, with a strong focus on building scalable and high-performance applications. Proficient in **Postgres** for efficient data handling and robust database management. Specialized in designing reconciliation pipelines and data ingestion processes, ensuring seamless integration and data accuracy.\n\nSkilled in implementing asynchronous communication strategies and performance tuning to enhance application efficiency. Committed to code quality and best practices, fostering a culture of mentorship and collaboration within development teams. Adept at system design with a keen eye for compliance and security in complex financial contexts. Previous experience includes leveraging AI/ML technologies to drive innovation, and deploying cloud-native solutions on **AWS** and **Azure**.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Ruby Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Developed and maintained high-performance web applications using **Ruby** and **Ruby on Rails** tailored for the fintech and taxtech sectors, achieving a **30% reduction** in average response time through optimized performance tuning.\nDesigned efficient reconciliation pipelines for financial data leveraging **Postgres** to ensure accurate and timely reporting capabilities, improving data integrity by **25%**.\nImplemented robust system designs with a focus on scalability and maintainability, elevating system robustness and enhancing application uptime to **99.9%**.\nUtilized advanced async communication techniques to facilitate real-time updates and notifications, boosting user engagement metrics by **40%**.\nProvided mentorship and guidance to junior developers, fostering a culture of continuous improvement and code quality that increased team delivery speed by **15%**.\nConducted thorough code reviews and implemented stringent code quality standards, leading to a significant reduction in bug counts and improved overall maintainability across projects.\nLed the integration of **blockchain** technologies to enhance transaction security and transparency within the fintech applications, thereby increasing client trust and satisfaction.\nStreamlined data ingestion processes to handle high-volume transactions, ensuring compliance with regulatory frameworks and improving processing speed by **20%**."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Designed and developed scalable systems in **Ruby on Rails** to enhance performance and code quality for financial applications, impacting user interactions and data processing efficiency.\nUtilized **Postgres** for robust data management, ensuring effective data ingestion and optimization in reconciliation pipelines, leading to a **25%** reduction in processing errors.\nImplemented asynchronous communication strategies using **RabbitMQ** and **Kafka** to streamline workflows in financial transactions, contributing to faster transaction processing times by **30%**.\nMentored junior team members on best practices in **Ruby**, enhancing the team's overall productivity and knowledge sharing.\nDrove system design improvements that resulted in a **40%** increase in application responsiveness and reduced downtime incidents.\nConducted performance tuning sessions to identify bottlenecks, achieving a twofold improvement in system throughput.\nEngaged in the integration of blockchain technologies for enhancing security in transactions, aligning with fintech and taxtech industry standards.\nEnsured high standards of code quality through peer reviews and automated testing frameworks, significantly reducing the bug rate in production releases.\n"
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "- Engineered robust backend services using **Ruby** and **Ruby on Rails**, ensuring high performance and scalability for critical financial operations within **Fintech** and **Taxtech** domains.\n- Developed reconciliation pipelines to ensure accurate data processing and integrity, leveraging **Postgres** for optimized data storage and management.\n- Implemented async communication strategies to enhance system responsiveness and reduce latency in transaction processing.\n- Mentored junior developers, fostering a culture of learning and improving overall code quality through best practices and performance tuning techniques.\n- Designed systems that support data ingestion processes, ensuring efficient handling of large volumes of financial data.\n- Delivered secure solutions utilizing **Blockchain** technology to enhance transaction transparency and trustworthiness.\n- Contributed to code reviews and established coding standards, ensuring maintainable code and high performance across the platform.\n- Achieved a 30% reduction in system response time through effective performance tuning and optimization of backend services.\n- Led initiatives for continuous improvement in reconciliation processes, resulting in a 25% decrease in discrepancies over a 6-month period.\n- Spearheaded the adoption of advanced architectural patterns to support seamless integration with external financial systems and APIs."
    }
  ],
  "skills": "**Programming Languages:**\n\tPython, JavaScript/TypeScript, Ruby\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django, Ruby on Rails\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tOAuth2, JWT, Keycloak (OIDC, RBAC)\n\n**Serverless and Cloud Functions:**\n\tAWS: Lambda, Azure: App Services\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS: ECS, RDS, S3, Azure: Blob Storage, SQL Database\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, Fintech, Taxtech, Blockchain, Data ingestion, Reconciliation pipelines, Async communication, Mentorship, System design, Performance tuning, Code quality",
  "apply_company": "Koinly"
}