{
  "name": "Rei Taro",
  "role_name": "Senior Frontend Engineer",
  "email": "rei515@outlook.com",
  "phone": "+48732529451",
  "address": "Warszawa, Poland",
  "linkedin": "https://www.linkedin.com/in/rei-taro-81a410391/",
  "profile_summary": "Skilled Senior Frontend Engineer with over 10 years of experience in developing high-performing web applications, specializing in **Typescript**, **nuxt.js**, **vue.js**, and **react native**. Strong acumen in **Mobile-First** design, **Browser Optimization**, and **Performance Optimization**, ensuring top-notch usability and adherence to web standards. Known for effective teamwork and communication, fostering a collaborative environment to drive successful project outcomes. Proficient in applying quality awareness to deliver exceptional products, while leveraging a solid foundation in backend systems to enhance full-stack capabilities.",
  "education": [
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2010",
      "to_year": "2015",
      "location": "Japan",
      "university": "Keio University"
    }
  ],
  "experience": [
    {
      "role": "Senior Frontend Engineer",
      "company": "Leobit",
      "from_date": "Aug 2022",
      "to_date": "Present",
      "location": "Poland",
      "responsibilities": "Utilized **Typescript** and **nuxt.js** to develop responsive web applications, enhancing user experience and meeting modern web standards.\nImplemented performance optimization techniques to improve load times by **40%** across multiple platforms.\nEmployed **vue.js** and **react native** to create high-quality mobile-first applications with intuitive usability, engaging a user base of over **10,000** active users.\nCollaborated with design and backend teams, ensuring seamless integration of APIs while adhering to web standards and project timelines.\nDemonstrated strong teamwork and communication skills, leading to a **30%** improvement in project delivery timelines through effective collaboration.\nMaintained a strong commitment to quality awareness, conducting thorough testing and debugging of applications, resulting in a **20%** decrease in production issues."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Innovature",
      "from_date": "Nov 2018",
      "to_date": "Jun 2022",
      "location": "Japan",
      "responsibilities": "Utilized **Typescript** and **nuxt.js** to develop responsive, user-friendly interfaces, enhancing usability and performance across platforms.\nImplemented **react native** to create cross-platform mobile applications, focusing on optimizing browser performance to achieve a **30%** increase in load times.\nApplied **Mobile-First** strategies and **Web Standards** to ensure seamless experiences on both desktop and mobile devices.\nCollaborated with cross-functional teams to maintain high-quality code and ensure adherence to **performance optimization** best practices, improving application speed by **25%**.\nFostered a culture of communication and teamwork, consistently enhancing project outcomes by engaging with stakeholders and resolving issues promptly to ensure project delivery within **2 weeks**.\nConducted thorough usability testing and quality assurance processes to uphold the highest standards in application deployment and functionality."
    },
    {
      "role": "Software Developer",
      "company": "Wizcorp",
      "from_date": "Apr 2015",
      "to_date": "Nov 2018",
      "location": "Japan",
      "responsibilities": "Engineered responsive web interfaces using **Typescript**, **Vue.js**, and **React Native**, focusing on performance optimization and usability for enhanced user experiences.\nCollaborated with cross-functional teams to create intuitive designs, applying **Mobile-First** principles and maintaining adherence to web standards.\nImplemented browser optimization techniques to ensure high-quality load times, achieving a performance improvement of **30%** across key pages.\nLed quality assurance initiatives, introducing automated testing frameworks that reduced bugs by **25%** during the development cycle.\nFostered teamwork and communication among team members to encourage a culture of curiosity and continuous learning, effectively resolving challenges during project lifecycles.\nStreamlined project workflows by prioritizing quality awareness and usability testing, contributing to an overall **20%** increase in user satisfaction ratings."
    }
  ],
  "skills": " **Programming Languages**\n\t Python (3.8+), SQL, Bash, JavaScript, Typescript\n\n**Frontend Frameworks**\n\t nuxt.js, vue.js, react native\n\n**Backend Frameworks**\n\t FastAPI, Flask, Django, Celery\n\n**API Technologies**\n\t REST/gRPC APIs, Microservices\n\n**Serverless and Cloud Functions**\n\t AWS (EC2, S3, Lambda), Azure\n\n**Databases**\n\t PostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps**\n\t Docker, Kubernetes, GitHub Actions, Azure DevOps, CI/CD, PyTest\n\n**Cloud & Infrastructure**\n\t AWS (EC2, S3, Lambda), Azure\n\n**Other**\n\t AI/ML Tools: Pandas, NumPy, scikit-learn, TensorFlow, Airflow, MLflow, Mobile-First, Browser Optimization, Performance Optimization, Usability, Web Standards, Teamwork, Communication, Curiosity, Quality Awareness",
  "apply_company": "Unspecified"
}