{
  "name": "Tomasz Lee",
  "role_name": "Senior Backend Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Dynamic Senior Backend Engineer with 9+ years of extensive experience in designing and implementing backend solutions using **Node.js**, **TypeScript**, **REST**, and **GraphQL**. Proficient in database management with **SQL** and **NoSQL** technologies, alongside adeptness in cloud services such as **AWS**. Strong background in developing distributed systems and microservices architectures, armed with knowledge in containerization using **Docker** and orchestration with **Kubernetes**. Proven record in delivering scalable and robust solutions, enhancing development efficiencies, and optimizing application performance. Equipped with excellent collaboration and project leadership skills to drive cross-functional team success.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Senior Backend Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Utilized **Node.js** and **TypeScript** to develop robust backend services, enhancing application performance by **30%**.\nDesigned and implemented **REST** and **GraphQL** APIs to provide flexible and efficient data access, leading to a **20%** reduction in client-side data fetching times.\nOptimized SQL and **NoSQL** database architectures, ensuring data integrity and improving access speeds by **25%**.\nDeployed containerized applications using **Docker** and orchestrated with **Kubernetes**, improving deployment efficiency and scaling capabilities.\nImplemented security best practices, including JWT-based authentication and data validation, improving system security by **15%**.\nCollaborated cross-functionally to design high-performance features and enhance overall user experience.\nIntegrated AWS services to leverage cloud capabilities, optimizing resource usage and reducing operational costs by **10%**.\nSpearheaded the transition from monolithic architecture to microservices, increasing system maintainability and scalability.\nConducted code reviews and enforced coding standards leading to improved code quality and team productivity by **20%**.\n"
    },
    {
      "role": "Software Engineer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "Developed scalable APIs using **Node.js** and **TypeScript** to enhance application performance, resulting in a 20% decrease in response time.\nImplemented **REST** and **GraphQL** interfaces to provide flexible data retrieval options for clients, improving developer usability by 35%.\nDesigned effective data storage solutions using both **SQL** and **NoSQL** databases, achieving a 40% increase in data query efficiency.\nCreated and managed containerized applications with **Docker** and **Kubernetes**, streamlining the deployment process and reducing downtime to less than **5 hours** during migrations.\nUtilized **AWS** services for cloud hosting and deployment, enhancing system reliability and scalable growth for a user base of over **10,000** concurrent users.\nEstablished new CI/CD pipelines, leveraging automated deployments to reduce lead time for production releases by **25%**.\nConducted performance tuning and optimization of existing applications, yielding a **30% improvement** in system throughput.\nMentored junior developers in best practices for backend development, fostering a collaborative team environment that boosted overall productivity.\nCollaborated with cross-functional teams to ensure alignment on system requirements and technical specifications, achieving project milestones on time.\nCreated comprehensive documentation for backend processes, aiding future maintenance and onboarding processes for new developers."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "• Developed and maintained backend services using **Node.js** and **TypeScript** to enhance system functionality and performance, leading to a 30% increase in response times.\n• Designed and implemented **REST** and **GraphQL** APIs, facilitating seamless data retrieval and manipulation for frontend applications, improving client satisfaction metrics by 15%.\n• Utilized **SQL** and **NoSQL** databases for efficient data storage and querying, achieving a **25%** reduction in data retrieval times.\n• Deployed applications using **Docker** and managed orchestration with **Kubernetes**, enhancing system scalability and reliability.\n• Integrated **AWS** cloud services for data storage and compute needs, reducing operational costs by **20%**.\n• Collaborated with cross-functional teams for the smooth migration of services to cloud infrastructure, ensuring a fault-tolerant architecture.\n• Conducted code reviews and participated in agile ceremonies, promoting best practices and adherence to coding standards across the team.\n• Produced comprehensive technical documentation and process overviews to improve onboarding and knowledge sharing, decreasing training time by **40%**."
    }
  ],
  "skills": " **Programming Languages**\n\t TypeScript, Node.js, Python\n\n**Backend Frameworks**\n\t NodeJS, ExpressJS, NestJS, C#, .NET, Entity Framework, Microservices\n\n**Frontend Frameworks**\n\t HTML, CSS, JavaScript, ReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n**API Technologies**\n\t REST, GraphQL\n\n**Serverless and Cloud Functions**\n\t AWS\n\n**Databases**\n\t MSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB, SQL, NoSQL\n\n**DevOps**\n\t Docker, Kubernetes, CI/CD pipelines\n\n**Cloud & Infrastructure**\n\t AWS, Azure\n\n**Other**\n\t UX/UI Design, Git, GitHub, Redux, Messaging & Caching: Apache Kafka, RabbitMQ, Redis, Testing Tools: NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest, Blockchain: Solidity, Ether.js, Web3.js, Ethereum",
  "apply_company": "TechTree"
}