{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior/Staff Frontend Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-karol-kotlinski-bb2520397/",
  "profile_summary": "As a Senior/Staff Frontend Engineer with 8 years of experience, I excel in creating responsive, user-friendly interfaces using **React**, **Next.js**, **JavaScript**, and **TypeScript**. I am well-versed in API development and integration, ensuring seamless communication between front-end and back-end systems. My work emphasizes accessibility and usability principles, supporting product thinking and attention to design details.\nIn addition to my frontend expertise, I possess a rich technical background with frameworks like **Vue**, and am experienced in full-stack development utilizing **Node.js** alongside cloud services such as **AWS** and **Azure**. My commitment to strong problem-solving skills, curiosity, and autonomy drives me to deliver high-performance solutions. I have also led initiatives that incorporate AI/ML for innovative analytics while ensuring compliance with standards like HIPAA and PCI DSS.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior/Staff Frontend Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Developed responsive user interfaces leveraging **React** (version **17-18**) and **Next.js**, ensuring adherence to usability principles and accessibility standards.\nUtilized **JavaScript** and **TypeScript** for crafting high-quality web applications, optimizing performance and user experience through robust product thinking and attention to design details.\nIntegrated RESTful **APIs** to enhance application functionality and facilitate seamless data exchanges, while prioritizing efficient HTTP requests.\nConducted comprehensive testing strategies using **Postman**, ensuring high-quality deliverables and adherence to both unit and integration testing protocols.\nImplemented user-centric design principles by collaborating with cross-functional teams, enhancing usability and overall interaction in the application.\nShowcased problem-solving skills by addressing complex frontend challenges, maintaining a curious mindset towards emerging technologies and methodologies.\nFostered an autonomous work environment, empowering team members to innovate and contribute to product enhancements.\nUpdated existing platforms with state-of-the-art features, iterating continuously based on user feedback and analytic data.\nMaintained high standards in code quality and style consistency, mentoring junior engineers on best practices and design patterns."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Designed and developed dynamic, user-focused front-end applications using **React (18)**, **Next.js**, and **TypeScript**, ensuring adherence to usability principles and accessibility standards for responsive UIs.\nCollaborated with cross-functional teams to create intuitive and performant user interfaces that enhance product thinking and align with user needs, demonstrating strong attention to design details.\nImplemented APIs and integrated third-party services, utilizing **Postman** for effective testing and documentation, improving communication between front-end and back-end systems.\nApplied problem-solving skills to tackle complex user interface challenges, leveraging curiosity and autonomy to explore innovative solutions.\nParticipated in regular code reviews and design discussions to maintain high-quality standards, ensuring all development efforts align with best practices and organizational goals.\nMaintained and refactored existing codebases to improve performance and scalability, ultimately reducing load times by **30%**.\nMentored junior engineers, providing guidance on **JavaScript** concepts and front-end development techniques to foster a culture of learning and knowledge sharing."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "- Developed and optimized responsive UIs using **React (18)** and **Next.js**, ensuring adherence to usability principles and accessibility compliance (WCAG **2.1**) to enhance user experiences across web and mobile platforms.\n- Leveraged **TypeScript** and **Tailwind CSS** to create modular and maintainable code, enhancing team collaboration while emphasizing attention to design details and product thinking.\n- Designed and implemented RESTful APIs, utilizing **Postman** for testing and documentation, ensuring smooth integration between frontend applications and backend services.\n- Applied problem-solving skills to address complex user interface challenges, demonstrating curiosity and autonomy in exploring new solutions and technologies.\n- Engaged in regular code reviews and team discussions to enhance project outcomes through collaboration and knowledge sharing.\n- Contributed to fast, responsive designs that meet the needs of diverse user demographics, consistently implementing feedback to improve usability metrics and overall satisfaction.\n- Employed HTTP best practices to ensure optimized data exchange, reducing load times and enhancing application performance.\n- Executed feature updates based on prioritization of user feedback and product requirements, contributing to the continuous improvement and iteration of the e-commerce platform."
    }
  ],
  "skills": "**Frontend Frameworks**:\n\tReact, Next.js, JavaScript, TypeScript\n\n**API Technologies**:\n\tAPIs, HTTP, Postman\n\n**Programming Languages**:\n\tPython (FastAPI, Flask, Django)\n\n**Backend Frameworks**:\n\tNone\n\n**Serverless and Cloud Functions**:\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Databases**:\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**DevOps**:\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD\n\n**Cloud & Infrastructure**:\n\tTerraform, Ansible, Helm, Docker Compose\n\n**Other**:\n\tArtificial Intelligence & Machine Learning: MLflow, Airflow, Kubeflow, Authentication & Security: Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, responsive UI, accessibility, usability principles, product thinking, attention to design details, problem-solving, curiosity, autonomy"
}