{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Amazon Connect Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-kotlinski-08ba40390/",
  "profile_summary": "As a dedicated Amazon Connect Engineer with 8 years of experience, I excel in leveraging **AWS Services**, specifically **Amazon Connect**, **DynamoDB**, **Lambda**, **CloudFormation**, **Terraform**, **Step Functions**, **S3**, **Kinesis**, and **API Gateway** to design and implement high-performance solutions. Proficient in **CI/CD** practices and Infrastructure as Code (IaC), I ensure operational excellence and seamless deployment of applications. My technical expertise in **Python** and **JavaScript** complements my robust problem-solving capabilities, enabling me to troubleshoot issues efficiently and deliver reliable systems aligned with best practices.\n\nBeyond my technical acumen, I possess strong skills in **collaboration**, **communication**, and **stakeholder management**, ensuring that all project needs are met and objectives are achieved. My flexibility and influencing skills allow me to adapt to various project dynamics, driving successful outcomes in complex environments while prioritizing operational management. I have experience leading diverse teams in the development of compliance-focused platforms, ensuring alignment with industry standards.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Amazon Connect Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Utilized **AWS Services** such as **Lambda**, **DynamoDB**, **S3**, and **CloudFormation** to build highly scalable and efficient cloud-based solutions for customer engagement via **Amazon Connect**.\nImplemented **Infrastructure as Code** strategies using **Terraform** and **CloudFormation** to automate deployment processes, improving efficiency by **30%** while ensuring compliance and security across all AWS environments.\nDesigned and maintained CI/CD pipelines leveraging AWS tools and services for continuous integration and deployment, enhancing release cycle speed by **25%** with rigorous automation testing protocols.\nDeveloped microservices tailored for **Amazon Connect** functionalities, facilitating rapid deployment of new features and enhancements to existing systems with an overall uptime improvement to **99.9%**.\nManaged operational workflows and systems integration with **AWS EventBridge** and **API Gateway**, ensuring seamless data flow and responsiveness within the customer engagement lifecycle.\nCollaborated with stakeholders to define project requirements and establish product priorities, employing strong **communication** and **collaboration** skills to ensure alignment on business objectives.\nExecuted effective **flexibility** in operations management by adapting to changing project needs while maintaining high performance levels across multiple teams.\nConducted regular technical problem-solving sessions to address system bottlenecks, leading to a **15%** reduction in customer service response times and improved user satisfaction.\nPresented findings and solutions to key stakeholders, leveraging **influencing skills** to gain buy-in for critical project initiatives and technological advancements within the organization.\nEmployed **monitoring** tools such as **CloudWatch** and **CloudTrail** to ensure full operational visibility, promoting proactive maintenance and a reduction in incident response times by **20%**."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Leveraged **AWS Services** including **Amazon Connect**, **DynamoDB**, **Lambda**, **StepFunction**, and **S3** to design and implement scalable cloud solutions that enhanced operational efficiency in financial systems.\nApplied **Infrastructure as Code** principles using **CloudFormation** and **Terraform** to automate provisioning and management of cloud infrastructure, reducing deployment time by **50%**.\nUtilized **Kinesis** and **EventBridge** to facilitate real-time data streaming and processing, improving transaction handling speed and reliability by **30%**.\nEmployed strong **Technical Problem-Solving** skills to troubleshoot and resolve complex issues in cloud-based applications, ensuring 99.9% uptime of critical financial services.\nCollaborated with cross-functional teams to gather requirements and design robust solutions, enhancing communication and **Stakeholder Management** for project success across departments.\nImplemented CI/CD pipelines for continuous integration and deployment, leading to a **40%** increase in development speed and a notable reduction in deployment errors.\nDemonstrated **Flexibility** in adapting to evolving project requirements while maintaining high-quality standards in deliverables, facilitating seamless updates and features roll-out.\nDrove adoption of **API Gateway** for efficient and secure interactions between microservices and third-party APIs, ensuring smooth data flow and integration across the platform.\nMaintained comprehensive documentation and utilized **AWS CloudWatch** and **CloudTrail** for monitoring and auditing, thus improving operational transparency and compliance.\nEngaged effectively with stakeholders to influence technology adoption and strategy, aligning cloud solutions with business goals and user needs."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Leveraged **AWS services** to design and implement scalable e-commerce solutions using **Python** and **JavaScript**, ensuring high availability and operational efficiency.\nManaged infrastructure as code through **Terraform** and **CloudFormation**, streamlining resource deployment and service management for continuous integration and delivery (**CI/CD**) processes.\nIntegrated **Amazon Connect** with backend systems to enhance customer support capabilities, utilizing features like dynamic call routing and real-time analytics to boost operational performance.\nDeveloped serverless applications using **AWS Lambda** and **API Gateway**, allowing for efficient handling of requests with reduced overhead and costs, achieving an estimated **30%** improvement in response times.\nUtilized **DynamoDB** for high-throughput data storage, ensuring low-latency access to user data and improving transaction speeds across **9** million user interactions monthly.\nImplemented monitoring and logging through **CloudWatch** and **CloudTrail**, ensuring compliance and operational transparency while facilitating proactive issue resolution.\nDesigned resilient event-driven architectures using **Kinesis** and **EventBridge**, enabling real-time data processing and application responsiveness.\nCommunicated effectively with stakeholders to gather requirements and deliver tailored e-commerce solutions, enhancing customer experience based on feedback and insights.\nExercised technical problem-solving skills to address challenges in cloud infrastructure, resulting in a **25%** reduction in downtime during peak traffic scenarios.\nFacilitated collaboration across teams to ensure seamless integration of new technologies while providing flexibility and adaptability in project management processes."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, JavaScript, TypeScript\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n **Frontend Frameworks:**\n\tReact, Vue, Angular\n\n **API Technologies:**\n\tAPI Gateway, Amazon Connect, Amazon Lex\n\n **Serverless and Cloud Functions:**\n\tAWS Lambda, StepFunction\n\n **Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis, DynamoDB\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:**\n\tAWS (ECS, RDS, S3, Kinesis, CloudWatch, CloudTrail, CloudFront, EventBridge), Azure (App Services, Blob, SQL)\n\n **Other:**\n\tMLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, CI/CD, Technical Problem-Solving, Collaboration, Communication, Stakeholder Management, Operations Management, Flexibility, Influencing Skills"
}