{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Web Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Senior Web Engineer with 13+ years of experience in developing robust web infrastructure and enhancing developer experience. Proficient in **TypeScript** and skilled in **gRPC**, with a strong foundation in **dependency management**, **build tooling**, and **SDK development**. Experienced in delivering high-performance applications across healthcare and financial sectors, leveraging technologies such as **JavaScript**, **Python**, **React**, **Next.js**, and **Node.js**. \nDemonstrated ability in creating documentation that streamlines development and fosters collaboration among teams. Adept in deploying cloud-native applications on **AWS** and **Azure**, implementing microservices and CI/CD pipelines. My background also includes building AI/ML-powered platforms that utilize predictive analytics and automation, ensuring compliance with standards like HIPAA and PCI DSS.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Web Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Developed and maintained web infrastructure using **TypeScript** and **gRPC**, ensuring high-performance applications that meet user expectations.\n- Applied dependency management strategies to enhance code maintainability and optimize build tooling processes for seamless SDK development.\n- Created comprehensive documentation for web platforms to improve developer experience and facilitate onboarding for new team members.\n- Designed and built full-stack platforms for healthcare and fintech leveraging **Python** (FastAPI), **Node.js**, and paired with modern front-end frameworks like **React** (17–18), **Next.js**, and **Vue 3**, ensuring compliance with industry standards such as HIPAA, FHIR, GDPR, PCI DSS, and SOX.\n- Delivered mobile applications for iOS and Android using **Flutter** and **React Native**, implementing native modules and state management with Provider and Redux to support secure, real-time user interactions.\n- Created CI/CD pipelines tailored for mobile using **Fastlane** and **App Center**, incorporating test automation, release workflows, and crash analytics with **Firebase Crashlytics** and **Sentry**.\n- Led the transformation of **legacy systems** into microservices architectures, leveraging **Docker**, **Kubernetes** (AKS/EKS), and serverless functions via **AWS Lambda** and **Azure Functions** for fault-tolerant, scalable deployments.\n- Built and maintained data infrastructure using **PostgreSQL**, **MongoDB**, **Redis**, and **GraphQL**, designed to support heavy data ingestion and real-time analytics for health and finance domains.\n- Deployed ML models for risk scoring, fraud detection, and document classification using **scikit-learn**, **PyTorch**, and **TensorFlow**, with backend inference integrated into live systems.\n- Implemented MLOps workflows using **MLflow**, **DVC**, and **Airflow**, managing model training, validation, and deployment pipelines across development and production.\n- Integrated intelligent features into frontend applications, such as personalized dashboards, predictive health alerts, and financial summaries, powered by models hosted on **Azure ML** and **AWS Sagemaker**.\n- Built DevOps pipelines using **GitHub Actions**, **CircleCI**, and **Azure DevOps**, with full test automation, linting, security checks, and multi-environment deployment workflows.\n- Developed advanced data visualization tools with **D3.js**, **Chart.js**, and **Power BI Embedded**, enabling real-time analysis of financial activity, fraud trends, and operational KPIs.\n- Collaborated closely with ML teams to deploy **NLP models** (**spaCy**, **Hugging Face Transformers**) for document parsing and anomaly detection, exposed through secured REST APIs.\n- Defined and enforced robust testing strategies across the stack using **Jest**, **Cypress**, **Postman**, and **PyTest** to cover unit, integration, E2E, and contract-level tests.\n- Integrated search capabilities with **Azure Cognitive Search** and **Elasticsearch**, supporting fast and flexible querying across structured and unstructured health and financial datasets."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Utilized **TypeScript** to enhance developer experience and streamline SDK development, ensuring robust and scalable code with built-in documentation for ease of use.\nImplemented **gRPC** for efficient inter-service communication in microservices architecture, improving the speed and reliability of data exchange between components.\nModernized core web infrastructure by migrating to an event-driven architecture with technologies such as **Node.js** (NestJS/Express) and **Python** (FastAPI, Django), leading to a **40%** increase in system scalability and a **30%** reduction in response times for high-volume transactional systems.\nCreated interactive front-end applications using **React** (18), **Vue 3**, and **Next.js**, applying best practices in **Dependency Management** and **Build Tooling** to deliver high-quality, responsive user interfaces for financial applications and admin panels.\nDesigned and delivered real-time analytics dashboards incorporating **D3.js** and **Power BI Embedded**, providing critical insights that enhance operational efficiency and transaction monitoring.\nManaged the development of **ETL** pipelines for ingesting and processing financial data from multiple sources while utilizing **Apache Airflow** and **Azure Data Factory**, achieving both batch and real-time processing with a **99.9%** data accuracy rate.\nDeveloped and deployed machine learning models for fraud detection using **scikit-learn**, **XGBoost**, and **Azure ML**, enabling prompt detection of suspicious activities and achieving a **15%** improvement in anomaly detection rates.\nCreated machine learning pipelines for real-time credit scoring and churn prediction, integrating model inference into backend services with **MLflow** and **Airflow** to enhance operational workflows."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Leveraged **TypeScript** in building robust web applications, improving code quality and developer experience across key projects.\nImplemented **gRPC** for efficient service-to-service communication, enhancing performance and scalability of backend services.\nOptimized web infrastructure by applying best practices in **Dependency Management**, resulting in a **30%** reduction in build times and improved team productivity.\nUtilized modern **Build Tooling** approaches, such as Webpack and Babel, to streamline workflows and enhance asset management, ensuring a seamless integration process.\nDeveloped custom SDKs to facilitate consumption of various APIs, significantly improving integration efforts across multiple platforms, with a focus on developer experience.\nCreated comprehensive documentation for technical resources and processes, enabling team members to efficiently onboard and understand intricate system functionalities, enhancing cross-team collaboration.\nEngineered resilient, high-availability backend services tailored for a global audience, using **Python** (FastAPI, Django) and **Node.js** (NestJS, Express), ensuring a response time under **100ms** for critical endpoints.\nDesigned real-time functionality utilizing **WebSockets** and event-driven structures powered by **Kafka** and **RabbitMQ**, yielding a **50%** improvement in order processing times.\nDeveloped responsive frontend solutions utilizing **React** (18), **Vue 3**, and **Angular**, optimized for low-latency performance and user engagement across over **10,000** active users daily.\nManaged database operations with **MongoDB**, **PostgreSQL**, **Redis**, and **Cassandra**, ensuring efficient data retrieval and manipulation under high traffic conditions, achieving an uptime of **99.9%**.\nIntegrated AI-driven recommendation systems utilizing **scikit-learn**, **LightGBM**, and **TensorFlow**, resulting in a **15%** increase in conversion rates through personalized user experiences.\nExecuted **Redis** caching strategies to enhance data retrieval speeds, improving application response by **45%** during peak load times.\nUtilized feature flagging and blue-green deployment strategies with **LaunchDarkly** and **Kubernetes**, enabling a structured approach to feature releases and reducing rollbacks by **75%**.\nConceived SEO-friendly e-commerce platforms utilizing **Next.js**, **Vue 3 + Nuxt**, and **HTML5/CSS3**, improving search engine rankings and compliance with **WCAG 2.1** standards.\nDeveloped secure payment gateways with **Stripe**, **PayPal**, and **Razorpay**, ensuring PCI compliance to handle sensitive information safely.\nImplemented role-based access controls (**RBAC**) and adhered to **OAuth 2.0** standards for secure user access management, maintaining regulatory compliance such as **GDPR**."
    }
  ],
  "skills": " **Programming Languages:**\n\t•\tTypeScript\n\n**Backend Frameworks:**\n\t•\tPython: FastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\t•\tJavaScript/TypeScript: React, Vue, Angular\n\n**API Technologies:**\n\t•\tgRPC\n\n**Serverless and Cloud Functions:**\n\t•\tAWS: ECS, Lambda, RDS, S3\n\t•\tAzure: App Services, Blob Storage, SQL Database\n\n**Databases:**\n\t•\tPostgreSQL (Fintech), MySQL (Healthcare)\n\t•\tMongoDB (Gaming), Redis\n\n**DevOps:**\n\t•\tDocker, Kubernetes\n\t•\tGitHub Actions, GitLab CI/CD\n\t•\tCI/CD & Infrastructure as Code: Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\t•\tWeb Infrastructure\n\n**Other:**\n\t•\tAuthentication & Security: Keycloak (OIDC, RBAC), OAuth2, JWT\n\t•\tNginx, Let’s Encrypt, Certbot\n\t•\tDependency Management\n\t•\tBuild Tooling\n\t•\tSDK Development\n\t•\tDeveloper Experience\n\t•\tDocumentation",
  "apply_company": "Justera Group"
}