{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior AI Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "As a Senior AI Engineer with 8 years of experience, I excel in leveraging **React**, **Next.js**, **TypeScript**, **Python**, and modern AI frameworks to develop advanced, high-performance applications. I possess strong expertise in building and integrating **APIs** and utilizing **AI** technologies including **LLMs** and vector databases like **Pinecone** and **Weaviate**, alongside tools such as **OpenAI**, **Anthropic**, and **Hugging Face** to deliver cutting-edge solutions.\n\nI have a proven track record in developing enterprise-grade platforms and optimizing machine learning workflows for predictive analytics and real-time processing. My comprehensive knowledge of **CI/CD** practices and experience in developing microservices and event-driven architectures ensure the delivery of secure and compliant applications aligned with industry standards like HIPAA and PCI DSS. My hands-on experience extends to implementing machine learning pipelines and deploying ML models in production environments using tools such as **MLflow**, **Airflow**, and **Kubeflow**. I am dedicated to driving innovation through technology while maintaining excellence in performance and security.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior AI Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Developed diverse AI features utilizing **React**, **Next.js**, **TypeScript**, and **Python**, optimizing performance across platforms while ensuring compatibility with the latest libraries.\n- Designed and implemented APIs for AI models and integration with core systems, leveraging **Python** and framework capabilities.\n- Created and managed CI/CD pipelines, employing tools like GitHub Actions and **Cypress** for automated testing and deployment of applications across 3 environments.\n- Integrated cutting-edge AI technologies, including **OpenAI** and **Hugging Face**, to enhance client-facing applications with predictive capabilities and user-specific features.\n- Collaborated with cross-functional teams to deploy advanced machine learning solutions, focusing on **LLMs** and **Vector databases** for improved data performance and model efficiency.\n- Ensured top-tier testing strategies with **Jest** and **Cypress**, resulting in coverage improvements of up to **90%** in unit and integration tests across services.\n- Spearheaded AI project initiatives adopting agile methodologies, achieving feature delivery for 5 major projects ahead of schedule.\n- Engaged with data scientists to leverage advanced querying and storage solutions such as **Pinecone** and **Weaviate** for enhanced data retrieval and model performance.\n- Streamlined development processes through the establishment of best practices in **CI/CD**, enhancing productivity by **30%** year-over-year.\n- Frequently analyzed performance metrics to fine-tune and evolve AI models, implementing iterative improvements based on user feedback and operational requirements."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Designed and implemented scalable APIs using **Python** and **Go**, ensuring high performance and reliability for applications integrating AI functionalities.\nDeveloped innovative applications utilizing **React** (18), **Next.js**, and **TypeScript** for dynamic user experiences, focusing on enhancing the interaction with AI-driven features and services.\nIntegrated machine learning algorithms and AI tools such as **OpenAI**, **Hugging Face**, and **Anthropic** into existing systems, contributing to the development of advanced AI applications.\nLeveraged **CI/CD** practices and tools like **Jest** and **Cypress** for automated testing and deployment, improving code quality and reducing deployment times by **30%**.\nArchitected data workflows incorporating **Vector databases** such as **Pinecone** and **Weaviate**, optimizing data retrieval and storage for AI models which improved data access speed by **40%**.\nDeveloped user-facing components and systems for AI-driven applications, ensuring a seamless experience through effective integration and efficient use of resources.\nParticipated in the continuous learning and adaptation of new AI/ML technologies, fostering a culture of innovation and responsiveness to industry trends.\nLed efforts in versioning deployment of AI models, overseeing a transition from **version 1.0** to **version 2.5** for improved performance metrics and user feedback."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Utilized **React (18)** and **Next.js** to develop interactive and user-friendly interfaces for AI-driven applications, ensuring fast and responsive performance across platforms.\nImplemented **TypeScript** for robust type checking and improved maintainability in codebases, contributing to higher code quality and fewer runtime errors.\nDesigned and developed **APIs** for seamless integration between AI models and frontend applications, enhancing data flow and user interaction efficiency.\nEngineered and deployed machine learning models leveraging **Python** and popular libraries like **scikit-learn**, **TensorFlow**, and others, achieving a model accuracy improvement of over **25%** in recommendation systems.\nIntegrated with **OpenAI** and **Hugging Face** frameworks to enhance model capabilities, focusing on real-time data processing and user-specific personalization features.\nImplemented CI/CD practices with tools like **Jest**, **Cypress**, and **VRT** to automate testing and streamline deployment processes, resulting in a **40%** reduction in deployment time.\nContributed to the architectural design of **Vector databases** such as **Pinecone** and **Weaviate** for efficient data querying and storage in AI applications, optimized for handling billions of data points.\nDeveloped and maintained robust data pipelines for AI workflows, ensuring smooth processing of large datasets and integration with predictive analytics features.\nEnhanced application performance and scalability through efficient caching strategies with **Redis** and by applying performance tuning across all layers of the application.\nApplied best practices in AI product lifecycle management, ensuring ethical deployment and compliance with regulations such as GDPR in all AI initiatives."
    }
  ],
  "skills": "Programming Languages:\n\tPython, TypeScript, Go\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Next.js, Vue, Angular\n\n**API Technologies:**\n\tAPIs, OpenAI, Anthropic, Hugging Face, RAG\n\n**Serverless and Cloud Functions:**\n\tAWS (Lambda), Azure (App Services)\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis, Vector databases, Pinecone, Weaviate\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, CI/CD\n\n**Cloud & Infrastructure:**\n\tAWS (ECS, RDS, S3), Azure (Blob), Terraform, Ansible, Helm, Docker Compose\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, Jest, Cypress, VRT",
  "apply_company": "Typeform"
}