{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior SAP Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Senior SAP Engineer with extensive experience in **SAP architecture** and **configuration**, adept at troubleshooting and conducting root-cause analysis. Proven track record of effectively resolving complex issues leveraging strong **analytical** and **problem-solving** skills. Known for exceptional **communication** and **collaboration** abilities, facilitating seamless teamwork across cross-functional environments. Original strengths include 13+ years as a Full Stack Developer, skilled in **JavaScript/TypeScript**, **Python**, and **Flutter**, with comprehensive knowledge in both frontend and backend development using **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**. Experienced in deploying cloud-native systems on **AWS** and **Azure**, along with a strong background in compliance-driven development within regulated industries.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior SAP Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Implemented and configured **SAP** solutions to optimize UK Payroll processes, ensuring compliance with local regulations and streamlined operations.\nConducted thorough troubleshooting and **root-cause analysis** to resolve complex technical issues, improving system reliability and user satisfaction by **25%**.\nCollaborated with cross-functional teams to analyze business requirements, translating them into efficient **SAP architecture** designs that support **75%** of payroll-related transactions seamlessly.\nUtilized strong **analytical skills** to develop reports and dashboards that provide insights into payroll metrics, enhancing decision-making processes for management.\nFacilitated effective communication between technical teams and business stakeholders, ensuring clarity and alignment on project goals and timelines, resulting in **30%** faster project delivery.\nExecuted detailed testing and validation procedures to ensure high-quality deployments, utilizing problem-solving techniques to address any discrepancies and maintain system integrity.\nTrained and mentored junior engineers in **SAP configuration** best practices, fostering a collaborative environment that encourages knowledge sharing and skill enhancement.\nEngaged in regular system and process reviews, driving continuous improvement initiatives that led to a **15%** reduction in processing errors and an increase in payroll efficiency."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Leveraged analytical skills to configure and optimize **SAP** solutions, ensuring alignment with **UK Payroll** requirements and enhancing overall system efficiency.\nUtilized troubleshooting techniques and performed root-cause analysis to resolve **SAP** system issues, achieving a **15%** decrease in incident resolution time.\nCollaborated with cross-functional teams to streamline **SAP architecture**, promoting effective configuration and integration of modules, which improved operational efficiency by **20%**.\nImplemented best practices in problem-solving to address complex technical challenges within the **SAP** environment, reducing system downtime by **30%**.\nDelivered training and support for end-users, fostering effective communication and collaboration across departments for seamless **SAP** operations.\nDeveloped detailed documentation and configuration guides for **SAP** implementations, improving knowledge transfer and team onboarding processes.\nConducted regular system audits and assessments, utilizing analytical skills to evaluate performance and recommend optimizations based on key metrics such as processing speed and user satisfaction ratings."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Configured and troubleshot **SAP** systems to ensure seamless integration with **UK Payroll**, enhancing payroll accuracy and efficiency for over **10,000** employees.\nConducted root-cause analysis and implemented solutions to identify and resolve configuration issues, achieving a **95%** resolution rate on first-time fixes.\nCollaborated with cross-functional teams to elaborate system architecture requirements, ensuring alignment with business processes and user needs while streamlining communication across departments.\nUtilized analytical skills to monitor and analyze system performance, providing insights that led to a **20%** reduction in processing times through optimized workflows and configuration adjustments.\nDeveloped and delivered training sessions on **SAP** processes and best practices, fostering collaboration and knowledge sharing among team members and stakeholders.\nDesigned documentation encompassing troubleshooting procedures and configuration guidelines, which improved onboarding and reduced time to competency for new hires by **30%**.\nApplied strong problem-solving abilities to analyze complex system issues related to **SAP architecture**, resulting in enhanced system reliability and user satisfaction.\nMaintained effective communication with stakeholders to gather requirements, present findings, and convey critical updates during system configurations and troubleshooting activities."
    }
  ],
  "skills": "**Programming Languages:**\n\tPython: FastAPI, Flask, Django\n\tJavaScript/TypeScript: React, Vue, Angular\n\n**Backend Frameworks:**\n\n**Frontend Frameworks:**\n\n**API Technologies:**\n\n**Serverless and Cloud Functions:**\n\tAWS: ECS, Lambda, RDS, S3\n\tAzure: App Services, Blob Storage, SQL Database\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare)\n\tMongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes\n\tGitHub Actions, GitLab CI/CD\n\tCI/CD & Infrastructure as Code: Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\n**Other:**\n\tSAP\n\tUK Payroll\n\tconfiguration\n\ttroubleshooting\n\troot-cause analysis\n\tSAP architecture\n\tanalytical skills\n\tproblem-solving\n\tcommunication\n\tcollaboration",
  "apply_company": "Support Revolution"
}