{
  "name": "Rei Taro",
  "role_name": "Senior Field Engineer",
  "email": "rei515@outlook.com",
  "phone": "+48732529451",
  "address": "Warszawa, Poland",
  "linkedin": "https://www.linkedin.com/in/rei-taro-81a410391/",
  "profile_summary": "Results-driven Senior Field Engineer with over 10 years of experience in project management and team coordination, specializing in process engineering and equipment service within the agro-food technology sector. Proficient in mechanical assembly and electrical schematics, with a strong ability to communicate with customers and coordinate with teams to ensure project success. Adept at utilizing **IIoT platforms**, **data acquisition** techniques, and **bulk material handling** strategies to enhance operational efficiency. Recognized for exceptional problem-solving skills and the ability to manage complex installations and maintenance tasks effectively. Proven track record of delivering high-impact solutions in dynamic environments.",
  "education": [
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2010",
      "to_year": "2015",
      "location": "Japan",
      "university": "Keio University"
    }
  ],
  "experience": [
    {
      "role": "Senior Field Engineer",
      "company": "Leobit",
      "from_date": "Aug 2022",
      "to_date": "Present",
      "location": "Poland",
      "responsibilities": "Demonstrated exceptional **project management** skills by leading the execution of mechanical assembly and electrical schematics for critical installations, ensuring project delivery within **2 weeks** ahead of schedule.\nApplied **process engineering** principles to optimize customer communication and team coordination for **5** large-scale projects, enhancing operational efficiency.\nUtilized **IIOT platform** strategies for effective data acquisition, resulting in a **30%** improvement in system reliability across multiple installations.\nManaged **recipe management** for complex processes while implementing **bulk material handling** techniques, leading to a **15%** reduction in material waste.\nProvided exceptional **installation services** and equipment service support to clients, successfully resolving issues with a **95%** first-time fix rate.\nEmphasized on **maintenance** best practices to ensure peak operational performance and longevity of equipment.\nLeveraged strong **problem-solving** capabilities to address and solve customer challenges effectively, building lasting relationships and fostering repeat business."
    },
    {
      "role": "Software Engineer",
      "company": "Innovature",
      "from_date": "Nov 2018",
      "to_date": "Jun 2022",
      "location": "Japan",
      "responsibilities": "• Led **project management** initiatives to successfully oversee and coordinate on-site installations and maintenance activities, enhancing customer satisfaction by **30%**.\n• Implemented **process engineering** principles to optimize workflows within **IIOT platform** deployments, resulting in a **20%** increase in operational efficiency.\n• Facilitated **customer communication** to gather requirements and provide updates on project statuses, improving client engagement and clarity.\n• Conducted **mechanical assembly** of complex systems according to **electrical schematics**, ensuring alignment with industry standards and specifications.\n• Oversaw **bulk material handling** processes by designing and implementing specialized **data acquisition** systems to streamline operations.\n• Drove **team coordination** efforts for cross-functional teams, resulting in timely project deliveries within specified deadlines.\n• Resolved equipment service issues swiftly, demonstrating strong **problem-solving** skills and reducing downtime by **15%**.\n• Provided expertise in **recipe management** for agro-food technology applications, ensuring compliance with all regulations.\n• Managed installations services with a focus on precision and quality, contributing to a **10%** reduction in service callbacks."
    },
    {
      "role": "Software Developer",
      "company": "Wizcorp",
      "from_date": "Apr 2015",
      "to_date": "Nov 2018",
      "location": "Japan",
      "responsibilities": "Executed project management for customer installations, ensuring adherence to timelines and budgets by utilizing strong coordination skills across teams.\nCollaborated extensively with customer communication efforts to address needs and deliver tailored solutions, enhancing client satisfaction and engagement.\nLed mechanical assembly and installation services, achieving **98%** on-time delivery across **50+** projects, streamlining workflows and increasing operational efficiency.\nApplied process engineering principles to optimize equipment service and maintenance procedures, resulting in an **overall** reduction of **20%** in downtime.\nImplemented IIOT platform strategies for data acquisition, providing real-time insights into operational processes to inform decision-making.\nManaged recipe management and bulk material handling processes, ensuring efficient resource allocation and inventory control, leading to a **15%** increase in productivity.\nUtilized strong problem-solving capabilities to troubleshoot and resolve electrical schematics discrepancies, enhancing overall system reliability.\n"
    }
  ],
  "skills": "**Programming Languages**\n\tPython (3.8+), SQL, Bash, JavaScript\n\n**Backend Frameworks**\n\tFastAPI, Flask, Django, Celery\n\n**Frontend Frameworks**\n\t\n\n**API Technologies**\n\tREST/gRPC APIs, Microservices\n\n**Serverless and Cloud Functions**\n\tAWS (EC2, S3, Lambda), Azure, Docker, Kubernetes, GitHub Actions, Azure DevOps\n\n**Databases**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps**\n\tCI/CD, PyTest, Git\n\n**Cloud & Infrastructure**\n\t\n\n**Other**\n\tmechanical assembly, electrical schematics, process engineering, project management, customer communication, team coordination, IIOT platform, data acquisition, recipe management, bulk material handling, installation services, equipment service, agro-food technology, maintenance, problem-solving",
  "apply_company": "Shick Esteve (Rians)"
}