{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior QA Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Senior QA Engineer with 13+ years of experience specializing in test automation and quality assurance strategies for high-performance applications in healthcare and financial services. Proficient in **Playwright**, **Cypress**, and CI/CD methodologies, ensuring robust test automation frameworks and efficient workflows.\nAdept at implementing QA strategies that enhance software reliability and performance while adhering to compliance standards such as HIPAA and PCI DSS. Strong background in AI applications, collaborating with cross-functional teams to integrate AI-driven testing solutions, enhancing verification and validation processes.\nExperienced in Gitflow version control and employing visual test automation techniques that drive quality benchmarks. Versatile in full-stack development using **JavaScript/TypeScript**, **Python**, **React**, and **Node.js**, further contributing to the thoroughness of QA processes by understanding the development lifecycle and deployment on **AWS** and **Azure**.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior QA Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Developed and maintained **test automation** strategies using **Playwright** and **Cypress**, resulting in a **30%** reduction in manual testing time.\n- Collaborated with development teams to implement **CI/CD** pipelines with integration for **Gitflow**, ensuring efficient code deployment and improved release cycles by **20%**.\n- Conducted in-depth quality assurance (QA) testing for full-stack applications, utilizing automation frameworks and maintaining optimal testing environments.\n- Designed visual test automation protocols, enhancing test coverage across web platforms with a **25%** increase in test case efficiency.\n- Utilized AI techniques to improve testing processes and outcomes, implementing predictive models that informed QA strategies and resource allocation.\n- Executed comprehensive regression testing and maintained an efficient QA strategy, ensuring product quality met standards before deployment.\n- Trained and mentored junior QA engineers on the implementation of **automated testing** best practices, contributing to team skill enhancement.\n- Collaborated with cross-functional teams to define requirements and establish a robust QA framework for enterprise-grade applications, leading to faster product releases."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Implemented comprehensive **test automation** strategies utilizing **Playwright** and **Cypress** to ensure high-quality delivery of financial applications, reducing manual testing effort by **75%**.\nDeveloped a robust **QA strategy** for both frontend and backend components, enhancing application reliability through consistent **visual test automation** practices.\nIntegrated **Gitflow** workflows within the testing process, enabling streamlined collaboration and continuous integration across cross-functional teams.\nEstablished efficient **CI/CD** pipelines that facilitated seamless deployment processes, resulting in a **50%** reduction in release cycle times.\nExecuted automated tests for various application modules, achieving a test coverage of over **90%**, significantly enhancing overall product quality.\nLeveraged **AI** techniques for intelligent test case generation, improving test efficiency and effectiveness by identifying critical paths within the application.\nCollaborated closely with development teams to incorporate testing throughout the software development lifecycle, promoting a culture of quality within Agile practices."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Developed and implemented a comprehensive **QA strategy** utilizing **test automation** frameworks such as **Playwright** and **Cypress** to ensure the quality and performance of backend services across key modules, achieving a **95%** reduction in manual testing time.\nExecuted **CI/CD** pipelines for continuous integration and deployment, streamlining the release process and ensuring code quality with regular automated testing phases, achieving a deployment frequency of **5 times per week**.\nCreated visual test automation scripts to validate UI components, improving detection of discrepancies by **85%** before production releases, thus enhancing user experience.\nCollaborated with development teams to integrate **Gitflow** methodologies for efficient version control and collaboration, ensuring code quality in all ongoing projects.\nUtilized AI capabilities for predictive testing and identifying high-risk areas of the application, leading to a significant reduction in post-release defects by **30%**.\nParticipated in creating and maintaining a robust suite of automated tests focusing on critical functionalities, ensuring high application reliability and performance under load with a target response time of under **200ms**.\nTrained the team on best practices for test automation with **Gitflow**, fostering a culture of quality-first development and enabling smoother QA processes across all teams.\nReviewed and analyzed test results, providing actionable insights to development teams to facilitate quick resolution of identified issues, leading to improved product delivery timelines by **15%**."
    }
  ],
  "skills": "**Programming Languages:**\n\t•\tPython: FastAPI, Flask, Django\n\t•\tJavaScript/TypeScript: React, Vue, Angular\n\n**Backend Frameworks:**\n\t•\tFastAPI\n\t•\tFlask\n\t•\tDjango\n\n**Frontend Frameworks:**\n\t•\tReact\n\t•\tVue\n\t•\tAngular\n\n**API Technologies:**\n\t•\tKeycloak (OIDC, RBAC), OAuth2, JWT\n\n**Serverless and Cloud Functions:**\n\t•\tAWS: ECS, Lambda, RDS, S3\n\t•\tAzure: App Services, Blob Storage, SQL Database\n\n**Databases:**\n\t•\tPostgreSQL (Fintech), MySQL (Healthcare)\n\t•\tMongoDB (Gaming), Redis\n\n**DevOps:**\n\t•\tDocker, Kubernetes\n\t•\tGitHub Actions, GitLab CI/CD\n\n**Cloud & Infrastructure:**\n\t•\tTerraform, Ansible, Helm, Docker Compose\n\n**Other:**\n\t•\tMLflow, Airflow, Kubeflow\n\t•\tCypress\n\t•\tPlaywright\n\t•\tAI\n\t•\tGitflow\n\t•\tCI/CD\n\t•\ttest automation\n\t•\tQA strategy\n\t•\tvisual test automation\n",
  "apply_company": "Not specified"
}