{
  "name": "Tomasz Lee",
  "role_name": "Software Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-477994390/",
  "profile_summary": "Results-driven Software Engineer with 9+ years of experience in developing high-quality applications and a proven track record in cross-functional collaboration. Proficient in **JavaScript**, skilled in leveraging advanced software development methodologies for improved software behavior verification. Experienced in writing comprehensive documentation and ensuring clarity through effective written communication. Original strengths include expertise in designing microservices architecture, utilizing **.NET**, **C#**, **ReactJS**, and **NextJS**, and hands-on experience with cloud services. Committed to delivering innovative solutions and enhancing team productivity.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Software Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Apr 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Utilized **JavaScript**, including **ReactJS** and **Next.js**, to spearhead the design and development of a web-based customer management platform, improving user satisfaction by **25%**.\nApplied **Python** in back-end development for efficient data handling and software behavior verification, ensuring robust application performance.\nLeveraged **C++** for high-performance modules within the system, enhancing computational efficiency with intricate algorithms.\nIncorporated **Go** programming language for microservices development, promoting scalability and maintainability effectively.\nDeveloped comprehensive documentation and guides, enhancing written communication across the team to improve understanding and collaboration.\nImplemented a microservices architecture using **.NET Core**, which streamlined system functionality, facilitating agile development and deployment.\nIntegrated **Apache Kafka** for real-time data streaming and **RabbitMQ** for task queuing, boosting system resilience and throughput.\nUtilized **Redis** for caching frequently accessed data, cutting database load and improving response times by **35%**.\nDeveloped RESTful APIs with **.NET**, integrated with a **MongoDB** database to ensure seamless data access for various services.\nExecuted CI/CD pipelines on **Azure DevOps**, leading to a **40%** reduction in deployment time.\nOptimized **MSSQL** database queries and indexing, achieving a **20%** reduction in average query execution time.\nCollaborated with UX/UI designers to enhance the platform’s user interface, leading to an improved user experience.\nEngineered a reporting engine using **D3.js** and **Three.js** for interactive data visualizations.\nEmployed JWT-based authentication and authorization to secure the application effectively."
    },
    {
      "role": "Full Stack Developer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "Utilized **JavaScript** for developing interactive user interfaces, enhancing user experience which contributed to a **25% improvement** in user engagement.\nEmployed **Python** for backend development, facilitating seamless integration with databases and processing logic with a focus on **real-time data access**.\nLeveraged **C++** for optimizing system performance, particularly in computational-heavy tasks that improved efficiency across applications.\nImplemented **Ruby** for scripting purposes, enhancing automated tasks and improving the overall development workflow.\nConducted comprehensive **AI research** to enhance product features, ensuring alignment with industry standards and customer expectations.\nExecuted software behavior verification practices to ensure software quality and reliability, minimizing bugs and issues in deployments.\nMaintained thorough and clear documentation for all software projects, improving team collaboration and onboarding processes for new developers.\nDemonstrated strong written communication skills, creating clear reports and project updates that facilitated stakeholder engagement.\nCreated and managed a cloud-based project management tool utilizing **Angular** and **.NET Core**, achieving a **15%** increase in team collaboration efficiency.\nDesigned a microservices architecture using **RabbitMQ** and **Apache Kafka**, enhancing system scalability and task orchestration.\nIntegrated **Redis** as a caching layer, resulting in a **25% boost** in performance by reducing API call latency.\nDeveloped **RESTful APIs** with **.NET Core**, ensuring effective integration with a **PostgreSQL** database for optimized data access.\nLed the CI/CD pipeline implementation using **GitHub Actions**, reducing production deployment errors by **30%**.\nManaged **MSSQL** and **MySQL** databases for effective data storage, enhancing queries for performance optimization.\nFacilitated the creation of custom charts and graphs with **D3.js** for interactive reporting, improving project status tracking capabilities.\nConducted code reviews and mentorship sessions with junior developers, significantly contributing to enhanced team productivity."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "Utilized **JavaScript** to create dynamic and interactive web applications, enhancing user engagement by 25%.\nEngaged in **Python** programming for backend services, leading to a **40%** reduction in response time for data processing tasks.\nConducted **AI research** to incorporate machine learning algorithms into the system, resulting in predictive analytics features that improved decision-making processes.\nDeveloped strong **documentation** practices, producing comprehensive user manuals that enhanced team understanding of software functionality.\nAchieved a **50%** increase in software behavior verification through strategic implementation of automated testing frameworks.\nLeveraged **C++** for performance-critical components ensuring system reliability under high-load scenarios.\nEnhanced team communication through effective **written communication**, delivering clear reports and updates during project iterations.\nParticipated in code reviews to maintain high-quality standards, improving overall project deliverables.\nCollaborated with cross-functional teams to identify software needs and improve system functionality, contributing to a **30%** increase in project delivery efficiency.\n"
    }
  ],
  "skills": "  **Programming Languages**\n\tJavaScript, Python, Go, C++, Ruby\n\n  **Backend Frameworks**\n\tNodeJS, ExpressJS, NestJS, C#, .NET, Entity Framework, Microservices\n\n  **Frontend Frameworks**\n\tHTML, CSS, TypeScript, ReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n  **API Technologies**\n\tRESTful API, GraphQL\n\n  **Serverless and Cloud Functions**\n\tAWS, Azure\n\n  **Databases**\n\tMSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB\n\n  **DevOps**\n\tCI/CD pipelines\n\n  **Cloud & Infrastructure**\n\tGit, GitHub\n\n  **Other**\n\tUX/UI Design, Testing Tools: NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest, Blockchain: Solidity, Ether.js, Web3.js, Ethereum, AI research, Software behavior verification, Documentation, Written communication"
}