{
  "name": "Tomasz Lee",
  "role_name": "Machine Learning Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Results-driven Machine Learning Engineer with 9+ years of experience in developing machine learning models using **Python**, **PyTorch**, and **TensorFlow**. Proficient in **Machine Learning** techniques and frameworks, including **scikit-learn**, with a strong focus on **anomaly detection**, **model evaluation**, and statistical methods. Extensive background in data integration and bioinformatics with a solid understanding of **Genomics** applications. Experienced in leveraging cloud services such as **AWS**, **GCP**, and **Azure** to deploy scalable solutions. Known for exceptional problem-solving and communication skills, effectively collaborating across teams to drive project success.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Machine Learning Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Applied **Python** in developing machine learning models, achieving an **accuracy** improvement of 15% across multiple datasets.\nUtilized **TensorFlow** and **PyTorch** frameworks for training and deploying deep learning algorithms, successfully enhancing model performance.\nConducted data integration processes with **scikit-learn** to streamline workflows, resulting in a **30%** reduction in preprocessing time.\nImplemented model evaluation techniques to gauge performance metrics, leading to the identification of underperforming models and subsequent training refinements.\nEmployed **Docker** for containerization of machine learning applications, facilitating consistent deployment across various environments.\nLeveraged **AWS** and **GCP** cloud services for scalable data storage and computing power, resulting in a **50%** increase in processing capabilities for large datasets.\nCarried out anomaly detection tasks using statistical methods to enhance the reliability of the data-driven decision-making process.\nExecuted bioinformatics and genomics analyses to draw actionable insights from biological data, contributing to significant advancements in research initiatives.\nCommunicated complex concepts and findings effectively to both technical and non-technical stakeholders through clear reporting and presentations.\nDemonstrated exceptional problem-solving skills by addressing critical issues during model development, fostering efficient and innovative solutions."
    },
    {
      "role": "Full Stack Developer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "Applied **Python** and libraries like **PyTorch** and **TensorFlow** to develop machine learning models for improved decision-making processes.\nUtilized **scikit-learn** for model evaluation, achieving a **95% accuracy rate** in predictive analytics.\nImplemented anomaly detection algorithms to identify data discrepancies, enhancing data integrity and reliability by **20%**.\nDesigned and developed data integration pipelines for bioinformatics projects, ensuring seamless genomic data flow between heterogeneous systems.\nLeveraged **AWS**, **GCP**, and **Azure** cloud services to scale machine learning applications, improving computational efficiency by **30%**.\nEmployed statistical methods to analyze and interpret complex datasets, resulting in impactful insights for stakeholders.\nCollaborated with teams using **Docker** for containerization, ensuring consistent environments across various stages of development.\nFacilitated communication between technical and non-technical stakeholders, driving project alignment and success in deliverables.\nConducted code reviews and provided mentorship, fostering a culture of continuous improvement and problem-solving within the team.\nPromoted compliance with best practices in data security and optimization across various machine learning projects."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "Utilized **Python** with **scikit-learn** and **TensorFlow** to develop machine learning models that improved prediction accuracy by **15%**.\nImplemented **PyTorch** to build and train neural networks for anomaly detection in large genomic datasets, enhancing model evaluation processes.\nIntegrated data from various sources using advanced **Data Integration** techniques, ensuring high data quality and availability for analysis.\nCollaborated with cross-functional teams to communicate insights and findings, enhancing stakeholder engagement and project transparency.\nDesigned and deployed machine learning solutions on **AWS** and **GCP**, managing resources that supported up to **1000** concurrent users.\nParticipated in routine model evaluation to measure performance metrics, leading to iterative improvements and fine-tuning strategies.\nDeveloped containerized applications using **Docker** for seamless deployment of machine learning models in production environments.\nApplied **Statistical Methods** and **Machine Learning** algorithms in **Bioinformatics** and **Genomics** projects, contributing to research-backed decisions and collaborative outcomes.\nEngaged in problem-solving sessions to address system inefficiencies, leading to a reduction in processing time by **30%**.\nCreated comprehensive documentation and technical guides to enhance team knowledge and promote effective communication of complex concepts."
    }
  ],
  "skills": " **Programming Languages**\n\tPython, JavaScript, TypeScript, C#, Solidity\n\n**Backend Frameworks**\n\tNodeJS, ExpressJS, NestJS, .NET\n\n**Frontend Frameworks**\n\tReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n**API Technologies**\n\tRESTful API, GraphQL\n\n**Serverless and Cloud Functions**\n\tAWS, GCP, Azure\n\n**Databases**\n\tMSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB\n\n**DevOps**\n\tCI/CD pipelines, Docker\n\n**Cloud & Infrastructure**\n\tAWS, Azure\n\n**Other**\n\tMachine Learning, PyTorch, TensorFlow, scikit-learn, Bioinformatics, Genomics, Data Integration, Model Evaluation, Anomaly Detection, Statistical Methods, Communication Skills, Problem-Solving, UX/UI Design, Git, GitHub, Messaging & Caching: Apache Kafka, RabbitMQ, Redis, Testing Tools: NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest"
}