{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Electrical Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Senior Electrical Engineer with 13+ years of experience in high-voltage systems and substation design, ensuring compliance with NESC and IEEE standards. Proficient in **AutoCAD**, **MicroStation**, and **Bentley Substation** for accurate bus design and grounding systems. Skilled in implementing protection & control designs and relay coordination, ensuring optimal system performance and safety. Proven ability in conducting quality checks and mentoring junior engineers while fostering cross-discipline coordination.\nAdditionally, I bring a strong foundation in full stack development, with hands-on expertise in **JavaScript/TypeScript**, **Python**, and **Flutter**. Experienced in developing AI/ML-powered platforms powered by **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**. Proficient in deploying cloud-native systems on **AWS** and **Azure**, with a solid grasp of microservices, event-driven architectures, and CI/CD pipelines.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Electrical Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Conducted detailed **substation design** for high-voltage systems, ensuring compliance with **NESC** and **IEEE** standards, achieving a **99%** success rate in quality checks.\nUtilized **AutoCAD** and **MicroStation** for precise **bus design** layouts, significantly improving project turnaround time by **30%**.\nImplemented advanced **grounding systems** to enhance safety and reliability, collaborating with cross-discipline teams to guarantee seamless integration with existing infrastructure.\nLed the **relay coordination** activities, optimizing system protection and control design, resulting in a **20%** increase in efficiency during operational tests.\nDesigned and managed SCADA systems for real-time monitoring and control of electrical grids, achieving a **15%** reduction in response time to system anomalies.\nMentored junior engineers in best practices for design and project execution, fostering a culture of continuous improvement and professional growth.\nConducted rigorous quality checks and assessments on designs, contributing to the successful certification of electrical installations with zero major non-compliance issues.\nCollaborated with multi-disciplinary teams to coordinate design efforts across various stages, ensuring timely project completion without sacrificing quality or safety standards."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Executed high-voltage **substation design** projects focusing on grounding systems, bus design, and relay coordination, ensuring compliance with **IEEE** and **NESC** standards.\nUtilized **AutoCAD** and **MicroStation** to create detailed design documentation, improving project delivery timelines by **30%**.\nConducted rigorous quality checks throughout all phases of project life cycles, maintaining a defect rate of less than **2%**.\nLed cross-discipline coordination efforts involving electrical, civil, and mechanical teams to achieve cohesive project outcomes, fostering collaboration that resulted in a **25%** reduction in project conflicts.\nMentored junior engineers on best practices and technical skills, leading to measurable improvements in team performance and project execution efficiency.\nImplemented **SCADA** systems for effective monitoring and control of high-voltage equipment, enhancing operational reliability and response times by **15%**.\nDesigned and optimized protection & control systems, ensuring robust safety and performance metrics across all substations, contributing to enhanced grid stability.\n"
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Designed and optimized **high-voltage** grounding and bus systems in substation design, applying **AutoCAD** and **MicroStation** for accurate technical drawings and layouts.\nConducted **quality checks** on designs for compliance with **NESC** and **IEEE** standards, ensuring that all electrical systems meet safety and performance criteria.\nCollaborated across disciplines to facilitate seamless project execution, mentoring junior engineers by sharing best practices in **protection & control design** and relay coordination.\nExecuted detailed plans for **SCADA** systems integration, enhancing operational efficiency and control in high-demand substation environments.\nManaged complex **relay coordination** tasks, ensuring die designs effectively protect equipment and comply with operational requirements.\nUtilized **Bentley Substation** for design modifications, significantly reducing the time for project completion on **9** major substation projects.\nImplemented robust cross-discipline coordination strategies, resulting in a **20%** reduction in project delivery time while maintaining quality standards.\nAssured compliance with safety regulations and operational protocols throughout all stages of project development, including rigorous testing and validation phases."
    }
  ],
  "skills": "Programming Languages:\n\tPython: FastAPI, Flask, Django\n\tJavaScript/TypeScript: React, Vue, Angular\n\n**Backend Frameworks:**\n\t\n\n**Frontend Frameworks:**\n\t\n\n**API Technologies:**\n\t\n\n**Serverless and Cloud Functions:**\n\tAWS: ECS, Lambda, RDS, S3\n\tAzure: App Services, Blob Storage, SQL Database\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare)\n\tMongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes\n\tGitHub Actions, GitLab CI/CD\n\tCI/CD & Infrastructure as Code: Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\t\n\n**Other:**\n\tsubstation design\n\thigh-voltage\n\tgrounding systems\n\tbus design\n\tAutoCAD\n\tMicroStation\n\tBentley Substation\n\trelay coordination\n\tSCADA\n\tprotection & control design\n\tNESC\n\tIEEE\n\tquality checks\n\tmentoring\n\tcross-discipline coordination",
  "apply_company": "Primera Engineers"
}