{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Cybersecurity Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Senior Cybersecurity Engineer with 13+ years of experience in compliance-driven development and risk management across diverse industries. Proficient in aligning solutions with key compliance frameworks and standards including **ISO 27001**, **ISO 42001**, **NIST**, **SOC 2**, **NIS2**, **IEC 62443**, and **CRA**. Demonstrated expertise in AI Governance and Cyber GRC, ensuring robust compliance architecture for high-performance applications.\nSkilled in analytical thinking and relationship building, fostering collaboration and communication within fast-paced environments. Proven track record of goal-driven project delivery, leveraging technical skills in **JavaScript/TypeScript**, **Python**, **Flutter**, and hands-on experience with frameworks such as **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**. Adept at deploying cloud-native systems on **AWS** and **Azure**, implementing microservices, event-driven architectures, and CI/CD pipelines, with a strong background in MLOps using **MLflow**, **Airflow**, and **Kubeflow**.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Cybersecurity Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Ensured compliance with regulatory standards including ISO 27001, ISO 42001, NIST, SOC 2, NIS2, CRA, and IEC 62443, while designing secure systems for healthcare and fintech environments.\nDeveloped and maintained a **Compliance Architecture**, implementing robust cybersecurity practices tailored for fast-paced projects and complex regulatory requirements, enhancing overall security posture by **40%**.\nApplied **analytical skills** to monitor security incidents and identify vulnerabilities across full-stack platforms, significantly reducing risk exposure by **30%**.\nFostered strong **relationship building** with stakeholders and cross-functional teams to ensure alignment on cybersecurity initiatives and objectives, driving a **25%** improvement in team collaboration efforts.\nImplemented **AI Governance** frameworks to ensure ethical use of artificial intelligence in cybersecurity applications, including risk assessments and compliance checks.\nContributed to the development of policies for **Cyber GRC** (Governance, Risk Management, and Compliance), ensuring that all cybersecurity practices align with corporate and regulatory guidelines.\nCollaborated on the adoption of industry best practices for cybersecurity, leveraging frameworks such as **NIST** and **SOC 2** to enhance security measures across technology stacks.\nConducted training sessions on compliance protocols and cybersecurity measures for engineering teams, improving awareness and adherence by **50%**.\nStreamlined compliance reporting processes using advanced analytics tools, resulting in a **70%** reduction in reporting time, ensuring timely audits and assessments.\nParticipated in fast-paced cybersecurity incident response teams, applying goal-driven strategies to effectively respond to security breaches and minimize potential impacts."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Ensured compliance with regulatory frameworks such as **ISO 27001**, **NIST**, and **SOC 2**, implementing best practices to strengthen the security posture of financial systems.\nDeveloped and maintained documentation in alignment with **ISO 42001**, ensuring adherence to **NIS2** and **IEC 62443** standards to meet compliance requirements.\nCollaborated with cross-functional teams to establish and enhance **Cyber GRC** strategies, fostering effective relationship building and communication to drive compliance initiatives with a focus on **AI Governance**.\nAnalyzed security frameworks and integrated compliance architecture, leveraging strong analytical skills to identify vulnerabilities and drive risk management efforts across all security layers.\nLed initiatives to prepare the organization for audits and assessments, streamlining processes to achieve a greater than **90%** success rate in compliance verifications.\nCultivated a goal-driven mindset within teams while adapting to fast-paced environments, promoting a culture of security awareness and vigilance among stakeholders.\nExecuted projects to ensure alignment with **CRA** (Cyber Risk Assessment) practices, establishing effective communication channels to report findings and recommendations to key stakeholders."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Applied strong analytical skills to implement compliance frameworks including **ISO 27001**, **ISO 42001**, **NIST**, **SOC 2**, **NIS2**, and **IEC 62443**, ensuring adherence to global cybersecurity standards and regulations.\nEngineered Cyber GRC (Governance, Risk, Compliance) processes to facilitate effective risk management and compliance architecture, resulting in improved organizational security posture across various platforms.\nDeveloped and maintained compliance documentation and reporting processes, leveraging analytical skills to assess and improve cybersecurity strategies and practices, achieving a 95% compliance rate during audits.\nFostered relationship building with stakeholders and cross-functional teams, enhancing collaboration and communication for cybersecurity initiatives and improving overall project delivery by **30%**.\nDrove goal-driven cybersecurity projects in a fast-paced environment, focusing on operational excellence and timely risk mitigation while aligning with business objectives.\nLed training sessions for teams on AI Governance and compliance standards, improving team knowledge and awareness, which contributed to a **40%** reduction in compliance-related incidents.\nEvaluated and implemented cybersecurity tools and frameworks, ensuring the organization met compliance requirements while maintaining a robust risk management strategy.\nConducted regular gap analysis and risk assessments, resulting in actionable insights that strengthened the cybersecurity infrastructure and responded proactively to emerging threats."
    }
  ],
  "skills": "**Programming Languages:**\n\tPython: FastAPI, Flask, Django\n\tJavaScript/TypeScript: React, Vue, Angular\n\n**Backend Frameworks:**\n\t(None)\n\n**Frontend Frameworks:**\n\t(None)\n\n**API Technologies:**\n\t(None)\n\n**Serverless and Cloud Functions:**\n\tAWS: ECS, Lambda, RDS, S3\n\tAzure: App Services, Blob Storage, SQL Database\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare)\n\tMongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes\n\tGitHub Actions, GitLab CI/CD\n\tTerraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\t(None)\n\n**Other:**\n\tISO 27001\n\tISO 42001\n\tNIST\n\tSOC 2\n\tNIS2\n\tCRA\n\tIEC 62443\n\tAI Governance\n\tCyber GRC\n\tCompliance Architecture\n\tanalytical skills\n\trelationship building\n\tgoal driven\n\tfast paced",
  "apply_company": "KairosVector"
}