{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior FullStack Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Dynamic Senior Full Stack Engineer with 13+ years of experience in building scalable and secure web applications. Proficient in **Python**, **TypeScript**, and integrating **APIs** for high-performance B2B SaaS solutions. Expertise in **Web Applications** development with a focus on **Customizations**, ensuring compliance with industry standards such as HIPAA and PCI DSS for security and performance.\nSkilled in creating integrations that drive fault tolerance and scalability within applications. Strong communicator and collaborator, adept at problem-solving to enhance development processes. Well-versed in **React**, **Next.js**, **Vue**, and **Node.js** for frontend solutions, alongside **FastAPI** and **Django** for backend services. Experienced in leveraging **AWS** and **Azure** for deploying cloud-native systems, employing microservices and CI/CD pipelines to streamline development workflows. Committed to driving innovation in HR Tech and enhancing user experience through advanced technology.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior FullStack Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Utilized **Python (FastAPI)** and **TypeScript** to design and build scalable web applications, ensuring high performance and fault tolerance while maintaining compliance with industry standards such as HIPAA and GDPR.\nImplemented APIs and integrations, enhancing application scalability and security for **B2B SaaS** solutions in healthcare and fintech domains.\nApplied web technologies and practices to customize features tailored to specific client needs, emphasizing security and performance.\nCollaborated with cross-functional teams, improving communication and problem-solving capabilities to drive project success across various platforms.\nDeveloped full-stack applications leveraging front-end frameworks including **React (17-18)** and **Vue 3**, ensuring a responsive and seamless user experience.\nEngineered robust mobile applications using **Flutter** and **React Native** for iOS and Android, implementing state management through **Provider** and **Redux** for enhanced app responsiveness in real-time environments.\nEstablished CI/CD pipelines with **Fastlane** and **App Center**, streamlining testing and deployment processes to enhance application reliability.\nMigrated legacy systems to microservices architectures, incorporating **Docker** and **Kubernetes (AKS/EKS)**, resulting in improved fault tolerance and scalability.\nManaged data infrastructure employing **PostgreSQL**, **MongoDB**, and **GraphQL** for real-time data analytics and heavy ingestion, specifically in financial and healthcare data environments.\nDeployed machine learning models for fraud detection and risk scoring utilizing **scikit-learn**, **PyTorch**, and **TensorFlow**, ensuring seamless backend integration.\nImplemented MLOps workflows using **MLflow** and **DVC** to automate model training and deployment processes across development stages.\nIntegrated advanced analytics features into applications, such as personalized dashboards and predictive alerts, leveraging services like **Azure ML** and **AWS Sagemaker**.\nBuilt comprehensive DevOps pipelines with **GitHub Actions** and **CircleCI**, ensuring code quality through full test automation, linting, and security checks.\nCreated advanced data visualization tools using **D3.js** and **Chart.js**, enabling real-time tracking of key performance indicators in financial operations.\nCollaborated with ML teams to establish NLP capabilities using **spaCy** and **Hugging Face Transformers**, facilitating efficient document processing through secure APIs.\nDefined and enforced comprehensive testing strategies using **Jest**, **Cypress**, and **Postman** to ensure thorough coverage across all application layers.\nEnhanced search functionalities with **Azure Cognitive Search** and **Elasticsearch**, allowing for rapid queries across diverse datasets in both health and finance sectors."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Utilized **Python** and **TypeScript** to modernize core financial platforms by migrating to microservices architecture, which enhanced scalability and performance for high-volume transactional systems handling **over 1M** transactions per month.\nEngineered dynamic web applications and interactive user interfaces using **React (18)**, **Vue 3**, and **Next.js**, along with **Redux Toolkit** and **Tailwind CSS**, ensuring responsive design and user-friendly experiences.\nImplemented scalable APIs for frontend-backend communication, ensuring seamless integrations across various services and maintaining high performance specifications with **99.9%** uptime.\nDelivered real-time analytics dashboards leveraging **React**, **D3.js**, and **Power BI Embedded**, enabling operations teams to quickly analyze transaction data and anomalies within **seconds** of occurrence.\nDesigned a fault-tolerant event-driven architecture with **Kafka**, **RabbitMQ**, and **Azure Service Bus**, facilitating asynchronous communication across critical workflows, including payments and alerts.\nDeveloped robust ETL pipelines for ingesting and processing financial data streams, efficiently managing data from both internal databases and third-party sources using **Python**, **Apache Airflow**, and **Azure Data Factory**, supporting both batch and near-real-time processing.\nEngineered and deployed machine learning models for fraud detection employing **scikit-learn**, **XGBoost**, and **Azure ML**, which empowered the system to identify 95% of suspicious activities based on historical data analysis.\nCreated and managed ML pipelines for real-time credit scoring and churn prediction, utilizing **MLflow** and **Airflow**, integrating model inference seamlessly into backend services for efficient processing."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Focused on **Python** for backend development, designing scalable APIs and web applications for a global e-commerce platform, optimizing performance across key modules like checkout and order fulfillment.\nUtilized **TypeScript** to develop and enhance frontend applications with frameworks like React (**18**), Vue (**3**), and Angular, delivering custom solutions for web and mobile platforms.\nEngineered high-performance integrations using **WebSocket** and event-driven architecture powered by **Kafka** and **RabbitMQ**, ensuring fault tolerance and real-time data updates for enhanced user experiences.\nImplemented security best practices through **OAuth 2.0** and role-based access control (RBAC) to maintain compliance with GDPR and ensure data protection for over **500,000** users.\nLeveraged **MongoDB**, **PostgreSQL**, **Redis**, and **Cassandra** to enable effective data storage strategies and customize performance enhancements, significantly reducing read pressure or improving access speeds by over **40%**.\nDeveloped customized, SEO-friendly e-commerce UIs with **Next.js**, ensuring accessibility compliance (WCAG **2.1**) and a mobile-first approach to increase engagement and user retention.\nConducted problem-solving and collaborative efforts to integrate **Stripe**, **PayPal**, and **Razorpay** for secure payment workflows, achieving PCI compliance and ensuring safe transactions for customers generating an annual revenue of over **$5 million**.\nImplemented feature flags and rollouts with **LaunchDarkly** and **Kubernetes**, optimizing deployment processes through A/B testing and risk mitigation strategies, impacting customer experience during platform updates significantly."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, TypeScript\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tAPIs, Integrations\n\n**Serverless and Cloud Functions:**\n\tAWS: ECS, Lambda, RDS, S3, Azure: App Services, Blob Storage, SQL Database\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS, Azure\n\n**Other:**\n\tWeb Applications, Scalability, Performance, Fault Tolerance, Security, Customization, Compliance, B2B SaaS, HR Tech, Temporal, Collaboration, Communication, Problem Solving",
  "apply_company": "Ben"
}