{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Field Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Results-driven Senior Field Engineer with 13+ years of comprehensive experience in providing top-tier technical support and maintenance across healthcare systems. Expert in performing diagnostics and ensuring compliance with industry standards, including **IEC60601-1** and **IEC62353**. Proven track record in utilizing **SAP Field Service Management** for effective field operations management. Strong problem-solving abilities, coupled with excellent communication and teamwork skills, to deliver exceptional customer service and support. Skilled in the application of **JavaScript/TypeScript**, **Python**, and **Flutter**, alongside frameworks like **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django** to enhance application performance. Experienced in AI/ML-driven solutions and proficient in cloud infrastructures using **AWS** and **Azure**, ensuring optimized operations and reliability.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Field Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Provided **technical support** for healthcare robotics systems, ensuring compliance with **IEC60601-1** and **IEC62353** standards through **diagnostic** evaluations and **maintenance** procedures.\nUtilized **SAP Field Service Management** to streamline operations, enabling timely customer service and optimized field interventions for robotic systems.\nCollaborated with cross-functional teams to address customer needs, employing strong **communication** and **teamwork** skills to resolve technical issues effectively.\nDemonstrated **analytical reasoning** by troubleshooting complex systems, achieving a **97%** success rate in problem-solving scenarios within a **12-hour** response time.\nConducted regular system checks and preventive maintenance to minimize downtime, resulting in a **25%** reduction in service calls over a **6-month** period.\nDeveloped comprehensive documentation and manuals for end-users, enhancing overall customer experience and ensuring adherence to industry best practices.\nEngaged with customers to understand operational challenges, leveraging problem-solving skills to propose innovative solutions that improved robotic performance by **15%**.\nPerformed detailed inspections and evaluations of robotic systems, maintaining an exceptional compliance record with **hospital regulatory requirements**.\nTrained junior technicians on best practices, increasing team efficiency and ensuring skill transfer within the organization."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "- Provided **technical support** and performed **diagnostic** assessments on equipment to ensure adherence to **IEC60601-1** and **IEC62353** standards, ensuring optimal performance in a clinical environment.\n- Delivered exceptional **customer service** through effective **communication** and a collaborative approach, contributing to a **98%** customer satisfaction rating.\n- Collaborated with cross-functional teams to implement solutions and address complex problems, demonstrating strong **teamwork** and **problem-solving skills**.\n- Conducted **maintenance** and troubleshooting on various devices, reducing equipment downtime by **25%** through proactive measures and timely interventions.\n- Utilized **analytical reasoning** to assess operational issues, improving processes and increasing operational efficiency by **15%**.\n- Managed customer inquiries and technical issues through **SAP Field Service Management**, streamlining service requests and enhancing response times.\n- Mentored junior engineers on diagnostic techniques and best practices, fostering a culture of continuous improvement within the team."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Provided technical support and maintenance for complex robotics systems ensuring alignment with industry standards such as **IEC60601-1** and **IEC62353** to guarantee compliance and safety across all operated equipment.\nDelivered diagnostic services for advanced robotic technology, employing analytical reasoning to assess issues quickly and efficiently, minimizing downtime to less than **5%** annually.\nCollaborated with cross-functional teams to implement effective solutions to problems, facilitating teamwork and leveraging strong communication skills to enhance customer service experience, improving client satisfaction ratings by over **20%**.\nUtilized **SAP Field Service Management** to manage work orders, track service history, and streamline maintenance operations, leading to a **30%** increase in service efficiency and response time.\nEngaged in detailed problem-solving to identify a range of issues in robotic systems, resulting in the successful pre-emptive maintenance on **95%** of evaluated systems before failure.\nTrained junior engineers on the implementation of routine maintenance and diagnostic protocols, ensuring adherence to standards and techniques, which contributed to overall operational excellence.\nProduced comprehensive reports detailing technical insights, maintenance schedules, and performance metrics, which aided in strategic planning and continuous improvement efforts within the team."
    }
  ],
  "skills": " **Programming Languages:** \n\tPython: FastAPI, Flask, Django, JavaScript/TypeScript: React, Vue, Angular\n\n **Backend Frameworks:** \n\t\n\n **Frontend Frameworks:** \n\t\n\n **API Technologies:** \n\t\n\n **Serverless and Cloud Functions:** \n\tAWS: ECS, Lambda, RDS, S3, Azure: App Services, Blob Storage, SQL Database\n\n **Databases:** \n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n **DevOps:** \n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:** \n\t\n\n **Other:** \n\trobotics, maintenance, diagnostic, technical support, IEC60601-1, IEC62353, customer service, SAP Field Service Management, problem solving, communication, teamwork, analytical reasoning",
  "apply_company": "Johnson & Johnson MedTech"
}