{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Security Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "As a Senior Security Engineer with 8 years of experience, I excel in Cloud Security and Security Architecture while effectively leveraging my expertise in IaaS and PaaS solutions. My proficiency in Threat Modeling, Risk Assessment, and implementing Security Standards ensures compliance with regulations such as FedRAMP and PCI-DSS. I have a solid background in Access Management including OAuth and Cloud SSO, Identity Provisioning, and Identity Governance. My hands-on experience with encryption techniques and key management contributes to developing robust security protocols.\nIn addition to my security-focused skills, I have a background in full-stack development, utilizing **JavaScript/TypeScript**, **Python**, and **Flutter**. I am proficient in building high-performance applications using **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**, alongside deep cloud experience in **Azure** and **AWS**. I have successfully led the development of enterprise-grade platforms integrating AI/ML for predictive analytics, and I have a strong foundation in CI/CD automation, microservices architecture, and event-driven systems. My analytical and communication skills empower me to work collaboratively in dynamic environments, while ensuring the highest levels of security are maintained.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Security Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Implemented security best practices in full-stack healthcare and financial platforms to ensure compliance with HIPAA, **PCI DSS**, and **FedRAMP** security standards.\nConducted **risk assessments** and **threat modeling** to identify vulnerabilities in applications developed using **TypeScript**, **Python (FastAPI)**, and **Node.js**.\nArchitected secure scalable deployment methodologies utilizing **Docker** and **Kubernetes (EKS/AKS)** for container orchestration, ensuring **IaaS** and **PaaS** are configured with cloud security measures.\nEstablished robust **access management** protocols through **OAuth** and **Cloud SSO**, enhancing user authentication and identity governance across diverse platforms.\nDesigned and managed **encryption** and **key management** strategies to safeguard sensitive data in transit and at rest, adhering to established security architecture patterns.\nAdvised cross-functional teams on best practices for **identity provisioning** and governance, enhancing overall cybersecurity posture across 9+ projects.\nCollaborated directly with stakeholders and developers using strong **communication skills** to foster a culture centered on security awareness and risk mitigation.\nStreamlined CI/CD pipelines while integrating security scans, linting, and test automation with tools like **GitHub Actions** and **CircleCI**, resulting in a **30%** reduction in deployment times.\nIntegrated comprehensive logging and monitoring solutions, leveraging **Firewalls** and **VPNs** to enhance network security and provide real-time alerts for suspicious activities.\nManaged the implementation of multiple security frameworks and compliance initiatives, efficiently aligning technology practices with regulatory mandates across **12+** systems.\nDeveloped educational materials and conducted workshops on **Cloud Security** and **Networking** fundamentals to improve team proficiency in maintaining secure application environments.\nEvaluated and improved existing security architecture to stay ahead of evolving threats and vulnerabilities, maintaining awareness of new cybersecurity trends and technologies."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "- Conducted **Risk Assessment** and **Threat Modeling** strategies to identify vulnerabilities within cloud-based environments, ensuring compliance with **FedRAMP**, **PCI-DSS**, and internal **Security Standards** for secure financial transactions.\n- Engineered robust **Cloud Security** frameworks using **Kubernetes** and **Docker** to facilitate secure deployment methodologies, enhancing threat detection and remediation protocols in applications serving over **100K** users.\n- Developed and maintained access management protocols utilizing **OAuth** and **Cloud SSO**, strengthening **Identity Provisioning** and **Identity Governance** to safeguard user credentials and enhance security posture.\n- Implemented **Encryption** and **Key Management** solutions for sensitive financial data, achieving compliance with **STIG** requirements and reinforcing data integrity across **20TB** of transaction records.\n- Managed comprehensive cybersecurity strategies, ensuring secure network configurations through the use of **VPN** and **Firewalls**, effectively reducing external threats by over **30%** within the first year.\n- Collaborated with cross-functional teams to document and communicate security policies, fostering a culture of security awareness and accountability within the organization, leading to improved compliance metrics by **25%**.\n- Analyzed security architecture to identify potential threats and recommend improvements, resulting in enhanced system resilience and performance across cloud infrastructures.\n- Led incident response drills that prepared teams for potential cybersecurity threats, reducing incident response time by **40%**, and enhancing overall organizational readiness."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Conducted thorough **Risk Assessments** to evaluate vulnerabilities and compliance within cloud-based systems, ensuring adherence to **PCI-DSS** and **FedRAMP** security standards across all infrastructure deployments.\nDeveloped and implemented security policies aligned with best practices in **Security Architecture** and **Threat Modeling**, focusing on enhancing **Cloud Security** measures for applications deployed in **IaaS** and **PaaS** environments.\nLeveraged **OAuth** and **Cloud SSO** solutions to optimize **Access Management**, facilitating a secure yet user-friendly authentication process across the platform for **9** distinct user types.\nDesigned and maintained **Identity Governance** frameworks to ensure effective **Identity Provisioning**, achieving a **95%** compliance rate with GDPR regulations by implementing secure access protocols and monitoring mechanisms.\nExecuted comprehensive **encryption** strategies and **key management** practices to safeguard sensitive data, resulting in a **30%** reduction in data breach incidents year over year.\nUtilized **Docker** and **Kubernetes** for deploying secure cloud applications, establishing **blue-green deployment** methodologies to mitigate risks during updates and improve system availability by **99.9%**.\nCollaborated with cross-functional teams to enhance networking and firewall configurations, fortifying infrastructure against potential cyber threats and ensuring optimal **VPN** setups for remote access.\nPresented security findings and recommendations to stakeholders, employing strong **communication skills** to convey complex technical concepts effectively, driving informed decision-making.\nApplied analytical skills to identify potential vulnerabilities, contributing to the continuous improvement of the security posture across the organization."
    }
  ],
  "skills": "**Programming Languages:**\n\tPython, JavaScript, TypeScript\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tOAuth, JWT\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, CI/CD & Infrastructure as Code (Terraform, Ansible, Helm, Docker Compose)\n\n**Cloud & Infrastructure:**\n\tIaaS, PaaS, Cloud Security, Security Architecture, Threat Modeling, Risk Assessment, Security Standards, Access Management, Cloud SSO, Identity Provisioning, Identity Governance, Encryption, Key Management, Cybersecurity, Deployment Methodologies, STIG, FedRAMP, PCI-DSS, VPN, Firewalls, Networking\n\n**Other:**\n\tAnalytical Skills, Communication Skills",
  "apply_company": "Oracle"
}