{
  "name": "Tomasz Lee",
  "role_name": "Senior Implementation Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Results-driven Senior Implementation Engineer with 9+ years of experience in software development and project management. Proficient in **Java**, **Python**, **SQL**, **Oracle**, **MySQL**, and **SQL Server** for backend development and database management. Demonstrated expertise in operating systems including **Unix**, **Linux**, and **Windows**, with strong skills in shell scripting. Effective communicator with a proven track record in leading cross-functional teams and managing complex projects. Original strengths include a background in **.NET**, **C#**, and **ReactJS**, enhancing versatility in both front-end and back-end development. Committed to optimizing processes and delivering high-quality software solutions.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Senior Implementation Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "• Leveraged **Java** and **Python** for backend development, ensuring high efficiency and maintainability of customer management solutions.\n• Conducted SQL database design and management across platforms like **Oracle**, **MySQL**, and **SQL Server** to optimize data retrieval processes, achieving a **20%** reduction in average query execution time.\n• Utilized **Unix** and **Linux** environments to enhance system performance and reliability for web-based applications.\n• Developed and maintained shell scripts for automation of repetitive tasks, improving deployment processes and system administration efficiency.\n• Implemented project management techniques to efficiently oversee the development lifecycle, ensuring on-time delivery and resource allocation efficiency.\n• Established clear communication with cross-functional teams to align project objectives and deliverables, enhancing overall project success rate.\n• Spearheaded the design and development of a web-based customer management platform using **.NET 7** and **ReactJS**, improving user satisfaction by **25%**.\n• Designed and implemented a microservices architecture using **.NET Core** to modularize the system for scalability and maintainability.\n• Integrated **Apache Kafka** for real-time data streaming and **RabbitMQ** for task queuing, resulting in improved system resilience and throughput.\n• Utilized **Redis** for caching frequently accessed data, reducing database load and improving response times by **35%**.\n• Developed RESTful APIs with **.NET**, integrated with a **MongoDB** database to provide seamless data access for various services.\n• Implemented CI/CD pipelines on **Azure DevOps**, reducing deployment time by **40%**.\n• Collaborated with UX/UI designers to enhance the platform’s user interface, leading to an improved user experience.\n• Developed a reporting engine using **D3.js** and **Three.js** for interactive data visualizations.\n• Implemented JWT-based authentication and authorization for securing the application."
    },
    {
      "role": "Software Engineer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "• Developed and maintained robust shell scripts for automation tasks across Linux and Unix environments, enhancing project efficiency by **20%**.\n• Implemented SQL queries in **Oracle**, **MySQL**, and **SQL Server** to facilitate effective data management and retrieval, improving database performance by **15%**.\n• Collaborated with cross-functional teams to gather system requirements and ensure seamless project management, contributing to a **25%** increase in project delivery speed.\n• Streamlined deployment processes through effective project management practices, leading to a reduction of deployment errors by **30%**.\n• Engaged in effective communication with stakeholders and team members to define project timelines and priorities, ensuring alignment with business objectives.\n• Enhanced team productivity by conducting code reviews and sharing best practices, leading to a **10%** decrease in production issues.\n• Applied strong programming skills in **Java**, **Python**, **C**, and **C++** to develop efficient software solutions tailored to project needs.\n• Leveraged tools like **Autosys** and **CA-7** for job scheduling and automation, optimizing job execution time by **15%**.\n• Utilized project management tools to track progress and adhere to deadlines, ensuring consistent project updates and stakeholder involvement."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "Utilized **SQL Server** and **Oracle** to manage and optimize databases, enhancing data retrieval efficiency by **30%**.\nImplemented **shell scripting** to automate repetitive tasks, resulting in a processing time reduction of **15%** across various projects.\nDeveloped and executed project management strategies to effectively coordinate efforts within cross-functional teams, ensuring timely delivery of deliverables.\nCollaborated in the migration of legacy systems to new technologies, including **Java** and **Python**, improving system maintainability and performance.\nConducted communication with stakeholders to gather requirements and ensure alignment with project goals.\nPerformed rigorous testing on **MySQL** and **CA-7** systems to maintain data integrity and system robustness.\nContributed to code reviews and daily standups to foster team synergy and adherence to best practices in engineering.\nLeveraged **Unix** and **Linux** environments for system development, enhancing software deployment and version control efficiency.\nDeveloped robust solutions in **C** and **C++** for high-performance applications, contributing to a project completion rate of **98%** on schedule."
    }
  ],
  "skills": "**Programming Languages**\n\tJava, Python, C, C++, JavaScript, TypeScript\n\n**Backend Frameworks**\n\tNodeJS, ExpressJS, NestJS, C#, .NET, Entity Framework, Microservices\n\n**Frontend Frameworks**\n\tReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n**API Technologies**\n\tRESTful API, GraphQL\n\n**Serverless and Cloud Functions**\n\tAWS, Azure\n\n**Databases**\n\tMSSQL Server, SQL, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB, Oracle\n\n**DevOps**\n\tCI/CD pipelines\n\n**Cloud & Infrastructure**\n\tUnix, Linux, Windows, shell scripting\n\n**Other**\n\tUX/UI Design, Git, GitHub, Messaging & Caching: Apache Kafka, RabbitMQ, Redis, Testing Tools: NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest, Blockchain: Solidity, Ether.js, Web3.js, Ethereum, Autosys, UAC, CA-7, project management, communication",
  "apply_company": "Stonebranch"
}