{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Backend Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Experienced Senior Backend Engineer with 13+ years of expertise in delivering high-performance applications, primarily focused on backend development. Proficient in **C#**, **JavaScript**, and **TypeScript**, with extensive knowledge of **Kubernetes**, **Docker**, and cloud services such as **Azure**. Solid experience in Infrastructure as Code using **Bicep** and **Terraform**, coupled with a strong foundation in Agile methodologies and SCRUM practices.\n\nSkilled in building scalable architectures and implementing microservices, facilitating efficient teamwork and adaptability in fast-paced environments. Known for strong problem-solving abilities and experience in developing compliance-driven solutions within the healthcare and financial industries. Well-versed in deploying cloud-native systems, and leveraging AI/ML technologies for predictive analytics and real-time processing.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Backend Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Utilized **C#**, **JavaScript**, and **TypeScript** to develop robust backend systems, emphasizing high-quality code and adherence to Agile methodologies.\nImplemented **Infrastructure as Code** using **Bicep** and **Terraform** to streamline deployment processes and enhance infrastructure management across multiple environments.\nEmployed **Docker** and **Kubernetes** for containerization and orchestration of applications, resulting in improved scalability and reliability in cloud environments like **Azure**.\nCollaborated with cross-functional **Agile** teams during Spring Planning and reviews, enhancing teamwork and adaptability within the project.\nLed problem-solving sessions to address system bottlenecks, ensuring optimal performance and uptime, with metrics tracked on a quarterly basis.\nFocused on maintaining developer productivity by creating and enforcing robust coding standards and best practices in unit testing using tools like **Jest** and **PyTest**.\nEngaged in continuous integration and deployment cycles, with emphasis on automated testing and deployment workflows to ensure smooth transitions between production releases.\nSupported the transition to microservices, enhancing system flexibility and response to changing business needs, with over **75%** of services re-architected within **6 months**.\nDefined testing strategies that resulted in **30%** reduction in post-release defects, specifically through enhanced end-to-end testing frameworks and CI/CD integration.\nDeveloped data processing pipelines that processed up to **100,000** records per hour, applying optimal design patterns and techniques to maintain efficiency and reliability."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "• Leveraged **C#** to develop and optimize backend services, improving overall system performance by **25%** in transaction processing speed.\n• Implemented **Infrastructure as Code** using **Terraform** and **Bicep** to automate cloud resource provisioning on **Azure**, reducing deployment times by **40%**.\n• Collaborated in an **Agile** environment, participating in daily **SCRUM** meetings to enhance team communication and project delivery.\n• Designed containerized applications using **Docker** and orchestrated services with **Kubernetes**, achieving increased scalability and reliability.\n• Developed robust APIs with **JavaScript** and **TypeScript**, integrating seamlessly with front-end applications to deliver a cohesive user experience.\n• Contributed to team success through effective problem-solving approaches and fostering a collaborative team environment, which led to a **15%** increase in project completion rates.\n• Showcased adaptability by quickly learning and implementing new technologies to meet evolving project requirements and client needs."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "• Developed and maintained robust backend services using **C#** in conjunction with **Kubernetes**, **Docker**, and **Azure**, focusing on high availability and scalability.\n• Implemented Infrastructure as Code (IaC) practices utilizing **Terraform** and **Bicep** to streamline deployments and manage cloud resources effectively.\n• Leveraged Agile methodologies and SCRUM processes to ensure efficient team collaboration and adaptive project management, delivering high-quality software solutions on-time.\n• Engaged in proactive problem-solving to identify system inefficiencies, resulting in performance improvements of over **30%** in throughput.\n• Collaborated with cross-functional teams to enhance software features, ensuring seamless integration and user experience across platforms.\n• Maintained and optimized API services that supported multiple applications, processing an average of **100,000** requests per hour with minimal latency.\n• Executed secure application designs applying best practices, including role-based access control (RBAC) and OAuth 2.0 for data protection and compliance regulations.\n• Adapted to changing requirements and project scopes, demonstrating strong adaptability and teamwork skills in fast-paced environments.\n• Conducted regular code reviews and mentored junior developers, fostering a culture of continuous learning and improvement within the team."
    }
  ],
  "skills": " **Programming Languages:**\n\tC#, JavaScript, TypeScript, Python\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n **Frontend Frameworks:**\n\tReact, Vue, Angular\n\n **API Technologies:**\n\tKeycloak (OIDC, RBAC), OAuth2, JWT\n\n **Serverless and Cloud Functions:**\n\tAWS: ECS, Lambda, RDS, S3\n\tAzure: App Services, Blob Storage, SQL Database\n\n **Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD\n\n **Cloud & Infrastructure:**\n\tTerraform, Ansible, Helm, Docker Compose, Bicep\n\n **Other:**\n\tMLflow, Airflow, Kubeflow, Agile, SCRUM, Problem Solving, Teamwork, Adaptability",
  "apply_company": "DocuWare"
}