{
  "name": "Rei Taro",
  "role_name": "Senior AI Engineer",
  "email": "rei515@outlook.com",
  "phone": "+48732529451",
  "address": "Warszawa, Poland",
  "linkedin": "https://www.linkedin.com/in/rei-taro-81a410391/",
  "profile_summary": "Results-driven Senior AI Engineer with over 10 years of experience, specializing in LLM technologies and **LangChain** integration to build cutting-edge AI solutions. Skilled in **prompt engineering**, **Retrieval-Augmented Generation**, and fine-tuning models for optimal performance using **Python**. Proficient in managing **data pipelines** and engineering data for large datasets, leveraging cloud platforms like **AWS**, **GCP**, and **Azure**. Demonstrated ability to implement **MLOps** practices to ensure seamless deployment and operational efficiency. Strong foundations in **NLP** and embedding techniques, with a focus on establishing **evaluation frameworks** to enhance model performance. Recognized for leading innovative projects at esteemed organizations including VISA and Reply Polska, while maintaining a commercial awareness and a startup mindset to drive impactful solutions.",
  "education": [
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2010",
      "to_year": "2015",
      "location": "Japan",
      "university": "Keio University"
    }
  ],
  "experience": [
    {
      "role": "Senior AI Engineer",
      "company": "Leobit",
      "from_date": "Aug 2022",
      "to_date": "Present",
      "location": "Poland",
      "responsibilities": "Leveraged LLMs and **LangChain** to develop prompt engineering strategies that enhance model performance in production.\nApplied **Python** to implement efficient **MLOps** practices, enhancing model deployment cycles by **30%**.\nUtilized **cloud services** including **AWS**, **GCP**, and **Azure** to architect scalable solutions for large datasets, ensuring system reliability and performance.\nEngineered data pipelines for continuous integration of **Retrieval-Augmented Generation** and improved data processing using **fine-tuning** techniques.\nDeveloped and maintained feedback loops and evaluation frameworks for robust **NLP** model assessments, leading to a **25%** increase in model accuracy.\nCollaborated with cross-functional teams to guide the successful integration of **embeddings** into workflows, enhancing user experience through innovative solutions.\nEmployed a startup mindset to innovate and adapt quickly to evolving material needs, ensuring relevance in competitive markets."
    },
    {
      "role": "Software Engineer",
      "company": "Innovature",
      "from_date": "Nov 2018",
      "to_date": "Jun 2022",
      "location": "Japan",
      "responsibilities": "Implemented large-scale AI models leveraging **LLM**, **LangChain**, and **LlamaIndex** to enhance natural language processing capabilities and improve user interactions.\nExecuted **prompt engineering** techniques to optimize responses in AI-driven applications, resulting in a **30%** increase in user satisfaction metrics.\nDeveloped scalable data pipelines using **Python** and **Apache Airflow** to manage and process **large datasets**, ensuring efficient data handling and compliance with industry standards.\nUtilized **Azure** and **AWS** for deploying state-of-the-art AI models, achieving an uptime of **99.9%** while optimizing costs through effective resource management.\nConducted **evaluations** and **fine-tuning** of models based on performance metrics, leveraging **feedback loops** to continuously improve output accuracy and relevance.\nCollaborated with cross-functional teams to drive **MLOps** practices, ensuring smooth integration of AI features into production systems and facilitating **data engineering** processes for enhanced operational efficiency.\nMaintained a **startup mindset** by adapting to changing project requirements and implementing cost-effective solutions to achieve business objectives."
    },
    {
      "role": "Software Developer",
      "company": "Wizcorp",
      "from_date": "Apr 2015",
      "to_date": "Nov 2018",
      "location": "Japan",
      "responsibilities": "Utilized **Python** to develop and optimize data pipelines for large datasets, ensuring efficient data processing and retrieval workflows required for advanced **NLP** projects.\nImplemented advanced **LLM** techniques using **LangChain** and **LlamaIndex** to enhance model performance and reliability in real-time environments.\nEmployed **prompt engineering** and **Retrieval-Augmented Generation** strategies to refine user queries and improve information retrieval accuracy by **30%**.\nIntegrated **AWS**, **GCP**, and **Azure** cloud services to deploy scalable machine learning models, improving operational efficiency and reducing deployment time by **25%**.\nDesigned feedback loops and evaluation frameworks that facilitated model fine-tuning and enhanced adaptability, resulting in a **15%** increase in user engagement metrics.\nCollaborated with cross-functional teams to ensure commercial awareness and a startup mindset in all design and implementation processes, passing key project milestones ahead of schedule by **20%**.\nConducted extensive data engineering practices to build robust data pipelines, streamlining operations and reducing latency for real-time data analysis by leveraging modern **MLOps** techniques."
    }
  ],
  "skills": "**Programming Languages**\n\tPython (3.8+), SQL, Bash, JavaScript\n\n**Backend Frameworks**\n\tFastAPI, Flask, Django, Celery\n\n**Frontend Frameworks**\n\t\n\n**API Technologies**\n\tREST/gRPC APIs, Microservices, Kafka\n\n**Serverless and Cloud Functions**\n\tAWS (EC2, S3, Lambda), Azure, GCP\n\n**Databases**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps**\n\tDocker, Kubernetes, GitHub Actions, Azure DevOps, CI/CD, PyTest, Git\n\n**Cloud & Infrastructure**\n\tAWS, Azure, GCP\n\n**Other**\n\tLLM, LangChain, LlamaIndex, prompt engineering, Retrieval-Augmented Generation, fine-tuning, embeddings, NLP, evaluation frameworks, MLOps, data engineering, data pipelines, large datasets, feedback loops, commercial awareness, startup mindset",
  "apply_company": "Nory"
}