{
  "name": "Tomasz Lee",
  "role_name": "Senior Backend Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Results-driven Senior Backend Engineer with 9+ years of experience in developing scalable applications using **Golang**, **PostgreSQL**, and **Redis**. Proficient in building microservices and API integration, ensuring clean, testable, and maintainable code. Experienced in utilizing **Kubernetes** for efficient deployment and management of applications on **Google Cloud Platform**. Strong communication skills facilitate effective collaboration across teams and independent work. Demonstrated ability to streamline development processes, optimize performance, and lead successful project completions.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Senior Backend Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Utilized **PostgreSQL** for efficient data storage and retrieval, enhancing database performance by **30%**.\nImplemented a **microservices** architecture using **Golang**, ensuring scalability and maintainability of applications.\nDeveloped and integrated **RESTful APIs** to facilitate seamless communication between services while adhering to **clean code** principles.\nLeveraged **Redis** for optimized caching of data, contributing to a **35%** reduction in response times.\nDeployed containerized applications using **Kubernetes**, streamlining orchestration and management of applications in production.\nCollaborated in a CI/CD environment using **GitLab**, resulting in a **40%** reduction in deployment times.\nEngaged in continuous integration practices, ensuring all code is **testable** and maintainable with a focus on quality.\nCommunicated effectively across teams, enhancing collaboration and project understanding, showcasing **strong communication skills**.\nDeveloped comprehensive system documentation to support **independent work** and knowledge transfer among team members.\nMaintained a high-standard code repository, ensuring all code adheres to industry best practices for **maintainable code**."
    },
    {
      "role": "Full Stack Developer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "• Developed and maintained APIs using **Golang** integrated with **PostgreSQL**, enhancing data access speed by **20%**.\n• Designed microservices architecture optimizing service interactions and scalability, utilizing **Kubernetes** for orchestration and management.\n• Implemented caching strategies with **Redis** resulting in a **30%** reduction in query response time.\n• Authored clean, testable, and maintainable code following software development best practices to ensure project longevity.\n• Led CI/CD practices using **GitLab**, improving deployment frequency by **40%** and reducing lead time for changes.\n• Collaborated with the team to migrate on-premise applications to **Google Cloud Platform**, achieving a **50%** decrease in infrastructure costs.\n• Conducted performance tuning on databases, optimizing queries in both **PostgreSQL** and **Redis** for improved latency.\n• Communicated effectively with cross-functional teams to gather project requirements, fostering strong stakeholder relationships.\n• Mentored junior developers on best coding practices and microservices design principles, enhancing overall team output by **25%**.\n• Created comprehensive documentation for developed systems to facilitate knowledge sharing within the team."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "• Developed and maintained microservices architecture to enhance system scalability and performance, resulting in a **30%** reduction in response time.\n• Utilized **Golang** for backend development, ensuring robust and maintainable code for high-traffic applications.\n• Implemented **PostgreSQL** for database management, significantly boosting query efficiency by **25%**.\n• Leveraged **Redis** for caching solutions, improving data retrieval speeds and reducing load times by **15%** during peak hours.\n• Deployed applications on **Kubernetes** for container orchestration, enhancing deployment and scalability capabilities across projects.\n• Integrated APIs for seamless data communication with third-party services, promoting interoperability and improving service efficiency.\n• Collaborated with cross-functional teams using **GitLab** for version control, fostering independent work and enhancing team coordination.\n• Adhered to clean code and testable practices, ensuring high code quality and maintainability throughout the development process.\n• Communicated effectively with team members and stakeholders to convey project updates and gather requirements, supporting strong team alignment.\n• Engaged in daily scrums and actively participated in code reviews to uphold coding standards and align with project goals.\n• Provided detailed technical documentation and user guides, facilitating knowledge transfer and onboarding for new team members."
    }
  ],
  "skills": " **Programming Languages** \n\t Golang, Python, JavaScript, TypeScript \n\n **Backend Frameworks** \n\t NodeJS, ExpressJS, NestJS, C#, .NET, Entity Framework, Microservices \n\n **Frontend Frameworks** \n\t ReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS \n\n **API Technologies** \n\t RESTful API, GraphQL, API integration \n\n **Serverless and Cloud Functions** \n \n **Databases** \n\t MSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB \n\n **DevOps** \n\t AWS, Azure, Kubernetes, CI/CD pipelines, GitLab \n\n **Cloud & Infrastructure** \n\t Google Cloud Platform \n\n **Other** \n\t UX/UI Design, Git, GitHub, Redis, Apache Kafka, RabbitMQ, Blockchain, Solidity, Ether.js, Web3.js, Ethereum, Testing Tools: NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest, clean code, testable code, maintainable code, independent work, strong communication skills"
}