{
  "name": "Patryk Zaslawski",
  "role_name": "Senior Software Engineer",
  "email": "patrykzas0428@outlook.com",
  "phone": "+48669862402",
  "address": "Gdanski, Poland",
  "linkedin": "https://www.linkedin.com/in/patryk-z-9b9455391/",
  "profile_summary": "As a dedicated Senior Software Engineer with 8+ years in software engineering, I deliver high-performance solutions leveraging modern technologies. Proficient in **Java**, **SpringMVC**, and **Springboot**, I specialize in developing robust applications tailored to diverse business needs. My experience extends to cloud services including **AWS** (SNS, S3, RDS, ECS, EKS, Lambda) and I am skilled in **SQL** for database management. I also bring expertise in **ApacheKafka**, **CloudFormation**, and CI/CD processes to streamline development workflows. In addition to my backend proficiency, I am committed to implementing efficient SDLC strategies and test automation to ensure high-quality software delivery. My background incorporates designing enterprise-grade systems with a strong focus on microservices architecture and API development, making me adaptable across various sectors including e-commerce and healthcare.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2014",
      "to_year": "2017",
      "location": "United Kingdom",
      "university": "The University of Manchester"
    }
  ],
  "experience": [
    {
      "role": "Senior Software Engineer",
      "company": "Binary Studio",
      "from_date": "Aug 2023",
      "to_date": "Present",
      "location": "United Kingdom (Remote)",
      "responsibilities": "- Developed and maintained scalable, cloud-native applications using **Java** frameworks including **SpringMVC** and **Springboot**, ensuring high performance and reliability.\n- Designed and implemented CI/CD pipelines for automated testing and deployment processes, leveraging services like **AWS CodePipeline** and **CloudFormation** to streamline software delivery in line with **SDLC** methodologies.\n- Integrated **AWS services** such as **SNS**, **S3**, **RDS**, and serverless computing with **Lambda** to enhance functionality and reduce operational overhead.\n- Built robust data storage solutions with **SQL** databases, optimizing for performance and scalability, and ensuring quick retrieval and management of data.\n- Collaborated with cross-functional teams to develop event-driven microservices using **Apache Kafka**, facilitating real-time data processing and messaging.\n- Led the development of automated test strategies using **test automation** frameworks, improving code quality and reducing regression issues by **30%**.\n- Spearheaded the migration of legacy applications to cloud-based environments using **ECS** and **EKS**, improving application availability and scalability by **50%**.\n- Mentored junior engineers in best practices of **Java** development, **Spring** frameworks, and cloud technologies, promoting knowledge sharing and skill enhancement.\n- Ensured compliance with industry standards through comprehensive unit and integration testing, achieving a **95%** test coverage across the codebase.\n- Championed the use of effective **CI/CD** tools such as **Jenkins** and **GitHub Actions** for seamless and efficient software workflow management."
    },
    {
      "role": "Software Engineer",
      "company": "Ardigen",
      "from_date": "Mar 2020",
      "to_date": "Aug 2023",
      "location": "Poland",
      "responsibilities": "• Developed enterprise-level applications utilizing **Java** and **Spring Boot** frameworks, enhancing overall application performance and maintainability.\n• Designed and implemented RESTful APIs with **Spring MVC**, ensuring efficient communication between frontend and backend systems.\n• Managed cloud-based infrastructure using **AWS** services such as **Amazon RDS** for database management, **AWS Lambda** for serverless computing, and **Amazon S3** for scalable storage solutions.\n• Built containerized applications using **ECS** and **EKS**, enabling **Kubernetes** orchestration for improved deployment strategies and resource management.\n• Spearheaded the integration of **Apache Kafka** for event-driven architecture, capable of processing over **1 million** transactions per minute, significantly enhancing data processing capabilities.\n• Developed automated CI/CD pipelines with **CloudFormation**, ensuring consistent deployment of applications and reducing release times by **30%**.\n• Conducted comprehensive testing automation utilizing **JUnit** and **Selenium**, improving code quality and reducing production bugs by **25%**.\n• Collaborated in the software development life cycle (SDLC) by participating in scrum meetings, contributing to sprint planning, and delivering quality features on schedule.\n• Built centralized logging and monitoring solutions using technologies like **ELK Stack**, facilitating proactive issue identification and resolution.\n• Implemented secure, scalable, and compliant microservices architectures that enable **multitenancy** and support seamless integration with third-party services.\n• Optimized SQL queries in various databases, ensuring high performance and availability in transactional data access and storage.\n• Participated in code reviews and provided mentorship to junior developers, fostering a collaborative team environment and promoting best practices in software development."
    },
    {
      "role": "Software Engineer",
      "company": "Altum Software",
      "from_date": "Oct 2017",
      "to_date": "Feb 2020",
      "location": "United Kingdom",
      "responsibilities": "Designed and optimized backend architectures for enterprise applications using **Java** (SpringMVC, Springboot), enhancing performance by **30%** and ensuring maintainability across modules.\nDeveloped robust RESTful APIs in **Java** to manage high-volume transactions, achieving **30%** faster integration between frontend and backend services.\nLeveraged **AWS** components such as **RDS**, **SNS**, and **S3** for scalable and reliable database solutions, improving data accessibility by **25%**.\nBuilt containerized applications using **ECS** and **EKS**, streamlining deployment processes and ensuring scalability under peak loads.\nImplemented CI/CD strategies using **CloudFormation**, **AWS CodePipeline**, and **Jenkins**, reducing deployment time by **50%** and enhancing team collaboration.\nApplied **Apache Kafka** for real-time event streaming, improving order processing times and ensuring reliable communication within microservices.\nAutomated testing processes with **testautomation** tools, leading to a reduction in regression bugs by **40%** and enhancing overall software quality.\nConducted thorough SDLC practices, from requirement gathering to deployment, ensuring adherence to timelines and project specifications.\nDesigned integration solutions for third-party services using **AWS Lambda** functions, facilitating seamless data exchange and reducing latency in transactions.\nOptimized SQL queries for relational database management, enhancing data retrieval efficiency and reducing load times.\nConducted performance testing with tools like **JMeter**, identifying bottlenecks and fine-tuning applications to handle growth.\nDeveloped logging and monitoring solutions using **AWS CloudWatch**, crucial for maintaining application health and performance tracking.\nLed cross-functional teams (up to **9 members**) in agile environments, fostering effective communication and collaboration on projects."
    }
  ],
  "skills": "**Programming Languages**\n\tJava, Python\n\n**Backend Frameworks**\n\tSpring Boot, SpringMVC, FastAPI, Django, Flask\n\n**Frontend Frameworks**\n\tAngular (1–16), React (15–18), Next.js, Vue.js (2/3), Blazor\n\n**API Technologies**\n\tREST & gRPC APIs\n\n**Serverless and Cloud Functions**\n\tAWS Lambda\n\n**Cloud & Infrastructure**\n\tAWS (ECS, RDS, S3), Azure (App Services, Blob, SQL)\n\n**DevOps**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, CloudFormation, CI/CD\n\n**Databases**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis, SQL\n\n**Other**\n\tKeycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, Celery, Pydantic, ApacheKafka, SDLC, testautomation",
  "apply_company": "Mercell"
}