{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Android Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Results-driven Senior Android Engineer with 13+ years of experience in developing high-performance applications, specializing in **Kotlin**, **Android SDK**, and **Java**. Proficient in **Bluetooth LE** development and comfortable with **Coroutines**, **RxJava**, and various **debugging tools**. Strong understanding of **Android architecture**, along with hands-on capabilities in **C** and **C++** for optimizing mobile applications.\nAdditionally, I possess a solid background in cloud technologies and experience delivering quality applications across healthcare and financial sectors. Equipped with **JavaScript/TypeScript**, **Python**, and expertise in frameworks such as **React**, **Node.js**, and **FastAPI**. Experienced with compliance standards like HIPAA and PCI DSS, capable of aligning mobile solutions with industry regulations. Excellent communication skills in English, facilitating effective collaboration and project success.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Android Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Utilized **Android SDK** and **Kotlin** to design and develop high-performance mobile applications for Android, ensuring adherence to Android architecture best practices and user experience standards.\nImplemented robust debugging strategies and tools to troubleshoot and optimize application performance, achieving a **30% increase** in responsiveness across applications.\nConducted unit testing and implemented testing frameworks to enhance code quality, achieving **95% coverage** across critical functionality.\nCollaborated within an Agile team to deliver features on schedule, enhancing communication strategies in **English** for seamless information exchange with non-technical stakeholders.\nIntegrated **Bluetooth LE** capabilities within applications to improve connectivity and user interaction with smart devices.\nCreated functional specifications and documentation for application features, ensuring clarity and comprehensiveness for both technical teams and end-users.\nStreamlined application build processes using **Make**, **CMake**, and **Soong**, reducing build times by **40%** through optimization techniques.\nLeveraged **Coroutines** and **RxJava** to manage asynchronous programming effectively, resulting in smoother user experiences and reduced app crashes.\nEmployed ADB for application deployment and testing on real devices, ensuring thorough verification before production release.\nProvided mentorship and guidance to junior developers, fostering a culture of learning and collaboration within the team to elevate overall output quality."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Developed and optimized Android applications using **Kotlin** and **Java**, ensuring high performance through efficient coding practices and unit testing to enhance user experience.\nDesigned and implemented features within the **Android SDK**, utilizing **Coroutines** and **RxJava** for seamless asynchronous operations, leading to improved application responsiveness.\nLed the integration of **Bluetooth LE** functionalities, allowing devices to communicate efficiently and enhancing user connectivity through innovative features.\nUtilized **CMake** and **Make** for build optimization, facilitating smoother deployment processes across various device types and operating system versions.\nParticipated in code reviews via **Gerrit**, ensuring adherence to best practices while mentoring junior developers on **Android architecture** principles.\nDeveloped HAL (Hardware Abstraction Layer) components to improve hardware interaction and utilized **debugging tools** to troubleshoot issues effectively, achieving a reduction in bug reports by **30%**.\nConducted performance testing and optimizations, achieving a **25%** enhancement in application loading time by implementing effective management strategies within the application lifecycle.\nEffectively communicated technical concepts in English, collaborating cross-functionally with teams to align on project goals and deliverables, ensuring the successful launch of applications within **6 months**."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "- Developed and optimized **Android SDK** applications leveraging **Kotlin** and **Java** to ensure robust performance and scalability in line with modern **Android architecture** standards.\n- Employed **Coroutines**, **RxJava**, and **debugging tools** to enhance asynchronous programming, optimize resource management, and facilitate error resolution, contributing to a seamless user experience with a **99.9% application uptime**.\n- Designed and implemented **Bluetooth LE** capabilities for efficient device communication, enabling **real-time data exchange** and enhancing the functionality of mobile apps.\n- Integrated unit testing frameworks to ensure high code quality and maintained a code coverage of over **85%**, supporting continuous integration and deployment practices.\n- Collaborated on the build process using **CMake** and automated builds with **Soong** and **Make** to facilitate efficient development workflows and promote scalability across projects.\n- Engaged in proactive performance debugging on **Linux** platforms, addressing memory leaks and optimizing processing speed, achieving at least a **30% improvement** in application performance metrics.\n- Utilized **ADB** for effective application testing and debugging, conducting regular code reviews through **Gerrit** to maintain development standards.\n- Ensured all features adhered to high standards of user accessibility and compliance, leveraging strong English communication skills to work cross-functionally with design and product teams."
    }
  ],
  "skills": "**Programming Languages:**\n\tPython, JavaScript/TypeScript, Kotlin, C, C++, Java\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tNginx, OAuth2, JWT\n\n**Serverless and Cloud Functions:**\n\tAWS: Lambda, ECS, S3\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS: RDS, Azure: App Services, Blob Storage, SQL Database\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, Android SDK, Bluetooth LE, Coroutines, RxJava, ADB, Linux, Soong, Make, CMake, debugging tools, Android architecture, unit testing, Gerrit, English communication",
  "apply_company": "co.brick"
}