{
  "name": "Damian Franciszek Pospiech",
  "role_name": "C++ Developer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-187801395/",
  "profile_summary": "C++ Developer with 13+ years of experience in delivering high-performance, multithreaded applications within compliance-driven environments. Proficient in **C++ 17**, **STL**, **Boost**, and experienced in **C#** for developing robust software solutions on both **Windows** and **Linux** platforms. Strong background in network programming and algorithm design, ensuring efficient and effective software development. Leveraging a solid foundational knowledge in database management systems including **PostgreSQL** and **MS SQL Server**. Excellent command of English, enabling clear communication of complex ideas.\n\nOriginally skilled in **JavaScript/TypeScript**, **Python**, and **Flutter**, with hands-on expertise in **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django** for full stack development. Proven experience in building AI/ML-powered platforms that support predictive analytics and real-time processing, deploying applications in cloud environments such as **AWS** and **Azure**, and creating microservices and CI/CD pipelines.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "C++ Developer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Developed high-performance, multithreaded applications utilizing **C++ 17**, focusing on efficient algorithms and data structures to enhance application speed and reliability.\nImplemented robust data storage solutions with **PostgreSQL** and **MS SQL Server**, ensuring optimal data retrieval and management for both Windows and Linux environments.\nLeveraged **Boost** libraries for improved functionality and performance in network programming tasks, maximizing application efficiency.\nDesigned and developed scalable applications for both **Windows** and **Linux**, integrating cross-platform functionality to meet diverse user needs.\nUtilized advanced knowledge of algorithms to optimize data processing and memory management, ensuring that applications run smoothly under high-load scenarios.\nCollaborated effectively in English to communicate complex technical concepts and design strategies with team members and stakeholders.\nConducted thorough testing and debugging processes on developed applications to identify performance bottlenecks and implement necessary optimizations.\nEngaged in code reviews to ensure best practices and coding standards are upheld, fostering a culture of continuous improvement within the development team.\nResearched and applied new libraries and frameworks to enhance functionality and maintainability of C++ applications within the tech stack."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Developed high-performance multithreaded applications using **C++ 17**, optimizing algorithms for efficiency and speed within financial services.\nUtilized **STL** and **Boost** libraries to enhance application functionality and streamline development processes, enhancing overall code quality and maintainability.\nImplemented database solutions using **PostgreSQL** and **MS SQL Server**, ensuring robust data management and retrieval for high-volume transactions.\nApplied network programming techniques to enhance system communication across platforms, improving integration between services and reliability of financial transactions.\nCollaborated in a mixed-environment (Windows and Linux) development team, implementing solutions that promote cross-platform compatibility and performance tuning.\nDemonstrated English proficiency in technical documentation and stakeholder communication, facilitating knowledge sharing and effective collaboration across teams.\nConducted performance evaluations and optimizations of existing codebases, leading to a **30%** improvement in application response time.\nDesigned algorithms tailored for specific financial challenges, achieving a **40%** reduction in processing times for critical transactions."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Utilized **C++ 17** to design and implement robust multithreaded applications that enhance performance and efficiency, adhering to best practices in software development.\nEmployed **Boost** and **STL** libraries for efficient data structures and algorithms, achieving a reduction in runtime complexity by **30%** across key system components.\nDeveloped network programming solutions that enabled seamless communication between services on **Windows** and **Linux** environments, ensuring high reliability and efficiency.\nManaged database interactions with **PostgreSQL** and **MS SQL Server**, optimizing queries and schema for improved data retrieval performance by **25%**.\nCollaborated in a cross-functional team, showcasing strong **English proficiency** to convey technical concepts and facilitate discussions in agile sprints.\nImplemented efficient algorithms to solve complex data processing challenges, leading to a performance improvement of up to **40%** in computational tasks.\nConducted thorough code reviews and testing, ensuring adherence to quality standards and facilitating the integration of features in a controlled manner.\nParticipated in the whole software development lifecycle, contributing ideas and insights from design to deployment phases, enhancing team productivity and project outcomes."
    }
  ],
  "skills": "Programming Languages:\n\tC++, C#, Python, JavaScript/TypeScript\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tOAuth2, JWT\n\n**Serverless and Cloud Functions:**\n\tAWS: Lambda, Azure: App Services\n\n**Databases:**\n\tPostgreSQL, MS SQL Server, MySQL, MongoDB, Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS: ECS, RDS, S3, Azure: Blob Storage, SQL Database\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), Nginx, Let’s Encrypt, Certbot, Linux, Windows, Multithreaded applications, Network programming, Algorithms, English proficiency"
}