{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Marketing Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Senior Marketing Engineer with 13+ years of experience in building high-performance applications and marketing solutions. Expertise in **Python**, **Node.js**, and REST API development, integrating advanced analytics into customer engagement tools. Proficient in handling marketing automation platforms such as **Customer.io**, **HubSpot**, **Make.com**, **Zapier**, **Segment**, and analytics tools like **Mixpanel**, **PostHog**, and **GA4**. Strong skills in data visualization and reporting with **Looker Studio** and comprehensive experience in using **Google Tag Manager** for effective tracking. \n\nDemonstrated ability to deploy cloud-native systems on **AWS** and **Azure**, ensuring robust integration with microservices and event-driven architectures. Skilled in applying compliance-driven approaches for marketing strategies, while leveraging **OpenAI** and **Claude** for innovative solutions. Deep understanding of AI/ML frameworks includes proficiency in model orchestration with **LangChain**, **CrewAI**, and **AutoGen**. \n\nRecognized for delivering impactful results across healthcare and financial industries, driven by a solid foundation in front-end and back-end development using **React**, **Next.js**, and **Django** among others.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Marketing Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Utilized **Python** and **Node.js** to design and build integrated marketing platforms focusing on customer engagement and analytics with tools such as **Customer.io**, **HubSpot**, **Segment**, and **Mixpanel**. \nCollaborated with cross-functional teams to implement marketing automation strategies leveraging **Zapier** and **Make.com** for seamless workflows, achieving a **30%** increase in lead conversion rates. \nDeveloped real-time analytics dashboards using **Looker Studio** and **GA4**, enabling data-driven decision-making by visualizing key marketing metrics across various channels. \nEnhanced user experience through optimized landing pages built with **Webflow** and **Unbounce**, resulting in a **15%** improvement in user engagement and retention. \nIntegrated behavioral tracking solutions using **PostHog** and **Google Tag Manager**, successfully identifying user patterns and improving targeting strategies, which contributed to a **25%** increase in email open rates. \nBuilt and maintained REST APIs for data integration, ensuring compatibility with external data sources and tools, alongside version control using **Git** for efficient code management across projects. \nImplemented A/B testing strategies to refine marketing campaigns, utilizing tools like **AutoGen** and consumer insights models from **OpenAI** to enhance testing outcomes and optimize marketing effectiveness. \nConducted thorough analysis of campaign performance, leveraging insights from **Mixpanel** and **Customer.io** to inform future marketing strategies and drive continuous improvement in user outreach efforts. \nUtilized advanced statistical techniques and **Python** libraries for data analysis and transformation, preparing datasets for further insights generation to enhance marketing executions."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Implemented robust **REST API** integrations with tools like **Customer.io**, **HubSpot**, and **Zapier**, streamlining marketing workflows and automating user engagement processes across the organization.\nLeveraged data analytics through **Segment**, **PostHog**, and **Mixpanel** to derive actionable insights and improve customer journeys, contributing to a 25% increase in user conversion rates.\nDeveloped custom pipelines in Python, enhancing data processing efficiency by **30%**, utilizing libraries like **Pandas** and **NumPy** to support data-driven marketing strategies.\nDesigned and maintained tracking systems using **Google Tag Manager** and **GA4**, resulting in a **40%** improvement in data accuracy for campaign performance analysis.\nCreated and optimized marketing pages using **Webflow** and **Unbounce**, achieving design responsiveness and increasing landing page conversion rates by **15%**.\nCollaborated with cross-functional teams to integrate AI-driven marketing solutions using **OpenAI** and **LangChain**, enhancing customer interactions and personalizing content delivery.\nExecuted real-time marketing campaigns utilizing **Make.com**, leading to a **20%** increase in user engagement metrics while ensuring compliance with best practices.\nManaged version control through **Git**, facilitating collaborative development with a team of engineers and designers, improving project delivery timelines by **10%**."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Applied expertise in **Customer.io**, **HubSpot**, and **Segment** to design and implement marketing automation workflows that increase engagement and conversion rates across digital channels.\nLeveraged **Mixpanel** and **PostHog** for data analytics and user behavior tracking, enabling over **30%** improvement in targeting strategies based on insights gathered from user interactions.\nUtilized **Google Tag Manager** and **GA4** to set up tracking for marketing campaigns, ensuring accurate data collection and reporting to measure KPI performance and optimize marketing efforts.\nEngineered integration solutions using **Make.com** and **Zapier**, automating routine marketing tasks and processes to enhance operational efficiency.\nDeveloped custom analytics dashboards in **Looker Studio** to visualize marketing performance metrics and facilitate data-driven decisions, resulting in a **15%** reduction in costs.\nImplemented responsive landing pages using **Webflow** and **Unbounce** for targeted campaigns, optimizing user experience and elevating conversion rates by **20%**.\nCreated dynamic marketing content powered by **OpenAI** and **Claude**, breaking conventional marketing barriers and personalizing communication based on real-time user data.\nCollaborated closely with cross-functional teams to integrate REST APIs in **Python** and **Node.js**, ensuring seamless data flow between marketing tools and applications for robust performance tracking.\nManaged version control and collaborative workflows using **Git**, ensuring code quality and team productivity in campaign developments.\nEnforced best security practices for data handling in all marketing technologies to uphold user privacy and compliance with GDPR regulations."
    }
  ],
  "skills": "**Programming Languages:**\n\tPython, JavaScript/TypeScript, Node.js\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular, Webflow, Unbounce\n\n**API Technologies:**\n\tREST API, Customer.io, HubSpot, Make.com, Zapier, Segment, PostHog, Mixpanel, Google Tag Manager, GA4, Looker Studio\n\n**Serverless and Cloud Functions:**\n\tAWS: Lambda, Azure: App Services\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD\n\n**Cloud & Infrastructure:**\n\tAWS: ECS, RDS, S3, Azure: Blob Storage, SQL Database, Terraform, Ansible, Helm, Docker Compose\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), OAuth2, JWT, Nginx, Let’s Encrypt, Certbot, LangChain, CrewAI, AutoGen, OpenAI, Claude, Google Gemini, Git",
  "apply_company": "OhChat"
}