{
  "name": "Tomasz Lee",
  "role_name": "Senior Python Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Results-driven Senior Python Engineer with 9+ years of experience in developing and implementing scalable applications. Highly proficient in **Python**, **FastAPI**, and **Pydantic**, ensuring robust and high-performance solutions. Expertise in **Git** for version control and best practices in **Testing**, maintaining code quality and reliability. Comprehensive knowledge of database management and cloud environment deployments, implementing **CI/CD** workflows to streamline development lifecycles. Strong capabilities in Agile methodologies, fostering effective **Collaboration** and **Communication** across cross-functional teams. Proven track record in leading projects to successful outcomes and optimizing software engineering processes while ensuring alignment with business objectives.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Senior Python Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Leveraged Python and **FastAPI** to develop scalable web applications, enhancing overall system performance by **30%**.\nUtilized **Pydantic** for data validation, ensuring the accuracy and integrity of input data in API requests.\nImplemented robust testing strategies to achieve **95%** test coverage, ensuring reliability and maintainability of the codebase.\nCollaborated with cross-functional teams to adopt **Agile** methodologies, improving project delivery speeds and team communication.\nManaged version control using **Git**, facilitating efficient collaboration among team members and maintaining code integrity.\nDeployed applications on cloud infrastructure, optimizing resource utilization and reducing operational costs by **20%**.\nSuccessfully integrated CI/CD practices to streamline deployment processes, leading to a reduction in rollout time by **40%**.\nEmphasized collaboration and communication skills across the team and stakeholders to ensure alignment on project goals and objectives.\nOptimized database interactions using advanced querying techniques, resulting in faster data retrieval times by **25%**."
    },
    {
      "role": "Software Engineer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "Utilized **Python** and **FastAPI** to design and implement scalable web services, enhancing the ability to manage projects effectively.\nDeveloped robust applications with **Pydantic** for data validation, contributing to a **30%** decrease in data errors.\nImplemented CI/CD pipelines utilizing **Git**, streamlining the deployment process and ensuring high-quality software delivery.\nEngaged in **Agile** methodologies to enhance team collaboration, achieving a **20%** improvement in project turnaround times.\nDesigned and developed APIs that integrate seamlessly with various **Databases**, ensuring efficient data processing and retrieval.\nFostered an environment of open **Communication** among team members and stakeholders, leading to successful project alignment with business objectives.\nContributed to **Testing** frameworks to ensure code quality, resulting in a **25%** reduction in post-deployment bugs.\nCollaborated with cross-functional teams to gather system requirements, maintaining a focus on timely project delivery.\nLed and participated in code reviews, mentoring junior developers and promoting a culture of continuous improvement."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "Utilized **Python** and **FastAPI** to develop scalable microservices, enhancing system performance by **30%**.\nImplemented **Pydantic** for data validation, improving data integrity and reducing bugs by **15%**.\nCollaborated with cross-functional teams using **Git** for version control, ensuring streamlined collaboration and code management.\nDeveloped and executed automated testing strategies to ensure high code quality and reliability across **3** different projects.\nManaged **Databases** effectively to optimize data retrieval processes, achieving an overall performance increase of **25%**.\nEmployed **CI/CD** tools to automate deployment processes in the cloud, reducing deployment time by **40%**.\nContributed to Agile methodologies, participating in daily standups and sprint planning to ensure project alignment and effective collaboration.\nFacilitated communication between development and operations teams, enhancing overall project workflow and achieving targets consistently.\nProvided training and documentation for team members, improving onboarding processes and knowledge transfer efficiency."
    }
  ],
  "skills": "**Programming Languages**\n\tPython\n\n**Backend Frameworks**\n\tFastAPI\n\n**Frontend Frameworks**\n\tHTML, CSS, JavaScript, TypeScript, ReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n**API Technologies**\n\tRESTful API, GraphQL\n\n**Serverless and Cloud Functions**\n\t\n\n**Databases**\n\tMSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB\n\n**DevOps**\n\tAWS, Azure, CI/CD pipelines\n\n**Cloud & Infrastructure**\n\t\n\n**Other**\n\tUX/UI Design, Git, GitHub, Agile, Collaboration, Communication, Testing, NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest, Blockchain: Solidity, Ether.js, Web3.js, Ethereum",
  "apply_company": "Nearform"
}