{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Internship",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-karol-kotlinski-bb2520397/",
  "profile_summary": "Proficient in **Python**, **gRPC**, and developing **REST APIs**, I am an innovative Full Stack Developer with **8** years of impactful experience. My technical arsenal includes **Docker**, **Kubernetes**, and a solid understanding of **CI/CD pipelines**, enabling me to create efficient, modern applications utilizing a robust cloud architecture. I excel in both **microservices architectures** and **monolithic architectures**, contributing effectively to diverse team projects and optimizing development workflows.\n\nI bring original strengths in problem-solving and team collaboration, having successfully led projects in the healthcare and financial sectors. I am well-versed in building high-performance solutions with technologies like **React**, **Next.js**, and **Node.js**, while ensuring applications meet rigorous compliance standards, including HIPAA and PCI DSS. My experience also encompasses **AI/ML integration** for enhanced data analytics and automation, reflecting my commitment to innovation and technological excellence.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Internship",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Developed and optimized **REST APIs** and **gRPC** services using **Python** for efficient communication between microservices in a **Kubernetes**-based architecture.\n- Assisted in the implementation of **CI/CD pipelines** with **Docker** and GitHub Actions to streamline application deployment and enhance operational efficiency.\n- Collaborated in a team environment to support the transition from **monolithic architectures** to **microservices architectures**, improving scalability and maintainability of applications.\n- Contributed to problem-solving sessions to identify and address performance bottlenecks in the system, ensuring high availability and responsiveness.\n- Gained hands-on experience in containerization and orchestration through **Docker** and **Kubernetes** to deploy and manage applications in cloud environments.\n- Engaged in simplification of complex processes and workflows, enhancing team productivity and project delivery timelines.\n- Participated in code reviews and collaborative coding exercises that fostered **team collaboration** and improved code quality across multiple project teams.\n- Communicated effectively in **English** with cross-functional teams, facilitating the understanding of technical concepts and project updates.\n- Involved in troubleshooting and debugging issues within the application stack, honing problem-solving skills and technical knowledge.\n- Developed documentation and project reports to capture processes and solutions, aiding in knowledge sharing and future reference."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "• Participated in the development of microservices architectures using **Python** (FastAPI, Django) and **Node.js** (NestJS/Express) to boost scalability and maintainability in high-volume transaction systems for an internship project.\n• Collaborated with team members to create user-focused front-end applications utilizing **React** (v18), **Vue 3**, and **Next.js**, employing **TypeScript** and **Redux Toolkit** for enhanced performance and responsiveness of financial dashboards.\n• Assisted in the development of real-time transaction monitoring and analytics tools with **D3.js** and **Power BI Embedded** to provide insights into financial activities and assist in detecting anomalies.\n• Helped integrate **Kafka**, **RabbitMQ**, and **Azure Service Bus** to support asynchronous communication and real-time event processing, enhancing event-driven application architectures.\n• Contributed to building ETL pipelines using **Python**, **Apache Airflow**, and **Azure Data Factory** for both batch and real-time data ingestion, effectively handling financial data from diverse sources.\n• Supported the implementation of AI/ML fraud detection systems using **scikit-learn** and **XGBoost** to analyze transaction patterns and user behavior, assisting in flagging suspicious activities within banking systems.\n• Engaged in creating ML pipelines focused on credit scoring and transaction classification integrated with **MLflow** and **Airflow** for real-time decision-making efforts, reinforcing the project’s data-driven strategies.\n• Gained experience collaborating within team settings and improving problem-solving skills while simplifying complex technical processes in developmental tasks."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "- Developed and optimized **REST APIs** using **Python** in microservices architectures to ensure efficient backend performance, cross-functional communication, and scalability in a global e-commerce platform.\n- Collaborated in a team environment to implement **CI/CD pipelines** utilizing **Kubernetes** and **Docker**, streamlining the deployment process and reducing time to market by **30%**.\n- Employed **gRPC** for high-performance communication between services, significantly improving data exchange speeds and system responsiveness by **50%**.\n- Contributed to real-time data processing and feature implementation through responsive client-server communication, enhancing user experience and system interaction.\n- Assisted in the transition from monolithic architectures to microservices, implementing **problem-solving** strategies to address architectural challenges and optimizing system performance.\n- Engaged in team collaboration to maintain documentation and knowledge sharing, improving team efficiency and project delivery outcomes.\n- Demonstrated proficiency in English for effective communication within the team and with stakeholders, ensuring clarity in project requirements and deliverables.\n- Applied principles of **simplification** to refine development processes, improving code quality and reducing complexity across multiple service layers."
    }
  ],
  "skills": "**Programming Languages:**\n\tPython, Rust\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tJavaScript/TypeScript (React, Vue, Angular)\n\n**API Technologies:**\n\tgRPC, REST APIs\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, CI/CD pipelines, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tNginx, Certbot\n\n**Other:**\n\tAuthentication & Security (Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt), Microservices architectures, Monolithic architectures, Problem-solving, Team collaboration, Proficiency in English, Simplification"
}