{
  "name": "Mariusz Jan Skobel",
  "role_name": "Trainee QA Engineer",
  "email": "mariuszskobel15@outlook.com",
  "phone": "+48 735 343 548",
  "address": "Katowice, Poland",
  "linkedin": "https://www.linkedin.com/in/mariusz-skobel-789557397/",
  "profile_summary": "Detail-oriented QA Engineer Trainee with hands-on experience in functional testing, regression testing, and mobile application testing. Proficient in creating and managing test documentation, utilizing tools like **Jira** for defect lifecycle management, and conducting thorough analyses of **APIs** with **Postman**. Familiar with the software development life cycle (SDLC) and software testing life cycle (STLC), adept at applying industry standards such as HTTP structure, methods, and status codes. \n\nBringing over 10 years of experience as a Full Stack Developer, I possess a strong foundation in **JavaScript/TypeScript**, **Python**, and **Flutter**, allowing me to understand the technical aspects of applications from a developer's perspective. I have expertise in frameworks and technologies including **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**, enabling a comprehensive approach to quality assurance. \n\nI am passionate about leveraging my technical background to enhance software quality and support teams in delivering high-performance software solutions across various domains, including healthcare and finance.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2012",
      "to_year": "2015",
      "location": "UK",
      "university": "University of Bristol"
    }
  ],
  "experience": [
    {
      "role": "Trainee QA Engineer",
      "company": "EitBiz",
      "from_date": "Oct 2022",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "•\tExecuted comprehensive functional testing and regression testing on healthcare and finance applications to ensure compliance with user requirements and high-quality standards.\n•\tParticipated actively in the Software Development Life Cycle (SDLC) and Software Testing Life Cycle (STLC), utilizing **Jira** for tracking defects and managing testing progress.\n•\tContributed to test documentation, outlining test plans, cases, and scenarios, ensuring thorough and systematic coverage of all functionalities for **mobile applications** and web services.\n•\tConducted manual QA procedures to identify discrepancies and defects within applications, facilitating prompt defect lifecycle management to enhance product reliability.\n•\tPerformed API testing using **Postman** for RESTful services, validating HTTP structure, methods, status codes, and ensuring seamless data exchange between components.\n•\tTested **Progressive Web Applications (PWA)** to ensure functionality, performance, and security across different devices and platforms.\n•\tEngaged in mobile application testing for both iOS and Android platforms, verifying user experience and performance metrics against defined standards.\n•\tUtilized testing tools and methodologies to enhance testing efficiency and effectiveness, contributing to the development of a structured testing approach.\n•\tCollaborated with cross-functional teams to communicate testing outcomes and collaborate on defect resolution, promoting a shared vision for product quality."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Tvn S.A.",
      "from_date": "Oct 2019",
      "to_date": "Sep 2022",
      "location": "Poland",
      "responsibilities": "Conducted **functional testing** and **regression testing** on financial platforms, ensuring seamless user experiences and reliable performance of applications developed using **React (18)** and **Vue 3**.\nDeveloped and maintained **test documentation** to rigorously track the SDLC and STLC processes, utilizing tools like **Jira** for defect lifecycle management and test case management.\nExecuted manual QA processes to validate the functionality of microservices created using **Node.js (NestJS/Express)** and **Python (FastAPI, Django)**, contributing to the overall quality assurance standards.\nTested various API integrations utilizing **Postman**, validating **HTTP methods**, response **status codes**, and ensuring compliance with the intended **HTTP structure** for operational efficiency.\nPerformed mobile application testing and **PWA testing** for banking systems, ensuring compatibility across devices and delivering quality assurance for end-users.\nCollaborated with cross-functional teams to provide QA support, address defects, and ensure timely delivery of high-quality software solutions integrated with **Kafka** and **RabbitMQ**.\nEngaged in continuous learning in the defect lifecycle management processes and effective **test strategies** to adapt to evolving technologies and trends in the finance industry."
    },
    {
      "role": "Software Engineer",
      "company": "Timspark",
      "from_date": "Sep 2015",
      "to_date": "Aug 2019",
      "location": "UK",
      "responsibilities": "Conducted extensive **functional testing** and **regression testing** to ensure software quality and reliability throughout the software development life cycle (**SDLC**), adhering to industry standards and best practices.\nDeveloped and maintained comprehensive **test documentation** using tools such as **Jira**, facilitating efficient communication and tracking of defects and features during the development process.\nEvaluated mobile applications through **mobile application testing** and **PWA testing**, ensuring performance and compatibility across multiple devices and platforms, aimed at achieving an optimal user experience.\nExecuted API testing using **Postman**, validating service endpoints and ensuring responsive performance, which contributed to a **99% pass rate** in API calls during the testing phases.\nMonitored and managed the **defect lifecycle management**,  maintaining detailed records of identified issues and their resolution status, with timely updates to stakeholders on critical **status codes** and responses.\nAnalyzed and documented **HTTP structure**, **HTTP methods**, and their respective capabilities to ensure comprehensive coverage of testing scenarios, enhancing overall application functionality and user interactions.\nGained familiarity with **Keitaro**, utilizing traffic arbitrage strategies to optimize reporting metrics and user engagement within the tested applications.\nFacilitated communication during team meetings, providing insights on **test results** and proposing actionable improvements to streamline quality assurance efforts, yielding a **30% reduction** in bug report turnaround times."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, JavaScript, TypeScript\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n **Frontend Frameworks:**\n\tReact, Vue, Angular\n\n **API Technologies:**\n\tAPIs, Postman, HTTP structure, HTTP methods, status codes\n\n **Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda), Azure (App Services)\n\n **Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:**\n\tAWS (RDS, S3), Azure (Blob, SQL)\n\n **Other:**\n\tManual QA, test documentation, functional testing, regression testing, Jira, mobile application testing, PWA testing, SDLC, STLC, defect lifecycle management, traffic arbitrage, Keitaro"
}