{
  "name": "Rei Taro",
  "role_name": "Senior Frontend Engineer",
  "email": "rei515@outlook.com",
  "phone": "+48732529451",
  "address": "Warszawa, Poland",
  "linkedin": "https://www.linkedin.com/in/rei-taro-81a410391/",
  "profile_summary": "Results-driven Senior Frontend Engineer with over 10 years of extensive experience in building high-performing web applications and platforms, leveraging modern frameworks such as **Angular**, **React**, **JavaScript**, and **TypeScript**. Proficient in designing robust and efficient APIs and adept at utilizing **AWS**, **Kubernetes**, and **DevOps** methodologies to enhance application performance and scalability. Strong background in Agile practices and microservices architecture, applying SOLID principles and design patterns to deliver maintainable code. Expert in database management with knowledge in **DynamoDB**, **Oracle**, **MySQL**, **MongoDB**, and **Elasticsearch**. Proven history of collaboration and effective communication in delivering impactful projects for leading organizations like VISA, Sii Poland, and Reply Polska.",
  "education": [
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2010",
      "to_year": "2015",
      "location": "Japan",
      "university": "Keio University"
    }
  ],
  "experience": [
    {
      "role": "Senior Frontend Engineer",
      "company": "Leobit",
      "from_date": "Aug 2022",
      "to_date": "Present",
      "location": "Poland",
      "responsibilities": "Utilized **Angular** and **React** to develop dynamic, user-friendly frontend applications that engage users and improve overall performance.\nImplemented **JavaScript** and **TypeScript** for robust client-side scripting, ensuring high-quality code adhering to **SOLID principles** and **design patterns**.\nLed the adoption of **micro-frontend** architecture to facilitate independent deployment and scaling of application features, enhancing user experience and developer efficiency.\nCollaborated with backend teams to design and consume **APIs**, ensuring seamless integration and functionality across applications.\nEmployed **DevOps** practices to streamline deployment processes using **GitLab CI**, reducing deployment times by **30%**.\nEngaged in Agile methodologies to iteratively enhance product features, ensuring timely delivery of **9** major releases per quarter.\nFacilitated cross-team communication, fostering collaboration and ensuring alignment on project goals and timelines across various functional teams.\nIntegrated **real-time monitoring** tools to observe application performance, leading to a **20%** reduction in downtime and improved user satisfaction."
    },
    {
      "role": "Software Engineer",
      "company": "Innovature",
      "from_date": "Nov 2018",
      "to_date": "Jun 2022",
      "location": "Japan",
      "responsibilities": "Utilized **Angular** and **React** to design and develop responsive user interfaces, adhering to **SOLID principles** and leveraging **Design patterns** to ensure code efficiency and maintainability.\nImplemented robust **APIs** for seamless integration with backend services, enhancing user experience and streamlining interactions.\nCollaborated within an **Agile** environment, actively participating in daily stand-ups and sprint planning, leading to a **20%** improvement in project delivery timelines.\nApplied **Microservices** architecture to develop modular and scalable frontend solutions, facilitating easier updates and maintenance.\nEngaged in **DevOps** practices to enhance deployment processes, using **GitLab CI** for continuous integration and delivery, achieving a **30%** reduction in deployment times.\nPerformed thorough testing and quality assurance, leveraging real-time monitoring tools for performance tracking and improvements, which resulted in a **15%** increase in application responsiveness.\nFostered effective **communication** and **collaboration** with cross-functional teams, ensuring alignment with project goals and contributing to project success throughout the development lifecycle."
    },
    {
      "role": "Software Developer",
      "company": "Wizcorp",
      "from_date": "Apr 2015",
      "to_date": "Nov 2018",
      "location": "Japan",
      "responsibilities": "• Developed responsive user interfaces leveraging **Angular** and **React**, enhancing user experiences and interaction with the platform.\n• Collaborated with cross-functional teams in an **Agile** environment, facilitating communication and ensuring alignment on project goals and timelines.\n• Implemented **Microservices** architecture to promote scalability and maintainability across applications, ensuring modular development.\n• Integrated robust APIs for seamless data exchange between frontend and backend services, fostering efficiency in application performance.\n• Utilized **JavaScript** and **TypeScript** to create dynamic components, resulting in a significant increase in application performance by **25%**.\n• Maintained comprehensive version control and CI/CD pipelines using **GitLab CI** to streamline deployment processes and reduce deployment time by **30%**.\n• Enhanced real-time application monitoring and logging features with **AWS** cloud services, ensuring system reliability and improved troubleshooting capabilities.\n• Practices **SOLID principles** and Design Patterns to ensure code quality and optimal software design, facilitating easier maintenance and scalability.\n• Contributed to the development of event-driven architecture, optimizing system responsiveness and user engagement.\n• Engaged in solution design discussions to harmonize frontend technologies with backend services, ensuring a cohesive user experience."
    }
  ],
  "skills": "**Programming Languages**\n\tJavaScript, Python (3.8+), SQL, TypeScript, Java\n\n**Frontend Frameworks**\n\tAngular, React\n\n**Backend Frameworks**\n\tFastAPI, Flask, Django, Spring Boot, Celery\n\n**API Technologies**\n\tREST/gRPC APIs, APIs, Microservices, Event-driven architecture, Micro-frontend\n\n**Serverless and Cloud Functions**\n\tAWS (EC2, S3, Lambda), Azure\n\n**Databases**\n\tPostgreSQL, MySQL, MongoDB, Redis, DynamoDB, Oracle, Elasticsearch\n\n**DevOps**\n\tDocker, Kubernetes, GitHub Actions, Azure DevOps, GitLab CI, CI/CD, Real-time monitoring\n\n**Cloud & Infrastructure**\n\tAWS, Azure\n\n**Other**\n\tAgile, Communication, Collaboration, SOLID principles, Design patterns",
  "apply_company": "Ticketmaster"
}