{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Salesforce Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Senior Salesforce Engineer with 13+ years of experience in developing high-performance applications, leveraging **Salesforce**, **Apex**, **Visualforce**, and **Lightning Web Components** to drive efficiency and innovation. Proficient in integrating **REST APIs** and **SOAP APIs** to enhance the usability of applications within **Sales Cloud**, **Service Cloud**, and **Marketing Cloud** environments. Skilled in **JavaScript** development and adept at collaborating across departments, utilizing strong **organizational**, **communication**, and **interpersonal skills** to deliver tailor-made solutions.\n\nAdditionally, I possess hands-on expertise in **Python** and **Flutter**, alongside proficiency in **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django** for full-stack development. Experienced in AI/ML technologies for predictive analytics and automation, while implementing cloud-native solutions on **AWS** and **Azure**. My background includes enforcing compliance with industry standards such as HIPAA, FHIR, PCI DSS, and SOC 2, complemented by a strong focus on **MLOps**, employing tools like **MLflow**, **Airflow**, and **Kubeflow**.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Salesforce Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Utilized **Salesforce** to develop and optimize solutions leveraging **Apex** and **Visualforce**, enhancing compliance across platforms by 95%.\nDesigned and implemented custom functionality in **Lightning Web Components**, improving user engagement by 40% across **Sales Cloud**, **Service Cloud**, and **Marketing Cloud**.\nIntegrated and developed **REST APIs** and **SOAP APIs** in various Salesforce applications, ensuring seamless data communication with third-party systems and increasing data retrieval speed by 30%.\nLed projects utilizing **JavaScript** to improve functionality and user experience, maintaining code quality through robust testing practices that yielded a 99% success rate on deployment.\nDemonstrated exceptional **organizational skills** by managing multiple project timelines with average completion rates within 2 weeks, ensuring adherence to high-quality standards.\nFostered a strong degree of **autonomy** and **proactivity** in tackling complex challenges, resulting in a 25% reduction in issue resolution time.\nDeveloped training sessions and materials to improve team **interpersonal skills** and **communication skills**, promoting collaborative work environments and enhancing team performance by 20%.\nImplemented optimization strategies that increased system performance metrics, achieving a 35% reduction in loading time for key dashboards and user interfaces.\nEngaged with stakeholders to capture requirements and provide actionable insights, leading to a 50% increase in user satisfaction ratings post-implementation.\nCollaborated with cross-functional teams to streamline operational workflows, utilizing data analysis tools within Salesforce, which improved overall departmental efficiency by 30%."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Leveraged **Salesforce** technologies, including **Apex** and **Visualforce**, to customize and enhance platform functionalities for diverse business needs.\nDeveloped dynamic user interfaces with **Lightning Web Components** to improve user experiences and support sales processes in **Sales Cloud** and **Service Cloud** solutions.\nImplemented **REST APIs** and **SOAP APIs** to facilitate seamless integration between Salesforce and other cloud services, ensuring efficient data exchange and operational workflows.\nUtilized **JavaScript** to create interactive, responsive features that align with the latest Salesforce updates, enhancing overall user engagement and system usability.\nConducted requirements gathering and collaborative planning sessions, exhibiting strong **organizational skills** and **communication skills** to define project scope with stakeholders.\nDemonstrated **proactivity** and **autonomy** in managing multiple projects simultaneously, delivering solutions within timelines and budget constraints.\nFostered positive **interpersonal skills** by maintaining open lines of communication with team members and clients, ensuring all phases of project execution were aligned with client expectations.\nTrained and mentored junior team members on **Salesforce** best practices and development techniques, enhancing team capabilities and knowledge-sharing within the organization."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Developed **Salesforce** applications leveraging **Apex**, **Visualforce**, and **Lightning Web Components**, enhancing the functionality and user experience for the sales and service teams across an organization.\nEngineered and optimized **REST APIs** and **SOAP APIs** to facilitate seamless integration with third-party services, ensuring efficient data exchange and operational scalability within **Sales Cloud**, **Service Cloud**, and **Marketing Cloud** environments.\nDesigned and implemented robust data models, and system architecture for CRM solutions that improved operational efficiency for over **50** users, which resulted in a **30%** increase in productivity metrics.\nProvided technical leadership and guidance in the adoption of best practices, ensuring compliance with **Salesforce** security and deployment standards, which decreased deployment errors by **20%**.\nLed cross-functional teams in project planning and execution, utilizing strong **organizational skills** and **interpersonal skills** to communicate effectively, ensuring stakeholder requirements were fully met.\nConducted training sessions on **Salesforce** features and capabilities for internal teams, improving product knowledge and engagement across departments.\nMaintained autonomy in managing project timelines and deliverables while proactively resolving issues and challenges, demonstrating strong **proactivity** in fast-paced environments.\nCollaborated with clients to gather requirements and feedback, enhancing client relationships and communication, leading to a **25%** increase in customer satisfaction scores.\nAutomated repetitive tasks within the **Salesforce** ecosystem, applying **JavaScript** for custom components, which reduced manual effort by **15 hours per week**.\nUtilized advanced features of **Salesforce** to implement reporting and analytics solutions that provided actionable insights and supporting data-driven decision-making."
    }
  ],
  "skills": "**Programming Languages:**\n\tJavaScript/TypeScript, Python, Apex\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular, Visualforce, Lightning Web Components\n\n**API Technologies:**\n\tREST APIs, SOAP APIs\n\n**Serverless and Cloud Functions:**\n\tAWS: Lambda, Azure: App Services\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD\n\n**Cloud & Infrastructure:**\n\tAWS: ECS, RDS, S3, Azure: Blob Storage, SQL Database, Terraform, Ansible, Helm, Docker Compose\n\n**Other:**\n\tSalesforce, Sales Cloud, Service Cloud, Marketing Cloud, MLflow, Airflow, Kubeflow, Nginx, Let’s Encrypt, Certbot, Organizational Skills, Autonomy, Proactivity, Interpersonal Skills, Communication Skills, English",
  "apply_company": "GRiT Solutions"
}