{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Technical Sales Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-623a26390/",
  "profile_summary": "Technical Sales Engineer with 13+ years of experience in full-stack development, skilled in **JavaScript/TypeScript**, **Python**, and **Flutter**. Proficient in secure coding practices and information security, ensuring the protection of customer data while providing engaging technical demonstrations. Strong background in deploying cloud-native systems on **AWS** and **Azure** and implementing CI/CD pipelines, empowering product delivery with speed and efficiency. Passionate about community involvement and cybersecurity, I effectively communicate complex technical concepts to diverse audiences. Experienced in planning and prioritization, I excel in remote working environments while maintaining high standards of customer engagement.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Technical Sales Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Managed customer engagement by delivering technical demonstrations of platform capabilities, ensuring secure coding practices are highlighted and information security is prioritized.\nUtilized excellent communication skills to explain complex technical concepts clearly, aiding in client understanding and satisfaction in the healthcare and fintech sectors.\nPlanned and prioritized tasks effectively while collaborating with cross-functional teams to address customer needs and enhance product offerings in line with cybersecurity standards.\nEngaged with community involvement initiatives to promote innovative solutions, ensuring that client feedback drives product enhancements.\nFacilitated event management for product launches and workshops, showcasing features built with a tech stack including **Python (FastAPI)**, **React (17–18)**, **Flutter**, and **Node.js**.\nDemonstrated expertise in secure coding practices during presentations, using frameworks like **Docker** and **Kubernetes (AKS/EKS)** to illustrate scalable, fault-tolerant architectures.\nProvided insights on the implementation of advanced data visualization tools such as **D3.js** and **Power BI Embedded** to enhance customer analytics understanding.\nPromoted the adoption of technologies for risk scoring and fraud detection, leveraging machine learning models with **scikit-learn** and **TensorFlow** in customer discussions.\nConducted extensive training sessions on the integration of intelligent solutions like **Azure ML** and **AWS Sagemaker**, enhancing customer engagement in the decision-making process.\nMaintained a focus on information security and compliance with standards such as HIPAA and GDPR within technical conversations and product explanations."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "• Demonstrated **information security** best practices in modernizing core financial platforms by migrating to microservices architecture using **Node.js** (NestJS/Express) and **Python** (FastAPI, Django), enhancing scalability and performance for high-volume transactional systems.\n• Effectively communicated technical demonstrations while building interactive front-end applications with **React** (18), **Vue 3**, **Next.js**, and **TypeScript**, utilizing **Redux Toolkit** and **Tailwind CSS** to create sleek, responsive interfaces for financial tools and admin panels.\n• Engaged customers through the delivery of real-time analytics dashboards with **React**, **D3.js**, and **Power BI Embedded**, providing operations teams with instant insights into transactions and anomalies, especially those involving a minimum of 1000 data points.\n• Managed event-driven architecture design and deployment using **Kafka**, **RabbitMQ**, and **Azure Service Bus**, ensuring asynchronous communication across critical workflows such as payments, alerts, and compliance within **99.9% uptime**.\n• Prioritized the development of ETL pipelines for ingesting financial data from internal and third-party sources with **Python**, **Apache Airflow**, and **Azure Data Factory**, supporting both batch and real-time processing leading to a **30% reduction** in data latency.\n• Applied **secure coding** principles in building and deploying machine learning models for fraud detection using **scikit-learn**, **XGBoost**, and **Azure ML**, enabling proactive detection of suspicious activity based on user behavior and transaction patterns resulting in a **25% increase** in detection rate.\n• Planned and created ML pipelines for real-time credit scoring, churn prediction, and transaction classification, leveraging **MLflow** and **Airflow** to integrate model inference into backend services for an improved user experience across **1000+** transactions daily."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Applied **information security** principles and **secure coding** practices to develop and deliver high-quality technical demonstrations of backend services for a global e-commerce platform.\nEngaged with customers to ensure proactive **customer engagement**, effectively communicating technical concepts and addressing any cybersecurity concerns during event management.\nCollaborated cross-functionally to showcase product capabilities, demonstrating a solid understanding of **planning and prioritization** in technical solutions tailored to client needs.\nFacilitated technical presentations and product workshops utilizing excellent **communication** skills to elucidate complex topics while ensuring customers grasp the added value of the technology stack, including **Python (FastAPI, Django)**, **Node.js (NestJS, Express)**, and more.\nLeveraged **secure coding** protocols during the integration of payment workflows with **Stripe**, **PayPal**, and **Razorpay**, focusing on preventing security vulnerabilities and enhancing overall **cybersecurity**.\nDemonstrated proactive **community involvement** by organizing and leading **remote working** sessions to keep stakeholders informed on technical updates and product evolutions, achieving an increase in community engagement by **25%**.\nImplemented monitoring measures to evaluate customer satisfaction, ultimately improving technical support and achieving a **30%** reduction in response times for customer inquiries.\nEnsured robust **event management** strategies for product launches, effectively planning and executing strategies that elevated customer experience and satisfaction levels.\nUtilized **event-driven architecture** to enhance customer interactions and streamline the communication of product features, fostering a smoother operational workflow contributing to overall sales success."
    }
  ],
  "skills": "**Programming Languages:**\n\tPython: FastAPI, Flask, Django\n\tJavaScript/TypeScript: React, Vue, Angular\n\n**Backend Frameworks:**\n\t\n\n**Frontend Frameworks:**\n\t\n\n**API Technologies:**\n\t\n\n**Serverless and Cloud Functions:**\n\tAWS: ECS, Lambda, RDS, S3\n\tAzure: App Services, Blob Storage, SQL Database\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare)\n\tMongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes\n\tGitHub Actions, GitLab CI/CD\n\tTerraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\t\n\n**Other:**\n\tsecure coding\n\tinformation security\n\tcustomer engagement\n\ttechnical demonstrations\n\tcybersecurity\n\tevent management\n\tcommunity involvement\n\texcellent communication\n\tplanning and prioritization\n\tremote working"
}