{
  "name": "Patryk Zaslawski",
  "role_name": "Frontend Developer",
  "email": "patrykzas0428@outlook.com",
  "phone": "+48669862402",
  "address": "Gdanski, Poland",
  "linkedin": "https://www.linkedin.com/in/patryk-zaslawski-6b04a8397/",
  "profile_summary": "As a proficient Frontend Developer with 8+ years of software engineering experience, I excel in utilizing **Angular**, **TypeScript**, and **HTML5** to create dynamic and responsive single-page applications (SPAs). My strong knowledge of **SCSS**, **RxJS**, and **ReactiveForms** enables me to craft efficient, modular, and maintainable code. Experienced in implementing **Monorepos** and **Microfrontends** with a keen understanding of **Module Federation** and Backend for Frontend (BFF) patterns, I ensure seamless integration of various components. I am well-versed in version control systems including **Git**, **GitHub**, and **GitLab**, alongside setting up robust **CI/CD pipelines** to streamline processes. My background in **Confluence** and proficiency in methodologies like Kanban enhances team collaboration and project management. My past projects have spanned diverse industries including e-commerce and healthcare, where I have successfully delivered high-performance, business-centric solutions.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2014",
      "to_year": "2017",
      "location": "United Kingdom",
      "university": "The University of Manchester"
    }
  ],
  "experience": [
    {
      "role": "Frontend Developer",
      "company": "Binary Studio",
      "from_date": "Aug 2023",
      "to_date": "Present",
      "location": "United Kingdom (Remote)",
      "responsibilities": "Utilized **Angular**, **TypeScript**, **HTML5**, and **SCSS** to develop high-quality, responsive user interfaces for healthcare applications, improving user satisfaction by **25%**.\nImplemented effective state management strategies using **RxJS** and **ReactiveForms** to streamline form handling and data flow in complex Single Page Applications (SPA), reducing data processing time by **30%**.\nCollaborated with cross-functional teams to design and integrate Microfrontends architecture and Module Federation, promoting a modular development approach that supports code reuse and faster deployment.\nMaintained CI/CD pipelines utilizing **Git**, **GitHub**, and **GitLab** for version control and continuous integration, lowering deployment errors by **15%** through automated testing and monitoring.\nContributed to project documentation using **Confluence**, ensuring all stakeholders have access to up-to-date development processes and standards, enhancing team collaboration efficiency.\nAdopted Kanban methodologies to manage workflow and prioritize tasks effectively, leading to a **20%** increase in project delivery speed.\nPartnered with backend developers to implement Backend for Frontend (BFF) strategies, optimizing API utilization and ensuring seamless integration with Python services.\nImplemented responsive design principles to ensure application compatibility with various devices and platforms, resulting in improved accessibility and user experience.\nParticipated in code reviews and mentoring sessions within a team environment to uphold code quality and best practices in frontend development.\nDesigned and implemented modern web applications that adhere to performance best practices and mobile optimization guidelines.\nProvided technical insights and ownership for frontend challenges, ensuring solutions align with overall project architecture and user needs."
    },
    {
      "role": "Software Engineer",
      "company": "Ardigen",
      "from_date": "Mar 2020",
      "to_date": "Aug 2023",
      "location": "Poland",
      "responsibilities": "Develop and enhance dynamic, user-centric frontends utilizing **Angular**, **TypeScript**, **HTML5**, and **SCSS**, ensuring responsive design and efficient user interactions while adhering to best practices in frontend development.\nImplement features using **RxJS** and **ReactiveForms** within a Single Page Application (SPA) structure, focusing on performance optimization and user experience.\nUtilize Monorepos and Microfrontends architecture alongside Module Federation strategies to modularize frontend applications for improved maintainability and scalability.\nCollaborate with backend development to design and integrate a Backend for Frontend (BFF) approach, streamlining communication between frontend and backend services.\nManage version control and code quality using **Git**, **GitHub**, and **GitLab**, ensuring a robust workflow and seamless collaboration among team members.\nParticipate in CI/CD pipelines including Azure DevOps for efficient deployment processes and quality assurance checks, enhancing delivery timelines by **20%**.\nContributions to project management documents using **Confluence** and Agile methodologies like Kanban, facilitating clear communication and task tracking.\nEngage in code reviews and integrate best practices to maintain high standards of code quality and project integrity within the team.\nStay updated with the latest frontend technologies and frameworks to continually improve development processes and application performance by **15%** by adopting new tools and practices."
    },
    {
      "role": "Software Engineer",
      "company": "Altum Software",
      "from_date": "Oct 2017",
      "to_date": "Feb 2020",
      "location": "United Kingdom",
      "responsibilities": "Leveraged **Angular** and **TypeScript** to design and develop dynamic, responsive single-page applications (SPAs) that enhance user experience across various platforms, ensuring seamless integration with backend services.\nImplemented **Git** for version control while collaborating within **Monorepos** to streamline project management and maintain code integrity.\nUtilized **SCSS** for styling, enhancing visual appeal and user interface consistency across applications, improving aesthetic quality by **20%**.\nApplied **RxJS** for reactive programming patterns in Angular applications, optimizing data handling and user interactions, increasing UI responsiveness by **30%**.\nIntegrated **ReactiveForms** to manage complex forms efficiently, improving the user experience through streamlined input validation and processing.\nEngaged in **CI/CD pipelines** using **GitHub Actions** and **GitLab**, automating build, testing, and deployment processes to ensure a reliable delivery infrastructure with a **40%** reduction in deployment time.\nPlayed a pivotal role in adopting **Microfrontends** architecture, allowing for independently deployable features that facilitate team scalability and code maintainability.\nCollaborated within an Agile **Kanban** environment to rapidly iterate on features and enhance application performance, contributing to a **50%** faster feature rollout.\nPromoted best practices in code quality, using tools like **Git** for version control and **Confluence** for documentation, thereby enhancing team collaboration and project transparency.\nDeveloped and maintained internal CMS solutions, ensuring the content is easily manageable and responsive on both desktop and mobile devices, achieving a **15%** increase in user engagement.\nUtilized **Module Federation** to share code dynamically between applications, reducing load times and improving the user experience from different devices.\nParticipated in code reviews and provided constructive feedback to maintain high development standards and promote optimal coding practices within the team."
    }
  ],
  "skills": "**Programming Languages:**\n\tPython, TypeScript\n\n**Backend Frameworks:**\n\tFastAPI, Django, Flask, Spring Boot\n\n**Frontend Frameworks:**\n\tAngular (1–16), React (15–18), Next.js, Vue.js (2/3), Blazor, HTML5, SCSS, RxJS, ReactiveForms, Microfrontends, Module Federation, BFF, SPA\n\n**API Technologies:**\n\tREST & gRPC APIs\n\n**Serverless and Cloud Functions:**\n\tAWS Lambda, Azure Functions\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, CI/CD pipelines\n\n**Cloud & Infrastructure:**\n\tAWS (ECS, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Other:**\n\tSQLAlchemy, Pydantic, Celery, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, Git, GitHub, GitLab, Confluence, Kanban, CMS"
}