{
  "name": "Rei Taro",
  "role_name": "Senior Application Engineer",
  "email": "rei515@outlook.com",
  "phone": "+48732529451",
  "address": "Warszawa, Poland",
  "linkedin": "https://www.linkedin.com/in/rei-taro-81a410391/",
  "profile_summary": "Seasoned Senior Application Engineer with over 10 years of experience in backend development, specializing in security-focused practices such as **Bug Bounty**, **Pentesting**, **OWASP**, and **Security Automation**. Proficient in leveraging **SAST** and **DAST** tools like **Burp Suite**, **SonarQube**, and **Snyk** to ensure robust security postures. Skilled in CI/CD using **Jenkins** and **GitLabCI**, and experienced in infrastructure as code with **Terraform** and **Helm**. Strong expertise in creating, optimizing, and maintaining high-quality APIs and scalable services within financial and cloud-native architectures utilizing technologies such as **Python** (**FastAPI**, **Django**, **Flask**) and cloud platforms including **AWS** and **Azure**. Recognized for collaboration, effective communication, and problem-solving skills, with a proven record of delivering impactful projects for top-tier organizations such as VISA, Sii Poland, and Reply Polska.",
  "education": [
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2010",
      "to_year": "2015",
      "location": "Japan",
      "university": "Keio University"
    }
  ],
  "experience": [
    {
      "role": "Senior Application Engineer",
      "company": "Leobit",
      "from_date": "Aug 2022",
      "to_date": "Present",
      "location": "Poland",
      "responsibilities": "Implemented security measures through **Bug Bounty**, **Pentesting**, and compliance with **OWASP** guidelines to protect application integrity and user data.\nConducted thorough security assessments utilizing tools such as **Burp Suite**, **SonarQube**, and **Snyk** to identify vulnerabilities in applications and ensure quality through **SAST** and **DAST** processes.\nAutomated CI/CD pipelines using **Jenkins** and **GitLabCI** to drive efficient software delivery and enhance collaboration among teams, improving deployment times by **25%**.\nLeveraged **Terraform** and **Helm** to manage cloud infrastructure and configurations, ensuring scalability and reliability of services.\nIntegrated **WAF** solutions as part of an overall security strategy, enhancing application protections against threats and reducing attack surface.\nDocumented processes and security protocols, facilitating knowledge sharing and compliance by providing clear guidance for team members.\nFostered collaboration and open communication with cross-functional teams to identify and solve system integration challenges, leading to improved project outcomes."
    },
    {
      "role": "Software Engineer",
      "company": "Innovature",
      "from_date": "Nov 2018",
      "to_date": "Jun 2022",
      "location": "Japan",
      "responsibilities": "Conducted comprehensive security audits, utilizing skills in **Pentesting**, **Bug Bounty**, and **OWASP** to ensure compliance with industry standards across all systems.\nImplemented application security best practices through **SAST** and **DAST** methodologies, enhancing security measures in software development lifecycle.\nAutomated security testing and vulnerability management using tools like **Burp Suite**, **SonarQube**, and **Snyk** to identify and rectify security flaws across **9** applications.\nIntegrated CI/CD pipelines with **Jenkins** and **GitLabCI** to streamline security checks, significantly reducing time taken for deployments by **30%**.\nOrchestrated infrastructure management using **Terraform** and **Helm** to maintain consistent, secure environments across **5** different cloud platforms.\nCollaborated with cross-functional teams effectively to address and resolve security-related issues through strong **Communication** and **Collaboration** skills.\nDemonstrated exceptional **Problem-Solving** abilities by analyzing complex security challenges and documenting effective solutions.\n"
    },
    {
      "role": "Software Developer",
      "company": "Wizcorp",
      "from_date": "Apr 2015",
      "to_date": "Nov 2018",
      "location": "Japan",
      "responsibilities": "Implemented security best practices by conducting **Pentesting** and utilizing tools such as **Burp Suite**, **SonarQube**, and **Snyk** to identify vulnerabilities across applications, improving overall security posture by **30%**.\nDeveloped comprehensive documentation adhering to **OWASP** guidelines to ensure application security and compliance.\nEngineered robust backend services for trade execution and portfolio management, enhancing performance metrics by **25%** utilizing **Python**, **Flask**, and **PostgreSQL** in a multi-layered architecture.\nCollaborated with cross-functional teams to build and maintain CI/CD pipelines using **Jenkins** and **GitLabCI**, reducing deployment times by **40%**.\nConducted regular code reviews and security assessments using **SAST** and **DAST** methodologies, ensuring high-quality code and timely issue resolution.\nIntroduced infrastructure as code using **Terraform** and **Helm**, enabling scalable and reliable deployment strategies, reducing infrastructure provisioning time by **50%**.\nExecuted security automation tasks to streamline vulnerability management processes, enhancing response times and reducing manual workloads.\n"
    }
  ],
  "skills": "  **Programming Languages**\n    Python (3.8+), SQL, Bash, JavaScript\n\n  **Backend Frameworks**\n    FastAPI, Flask, Django, Celery\n\n  **Frontend Frameworks**\n\n  **API Technologies**\n    REST/gRPC APIs, Microservices\n\n  **Serverless and Cloud Functions**\n    AWS (EC2, S3, Lambda), Azure\n\n  **Databases**\n    PostgreSQL, MySQL, MongoDB, Redis\n\n  **DevOps**\n    Docker, Kubernetes, GitHub Actions, Azure DevOps, Jenkins, GitLabCI, Terraform, Helm, CI/CD\n\n  **Cloud & Infrastructure**\n\n  **Other**\n    AI/ML Tools: Pandas, NumPy, scikit-learn, TensorFlow, Airflow, MLflow, Bug Bounty, Pentesting, OWASP, SAST, DAST, Burp Suite, SonarQube, Snyk, WAF, Security Automation, Documentation, Collaboration, Problem-Solving, Communication",
  "apply_company": "Swapcard"
}