{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Unity Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Senior Unity Engineer with a strong foundation in **C#**, **Unity**, and **game development**, bringing over 13 years of software engineering experience. Skilled in crafting interactive mobile gaming experiences using **MonoBehaviours**, **ScriptableObjects**, and **Prefabs**. Proficient in deploying scalable applications with **Docker** and establishing CI/CD pipelines for seamless development workflows. Strong problem-solving skills in **GoLang** with expertise in **Redis** and **SQL** for data management solutions. Proven track record of building robust applications in high-performance environments, including the healthcare and financial sectors. Additionally, experienced in cloud technologies and compliance-driven development aligned with industry standards.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Unity Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Developed engaging mobile gaming applications utilizing **Unity** and **C#**, focusing on performance efficiency and user experience.\nImplemented game mechanics using **MonoBehaviours** and **ScriptableObjects** for increased modularity and reusability across multiple projects.\nCreated reusable asset systems with **Prefabs** and **Addressables** to optimize asset management and loading times, resulting in a **30%** reduction in load times.\nUtilized **GoLang** for backend services, ensuring seamless connectivity and data exchange within game environments.\nDesigned and implemented scalable database solutions with **Redis** and **SQL** to manage user data and game state effectively, achieving **99.9%** availability.\nEstablished CI/CD pipelines for mobile gaming applications to automate builds and deployments using **Docker**, enhancing release cycles by **40%**.\nCollaborated with cross-functional teams to integrate gameplay analytics and performance telemetry, enabling data-driven design decisions that improved player retention by **25%**.\nUtilized industry best practices for game optimization and problem-solving, conducting regular code reviews and performance testing.\nParticipated in agile methodology processes and contributed to sprint planning and retrospectives, fostering a collaborative team environment.\nMentored junior developers in best coding practices and game design principles, promoting a culture of continuous learning and improvement."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Developed engaging mobile games using **Unity** and **C#**, integrating **MonoBehaviours**, **ScriptableObjects**, and **Prefabs** to enhance gameplay mechanics and user experience.\nImplemented advanced game features utilizing **Addressables** for efficient asset management, optimizing load times by **30%**.\nDesigned and maintained CI/CD pipelines with **Docker**, ensuring smooth deployment processes and reducing build times by **25%**.\nLeveraged **Redis** for high-performance in-memory data storage, increasing game performance and reducing latency for up to **100,000** concurrent users.\nCollaborated cross-functionally to implement game design and mechanics in **GoLang**, resulting in a cleaner codebase and boosting productivity by **40%**.\nUtilized **SQL** to create and manage databases for player data and game analytics, enabling better decision-making based on user interactions and gameplay data.\nProduced documentation and tutorials on game development best practices, enhancing team skills and reducing onboarding time for new engineers by **20%**.\nParticipated in code reviews and provided mentoring to junior developers, fostering a collaborative environment that led to a **15%** increase in team efficiency."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Developed and optimized mobile game applications using **Unity** and **C#**, ensuring high-performance gameplay and engaging user experiences across various mobile devices.\nDesigned and implemented **MonoBehaviours** and **ScriptableObjects**, enhancing modularity and reusability within the game architecture, leading to a **30%** improvement in development efficiency.\nUtilized **GoLang** for backend services to manage game state and interactions, ensuring seamless real-time multiplayer experiences.\nLeveraged **Redis** for in-game data caching, drastically reducing load times and improving response rates by **50%** during critical gameplay moments.\nCreated and maintained database interactions using **SQL**, ensuring data integrity and optimizing queries to handle over **100,000** concurrent users.\nImplemented CI/CD pipelines with **Docker**, streamlining the development and deployment processes to ensure smoother updates and feature rollouts, reducing deployment time by **40%**.\nDeveloped and integrated **Addressables** for efficient asset management, allowing for dynamic content loading and reducing memory usage by **25%**.\nBuilt reusable **Prefabs** enhancing the speed of scene building and allowing for scalable game design.\nApplied Agile methodologies in teamwork and project management, enhancing communication and project visibility among team members, resulting in timely deliveries and updates.\nOptimized mobile gaming performance through profiling and refining gameplay mechanics, achieving target frame rates on a variety of devices."
    }
  ],
  "skills": "**Programming Languages:**\n\tC#, GoLang, Python, JavaScript/TypeScript\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular, Unity\n\n**API Technologies:**\n\tNginx, Keycloak (OIDC, RBAC), OAuth2, JWT\n\n**Serverless and Cloud Functions:**\n\tAWS: Lambda, ECS; Azure: App Services\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis, SQL\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS: RDS, S3; Azure: Blob Storage, SQL Database\n\n**Other:**\n\tArtificial Intelligence & Machine Learning: MLflow, Airflow, Kubeflow; game development, MonoBehaviours, ScriptableObjects, Prefabs, Addressables, mobile gaming",
  "apply_company": "Limit Break"
}