{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior IT Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Senior IT Engineer with a robust skill set in **Azure**, **PowerShell**, **Microsoft 365**, **Microsoft Graph**, and **Intune**, adept at implementing **Conditional Access**, **DLP**, and compliance measures such as **RBAC**, **OAuth**, **OIDC**, and **SAML**. Proficient in utilizing **Microsoft Sentinel**, **Azure Policy**, and **Microsoft Purview** for advanced security and compliance management. Extensive experience in network fundamentals, eDiscovery, and insider risk mitigation. \n\nBringing over 13 years of experience as a Full Stack Developer, specializing in high-performance application development within healthcare and financial sectors. Highly skilled in **JavaScript/TypeScript**, **Python**, and **Flutter**, with hands-on expertise in both frontend and backend frameworks including **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**. Proven track record in deploying cloud-native systems and implementing microservices architectures. Strong background in AI/ML-powered platforms, compliance-driven development, and MLOps with modern tools such as **MLflow**, **Airflow**, and **Kubeflow**.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior IT Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Managed Microsoft 365 environments, ensuring seamless integration of **Azure** and **Microsoft Graph** to enhance organizational productivity.\n• Administered **Microsoft Entra ID** for secure user identity management, implementing **RBAC** and **Conditional Access** to protect sensitive data.\n• Developed automated scripts using **PowerShell** to streamline IT operations, improving efficiency by **25%** in account provisioning processes.\n• Oversaw **DLP (Data Loss Prevention)** policies to safeguard company data against unauthorized access, achieving compliance with industry regulations.\n• Configured and managed **Intune** to streamline device management and deployment, supporting a fleet of over **500** devices.\n• Designed security frameworks leveraging **Microsoft Defender** to detect and respond to threats, reducing incident response time by **40%**.\n• Conducted audits and implemented best practices in **eDiscovery** and **Records Management** to maintain integrity and accountability within operational procedures.\n• Collaborated effectively with cross-functional teams to communicate IT changes and updates, enhancing client satisfaction and engagement levels.\n• Developed and enforced operational standards that align with **Audit Frameworks**, ensuring continuous compliance across various environments.\n• Implemented **Microsoft Sentinel** to monitor security incidents and streamline incident response workflows, improving threat detection capabilities.\n• Conducted insider risk assessments, utilizing risk management frameworks to mitigate vulnerabilities and protect sensitive information.\n• Maintained network fundamentals and security protocols, ensuring a robust infrastructure that supports organizational objectives."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Implemented security measures for Microsoft 365 environments, enhancing protection and compliance for **9,000+** users while utilizing **Azure** services and **Intune** for device management and Conditional Access configurations.\nAutomated administrative tasks and reporting processes using **PowerShell**, streamlining operations for IT support staff by reducing manual effort by **40%**.\nLeveraged **Microsoft Graph** API to integrate applications and streamline user management and provisioning, improving onboarding processes by **3 days**.\nDesigned and enforced RBAC policies and implemented **Azure Policy** to ensure adherence to organizational standards, reducing audit findings by **50%**.\nManaged security events and incidents using **Microsoft Sentinel**, significantly improving incident response times to under **30 minutes** with enhanced monitoring and alerting.\nConducted detailed eDiscovery and records management processes as part of compliance requirements, increasing the efficiency of audit preparation by **25%**.\nDeveloped and delivered training sessions for clients on security best practices, achieving a satisfaction rate of over **90%** in feedback surveys.\nImplemented insider risk management strategies, adapting workflows to identify anomalies and prevent data leakage effectively."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Leveraged **Azure** and **Microsoft 365** to implement conditional access policies and safeguard enterprise resources, ensuring compliance and security across systems.\nUtilized **PowerShell** scripting for automation of administrative tasks and configuration management, enhancing efficiency by up to **30%** in routine IT operations.\nDeployed and managed **Microsoft Graph** for seamless integration of user data and resource management, facilitating user onboarding and provisioning processes in an agile manner.\nImplemented robust role-based access control (**RBAC**) and OAuth protocols to secure IT platforms, ensuring that sensitive data adheres to GDPR regulations and enhances user protection.\nDesigned and executed **Microsoft Sentinel** for advanced threat detection and analytics, leading to a **40%** improvement in incident response times.\nDeveloped DLP policies utilizing **Microsoft Purview**, minimizing data leakage incidents and maintaining compliance with internal and external audit requirements, achieving a **25%** reduction in data exposure risks.\nEnsured network fundamentals and security best practices were adhered to within cloud infrastructures, using **Azure Policy** for consistent compliance and governance.\nConfigured and managed **Intune** for device management and securing endpoints, providing users with a single sign-on experience while maintaining device compliance.\nEstablished insider risk management strategies using advanced analytics to detect and respond to potential threats, contributing to a safer workplace environment.\nConducted eDiscovery and records management processes to ensure compliance with audit frameworks, reducing the costs associated with legal inquiries by **20%**.\nFostered strong client communication skills to align IT solutions with business needs, resulting in enhanced service delivery and user satisfaction across the board.\nActively collaborated in shifting IT operations towards a more secure, scalable cloud environment utilizing innovative tools and methodologies."
    }
  ],
  "skills": "**Programming Languages:**\n\tPython: FastAPI, Flask, Django\n\tJavaScript/TypeScript: React, Vue, Angular\n\n**Backend Frameworks:**\n\tNone\n\n**Frontend Frameworks:**\n\tNone\n\n**API Technologies:**\n\tOAuth, OIDC, RBAC, SAML\n\n**Serverless and Cloud Functions:**\n\tAWS: ECS, Lambda, RDS, S3\n\tAzure: App Services, Blob Storage, SQL Database\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare)\n\tMongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes\n\tGitHub Actions, GitLab CI/CD\n\tTerraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tMicrosoft 365\n\tMicrosoft Graph\n\tEntra ID\n\tPowerShell\n\tAzure Policy\n\tMicrosoft Sentinel\n\n**Other:**\n\tClient Communication\n\tAudit Frameworks\n\tDLP\n\tConditional Access\n\tIntune\n\tDefender\n\tNetwork Fundamentals\n\tMicrosoft Purview\n\tInsider Risk\n\teDiscovery\n\tRecords",
  "apply_company": "Ideamine Technologies (Acquired by Netrix Global)"
}