{
  "name": "Damian Franciszek Pospiech",
  "role_name": "QA Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-187801395/",
  "profile_summary": "Result-driven QA Engineer with over 13 years of experience in ensuring high-quality standards for applications in healthcare and financial sectors. Proficient in **API testing**, **JSON validation**, **data quality validation**, and adept with tools such as **Postman**, **Newman**, **Cypress**, **Playwright**, and **Jest**. Skilled in analyzing **REST APIs** and understanding complex data structures for large dataset comparison. Strong expertise in **Python** and **JavaScript** contributing to automated testing and validation processes. Experienced in implementing **CI/CD tools** to enhance deployment workflows and apply automation frameworks for efficient testing. Highly attentive to detail with excellent problem-solving capabilities, ensuring compliance and documentation are thoroughly maintained. Further background in developing AI tools and an established track record in building and deploying cloud-based applications using **React**, **Node.js**, and **Django**.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "QA Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Conducted thorough **API testing** and **JSON validation** for REST APIs, ensuring optimal performance and adherence to industry standards using tools such as **Postman**, **Newman**, and **Cypress**.\nExecuted data quality validation processes on large datasets, utilizing strong **data structure understanding** to ensure accuracy and reliability in data handling.\nDeveloped and maintained automated testing frameworks utilizing **Jest**, **Cypress**, and **Playwright** for enhanced test coverage across various application layers, achieving a **coverage rate of over 90%**.\nImplemented CI/CD pipelines leveraging **GitHub Actions** and **CircleCI** for automated deployment and testing, improving deployment efficiency by **40%**.\nCollaborated with development teams to ensure comprehensive documentation of test cases and processes, showcasing strong attention to detail and effective communication skills.\nEngaged in problem solving and debugging efforts during the QA process, identifying critical defects and contributing to continuous improvement initiatives.\nParticipated in the validation of complex algorithms, ensuring data quality for intelligent features in applications, particularly in the finance and healthcare domains.\nAssisted in the integration and validation of AI tools and models, ensuring reliable performance during the automation testing phase, while adhering to standard QA practices.\n"
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Conducted extensive **API testing** using **Postman** and **Newman** to ensure reliability and performance of **REST APIs**.\nPerformed **data quality validation** and **JSON validation** on large datasets comparing structures and values efficiently.\nImplemented automated tests using **Cypress**, **Playwright**, and **Jest**, contributing to improved test coverage and defect detection by over **30%**.\nUtilized **Python** and **JavaScript** to create and refine test scripts and frameworks, ensuring seamless integration within the **CI/CD pipeline**.\nCollaborated with development teams to establish **data structure understanding**, enabling effective communication regarding potential issues within the application.\nDocumented test strategies, processes, and outcomes with a focus on clarity and detail, enhancing team knowledge and project transparency.\nLeveraged **automation frameworks** to automate functional testing and regression testing, reducing manual efforts by **50%**.\nEmployed **AI tools** to analyze test results and provide insights into performance bottlenecks, escalating resolutions to stakeholders.\nDemonstrated excellent **problem-solving** skills by troubleshooting complex issues found during testing phases, ensuring a production-ready experience for users."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Conducted **API testing** using **Postman** and **Newman** to ensure the accuracy and reliability of REST APIs, validating **JSON** structure and data quality throughout the e-commerce platform.\nPerformed comprehensive **data quality validation** and **large dataset comparison** to identify discrepancies and ensure high data integrity, which supported improved decision-making and user experience.\nDeveloped automated test cases leveraging **Cypress** and **Playwright** for end-to-end testing, focusing on creating reliable frameworks that streamlined testing procedures across various modules, achieving a 25% reduction in manual testing efforts.\nCollaborated with developers to enhance **REST APIs** by providing feedback on functionality based on rigorous testing and data structure understanding, leading to a 30% improvement in response times.\nUtilized **Python** and **JavaScript** in the automation of testing scripts, enhancing the testing process, and improving overall coverage by 40%.\nEngaged with **CI/CD tools** to implement automated testing pipelines, ensuring that new code deployments maintain optimum performance and do not introduce defects, followed by regular documentation to maintain clarity on testing processes.\nLeveraged problem-solving skills to quickly identify issues during testing phases, prioritizing bug fixes and supporting rapid feature rollouts to align with business objectives and timelines.\nEmphasized **attention to detail** in all QA processes, ensuring adherence to project requirements and quality standards, which directly contributed to an increase in overall product launch success rates by 20%.\nParticipated in the documentation of testing methodologies and results, creating clear, organized reports that drive stakeholder decisions and improve project transparency."
    }
  ],
  "skills": "Programming Languages:\n\t**Python**, **JavaScript**\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\t**REST APIs**, **API testing**, Postman, Newman, JSON validation\n\n**Serverless and Cloud Functions:**\n\tAWS: ECS, Lambda, RDS, S3, Azure: App Services, Blob Storage, SQL Database\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, CI/CD tools, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tNginx, Let’s Encrypt, Certbot\n\n**Other:**\n\t**data quality validation**, **data structure understanding**, **large dataset comparison**, **automation frameworks**, **Cypress**, **Playwright**, **Jest**, **MLflow**, **Airflow**, **Kubeflow**, **AI tools**, **problem-solving**, **documentation**, **attention to detail**"
}