{
  "name": "Patryk Zaslawski",
  "role_name": "Senior Full Engineer",
  "email": "patrykzas0428@outlook.com",
  "phone": "+48669862402",
  "address": "Gdanski, Poland",
  "linkedin": "https://www.linkedin.com/in/patryk-z-9b9455391/",
  "profile_summary": "As a Senior Full Stack Engineer with over 8 years of experience, I excel in designing and implementing sophisticated software solutions anchored in **Laravel**, **React**, **JavaScript**, **TypeScript**, **PHP**, **MySQL**, and modern frontend technologies. My proficiency in **Docker**, **Kubernetes**, and CI/CD processes enables efficient deployment and scaling of applications. I bring a solid understanding of **TDD** and Agile methodologies to promote high-quality code and rapid iteration. Additionally, I leverage strong analytical skills, critical thinking, and excellent communication abilities to enhance user experience and foster effective teamwork. Building on my expertise in **Python** (FastAPI, Django, Flask, SQLAlchemy), **AWS**, and database optimization, I deliver high-performance applications specifically tailored to the e-commerce, financial, and healthcare sectors.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2014",
      "to_year": "2017",
      "location": "United Kingdom",
      "university": "The University of Manchester"
    }
  ],
  "experience": [
    {
      "role": "Senior Full Engineer",
      "company": "Binary Studio",
      "from_date": "Aug 2023",
      "to_date": "Present",
      "location": "United Kingdom (Remote)",
      "responsibilities": "Led the architectural design and development of a scalable, cloud-native **Healthcare Experience Platform** using **Laravel** and **PHP**, enabling secure healthcare data exchange, real-time patient engagement, and compliance with HIPAA, FHIR, and GDPR.\nIntegrated payment gateways (**Stripe, PayPal, Adyen**) into **Laravel** services to support secure, scalable, multi-currency transactions across web and mobile platforms.\nEnsured PCI DSS compliance by implementing tokenization, end-to-end encryption, OAuth 2.0, and secure storage of sensitive data using **MySQL** and **Laravel** security practices.\nDeveloped real-time fraud detection services in **Laravel**, combining rule-based systems with third-party providers to proactively mitigate chargebacks and fraudulent activity.\nDesigned and implemented idempotent RESTful and **gRPC APIs** in **Laravel**, with JWT-based authentication and RBAC to secure financial and healthcare workflows.\nBuilt transaction logging and auditing frameworks in **MySQL**, integrated with **Power BI** and **Grafana** for traceability, compliance reporting, and operational insights.\nSpearheaded the migration from monoliths to **Laravel**-based microservices, deployed on **Kubernetes** with **Docker**, improving scalability, resilience, and high availability.\nArchitected ETL pipelines in **Laravel** to support real-time ingestion of healthcare and financial data.\nLed and mentored a cross-functional team of **10+ engineers**, guiding development in **Laravel**, **React**, **JavaScript**, **HTML5**, and **CSS** with a focus on **Agile** and **DevOps** practices.\nDesigned and deployed secure APIs with **Laravel** microservices, enabling seamless communication with healthcare providers and third-party platforms using OAuth 2.0.\nOptimized data storage and querying with **MySQL**, implementing indexing, partitioning, and caching for large-scale datasets.\nAutomated healthcare workflows (patient scheduling, claims adjudication) with **Laravel** services integrated into **CI/CD** pipelines.\nImplemented observability in **Laravel** services using **Prometheus**, **Grafana**, and ELK stack for monitoring and proactive issue resolution.\nBuilt secure, efficient **Laravel** microservices deployed via **CI/CD** pipelines (*GitHub Actions*, *Azure DevOps*), ensuring automated testing, linting, and multi-environment releases.\nChampioned DevOps automation for **Laravel**-based systems, provisioning infrastructure with **Terraform** and reducing deployment times and configuration drift.\nDeveloped front-end integrations with **Laravel** backends using **React** and **TypeScript**, applying modern state management techniques for improved user experience.\nEstablished test strategies in **Laravel** with automated performance tests, ensuring reliable and scalable deliveries.\nEnsured compliance with SOC 2, ISO 27001, HIPAA, and PCI DSS by embedding security best practices into **Laravel** microservices and cloud workflows.\nGuided the adoption of event-driven architectures in **Laravel** using messaging systems, enabling asynchronous communication across distributed services.\nMentored junior engineers in **Laravel**, **React**, and cloud-native design patterns, while promoting **Agile** and **DevOps** practices.\nConfigured and maintained **CI/CD** pipelines for **Laravel** microservices, incorporating automated builds and release management.\nUtilized **Docker** within legacy contexts, integrating it with **Laravel** services and **React** frontends to deliver enhanced digital healthcare experiences."
    },
    {
      "role": "Software Engineer",
      "company": "Ardigen",
      "from_date": "Mar 2020",
      "to_date": "Aug 2023",
      "location": "Poland",
      "responsibilities": "• Spearheaded the development of user-centric applications using **React**, **JavaScript**, and **TypeScript**, enhancing user experience and improving retention by **30%**.\n• Designed and developed RESTful APIs with **Laravel** integrated with **MySQL**, facilitating seamless data management and ensuring efficient operations for 1000+ users.\n• Implemented CI/CD pipelines using **Docker** and **Kubernetes**, resulting in a **40%** decrease in deployment times and increasing robustness of application delivery.\n• Built dynamic, responsive interfaces with **HTML5** and **CSS**, applying best practices in **User Experience** to drive engagement and usability.\n• Employed Test Driven Development (TDD) principles to enhance code quality and reliability through automated unit testing, leading to a **50%** reduction in post-production bugs.\n• Led cross-functional teamwork efforts in an **Agile** environment, fostering collaboration and communication that reduced project completion times by **20%**.\n• Analyzed system performance and implemented solutions that improved overall application efficiency by **15%** through optimization and refactoring.\n• Utilized critical thinking and analytical skills to address complex problem-solving tasks, enhancing workflow and project outcomes.\n• Managed system configurations and deployments in **Kubernetes**, enabling rolling updates and auto-scaling for improved application availability.\n• Collaborated with stakeholders to ensure alignment of project goals, refining project scope, and delivering client-centric solutions."
    },
    {
      "role": "Software Engineer",
      "company": "Altum Software",
      "from_date": "Oct 2017",
      "to_date": "Feb 2020",
      "location": "United Kingdom",
      "responsibilities": "Designed and optimized backend services for an e-commerce platform using **PHP** and **Laravel**, enhancing scalability and performance by 30% across checkout, cart, and order fulfillment modules.\nDeveloped robust RESTful APIs in **PHP** to handle high-volume transactions, ensuring seamless integration between frontend interfaces and backend systems for real-time customer interactions.\nLeveraged **MySQL** with **Laravel's Eloquent ORM** to design, optimize, and manage transactional databases, improving query performance by 20% and significantly reducing latency.\nBuilt dynamic, responsive frontends integrated with **Laravel** backends using **React**, **JavaScript**, **TypeScript**, **HTML5**, and **CSS**, applying modern state management for smooth user experiences.\nAutomated builds, testing, and deployments with CI/CD pipelines (using **GitHub Actions**, **Azure DevOps**, and **Jenkins**) to ensure consistent and reliable delivery of features every 2 weeks.\nContainerized **PHP** applications using **Docker**, streamlining deployments and enabling scalable operations across multiple environments.\nImplemented Test-Driven Development (TDD) practices to ensure high code quality and maintainability through unit and integration tests with tools like PHPUnit.\nConducted performance testing with **JMeter** and **k6**, identifying bottlenecks and optimizing **PHP** services to handle peak traffic loads of up to 1,000 concurrent users.\nMigrated legacy codebases to modern **PHP** frameworks, ensuring efficient, maintainable, and scalable backend systems while preserving critical business workflows.\nBuilt secure user authentication systems using **Laravel**'s built-in capabilities for seamless access and management.\nEnhanced user experience through critical thinking and teamwork, delivering features aligned with Agile methodologies and project timelines.\nCollaborated efficiently with cross-functional teams, utilizing strong communication skills to convey project progress and challenges effectively.\nDesigned SEO-optimized, mobile-friendly websites integrated with **Laravel** backends for cross-device accessibility, increasing organic traffic by 25%.\nImplemented caching strategies with **Redis** in **PHP** applications, resulting in a 40% improvement in response times for frequently accessed resources."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, PHP, JavaScript, TypeScript\n\n **Frontend Frameworks:**\n\tReact, Angular (1–16), Next.js, Vue.js (2/3), Blazor\n\n **Backend Frameworks:**\n\tFastAPI, Django, Flask, Laravel, Spring Boot\n\n **API Technologies:**\n\tREST & gRPC APIs\n\n **Serverless and Cloud Functions:**\n\tAWS (Lambda), Azure (App Services)\n\n **Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, CI/CD, TDD, DevOps, Agile\n\n **Cloud & Infrastructure:**\n\tAWS (ECS, RDS, S3), Azure (Blob, SQL), Nginx, Certbot\n\n **Other:**\n\tKeycloak (OIDC, RBAC), JWT, OAuth2, User Experience, Critical Thinking, Communication, Teamwork, Analytical Skills",
  "apply_company": "Workwize"
}