{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Cloud Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "As a knowledgeable Senior Cloud Engineer with 8 years of extensive experience, I excel in **Azure** cloud architecture and governance, leveraging **Infrastructure as Code** tools like **Terraform**, **ARM Templates**, and **Bicep** to design and implement highly secure cloud solutions. I possess a solid understanding of **Zero-Trust Security**, utilizing **Defender for Cloud** and **Sentinel** to enhance security compliance and risk management. I am well-versed in developing **Cloud-First Strategies** and leading migration projects while ensuring adherence to security and compliance standards such as HIPAA and PCI DSS. \nIn addition, my background as a Full Stack Developer enables me to bring insights into the integration of modern technologies, including **JavaScript/TypeScript**, **Python**, and **Flutter**, as well as frameworks like **React**, **Next.js**, and **Node.js**. This unique blend of skills enriches my ability to contribute effectively to dynamic enterprise environments, ensuring robust, high-performance applications. I am bilingual in **German** and **English**, enhancing collaboration in diverse teams.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Cloud Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Designed and implemented **cloud architecture** solutions using **Azure**, ensuring compliance with governance and zero-trust security principles, while migrating legacy systems to cloud-native environments.\n- Utilized **Infrastructure as Code** with **Terraform**, **ARM templates**, and **Bicep** to automate and manage cloud resources effectively, reducing deployment times by **30%**.\n- Established security measures using **Defender for Cloud** and **Sentinel**, enhancing compliance with regulatory standards and ensuring adherence to best practices in cloud security.\n- Collaborated with cross-functional teams to develop a **cloud-first strategy**, enabling efficient resource utilization and scalability across environments, resulting in a **25%** increase in overall system performance.\n- Conducted assessments for cloud migration projects, providing insights and guidance for optimal cloud architecture and infrastructure positioning, while supporting multiple language needs in both **German** and **English**.\n- Implemented monitoring and alerting systems for cloud services to ensure high availability and reliability, achieving a downtime reduction of **15%**.\n- Provided technical leadership in the integration of **Microsoft 365** into cloud solutions, facilitating seamless collaboration tools for end-users.\n- Formulated governance frameworks to monitor and maintain compliance across cloud platforms, leading to **100%** adherence during audits.\n- Enhanced existing platforms by integrating automated workflows and compliance checks into the CI/CD pipelines, maximizing deployment efficiency and security across all applications.\n- Delivered training sessions for teams on **cloud security** practices and compliance strategies, empowering engineers with the knowledge to uphold high security standards."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Implemented **Azure** solutions and embraced a **Cloud-First Strategy** to transform the cloud infrastructure by leveraging **Infrastructure as Code** tools such as **Terraform**, **ARM Templates**, and **Bicep** for efficient resource management and deployment.\nDeveloped and maintained security best practices to ensure **Zero-Trust Security** principles using **Microsoft Defender for Cloud** and **Microsoft Sentinel**, enhancing compliance with industry regulations and standards.\nConducted cloud architecture assessments and governance evaluations, achieving a **95% compliance** rate with security policies across cloud deployments.\nLed migration projects, successfully transitioning **75%** of on-premises applications to **Microsoft 365** and **Azure**, improving operational efficiency and reducing costs by **30%**.\nDesigned scalable and secure cloud architectures that support various applications, ensuring high availability and disaster recovery strategies aligned with business objectives.\nActed as a key liaison between cross-functional teams to establish best practices for cloud governance and security, resulting in a **40% reduction** in security incidents.\nRegularly communicated technical concepts and strategies in both **German** and **English**, facilitating collaboration with diverse teams and stakeholders.\nMonitored cloud environments and implemented automated compliance checks using **Azure Policy**, improving compliance reporting accuracy by **60%**."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "• Designed and implemented cloud architecture strategies using **Azure**, ensuring compliance with **Governance**, **Security**, and **Compliance** frameworks across global infrastructure environments.\n• Developed Infrastructure as Code (IaC) solutions utilizing **Terraform**, **ARM Templates**, and **Bicep** to automate and streamline cloud deployment processes, enhancing operational efficiency by **30%**.\n• Managed migration activities and optimized resources in **Microsoft 365**, facilitating seamless transitions and improving scalability for digital workforce initiatives, achieving a **40%** reduction in onboarding time.\n• Applied **Zero-Trust Security** principles while integrating **Defender for Cloud** and **Sentinel** for proactive threat management and governance, enhancing incident response capabilities and reducing security incidents by **25%**.\n• Spearheaded the establishment and maintenance of a **Cloud-First Strategy**, aligning infrastructure developments with organizational goals to support robust and secure cloud environments.\n• Conducted training sessions in both German and English, ensuring that cross-functional teams are aligned with cloud governance best practices and compliance regulations, leading to a **50%** increase in team proficiency.\n• Collaborated with stakeholders to implement best practices for **cloud architecture**, focusing on reliability, scalability, and performance optimization in cloud-based solutions.\n• Enhanced security protocols through comprehensive audits and assessments, applying industry-leading standards for protecting corporate data within cloud infrastructure.\n"
    }
  ],
  "skills": " **Programming Languages:**\n\tPython(FastAPI, Flask, Django), JavaScript/TypeScript (React, Vue, Angular) \n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django \n\n **Frontend Frameworks:**\n\tReact, Vue, Angular \n\n **API Technologies:**\n\tN/A \n\n **Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda), Azure (App Services) \n\n **Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis \n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose \n\n **Cloud & Infrastructure:**\n\tAWS (RDS, S3), Azure (Blob, SQL, Governance, Security, Compliance, Migration), Cloud Architecture, Cloud-First Strategy \n\n **Other:**\n\tMLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, Infrastructure as Code, ARM Templates, Bicep, Zero-Trust Security, Defender for Cloud, Sentinel, Microsoft 365, German, English",
  "apply_company": "SelectLine Holding GmbH"
}