{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior PHP Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "Experienced Senior PHP Engineer with 8 years of expertise in building high-performance web applications and API integrations. Proficient in **PHP**, **RESTful APIs**, and **web infrastructure**, I excel in developing secure coding practices while adhering to OOP, SOLID principles, and clean code methodologies. I have a strong focus on web security and design patterns, ensuring robust application architecture and performance. \n\nIn addition to my PHP skills, I possess a comprehensive tech stack experience that includes **JavaScript**/**TypeScript**, **Python**, and **Flutter**, along with full-stack technologies such as **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**. With significant cloud experience on **Azure** and **AWS**, I’ve successfully led the development of enterprise-grade platforms across the healthcare and financial sectors.\n\nI am adept in microservices architecture and have implemented CI/CD automation to enhance development processes. My leadership experience includes mentoring team members while fostering a culture of problem-solving and effective communication. I have a strong foundation in integrating AI/ML capabilities into applications and am skilled in machine learning pipeline development using tools like **MLflow**, **Airflow**, and **Kubeflow**.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior PHP Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Implemented secure coding practices and design patterns in a **PHP**, **.NET Core** environment to develop reusable and maintainable web applications that meet industry standards.\nDeveloped and integrated **RESTful APIs** and **HTTP** services to ensure seamless communication between web infrastructure components and client applications, focusing on performance and scalability.\nUtilized **Docker** for containerization, enabling consistent environments for development and production, and enhancing deployment processes.\nAdopted OOP principles, **SOLID** design principles, and **Clean Code** practices, which improved the overall quality and readability of the codebase by **30%**.\nLed mentoring sessions and code reviews, fostering a culture of continuous learning and improvement among team members, achieving a **20%** increase in team productivity.\nEngaged in problem-solving to troubleshoot and resolve complex technical challenges, enhancing application reliability and performance metrics by **15%**.\nConducted security audits and implemented web security best practices to protect applications against vulnerabilities, resulting in a **40%** reduction in security incidents.\nCollaborated effectively with cross-functional teams to communicate technical requirements and updates, facilitating a smooth workflow and timely project delivery.\nOptimized existing applications by refactoring legacy code and integrating modern technologies, improving load times by **25%** and usability across platforms.\nUtilized **Knime** for data processing and analysis tasks, enhancing the data-driven decision-making process within the team."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Utilized **PHP** for developing and maintaining robust **RESTful APIs**, enhancing web infrastructure to support high-demand financial applications.\nEmployed **HTTP** best practices along with **OOP**, **SOLID**, and **Clean Code** principles to ensure scalable, maintainable, and secure code bases in the development process.\nImplemented design patterns to foster a modular architecture, enabling faster debugging and easier upgrades in the software lifecycle, improving project timelines by **30%**.\nLed initiatives to improve web security standards, incorporating secure coding practices, to mitigate vulnerabilities, achieving a **50%** reduction in critical security incidents.\nCoached junior developers in advanced programming techniques, fostering a culture of mentorship and continuous learning, resulting in improved team performance and reduced onboarding times by **20%**.\nDeveloped containerized applications using **Docker**, enhancing deployment efficiency and ensuring consistency across development and production environments with a deployment success rate exceeding **95%**.\nCollaborated effectively within cross-functional teams, leveraging strong communication skills to align project goals and timelines, contributing to a coherent workflow that resulted in a **40%** increase in delivery speed.\nSharp problem-solving capabilities allowed for the rapid identification and resolution of technical challenges, minimizing downtime and maintaining service availability for mission-critical applications."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Leveraged **PHP** to design and implement **RESTful APIs** for a high-performance e-commerce platform, ensuring adherence to **SOLID** principles and **OOP** best practices to enhance maintainability and scalability.\nDeveloped secure web infrastructure maintaining **web security** standards, including the implementation of **secure coding** practices to protect user data and comply with GDPR regulations.\nUtilized **Docker** for containerization, enabling seamless deployment across various environments and ensuring consistent integration and delivery.\nMentored junior developers on **Clean Code** principles and **design patterns**, fostering a culture of continuous improvement and collaboration within the engineering team.\nApplied **HTTP** protocols effectively to optimize the performance of web applications, achieving a **20%** reduction in response times for API calls during peak traffic periods.\nEngaged in problem-solving sessions to address system vulnerabilities and improve feature delivery processes, enhancing team communication and efficiency.\nIntegrated and configured **C#** and **.NET Core** services for backend functionalities, educating team members on the synergy between different tech stacks.\nDrove initiatives to enhance system reliability through strategic use of **Knime** for data processing, leading to a **15%** increase in operational efficiency.\nCreated thorough documentation for all developed features, focusing on communication to ensure clarity in technical specifications for stakeholders."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, JavaScript/TypeScript, PHP, C#, .NET Core\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n **Frontend Frameworks:**\n\tReact, Vue, Angular\n\n **API Technologies:**\n\tHTTP, RESTful APIs\n\n **Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n **Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:**\n\tAWS, Azure\n\n **Other:**\n\tArtificial Intelligence & Machine Learning (MLflow, Airflow, Kubeflow), Authentication & Security (Keycloak, JWT, OAuth2, Let’s Encrypt, Nginx, Certbot), OOP, SOLID, Clean Code, design patterns, secure coding, mentoring, problem-solving, communication, web infrastructure, web security",
  "apply_company": "LastPass"
}