{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Java Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Senior Java Engineer with 13+ years of extensive experience in delivering high-performance applications, specializing in **Java** and **Spring Boot**. Proficient in developing **RESTful APIs** and skilled in database management using **MySQL**, **MariaDB**, and **Redis**. Experienced in implementing best practices in **Web Security**, and utilizing frameworks such as **JUnit** and **Mockito** for robust application testing.\n\nExpert in leveraging modern software development methodologies, including **Kanban** and **SCRUM**, with a strong focus on **Dependency Injection** and **Design Patterns** to ensure a high-quality codebase. Proven ability to participate in various software projects, emphasizing compliance with industry standards. Additionally, adept at building AI/ML-powered solutions and deploying cloud-native systems on **AWS** and **Azure**, ensuring scalability and efficiency.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Java Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Developed and maintained robust **RESTful APIs** utilizing **Java** and **Spring Boot**, enhancing application performance and ensuring high response accuracy for external integrations.\nDesigned and implemented efficient data storage solutions using **MySQL**, **MariaDB**, and **Redis**, optimizing data retrieval and improving overall system scalability by up to **30%**.\nConstructed automated testing frameworks using **JUnit** and **Mockito**, ensuring comprehensive unit and integration tests which reduced regression bugs by **25%** across releases.\nCollaborated in an Agile environment utilizing **Kanban** and **SCRUM** methodologies, improving team efficiency and accelerating project delivery timelines by an average of **15%**.\nEnforced **Web Security** best practices across applications to safeguard sensitive user data and ensure compliance with industry regulations, resulting in a **40%** decrease in security incidents.\nApplied advanced **Design Patterns** and **Dependency Injection** principles to create maintainable, scalable, and modular code structures, facilitating easier feature implementations and updates.\nParticipated in API documentation and design standards through **Swagger** and **OpenAPI**, enhancing developer productivity and ease of integration with third-party services.\nMentored junior engineers on **Java** coding standards and best practices, fostering a culture of continuous improvement and knowledge sharing within the team, contributing to a strong collaborative environment."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Designed and developed RESTful APIs using **Java** and **Spring Boot**, ensuring robust and scalable back-end services for financial applications.\nImplemented data storage solutions with **MySQL** and **MariaDB**, achieving a **30%** improvement in query performance and data retrieval speed.\nUtilized **Redis** for caching frequently accessed data, reducing load times by **25%** and enhancing the responsiveness of financial tools and services.\nConducted unit testing with **JUnit** and **Mockito**, achieving over **95%** code coverage and ensuring high-quality code delivery through rigorous testing methodologies.\nEmployed **Swagger** and **OpenAPI** for API documentation, facilitating easier integration and communication with front-end teams and third-party developers.\nApplied design patterns and dependency injection techniques to promote code reusability and maintainability across various applications, resulting in **20%** faster development cycles.\nLed scrum sessions and employed Kanban methodologies to streamline project workflows, ensuring timely deliverables and efficient team collaboration.\nActively enforced web security protocols across applications to safeguard user data and comply with industry standards, resulting in enhanced security posture for financial transactions."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "- Developed and optimized **RESTful APIs** using **Java** and **Spring Boot**, ensuring performance efficiency and integration with backend services, resulting in a **30%** improvement in response times.\n- Architected robust data solutions with **MySQL** and **MariaDB**, managing high-volume transactions and ensuring data integrity for mission-critical applications with an uptime of **99.9%**.\n- Implemented effective caching strategies using **Redis** to enhance application performance, achieving a **50%** reduction in database load during peak traffic periods.\n- Conducted thorough testing using **JUnit** and **Mockito**, ensuring code reliability and maintainability, which contributed to a **25%** decrease in post-deployment bugs.\n- Defined system documentation and API specifications utilizing **Swagger** and **OpenAPI**, streamlining the onboarding process for new developers and reducing time to productivity by **40%**.\n- Engaged in agile project management methodologies like **Kanban** and **SCRUM**, fostering team collaboration and enhancing project delivery timelines by **20%**.\n- Applied advanced design patterns and dependency injection principles to ensure modular architecture, which significantly improved code reusability and simplified system maintenance.\n- Ensured compliance with web security standards and best practices, proactively identifying vulnerabilities and implementing solutions to secure backend systems against potential threats.\n- Collaborated with cross-functional teams to iterate on product design and functionality enhancements, boosting user satisfaction rates by **15%** through continuous feedback and improvement."
    }
  ],
  "skills": "  **Programming Languages:**\n\tPython, Java, JavaScript/TypeScript\n\n  **Backend Frameworks:**\n\tFastAPI, Flask, Django, Spring Boot\n\n  **Frontend Frameworks:**\n\tReact, Vue, Angular\n\n  **API Technologies:**\n\tRESTful APIs, Swagger, OpenAPI\n\n  **Serverless and Cloud Functions:**\n\tAWS: Lambda, Azure: App Services\n\n  **Databases:**\n\tPostgreSQL, MySQL, MariaDB, MongoDB, Redis\n\n  **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n  **Cloud & Infrastructure:**\n\tAWS: ECS, RDS, S3, Azure: Blob Storage, SQL Database\n\n  **Other:**\n\tMLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), OAuth2, JWT, Nginx, Let’s Encrypt, Certbot, JUnit, Mockito, Kanban, SCRUM, Dependency Injection, Design Patterns, Web Security",
  "apply_company": "LUMASERV"
}