{
  "name": "Rei Taro",
  "role_name": "Senior Backend Engineer",
  "email": "rei515@outlook.com",
  "phone": "+48732529451",
  "address": "Warszawa, Poland",
  "linkedin": "https://www.linkedin.com/in/rei-taro-81a410391/",
  "profile_summary": "Results-oriented Senior Backend Engineer with over 10 years of extensive experience in designing and implementing high-performance backend systems. Proficient in **Java**, **Kotlin**, and **Spring**, leveraging **REST** and **gRPC** for robust API design. Skilled in **CI/CD** practices and tools like **Datadog** for observability, alongside infrastructure management with **Terraform** and **Helm**. Experienced in messaging systems such as **Kafka** and **RabbitMQ**, and implementing security protocols including **OAuth2** and **mTLS** for secure communications. Demonstrated ability in building distributed systems with a strong focus on performance analysis and data quality. Original strengths include crafting automation tools, cloud-native architectures, and machine learning pipelines using **Python** frameworks (**FastAPI**, **Django**, **Flask**) on cloud platforms like **AWS** and **Azure**. Adept at mentoring junior developers and contributing to significant projects at leading organizations such as VISA, Sii Poland, and Reply Polska.",
  "education": [
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2010",
      "to_year": "2015",
      "location": "Japan",
      "university": "Keio University"
    }
  ],
  "experience": [
    {
      "role": "Senior Backend Engineer",
      "company": "Leobit",
      "from_date": "Aug 2022",
      "to_date": "Present",
      "location": "Poland",
      "responsibilities": "Engineered scalable distributed systems using **Java** and **Kotlin** under **Spring** framework to enhance backend service efficiency and performance.\nDeveloped REST and gRPC APIs for seamless data communication, ensuring high performance in application interactions.\nImplemented CI/CD practices, leveraging **Terraform** and **Helm** for streamlined deployment processes and robust infrastructure management.\nCreated observability measures using **Datadog** for real-time monitoring and performance analysis of system components.\nDesigned and implemented enhanced security protocols using **OAuth2** and **mTLS** for effective secrets management in API interactions.\nUtilized **RabbitMQ** and **Kafka** for event-driven architecture to ensure reliable message delivery and improve data flow across systems.\nMentored junior engineers, fostering a culture of knowledge sharing and enhancing debugging and performance analysis skills within the team.\nCollaborated with cross-functional teams to align development goals with regulatory compliance, pushing for data quality improvements across projects."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Innovature",
      "from_date": "Nov 2018",
      "to_date": "Jun 2022",
      "location": "Japan",
      "responsibilities": "Developed backend systems in **Java** and **Kotlin** implementing **Spring** framework to automate document workflows, streamline user onboarding, and manage complex reporting processes.\nCreated RESTful APIs and **gRPC** services for microservices architecture, enhancing system efficiency and response times with a focus on **performance analysis** and **observability**.\nManaged the deployment of CI/CD pipelines using **Terraform** and **Helm** on Azure App Services, facilitating consistent and scalable environments that improved deployment speed by **30%**.\nEngineered data pipelines for the secure exchange of regulatory data, employing **Apache Kafka** and **RabbitMQ** to ensure robust data message delivery and integrity with a throughput of **10,000** messages per second.\nPerformed security audits, ensuring compliance with industry standards, and integrated **OAuth2**, **mTLS**, and **API keys** to manage authentication and secure access controls, reducing vulnerabilities by **25%**.\nMentored junior developers on industry best practices in **debugging**, **distributed systems**, and **data quality**, enhancing team productivity and coding standards.\nCollaborated with cross-functional teams to ensure smooth system integration, regulatory compliance, and successful release management, achieving **100%** on-time project delivery."
    },
    {
      "role": "Software Developer",
      "company": "Wizcorp",
      "from_date": "Apr 2015",
      "to_date": "Nov 2018",
      "location": "Japan",
      "responsibilities": "Developed and maintained scalable backend services to enhance trading operations, utilizing **Java** and **Kotlin** with **Spring** framework for efficient trade execution and portfolio management.\nEngineered robust **REST** and **gRPC** APIs, ensuring high performance and reliability for data interaction across distributed systems, achieving a response time under **200ms**.\nImplemented CI/CD pipelines using **Terraform** and **Helm**, improving deployment frequency by over **30%** through automation and streamlined processes.\nMonitored application performance and health with **Datadog**, ensuring observability and maintaining service uptime of **99.9%**.\nCollaborated with frontend teams to integrate **React** applications with backend services, enhancing user experience and data-driven interactions.\nEstablished secure communication channels using **OAuth2** and **mTLS**, safeguarding user data and ensuring compliance with industry standards.\nLed initiatives in performance analysis and debugging, deploying strategic solutions that increased system efficiency by **25%**.\nMentored junior developers on best practices in backend development, contributing to knowledge-sharing sessions and improving team capabilities."
    }
  ],
  "skills": "**Programming Languages**\n\tJava, Kotlin, Python (3.8+), SQL, Bash, JavaScript\n\n**Backend Frameworks**\n\tSpring, FastAPI, Flask, Django, Celery\n\n**Frontend Frameworks**\n\tReact\n\n**API Technologies**\n\tREST, gRPC, OAuth2, mTLS, API keys, secrets management\n\n**Serverless and Cloud Functions**\n\tAWS (EC2, S3, Lambda), Azure, Docker, Kubernetes, GitHub Actions, Azure DevOps\n\n**Databases**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps**\n\tCI/CD, Terraform, Helm, Datadog, RabbitMQ, Kafka\n\n**Cloud & Infrastructure**\n\tAWS, Azure\n\n**Other**\n\tMicroservices, distributed systems, observability, performance analysis, data quality, debugging, mentoring, Pandas, NumPy, scikit-learn, TensorFlow, Airflow, MLflow, PyTest, Git",
  "apply_company": "sunday"
}