{
  "name": "Patryk Zaslawski",
  "role_name": "Machine Learning Engineer",
  "email": "patrykzas0428@outlook.com",
  "phone": "+48669862402",
  "address": "Gdanski, Poland",
  "linkedin": "https://www.linkedin.com/in/patryk-zaslawski-6b04a8397/",
  "profile_summary": "Seasoned Machine Learning Engineer with 8+ years of experience in software engineering, specializing in cutting-edge **Machine Learning** techniques including **PyTorch**, **TensorFlow**, and **scikit-learn** for data-driven insights. Proficient in **Python**, I possess a deep understanding of **Data Integration**, **Data Preprocessing**, and **Model Evaluation**, enabling successful implementation of high-performance machine learning models. Experienced in building and deploying solutions on cloud platforms such as **AWS**, **GCP**, and **Azure**, I excel in developing secure and scalable systems. My strong foundation in **Bioinformatics**, specifically **Genome Assembly** and **Anomaly Detection**, complements my problem-solving capabilities. I am adept at utilizing **Docker** for containerization and designing **RESTful APIs** to enhance system interactions. With a commitment to **scientific communication** and adherence to **ISO 13485** standards, I deliver innovative and reliable solutions, applying both creativity and analytical skills to meet complex challenges.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2014",
      "to_year": "2017",
      "location": "United Kingdom",
      "university": "The University of Manchester"
    }
  ],
  "experience": [
    {
      "role": "Machine Learning Engineer",
      "company": "Binary Studio",
      "from_date": "Aug 2023",
      "to_date": "Present",
      "location": "United Kingdom (Remote)",
      "responsibilities": "Applied **Python** alongside **TensorFlow**, **PyTorch**, and **scikit-learn** to develop machine learning models for healthcare applications, ensuring effective **data integration** and **data preprocessing** for optimal performance.\nConducted thorough **model evaluation** and **benchmarking** on various datasets, leading to a 30% improvement in prediction accuracy for healthcare outcomes.\nImplemented **anomaly detection** systems using advanced algorithms in **Python**, enhancing the capability to identify unusual patterns in patient data and decreasing false negatives by 25%.\nUtilized **Docker** for containerization of ML models, facilitating seamless deployment across different environments and improving scalability.\nDesigned and developed **RESTful APIs** to expose machine learning functionalities, enabling integration with healthcare systems to provide real-time analytics.\nCollaborated on projects utilizing **AWS**, **GCP**, and **Azure** for cloud computing resources, optimizing the running of machine learning workloads and reducing processing time by 40%.\nCreated solutions utilizing **generative modeling** techniques to enhance data simulation and create synthetic datasets for training models with limited samples.\nMentored junior engineers in **scientific communication** and **problem-solving** strategies, fostering a culture of knowledge-sharing and continuous learning in machine learning practices.\nDemonstrated **creativity** by developing novel solutions to complex problems in **bioinformatics** and **genome assembly**, significantly advancing project timelines and outcomes.\nLed initiatives for maintaining compliance with **ISO 13485** standards in machine learning projects within healthcare frameworks, safeguarding data integrity and security.\nEvaluated and implemented innovative **explainability** techniques for machine learning models, ensuring transparency and trust in AI-driven healthcare decisions.\nOptimized **data workflows** with a focus on efficiency, utilizing modern tools and methodologies to improve processing times for large and complex datasets by 50%."
    },
    {
      "role": "Software Engineer",
      "company": "Ardigen",
      "from_date": "Mar 2020",
      "to_date": "Aug 2023",
      "location": "Poland",
      "responsibilities": "Utilized **Python** and **TensorFlow** to develop and implement machine learning models for data preprocessing and model evaluation, ensuring accuracy and reliability in predictions across various applications.\nConducted extensive anomaly detection and benchmarking processes to enhance the robustness of machine learning algorithms in real-world scenarios.\nIntegrated machine learning solutions with existing systems using **RESTful APIs**, allowing secure and seamless data transfer for processing and analysis.\nApplied **scikit-learn** and **PyTorch** frameworks for model training and evaluation, achieving an accuracy improvement of over **15%** in predictive tasks.\nCollaborated with cross-functional teams to create data integration processes using **AWS** and **Azure**, supporting the deployment of machine learning models in production environments.\nDeveloped and refined generative modeling techniques to enhance performance in **bioinformatics** tasks, resulting in faster genome assembly with improved precision.\nDesigned effective data preprocessing pipelines that streamlined data management and improved workflow efficiency by over **30%**.\nImplemented Docker containers to ensure consistent environments for model development and deployment, facilitating a reduction in setup times by **25%**.\nEngineered solutions using **Azure Machine Learning** to create robust and scalable models with capabilities for unsupervised learning, ensuring comprehensive analysis of large datasets.\nCommunicated scientific findings and machine learning strategies to stakeholders effectively, fostering transparency and collaboration throughout the project lifecycle.\nDemonstrated creativity in solving complex problems, applying innovative machine learning techniques to enhance data-driven decision-making processes.\nMaintained compliance with **ISO 13485** standards in the development and deployment of machine learning systems, ensuring high-quality outcomes that meet industry regulations."
    },
    {
      "role": "Software Engineer",
      "company": "Altum Software",
      "from_date": "Oct 2017",
      "to_date": "Feb 2020",
      "location": "United Kingdom",
      "responsibilities": "Implemented machine learning algorithms using **Python**, **scikit-learn**, **PyTorch**, and **TensorFlow** to analyze biological datasets, improving genomic data interpretations by **40%**.\nDesigned and optimized data preprocessing pipelines that integrated and cleaned data from multiple sources, enhancing data quality for model training and evaluation.\nDeveloped robust RESTful APIs in **Python** for model deployment, enabling real-time predictions and integrations into existing systems, with uptime reliability of **99.9%**.\nConducted model evaluation and benchmarking, utilizing metrics to ensure the performance of machine learning models met required standards, achieving a model accuracy improvement of **15%** over previous iterations.\nImplemented anomaly detection techniques to identify irregular patterns within datasets, leading to improved reliability in biological data assessments.\nLeveraged containerization technology with **Docker** to streamline model deployment and testing processes, resulting in reduced deployment times by **30%**.\nAutomated the integration of model outputs with frontend applications, using **RESTful APIs** to ensure seamless user experiences with real-time updates.\nApplied explainability techniques to machine learning models, enhancing end-user understanding and trust in AI outputs, ensuring adherence to **ISO 13485** standards.\nMaintained clear scientific communication to collaborate with cross-functional teams, providing insights into model performance and data insights, thereby fostering innovation and problem-solving.\nUtilized cloud platforms such as **AWS**, **GCP**, and **Azure** for scalable data storage and machine learning model hosting, enhancing operational efficiency.\nEngaged in creativity-driven problem-solving to redesign existing processes, leading to a **25%** increase in project turnaround efficiency."
    }
  ],
  "skills": "**Programming Languages:**\n\tPython, \n\n**Backend Frameworks:**\n\tFastAPI, Django, Flask, Spring Boot, \n\n**Frontend Frameworks:**\n\tAngular (1–16), React (15–18), Next.js, Vue.js (2/3), Blazor, \n\n**API Technologies:**\n\tREST & gRPC APIs, RESTful APIs, \n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL), GCP, \n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis, \n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, \n\n**Cloud & Infrastructure:**\n\tAWS, Azure, GCP, \n\n**Other:**\n\tMachine Learning, PyTorch, TensorFlow, scikit-learn, Bioinformatics, Genome Assembly, Data Integration, Data Preprocessing, Model Evaluation, Benchmarking, Explainability, Anomaly Detection, Unsupervised Learning, Generative Modelling, ISO 13485, Scientific Communication, Problem-Solving, Creativity"
}