{
  "name": "Mariusz Jan Skobel",
  "role_name": "Senior Systems Engineer",
  "email": "mariuszskobel15@outlook.com",
  "phone": "+48 735 343 548",
  "address": "Katowice, Poland",
  "linkedin": "https://www.linkedin.com/in/mariusz-skobel-927764397/",
  "profile_summary": "Senior Systems Engineer with 10+ years of experience leveraging **Microsoft 365**, **Azure**, and **PowerShell** to deliver secure and efficient systems solutions. Proficient in managing **Azure Policy**, **Conditional Access**, and **Endpoint Security** to maintain compliance with industry standards and enhance organizational security posture. Strong expertise in identity management using **Entra ID**, **SAML**, and **OIDC**, enabling secure user authentication and role-based access control (RBAC).\nSkilled in implementing **Microsoft Graph** for streamlined collaboration and data retrieval, and knowledgeable in **Data Loss Prevention (DLP)** strategies and **Microsoft Purview** for data governance. Experienced in incident response and creating efficient workflows that promote teamwork and communication across technical teams.\nBrings substantial expertise in software development with a focus on high-performance solutions in healthcare and finance, utilizing technologies such as **JavaScript/TypeScript**, **Python**, **React**, **Node.js**, and more. Passionate about building systems that are not only technically sound but also drive real-world impact.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2012",
      "to_year": "2015",
      "location": "UK",
      "university": "University of Bristol"
    }
  ],
  "experience": [
    {
      "role": "Senior Systems Engineer",
      "company": "EitBiz",
      "from_date": "Oct 2022",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Demonstrated expertise in **Azure** services, managing and deploying solutions with **Microsoft 365**, **Intune**, and **Defender**, ensuring robust endpoint security and compliance with enterprise policies.\n• Developed automation scripts using **PowerShell** to streamline deployment processes, yielding a **30%** reduction in manual effort and time on tasks.\n• Implemented **Azure Policy** and **Conditional Access** to enhance security posture, enforcing compliance across cloud resources with a focus on Governance and risk management.\n• Managed identity and access management using **Entra ID**, **SAML**, and **OIDC**, ensuring secure and efficient user access to applications for over **1,000** users.\n• Designed and executed incident response strategies, reducing potential security threats by **40%** and ensuring timely communication across teams during incidents.\n• Collaborated with cross-functional teams to enhance collaboration using **Microsoft Graph**, integrating seamless communication tools and improving team productivity by **20%**.\n• Established Data Loss Prevention (DLP) policies using **Microsoft Purview**, protecting sensitive information and achieving compliance with industry standards within **6 months**.\n• Configured role-based access control (RBAC) to manage permissions effectively, optimizing workflow and security across multiple systems.\n• Oversaw endpoint security measures, implementing network fundamentals to protect organizational data and systems from unauthorized access.\n• Facilitated training sessions on best practices for using Microsoft technologies, enhancing team skills and knowledge in security and collaboration solutions."
    },
    {
      "role": "Software Engineer",
      "company": "Tvn S.A.",
      "from_date": "Oct 2019",
      "to_date": "Sep 2022",
      "location": "Poland",
      "responsibilities": "• Utilized **Microsoft 365** and **Azure** to enhance system efficiency and security, implementing **Conditional Access** and **RBAC** protocols to ensure compliance and protect sensitive financial data.\n• Developed and maintained **PowerShell** scripts for automating routine tasks, enhancing operational workflows by reducing manual intervention by **50%**.\n• Managed user identities using **Entra ID** and integrated **Microsoft Graph** to streamline user access and monitoring across various applications, resulting in a **30%** reduction in access-related incidents.\n• Implemented **Intune** for endpoint security management, ensuring compliance with company policies and enhancing device security across the organization.\n• Conducted **Incident Response** activities effectively, achieving an **80%** resolution rate for security incidents within **24** hours through streamlined communication and collaboration.\n• Configured **Microsoft Defender** for proactive threat detection and response, significantly improving the organization's cybersecurity posture against potential threats.\n• Integrated **DLP** solutions to safeguard sensitive financial information, leading to a decrease in data leaks by **40%**.\n• Established a robust framework for **Network Fundamentals** and implemented **Azure Policy** for resource management, ensuring compliance with industry standards and internal protocols.\n• Collaborated with cross-functional teams to deliver effective solutions, enhancing communication and collaboration across different departments and achieving project milestones ahead of schedule."
    },
    {
      "role": "Software Engineer",
      "company": "Timspark",
      "from_date": "Sep 2015",
      "to_date": "Aug 2019",
      "location": "UK",
      "responsibilities": "Implemented robust **Microsoft 365** solutions enhancing collaboration and communication while ensuring seamless integration with **Azure** and other tools like **PowerShell** and **Microsoft Graph**.\nManaged identity and access management solutions with **Entra ID**, enforcing **Conditional Access** policies to safeguard sensitive data and maintain compliance through **DLP** strategies.\nConfigured and maintained **Endpoint Security** solutions, ensuring comprehensive protection against threats while supporting incident response protocols and improving the organization's cybersecurity posture.\nDeveloped and enforced **RBAC** and **SCIM** protocols for effective user access control, aligning with industry standards including **SAML** and **OIDC** for secure authentication processes.\nUtilized **Intune** for device management, ensuring compliance and efficient deployment of organizational policies across a fleet of **9,000** devices, enhancing user experience and device security.\nConducted thorough **Microsoft Purview** assessments to identify and mitigate data risks, resulting in compliance improvements across **3 major policies** related to data governance.\nExecuted **Azure Policy** to enforce compliance standards across cloud resources, drastically reducing misconfigurations by **30%** following audits.\nFacilitated collaboration across teams while leading training sessions on incident response and network fundamentals, improving overall team incident response time by **25%**.\n\n"
    }
  ],
  "skills": " **Programming Languages:**\n\tPython(FastAPI, Flask, Django), JavaScript/TypeScript (React, Vue, Angular)\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n **Frontend Frameworks:**\n\tReact, Vue, Angular\n\n **API Technologies:**\n\tMicrosoft Graph, OIDC, RBAC, SAML, SCIM\n\n **Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n **Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:**\n\tAzure, Microsoft 365, PowerShell, Azure Policy\n\n **Other:**\n\tArtificial Intelligence & Machine Learning (MLflow, Airflow, Kubeflow), Authentication & Security (Keycloak, JWT, OAuth2, Let’s Encrypt, Nginx, Certbot), DLP, Intune, Defender, Conditional Access, Endpoint Security, Network Fundamentals, Incident Response, Collaboration, Communication, Microsoft Purview",
  "apply_company": "Netrix Global"
}