{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Platform Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Senior Platform Engineer with 13+ years of experience in delivering high-performance applications. Proficient in implementing **blockchain** technologies, including **smart contracts** development with **Solidity**, **EVM**, and **Foundry**. Strong programming skills in **Go**, **Rust**, **C++**, and **Scala** for efficient algorithm and data structure design, enhancing system performance. Hands-on expertise in **CI/CD**, optimizing **release pipelines**, and managing **environment orchestration** for seamless deployments.\nDemonstrated capability in building AI/ML-powered platforms with core knowledge in deploying **cloud-native systems** on **AWS** and **Azure**. Skilled in development using **JavaScript/TypeScript**, **Python**, **Flutter**, and frameworks like **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**. Well-versed in compliance-driven development, aligning solutions with HIPAA, FHIR, PCI DSS, and SOC 2 standards. Strong background in MLOps, including model training, serving, and orchestration using **MLflow**, **Airflow**, and **Kubeflow**.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Platform Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Applied advanced **algorithms** and **data structures** to design and build scalable blockchain solutions using **Go**, **Rust**, and **C++** for high-performance systems.\nDeveloped and deployed **smart contracts** using **Solidity**, ensuring robust security practices with **cryptographic primitives** and adhering to best practices in blockchain environment orchestration.\nImplemented CI/CD pipelines leveraging **Foundry** and **GitHub Actions**, ensuring seamless integration and delivery of blockchain applications with effective observability and release workflows.\nLed performance optimization initiatives across platforms, analyzing system performance metrics and implementing improvements that resulted in a **30%** increase in transaction throughput.\nEngineered complex **Merkle trees** to enhance data integrity and security within blockchain transactions, achieving a reduction in verification time by **50%**.\nConfigured and maintained release pipelines ensuring efficient deployment of both microservices and blockchain applications across multiple environments.\nCollaborated cross-functionally to develop observability tools utilizing advanced logging and monitoring frameworks, resulting in proactive identification of systemic issues.\nSupported integration of various intelligent algorithms within the blockchain platform, enhancing operational efficiency and user experience by providing real-time insights and analytics.\nDeveloped thorough testing strategies with **PyTest** and **Postman** ensuring reliability and robustness of all deployments, achieving **100%** test coverage across critical paths.\nPrepared technical documentation and training materials for team members on **EVM** architecture and best practices in **Solidity** development to promote knowledge sharing and skill enhancement."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Implemented cutting-edge **blockchain** solutions, leveraging **EVM**, **Solidity**, and **smart contracts** to enhance financial data security and transaction integrity.\nDeveloped and maintained CI/CD pipelines, ensuring efficient deployment cycles and system reliability using **Foundry** and other orchestration tools.\nOptimized system performance by applying advanced algorithms and data structures, ensuring high efficiency and low latency in the platform architecture.\nIntegrated observability features into the architecture, enhancing troubleshooting and monitoring capabilities across all components.\nUtilized programming languages such as **Go**, **Rust**, **C++**, and **Scala** to develop robust backend services supporting the operational requirements of financial applications.\nImplemented cryptographic primitives and **Merkle trees** to ensure data integrity and secure transaction processing in distributed environments.\nResearched and applied best practices in environment orchestration to streamline development and production workflows for cross-functional teams.\nContributed to platform design discussions by presenting technical insights and system performance optimizations based on thorough analysis and experimentation."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Engineered robust **blockchain** solutions utilizing languages such as **Go**, **Rust**, and **C++** to develop scalable smart contracts, ensuring high throughput and performance across the decentralized application ecosystem.\nDesigned and implemented **CI/CD** pipelines that streamline the build and deployment processes, enhancing system performance and reliability while reducing deployment times by up to **40%**.\nManaged environment orchestration for multi-chain platforms using **Foundry** and **Yul**, ensuring seamless integration and interaction of smart contracts across various **EVM** compatible chains.\nDeveloped algorithms and data structures leveraging **Scala** to optimize transaction processing, achieving **greater than 99.9%** uptime for critical services in blockchain transactions.\nUtilized **Solidity** for crafting secure and efficient smart contracts, implementing cryptographic primitives and **Merkle trees** for data integrity and trust in the blockchain.\nImplemented observability practices that provide real-time insights into system performance and transaction health, utilizing state-of-the-art monitoring tools to maintain optimal service standards.\nPerformed regular audits and optimizations of existing smart contracts to enhance functionality and reduce gas fees by up to **30%**, ensuring competitive service offerings.\nLed initiatives in system performance improvements, employing best practices for resource allocation and transaction efficiency across the platform, targeting a **30%** reduction in average response times.\nCoordinated efforts in maintaining robust release pipelines, ensuring timely and seamless updates while minimizing disruptions across development, testing, and production environments."
    }
  ],
  "skills": "**Programming Languages:**\n\tGo, Rust, C++, Scala, Python, JavaScript/TypeScript\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tSmart Contract\n\n**Serverless and Cloud Functions:**\n\tAWS: Lambda, Azure: App Services\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose, CI/CD, Release Pipelines, Environment Orchestration\n\n**Cloud & Infrastructure:**\n\tAWS: ECS, RDS, S3, Azure: Blob Storage, SQL Database\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, Keycloak, OAuth2, JWT, Nginx, Let’s Encrypt, Certbot, Observability, Algorithms, Data Structures, System Performance, Cryptographic Primitives, Merkle Trees, Foundry, Yul, Solidity",
  "apply_company": "Matter Labs"
}