{
  "name": "Patryk Zaslawski",
  "role_name": "Senior Frontend Engineer",
  "email": "patrykzas0428@outlook.com",
  "phone": "+48669862402",
  "address": "Gdanski, Poland",
  "linkedin": "https://www.linkedin.com/in/patryk-z-107978395/",
  "profile_summary": "As a seasoned Senior Frontend Engineer with 8+ years of software development experience, I excel in utilizing **React**, **JavaScript**, **TypeScript**, **HTML5**, **CSS3**, and **Node.js** to create dynamic and user-friendly web applications. My expertise encompasses state management with **Redux**, automated testing using **Selenium**, and maintaining code quality through tools like **ESLint** and **Prettier**. I am also skilled in cloud computing solutions, seamlessly integrating **AI**, **Blockchain**, and micro frontend architectures into my projects. With a solid foundation in software engineering, I bring a detail-oriented approach and a commitment to delivering high-performance solutions tailored to customer needs.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2014",
      "to_year": "2017",
      "location": "United Kingdom",
      "university": "The University of Manchester"
    }
  ],
  "experience": [
    {
      "role": "Senior Frontend Engineer",
      "company": "Binary Studio",
      "from_date": "Aug 2023",
      "to_date": "Present",
      "location": "United Kingdom (Remote)",
      "responsibilities": "- Developed dynamic user interfaces using **React**, **JavaScript**, and **TypeScript**, ensuring a seamless design and user experience for web applications.\n- Implemented responsive designs with **HTML5** and **CSS3**, enhancing accessibility and usability across devices and platforms, contributing to a **30%** increase in user engagement.\n- Utilized **Redux** for state management, optimizing application performance and improving load times by **15%** through effective data handling.\n- Led the integration of automated UI testing frameworks such as **Selenium** to ensure functional accuracy, executing **100+** tests daily to maintain high-quality standards.\n- Collaborated in a micro frontend architecture, enhancing modularity and team collaboration, resulting in a **25%** acceleration in deployment cycles.\n- Employed **ESLint** and **Prettier** for code quality and consistency, enforcing coding standards and reducing bugs by **20%** before deployment.\n- Worked closely with backend developers to integrate APIs built in **Node.js**, enhancing the product functionality while ensuring smooth data flow.\n- Applied cloud computing principles in delivering scalable frontend solutions hosted on services such as **AWS** and **Azure**, optimizing costs and improving scalability by **40%**.\n- Developed thorough unit testing strategies using tools like Jest, ensuring that all components possess high reliability and performance metrics.\n- Collaborated on design system implementations to promote consistency across all platforms, thereby enhancing the overall user experience and reducing design-related discrepancies by **30%**.\n- Participated in code reviews and agile ceremonies, promoting best practices and fostering a culture of continuous improvement within the team."
    },
    {
      "role": "Software Engineer",
      "company": "Ardigen",
      "from_date": "Mar 2020",
      "to_date": "Aug 2023",
      "location": "Poland",
      "responsibilities": "• Developed dynamic, user-centric frontends using **React** and **JavaScript**, implementing best practices in **ESLint** and **Prettier** for code quality and maintainability.\n• Collaborated with backend teams to create seamless integrations between **Node.js** services and frontend applications, ensuring real-time data retrieval and updates.\n• Built responsive applications with **HTML5** and **CSS3**, optimizing performance through effective use of **Redux** for state management.\n• Conducted automated unit testing with **Selenium** to ensure robust and error-free UI components and customer-facing features.\n• Leveraged **TypeScript** for enhanced type safety and maintainability in large-scale enterprise applications, reducing runtime errors by up to **30%**.\n• Utilized modular design principles to implement **Micro Frontend** architectures, promoting independent deployability and team autonomy.\n• Applied **Cloud Computing** solutions for hosting and scaling UI applications, achieving **99.9%** uptime and fast load times.\n• Integrated **AI** functionalities into the UI for enhanced user experience, driving engagement metrics up by **25%**.\n• Collaborated cross-functionally to ensure compliance with best practices in UI-ToolKit adoption, standardizing components across multiple projects.\n• Engaged in code reviews and performed static analysis to maintain high standards in code efficiency and application performance.\n• Participated in Agile sprints, ensuring timely delivery of features and actively contributing to team retrospectives for continuous improvement."
    },
    {
      "role": "Software Engineer",
      "company": "Altum Software",
      "from_date": "Oct 2017",
      "to_date": "Feb 2020",
      "location": "United Kingdom",
      "responsibilities": "- Developed dynamic and responsive frontends utilizing **React**, **JavaScript**, **TypeScript**, **HTML5**, and **CSS3** to create seamless user experiences.\n- Implemented state management within applications using **Redux** for efficient data handling, improving frontend performance by **30%**.\n- Automated testing and quality assurance processes incorporating **Selenium** to ensure high-quality code delivery and reduce bugs by **25%**.\n- Collaborated on micro frontend architecture strategies to enhance modular application design, resulting in faster deployment cycles.\n- Conducted unit testing to validate functionality, using tools like **ESLint** and **Prettier** for enhancing code quality and maintaining coding standards across projects.\n- Engaged in cloud computing practices, leveraging platforms to deploy scalable applications and enhance availability.\n- Enhanced user interaction through optimized UI-Toolkit implementations, achieving a **15%** increase in user engagement.\n- Implemented CI/CD pipelines to streamline development processes, ensuring consistent and reliable delivery of frontend features.\n- Engaged in constant performance optimization tasks that resulted in reduced load times to under **2 seconds** for core application features.\n- Participated in mentoring sessions for junior developers, improving team competency in **JavaScript**, **TypeScript**, and modern web technologies."
    }
  ],
  "skills": "  **Frontend Frameworks**:\n\tReact, Angular (1–16), Next.js, Vue.js (2/3), Blazor, JavaScript, TypeScript, HTML5, CSS3, Redux, Micro Frontend, UI-ToolKit, Selenium, ESLint, Prettier\n\n  **Backend Frameworks**:\n\tPython (FastAPI, Django, Flask), Spring Boot, Node.js, REST & gRPC APIs\n\n  **API Technologies**:\n\tKeycloak (OIDC, RBAC), JWT, OAuth2\n\n  **Databases**:\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n  **Cloud & Infrastructure**:\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL), Cloud Computing\n\n  **DevOps**:\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD\n\n  **Other**:\n\tBlockchain, AI, Unit Testing",
  "apply_company": "Pragmatike"
}