{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Support Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "As a result-oriented Senior Support Engineer with 8 years of experience, I excel in problem-solving and troubleshooting within diverse environments, including **Windows**, **Linux**, and **Unix** systems. My technical proficiency includes scripting in **Python** and managing **REST** APIs, which complements my strong foundational knowledge in networking concepts such as **FibreChannel** and **IP**. I am adept at leveraging my communication skills to engage with customers effectively, ensuring clarity and satisfaction in resolving technical issues.\nBeyond support roles, I have a solid background in full stack development, utilizing modern tech stacks such as **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**. I have experience integrating machine learning capabilities into production environments and implementing cloud solutions using **Azure** and **AWS**, showcasing my ability to adapt to ever-evolving technological challenges. My organizational and planning skills enhance my capacity to deliver robust solutions aligned with compliance standards, ideally merging technical expertise with a customer-focused mindset.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Support Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Utilized **Python** for scripting and automation to enhance troubleshooting and support capabilities in hybrid environments, optimizing system performance and reliability.\nImplemented and maintained networking protocols, focusing on **IP**, **SNMP**, and **REST** for seamless integration and communication across various platforms.\nProvided expert customer communication while addressing support tickets, ensuring clear problem-solving strategies and organized planning to resolve technical issues efficiently within **24 hours**.\nDeveloped documentation detailing innovative support solutions for **Windows**, **Linux**, and **Unix** systems, ensuring all processes are well-organized and easily accessible for knowledge transfer.\nCollaborated with cross-functional teams to improve the overall support structure, implementing new strategies that reduced ticket resolution time by **30%**.\nLed training sessions for junior engineers on troubleshooting techniques and networking principles, improving team proficiency and reducing escalations.\nMonitored and maintained system performance using advanced tools and metrics, ensuring high availability and minimal downtime, with uptime targets of over **99.9%**.\nConducted regular audits of systems and protocols to identify vulnerabilities and recommend enhancements, improving security and efficiency across the technical landscape.\nDrove initiatives to streamline processes through automation scripts, resulting in a **15%** reduction in manual intervention required for routine support tasks.\nParticipated in on-call rotations to provide escalated support, ensuring business continuity during critical outages and system failures."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Provided expert-level **troubleshooting** and **customer communication** skills to resolve complex issues in financial platforms built on **Node.js (NestJS/Express)** and **Python (FastAPI, Django)**.\nUtilized **scripting** and **planning** to optimize **real-time transaction** monitoring dashboards, enhancing operational efficiency by **30%** with technologies like **React (18)**, **D3.js**, and **Power BI Embedded**.\nEnsured seamless **integration** of **event-driven architecture** using **Kafka**, **RabbitMQ**, and **Azure Service Bus** for enhanced **networking** capabilities, processing over **1 million** events daily.\nSupported the deployment of **ETL pipelines** with **Apache Airflow** and **Azure Data Factory**, managing the ingestion of **financial data** and ensuring accuracy across **99.9%** of batches.\nExecuted **AI/ML** investigations for **fraud detection** using **scikit-learn** and **XGBoost**, effectively identifying suspicious patterns with a detection rate improvement of **25%**.\nConducted thorough reviews and **problem-solving** sessions for system reliability across **Windows**, **Linux**, and **Unix** environments, enhancing service uptime to **99.95%**.\nParticipated in the overall **planning** and **organization** for the adoption of **REST** services, facilitating smoother communication between front-end applications and backend systems."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Utilized **Python** scripting to troubleshoot and resolve complex technical issues in Windows, Linux, and Unix environments, ensuring minimal downtime and optimal performance for backend services.\nLeveraged **REST** APIs effectively to communicate with various stakeholders, enhancing **customer communication** and streamlining support processes.\nApplied strong **problem-solving** skills to analyze network issues, implementing solutions across **FibreChannel** and **networking** protocols to ensure seamless operations.\nEmployed monitoring and management tools to manage **SNMP** configurations, ensuring effective network performance monitoring and issue resolution.\nDemonstrated exceptional **planning** and **organization** abilities to prioritize support tickets, expediting response times and improving overall customer satisfaction by **30%**.\nProvided clear and concise documentation and training materials to enhance team expertise in **scripting** and system processes, contributing to increased knowledge sharing across the organization.\nFacilitated effective communication with cross-functional teams, aiding in troubleshooting efforts and ensuring timely resolutions for customers.\nContributed to a **20%** reduction in service disruptions through proactive system maintenance and timely troubleshooting initiatives.\nUtilized strong technical acumen while evaluating system performance metrics, ensuring adherence to service level agreements (SLAs)."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n **Frontend Frameworks:**\n\tJavaScript/TypeScript (React, Vue, Angular)\n\n **API Technologies:**\n\tREST\n\n **Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n **Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:**\n\tWindows, Linux, Unix\n\n **Other:**\n\tNetworking, Scripting, SNMP, IP, Troubleshooting, CustomerCommunication, ProblemSolving, Planning, Organization, Authentication & Security (Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot), Artificial Intelligence & Machine Learning (MLflow, Airflow, Kubeflow)",
  "apply_company": "Broadcom"
}