{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Back-End Leaning Full Stack Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-623a26390/",
  "profile_summary": "Back-End Leaning Full Stack Engineer with 13+ years of experience specializing in **Node.js**, **TypeScript**, and microservices architecture. Expert in designing and developing robust REST APIs and proficient in using **MongoDB** as a NoSQL database solution. Skilled in **JavaScript** frameworks with a solid background in both frontend and backend development and well-versed in creating responsive UIs using **HTML** and **CSS**. Experienced in deploying and managing applications in **Azure Cloud**, ensuring smooth and containerized deployments. \nPassionate about problem-solving and proactive in enhancing application performance and user experience. Committed to delivering high-quality solutions in compliance with industry standards, specifically within healthcare and financial services.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Back-End Leaning Full Stack Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Utilized **Node.js** and **TypeScript** to design and build full-stack applications, ensuring optimal performance and security.\nDeveloped and integrated **REST APIs** facilitating seamless communication between microservices and frontend components within scalable architectures.\nEmployed **MongoDB** as the primary **NoSQL database** solution, supporting efficient data storage and retrieval for high-traffic applications.\nImplemented microservices architecture to enhance system resilience and maintainability, focusing on containerized deployments using **Docker**.\nBuilt responsive web interfaces with **HTML**, **CSS**, and JavaScript to ensure a user-friendly experience across devices.\nDemonstrated a proactive mindset by identifying bottlenecks and implementing optimizations resulting in performance improvements of up to **25%**.\nEngaged in problem-solving to troubleshoot and resolve technical challenges across the full stack, promoting operational efficiency.\nCollaborated with cross-functional teams to deliver solutions in line with project timelines, achieving a **95%** on-time delivery rate.\nUtilized **Azure Cloud** services for deploying applications, enhancing reliability and scalability through effective cloud solutions.\nMaintained comprehensive documentation of all back-end processes and APIs to ensure clarity and facilitate future development.\nAdapted to evolving technologies and frameworks, continuously enhancing skill set in line with industry standards."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "• Leveraged **Node.js** and **TypeScript** to modernize core financial platforms by migrating to **microservices architecture**, enhancing scalability and performance for high-volume transactional systems.\n• Developed REST APIs using **JavaScript** and **NoSQL databases** like **MongoDB** to support front-end functionalities and data management with a focus on performance and reliability.\n• Engaged in containerized deployments to streamline application delivery across environments, ensuring consistency and quick iteration.\n• Built interactive front-end applications using **React (18)**, **Vue 3**, and **Next.js**, employing design systems powered by **Tailwind CSS** to create responsive interfaces for financial tools and admin panels.\n• Delivered real-time analytics dashboards driven by **D3.js** and **Power BI Embedded**, which provided operations teams with instant insights into **transactions and anomalies** based on data from over **1 million** daily records.\n• Designed and deployed a robust event-driven architecture using **Kafka**, **RabbitMQ**, and **Azure Service Bus**, ensuring asynchronous communication across critical workflows such as payments, alerts, and compliance.\n• Developed ETL pipelines for ingesting financial data from internal and third-party sources leveraging **Python** with **Apache Airflow** and **Azure Data Factory**, supporting both batch and real-time processing for up to **10 TB** of data monthly.\n• Built and deployed machine learning models for fraud detection utilizing **scikit-learn**, **XGBoost**, and **Azure ML**, enabling proactive detection of suspicious activity based on user behavior and transaction patterns.\n• Created ML pipelines for real-time credit scoring, churn prediction, and transaction classification, leveraging **MLflow** and **Airflow** to integrate model inference into backend services, enhancing operational decision-making."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Utilized **Node.js** and **TypeScript** to design and optimize backend services in a **Microservices architecture** for a global e-commerce platform, achieving high availability and scalability across core functionalities like checkout, cart, and order fulfillment.\nDeveloped robust **REST APIs** to facilitate seamless communication between services and distributed systems, contributing to a smooth user experience with performance metrics showing an improvement in response times by **30%**.\nImplemented **NoSQL databases** like **MongoDB** for flexible and high-performance data storage solutions, enabling fast access and scalability for high-traffic e-commerce operations, achieving reduced read latency by **25%**.\nEngineered client-side applications with **HTML**, **CSS**, and **JavaScript**, creating responsive and engaging UIs that adhere to mobile-first principles, resulting in a **20%** increase in user engagement metrics.\nAdopted containerized deployments to streamline application delivery, utilizing **Azure Cloud** services for enhanced reliability and scalability with deployment success rates exceeding **98%**.\nCollaborated in agile teams to troubleshoot and solve complex problems leveraging a proactive mindset, facilitating timely feature delivery and maintenance of service-level agreements (SLAs).\nEnsured secure application access by implementing role-based access control (RBAC) and OAuth 2.0 protocols, aligning with GDPR compliance standards for user data protection across the platform.\nEmployed **Microservices architecture** principles to develop and maintain an evolving tech stack conducive to agile development practices, fostering a collaborative environment among cross-functional teams."
    }
  ],
  "skills": " **Programming Languages:**\n\tJavaScript, TypeScript, Python\n\n**Backend Frameworks:**\n\tNode.js, FastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular, HTML, CSS\n\n**API Technologies:**\n\tREST APIs\n\n**Serverless and Cloud Functions:**\n\tAWS: Lambda, Azure Cloud\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, NoSQL databases, Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Containerized deployments\n\n**Cloud & Infrastructure:**\n\tAWS: ECS, RDS, S3, Azure: App Services, Blob Storage, SQL Database, Terraform, Ansible, Helm, Docker Compose\n\n**Other:**\n\tArtificial Intelligence & Machine Learning: MLflow, Airflow, Kubeflow, Microservices architecture, Problem-solving mindset, Proactive mindset, Authentication & Security: Keycloak (OIDC, RBAC), OAuth2, JWT, Nginx, Let’s Encrypt, Certbot"
}