{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Sales Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Dynamic and results-driven Senior Sales Engineer with over 13 years of experience in delivering high-performance solutions, focusing on **Cloud Security**, **Cybersecurity**, and **Enterprise Network** configurations. Leveraging expertise in compliance standards and frameworks, including **CISSP** and **CCNP**, to align business objectives with technological capabilities in sectors like healthcare and finance.\nProficient in articulating the technical value of security solutions, utilizing **Value Selling Methodologies** effectively to build relationships and foster client trust. Demonstrated capability in deploying **cloud-native systems** on platforms like **AWS** and **Azure**, ensuring alignment with industry standards and enhancing organizational security posture.\nAdept at integrating automation tools and developing secure architectures involving **DLP**, **IPS**, **CASB**, and **SASE**. Strong analytical skills complemented by a proven track record in the MLOps domain, utilizing tools like **MLflow**, **Airflow**, and **Kubeflow** for optimizing AI/ML-powered solutions.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Sales Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Facilitated cloud security solutions ensuring compliance with industry standards, including **CISSP** and **CCNP** frameworks.\nEngaged in enterprise network assessments to optimize **SASE** architectures for enhanced cybersecurity across client infrastructures.\nLed initiatives in deploying **DLP** and **CASB** systems, ensuring protection against data breaches and compliance with regulatory requirements.\nImplemented strategies for **IPS** and **Proxy** solutions, enhancing customer understanding of proactive threat detection.\nUtilized value selling methodologies to articulate and demonstrate the business impacts of proposed security solutions to stakeholders, resulting in a **25%** increase in conversion rates.\nConducted detailed presentations showcasing **CNAPP** strategies during **9** successful client workshops and technology demonstrations, emphasizing tailored security architecture.\nCollaborated with clients to design custom cybersecurity frameworks that met individual enterprise needs, improving overall security posture and resilience against attacks.\nProvided expert guidance on the integration of advanced security services while establishing trusted relationships with potential clients and stakeholders, ultimately driving sales growth by **15%** year-over-year.\nEngaged in continuous education on evolving cybersecurity trends and technologies, ensuring the deployment of innovative solutions tailored to the market demands."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "- Leveraged knowledge of **Cloud Security** tools to ensure secure financial platforms during the transition to microservices architecture.\n- Developed business cases for new technology implementations, emphasizing the importance of compliance with cybersecurity standards like **CISSP** and **DLP**.\n- Collaborated with cybersecurity teams to integrate **Proxy** and **CASB** solutions, enhancing data protection during transactions.\n- Engaged in **Cybersecurity** assessments and solutions designed to protect enterprise networks, showcasing expertise in **IPS** and network security protocols.\n- Presented value-driven solutions by utilizing **Value Selling Methodologies**, aligning technical capabilities with customer needs.\n- Developed ETL pipelines for ingesting financial data from internal and third-party sources, facilitating compliance with enterprise network security standards.\n- Designed and deployed robust event-driven architecture enhancing payment systems with technologies like **Kafka** and **RabbitMQ**.\n- Built real-time analytics dashboards for financial operations, integrating with tools like **Power BI** for better decision-making insights.\n- Engineered machine learning models for proactive fraud detection, improving user security and transactional integrity in financial systems."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Leveraged expertise in **Cybersecurity** and **Cloud Security** to deliver value-driven presentations on advanced security solutions covering **CASB**, **CNAPP**, and **IPS**, demonstrating clear ROI to potential enterprise clients.\nApplied **Value Selling Methodologies** to effectively strategize sales approaches, averaging a **20%** increase in client engagement and facilitating shorter sales cycles.\nExecuted networking strategies utilizing **SASE** and **Enterprise Network** principles to showcase innovative solutions that enhance customer infrastructures, resulting in **15%** higher customer retention rates.\nDeveloped comprehensive security assessments for clients, focusing on **DLP** strategies and risk management, which reinforced the organization's commitment to safeguarding sensitive information.\nConducted in-depth training sessions on **Proxy** solutions to educate clients on maintaining compliance and enhancing their overall security posture, facilitating the adoption of best practices and achieving a **30%** decrease in security incidents post-implementation.\nUtilized knowledge of **CISSP** and **CCNP** certifications to advise clients on best practices in network security, contributing to higher trust and reliability in service delivery and customer satisfaction.\nCollaborated with cross-functional teams to develop tailored security solutions that align with specific client needs, realizing **25%** faster deployment times and ensuring robust protection across their environments."
    }
  ],
  "skills": "**Programming Languages:**\n\tPython: FastAPI, Flask, Django\n\tJavaScript/TypeScript: React, Vue, Angular\n\n**Backend Frameworks:**\n\t\n\n**Frontend Frameworks:**\n\t\n\n**API Technologies:**\n\t\n\n**Serverless and Cloud Functions:**\n\tAWS: ECS, Lambda, RDS, S3\n\tAzure: App Services, Blob Storage, SQL Database\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare)\n\tMongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes\n\tGitHub Actions, GitLab CI/CD\n\tCI/CD & Infrastructure as Code: Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\t\n\n**Other:**\n\tCloud Security\n\tEnterprise Network\n\tSASE\n\tProxy\n\tCybersecurity\n\tIPS\n\tDLP\n\tCASB\n\tCNAPP\n\tValue Selling Methodologies\n\tCISSP\n\tCCNP",
  "apply_company": "Zscaler"
}