{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Software Development Engineer III",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-187801395/",
  "profile_summary": "Experienced Software Development Engineer with 13+ years in high-performance application development, specialized in **TypeScript** and proficient in **C++**. Demonstrated expertise in graphics programming, including **WebGL**, **WebGPU**, and **OpenGL**, with a focus on performance optimization and algorithm development. Hands-on experience utilizing **Web Workers** and **WebAssembly** to enhance application responsiveness and performance. Accomplished in mobile SDKs and GIS technologies, providing solutions that leverage mapping services. Strong communicator and collaborator with a proactive problem-solving approach and a growth mindset. Additionally skilled in building AI/ML-powered platforms and cloud-native systems on **AWS** and **Azure**, leveraging frameworks such as **React**, **Next.js**, **Node.js**, **FastAPI**, and **Django**.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Software Development Engineer III",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Developed high-performance applications utilizing **TypeScript**, ensuring robust **algorithms** and **performance optimization** strategies to enhance overall efficiency.\n• Integrated advanced graphics programming techniques with **WebGL** and **OpenGL** to deliver visually appealing and responsive client-side experiences.\n• Employed **WebAssembly** and **WebGPU** for substantial performance improvements in graphics rendering tasks, achieving up to **30%** faster load times.\n• Conducted problem-solving sessions to tackle complex challenges in application architecture and integrated **Web Workers** for enhanced multi-threading support.\n• Collaborated with cross-functional teams to design and implement scalable mobile solutions using **Mobile SDKs**, leveraging **C++** for performance-critical components.\n• Built mapping functionalities using **GIS** technologies, contributing to the development of dynamic and interactive mapping interfaces.\n• Championed communication and collaboration across development teams, ensuring that all stakeholders were engaged throughout the product lifecycle.\n• Mentored junior developers, fostering a **growth mindset** by sharing best practices in coding standards and software design principles.\n• Contributed to the optimization of application performance through profiling and diagnostics, achieving a **20%** reduction in runtime errors.\n• Drove initiatives for continuous learning and improvement, leading to the successful deployment of updated application versions that improved user satisfaction by **15%**."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "- Leveraged **TypeScript** to develop high-performance web applications, ensuring optimized algorithms for scalability and reliability.\n- Collaborated with cross-functional teams to enhance product features through innovative use of **WebGL**, **WebGPU**, and **WebAssembly** for advanced graphics programming and rendering.\n- Implemented **Web Workers** for multithreading capabilities in applications, improving performance by **30%** in rendering complex visualizations.\n- Designed and optimized solutions using **C++** for mobile SDKs, incorporating mapping and GIS functionalities into the applications to enhance user experience.\n- Actively participated in team communication and collaboration, consistently demonstrating problem-solving skills to tackle project challenges and drive a growth mindset culture.\n- Developed performance optimization strategies that led to a **40%** increase in application speed and efficiency, resulting in a higher user satisfaction rate.\n- Introduced algorithms that reduced data processing times by **25%**, enhancing overall performance across various software components."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "• Developed high-performance applications utilizing **TypeScript**, optimizing algorithms and enhancing performance across the board.\n• Engineered scalable solutions leveraging **WebGL**, **WebGPU**, and **WebAssembly** to create immersive graphics-rich user experiences while adhering to performance optimization principles.\n• Collaborated in cross-functional teams to resolve complex challenges through effective communication and problem-solving strategies, contributing to a growth mindset within the team.\n• Designed modular systems employing **Web Workers** for asynchronous processing, improving application responsiveness and user interaction.\n• Applied **C++** for graphics programming and algorithm development, ensuring high efficiency and reliability in application performance.\n• Integrated GIS functionalities into applications through effective use of **maps** and spatial data visualization techniques, enhancing user engagement.\n• Developed mobile SDKs with a focus on performance and compatibility to expand application reach across various devices.\n• Optimized rendering pipelines using **OpenGL**, increasing frame rates and overall application performance in graphically intense applications.\n• Employed metrics-driven approaches to identify areas for growth and optimization, resulting in a past record of increasing application performance by **35%**.\n• Demonstrated a strong collaboration throughout the development lifecycle, ensuring seamless integration of various technologies and modules with an aim for high availability and low latency across platforms."
    }
  ],
  "skills": "Programming Languages:\n\tTypeScript, Python, C++, JavaScript\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular, WebGL, WebGPU, WebAssembly, Web Workers\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**API Technologies:**\n\tOAuth2, JWT\n\n**Serverless and Cloud Functions:**\n\tAWS: Lambda, Azure: App Services\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS: ECS, RDS, S3, Azure: Blob Storage, SQL Database\n\n**Other:**\n\tAlgorithms, performance optimization, graphics programming, communication, collaboration, problem-solving, growth mindset, MLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), Nginx, Let’s Encrypt, Certbot, Mobile SDKs, maps, GIS"
}