{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Software Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Senior Software Engineer with 13+ years of experience in full-stack development, expertly leveraging **Python**, **JavaScript**, **React**, and **Node.js** to deliver high-performance applications in the healthcare and financial sectors. Proficient in building scalable REST APIs and maintaining code quality through **Git** and Agile methodologies.\nDemonstrated ability in deploying cloud-based solutions on **AWS** and **Azure**, ensuring efficient, compliant systems aligned with industry standards. Adept in problem-solving and time-management, with a strong focus on meeting deadlines without compromising quality. Additionally skilled in developing AI/ML platforms integrating predictive analytics and real-time processing using **FastAPI** and **Django**.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Software Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Developed full-stack applications leveraging **Python**, **JavaScript**, and **Node.js**, utilizing frameworks like **React** (versions **17–18**) to deliver robust solutions.\n• Integrated **REST APIs** to enhance application functionality and ensure seamless data communication between front-end and back-end systems.\n• Employed **Git** for version control and collaboration on codebase, ensuring efficient workflow and code management across the team.\n• Facilitated cloud deployment strategies on **AWS** and **Azure**, optimizing applications for scalability and performance enhancements.\n• Practiced Agile methodologies, ensuring timely project delivery and effective team collaboration, which increased the productivity by **25%**.\n• Solved complex technical challenges through innovative problem-solving techniques, reducing bug resolution time by **40%**.\n• Maintained effective time-management strategies to prioritize tasks and meet deadlines consistently, achieving over **95%** of project milestones on time."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Utilized **Python** and **JavaScript** to modernize core financial platforms by migrating to microservices architecture with **Node.js** (NestJS/Express) and **Python** (FastAPI, Django), resulting in a **30%** increase in scalability and performance for high-volume transactional systems.\nEmployed **React (18)**, **Vue 3**, **Next.js**, and **TypeScript** to build interactive front-end applications, utilizing **Redux Toolkit** and **Tailwind CSS** to create sleek, responsive interfaces for financial tools and admin panels, enhancing user engagement by **25%**.\nDelivered real-time analytics dashboards using **React**, **D3.js**, and **Power BI Embedded**, providing operations teams with instant insights into transactions and anomalies, improving transaction monitoring time by **40%**.\nDesigned and deployed a robust event-driven architecture with **Kafka**, **RabbitMQ**, and **Azure Service Bus**, ensuring asynchronous communication across critical workflows for payments, alerts, and compliance, reducing system latency by **20%**.\nDeveloped ETL pipelines for ingesting financial data from internal and third-party sources utilizing **Python**, **Apache Airflow**, and **Azure Data Factory**, supporting both batch and real-time processing and increasing data processing efficiency by **50%**.\nBuilt and deployed machine learning models for fraud detection using **scikit-learn**, **XGBoost**, and **Azure ML**, enabling proactive detection of suspicious activity based on user behavior and transaction patterns, reducing fraud incidents by **15%**.\nCreated ML pipelines for real-time credit scoring, churn prediction, and transaction classification, leveraging **MLflow** and **Airflow** to integrate model inference into backend services, improving predictive accuracy by **30%**."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Utilized **Python** and **JavaScript** to design and optimize backend services for a global e-commerce platform, ensuring high availability, low latency, and scalability across key modules like checkout and order fulfillment.\nDeveloped innovative REST APIs employing **Node.js** frameworks such as **NestJS** and **Express**, enhancing system integration while supporting an Agile environment for seamless project iterations.\nImplemented cutting-edge frontend applications using **React** (18), ensuring fast, responsive user experiences on both web and mobile platforms through efficient component design and state management.\nLeveraged cloud services like **AWS** and **Azure** for scalable infrastructure solutions, optimizing deployment times by **40%** and improving resource management for high-traffic workflows.\nEngineered real-time features using event-driven architecture powered by **Kafka** and **RabbitMQ**, enabling responsive order updates and dynamic inventory tracking, increasing customer satisfaction metrics by **25%**.\nExecuted robust version control and collaboration through **Git**, enhancing team productivity and ensuring efficient code review practices.\nApplied problem-solving skills to implement Redis caching strategies for product metadata and shopping cart sessions, improving application responsiveness and reducing read pressure on databases by **30%**.\nManaged project timelines effectively, contributing to successful Agile sprints and stakeholder satisfaction while launching new features on schedule.\nUtilized **Agile** methodologies to enhance workflow efficiency, resulting in an improved release cycle with up to **50%** shorter time-to-market for new features.\nDeveloped secure payment workflows integrated with **Stripe**, **PayPal**, and **Razorpay**, ensuring PCI compliance and robust handling of sensitive customer data."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, JavaScript\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django, Node.js\n\n **Frontend Frameworks:**\n\tReact\n\n **API Technologies:**\n\tREST APIs\n\n **Serverless and Cloud Functions:**\n\tAWS, Azure\n\n **Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:**\n\tAWS: ECS, Lambda, RDS, S3, Azure: App Services, Blob Storage, SQL Database\n\n **Other:**\n\tAgile, Problem-solving, Time-management, Keycloak (OIDC, RBAC), OAuth2, JWT, Nginx, Let’s Encrypt, Certbot",
  "apply_company": "Apply4U"
}