{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Reliability Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "As a seasoned Reliability Engineer with 8 years of experience, I specialize in ensuring safety-critical standards and enhancing reliability engineering practices. My expertise encompasses risk assessment, design verification, and creating detailed method statements, ensuring compliance with industry regulations while fostering robust safety protocols.\nI possess strong problem-solving skills and excel in providing technical guidance while collaborating effectively within teams. My communication abilities enable me to articulate complex technical concepts to diverse stakeholders, ensuring alignment in project objectives. In addition to my core reliability engineering focus, I have a rich background in full-stack development with technologies such as **React**, **Next.js**, **Node.js**, **Python**, and **Flutter**, and deep experience in **cloud** solutions with **Azure** and **AWS**. This unique blend allows me to integrate engineering methodologies seamlessly into software solutions, enhancing performance and compliance.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Reliability Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Ensured compliance with safety-critical standards in the design and verification of healthcare and financial platforms, implementing robust **risk assessment** frameworks to achieve high reliability.\nProvided **technical guidance** to cross-functional teams, fostering **collaborative teamwork** to enhance problem-solving capabilities across projects.\nArchitected scalable solutions that adhere to **method statements**, ensuring reliability across system designs and deployments.\nDeveloped comprehensive **design verification** processes to validate the functionality and reliability of applications, maintaining alignment with industry standards.\nLed the implementation of reliable full-stack applications using technologies such as **TypeScript**, **Python (FastAPI)**, **Node.js**, and front-end frameworks like **React (17-18)** and **Next.js** to enhance user experience while adhering to critical design protocols.\nEstablished a proactive communication strategy that facilitated clear and effective interactions among team members, stakeholders, and clients to discuss reliability findings and improvements.\nUtilized **Docker** and **Kubernetes (AKS/EKS)** for creating reliable microservices-based architectures, incorporating high availability strategies in development and deployment.\nImplemented monitoring strategies and reliability tests using tools like **GitHub Actions**, integrating CI/CD pipelines to ensure efficient and safe deployments across multiple environments.\nContributed to the enhancement of system reliability through continuous improvement practices and **problem-solving** techniques, resulting in a 30% reduction in system failure rates and downtime.\nMonitored and reported on reliability metrics, making data-driven recommendations for system enhancements and reliability improvements based on real-time performance analysis."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Applied **reliability engineering** principles to enhance the performance and uptime of critical systems by implementing safety-critical standards and effective **risk assessment** strategies.\nConducted thorough **design verification** processes, ensuring systems met reliability and safety specifications, reducing failure rates by **20%** over a **6-month** period.\nDeveloped comprehensive **method statements** for safety and reliability assurance, contributing to the overall quality and compliance of engineering projects in a collaborative environment.\nProvided proactive **technical guidance** to cross-functional teams, fostering effective problem-solving and innovative solutions to complex reliability challenges in systems design.\nFacilitated **communication** across team members and stakeholders to ensure alignment on project goals and operational expectations, improving project delivery timelines by **15%**.\nPromoted **collaborative teamwork** by mentoring junior engineers and supporting knowledge sharing sessions, enhancing team skill sets in reliability and system performance.\nUtilized data analysis techniques to optimize system reliability metrics, achieving a **10%** increase in overall system availability and performance.\n"
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Ensured compliance with **safety-critical standards** during the design and verification processes of systems supporting **Network Rail**, applying deep expertise in **risk assessment** to mitigate potential failures across various engineering projects.\nProvided **technical guidance** in the implementation of **design verification** methodologies to enhance system reliability and performance, leveraging problem-solving skills to resolve complex engineering challenges.\nConducted thorough **reliability engineering** assessments, delivering detailed **method statements** and risk assessments for new designs, ensuring adherence to industry best practices and regulations.\nCollaboratively worked in cross-functional teams to gather insights and improve system designs through effective **communication**, fostering a culture of **collaborative teamwork** for project success.\nDeveloped and implemented reliability testing protocols, ensuring that all components meet **safety-critical standards** and perform reliably under expected conditions within **Network Rail** projects.\nEngaged in ongoing monitoring and analysis of system performance data, providing recommendations based on empirical evidence to enhance reliability and reduce operational risk.\nFacilitated training sessions and workshops focused on reliability principles and methodologies, enhancing team capabilities and awareness within **Network Rail** initiatives."
    }
  ],
  "skills": "**Programming Languages**:\n\tPython, JavaScript/TypeScript\n\n**Backend Frameworks**:\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks**:\n\tReact, Vue, Angular\n\n**API Technologies**:\n\tJWT, OAuth2\n\n**Serverless and Cloud Functions**:\n\tAWS (ECS, Lambda), Azure (App Services)\n\n**Databases**:\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps**:\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure**:\n\tAWS (RDS, S3), Azure (Blob, SQL)\n\n**Other**:\n\treliability engineering, safety-critical standards, design verification, risk assessment, method statements, technical guidance, problem-solving, communication, collaborative teamwork",
  "apply_company": "Myticas Consulting"
}