{
  "name": "Tomasz Lee",
  "role_name": "Senior Frontend Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Results-driven Senior Frontend Engineer with over 9 years of comprehensive experience in developing and executing scalable web applications. Proficient in **JavaScript**, **TypeScript**, and **React**, with expertise in **Electron** for building cross-platform applications. Well-versed in modern development tools such as **Jenkins**, **GitHub Actions**, **Webpack**, and **Vite** to enhance continuous integration and deployment processes. Experienced in utilizing cloud infrastructure and orchestration through **AWS**, **Kubernetes**, **Terraform**, and **Ansible**. Strong background in backend technologies, ensuring seamless integration with frontend frameworks. Proven track record of delivering high-quality software solutions, optimizing performance, and driving development projects to timely completion.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Senior Frontend Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Utilized **JavaScript**, **TypeScript**, and **React** to develop responsive user interfaces for a web-based customer management platform, enhancing user satisfaction by **25%**.\nSpearheaded the migration of front-end applications to **Electron**, streamlining the deployment process across multiple platforms.\nCollaborated with CI/CD tools such as **Jenkins** and **GitHub Actions** to automate builds and deployments, reducing overall deployment time by **40%**.\nImplemented code optimization techniques using **Webpack** and **Vite**, improving build times by **30%**.\nIntegrated cross-functional features with backend services, ensuring seamless communication via **RESTful APIs**.\nMaintained project management and deployment pipelines using **Azure DevOps** and **Terraform**, ensuring configuration consistency across environments.\nDeveloped and executed rigorous testing frameworks with **Chromatic** for visual regression testing, increasing code reliability and minimizing production bugs by **20%**.\nLeveraged **AWS** services for hosting applications and managing resources effectively, ensuring scalability and availability.\nUtilized monitoring and anomaly detection tools such as **DataDog** and **Sentry** to proactively identify and resolve issues in the application.\nParticipated in code reviews and knowledge-sharing sessions to foster a collaborative development culture."
    },
    {
      "role": "Full Stack Developer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "• Developed interactive user interfaces utilizing **React** and **JavaScript**, leading to a 25% improvement in user engagement on the platform.\n• Implemented build tools with **Webpack** and **Vite** to enhance the development workflow, contributing to a more efficient coding environment.\n• Designed and managed CI/CD pipelines using **GitHub Actions** and **Jenkins**, achieving a 30% reduction in production deployment errors.\n• Leveraged **TypeScript** for building robust components, ensuring code quality and maintainability.\n• Collaborated with backend teams to create and integrate RESTful APIs, utilizing **Go** and **Ruby** for data-driven applications.\n• Optimized application performance by incorporating tools such as **DataDog** and **Sentry** for monitoring and error tracking.\n• Engaged in mentoring sessions with junior developers, advancing team skills and productivity, reflected in improved project delivery timelines.\n• Maintained and evolved the application infrastructure using **Terraform** and **Kubernetes**, enhancing system reliability and scalability.\n• Developed interactive visualizations using **D3.js**, improving project status tracking and reporting capabilities.\n• Actively participated in code reviews, fostering a culture of excellence and continuous improvement amongst team members."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "Utilized **JavaScript** and **TypeScript** to develop dynamic user interfaces, enhancing user engagement on client-side applications by up to **25%**.\nLed the development of frontend components using **React** that contributed to a scalable architecture, resulting in a **30%** improvement in load times.\nImplemented CI/CD pipelines using **Jenkins** and **GitHub Actions**, streamlining deployment processes and ensuring code quality through automated testing.\nUtilized **Webpack** and **Vite** for efficient asset bundling, reducing the initial load time of applications by **15%**.\nCollaborated with cross-functional teams to integrate **AWS** cloud services, optimizing performance and reliability on the platform.\nEmployed **Kubernetes** and **Terraform** for cloud infrastructure management, facilitating easier scaling and maintaining uptime across services.\nContributed to version control and collaboration efforts using **GitHub**, improving team productivity by maintaining a clear development workflow.\nDeveloped and maintained technical documentation for frontend applications, aiding in onboarding new team members and ensuring consistency in coding standards.\nDrove efforts to integrate monitoring tools like **DataDog** and **Sentry**, resulting in a proactive approach to application performance and error tracking.\nEngaged in code reviews and participated in daily standups to ensure alignment with project goals and to promote knowledge sharing across the team."
    }
  ],
  "skills": " **Programming Languages**\n\tJavaScript, TypeScript, Go, Elixir, Ruby\n\n**Backend Frameworks**\n\tNodeJS, ExpressJS, NestJS, C#, .NET, Entity Framework, Microservices\n\n**Frontend Frameworks**\n\tReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS, Electron\n\n**API Technologies**\n\tRESTful API, GraphQL\n\n**Serverless and Cloud Functions**\n\tAWS, Kubernetes, Terraform, Ansible\n\n**Databases**\n\tMSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB\n\n**DevOps**\n\tCI/CD pipelines, Jenkins, GitHub Actions, DataDog, Sentry\n\n**Cloud & Infrastructure**\n\tAWS, Azure\n\n**Other**\n\tUX/UI Design, Git, GitHub, Messaging & Caching: Apache Kafka, RabbitMQ, Redis, Testing Tools: NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest, Blockchain: Solidity, Ether.js, Web3.js, Ethereum\n",
  "apply_company": "Glia"
}