{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Customer Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Results-driven Senior Customer Engineer with a robust expertise in **SAP**, **SAP S/4HANA**, **SAP BW**, and **SAP Business Technology Platform**, complemented by 13+ years of experience in full stack development across healthcare and financial sectors. Proven proficiency in **data governance**, **data catalog**, and **data quality** management, ensuring compliance with regulatory standards. Skilled in **data privacy**, enterprise architecture, and technical integration for enhanced data management. Strong background in **cost-benefit analysis** and **ROI analysis**, aiding in value-based selling strategies.\n\nAdditionally, adept in building high-performance applications utilizing **JavaScript/TypeScript**, **Python**, and **Flutter** with expertise across frontend frameworks such as **React**, **Next.js**, and **Vue**, as well as backend technologies including **Node.js**, **FastAPI**, and **Django**. Experienced in deploying cloud-native systems on **AWS** and **Azure**, and implementing microservices and CI/CD pipelines. A strong advocate for compliance-driven development aligning solutions with HIPAA, FHIR, PCI DSS, and SOC 2 standards, with solid capabilities in MLOps leveraging **MLflow**, **Airflow**, and **Kubeflow**.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Customer Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Leveraged **SAP Business Technology Platform** and **SAP S/4HANA** to design and implement data governance frameworks ensuring data quality and privacy compliance across enterprise systems.\n- Managed the integration of **SAP BW** with Data Lakes and various databases, streamlining data management processes and enhancing data accessibility.\n- Developed and optimized **integration platforms** ensuring seamless technical integration with existing systems, promoting effective data flows and accuracy.\n- Executed **cost-benefit analysis** and **ROI analysis** to create value-based selling strategies that enhance business processes and foster customer relationships.\n- Defined and enforced regulatory compliance measures, maintaining adherence to industry standards, thereby reducing risks associated with data privacy and governance.\n- Collaborated with cross-functional teams to facilitate effective communication, delivering comprehensive solutions tailored to meet customer needs and technical specifications.\n- Designed and built full-stack platforms for healthcare and fintech using **Python (FastAPI)**, **TypeScript**, and **Node.js**, ensuring compliance with relevant regulations like HIPAA and GDPR.\n- Built and maintained data infrastructures using **PostgreSQL**, **MongoDB**, and **Redis**, designed to support heavy data ingestion and enable real-time analytics.\n- Implemented CI/CD pipelines incorporating **GitHub Actions** and **Azure DevOps**, ensuring automated testing and smooth deployment across environments.\n- Integrated intelligent features into applications, enhancing user experience through personalized dashboards and predictive analytics, powered by cloud services like **AWS Sagemaker**.\n- Developed advanced data visualization tools with **D3.js** and **Power BI Embedded**, enabling real-time analysis of key performance indicators related to business performance.\n- Coordinated with data teams to enforce robust data quality measures, improving the integrity and reliability of data across platforms."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Implemented enterprise architecture solutions to enhance **SAP S/4HANA** and **SAP BW** platforms, driving optimal performance and scalability within financial systems.\nManaged data governance initiatives using **SAP Business Technology Platform** to ensure high data quality and compliance with regulatory standards.\nConducted comprehensive cost-benefit analysis and ROI analysis on integration projects, providing clear insights to stakeholders by leveraging **data governance** practices.\nDeveloped a robust data management strategy utilizing **Data Lakes** and integration platforms to streamline data flow and accessibility across departments.\nExecuted data privacy protocols and maintained regulatory compliance throughout technical integration processes, ensuring adherence to industry standards.\nSpearheaded integrations with third-party tools and platforms enhancing the efficiency of the **communication** processes within the team and client interactions.\nFacilitated value-based selling techniques by delivering actionable insights derived from data analysis, boosting overall sales effectiveness by **25%**.\nEstablished and maintained data catalogs to improve data discoverability, significantly reducing time spent on data retrieval by **40%**."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Leveraged **SAP S/4HANA** and **SAP BW** for effective data management and governance, ensuring high data quality and privacy across enterprise applications.\nDeveloped and maintained **data catalogs** to enhance data accessibility and usability, facilitating better decision-making and compliance with regulatory standards.\nExecuted **cost-benefit analysis** to support value-based selling strategies, enabling the delivery of tailored solutions to customers while maximizing ROI.\nConducted thorough **data quality** assessments, implementing corrective measures to maintain data integrity within the **SAP Business Technology Platform**.\nFacilitated seamless **integration** of various **databases** and **integration platforms**, enhancing operational efficiency and reducing data silos.\nImplemented **PaaS** solutions to streamline software deployments and ensure scalable architecture adhering to enterprise best practices.\nChampioned **data governance** initiatives, enforcing policies that upheld compliance with GDPR and enhanced data privacy measures for sensitive customer information.\nCommunicated technical needs and solutions effectively to cross-functional teams, ensuring alignment on project objectives and integration requirements.\nPresented **data lakes** strategies to manage expansive datasets, optimizing processes that drive business intelligence and analytics initiatives.\nEstablished protocols for **technical integration** of **SAP** solutions with existing internal systems, fostering streamlined operations and improved stakeholder satisfaction."
    }
  ],
  "skills": "Programming Languages:\n\tPython: FastAPI, Flask, Django\n\tJavaScript/TypeScript: React, Vue, Angular\n\n**Backend Frameworks:**\n\t\n**Frontend Frameworks:**\n\t\n**API Technologies:**\n\t\n**Serverless and Cloud Functions:**\n\tAWS: ECS, Lambda, RDS, S3\n\tAzure: App Services, Blob Storage, SQL Database\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare)\n\tMongoDB (Gaming), Redis\n\t\n**DevOps:**\n\tDocker, Kubernetes\n\tGitHub Actions, GitLab CI/CD\n\tTerraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tPaaS\n\n**Other:**\n\tSAP\n\tSAP S/4HANA\n\tSAP BW\n\tSAP Business Technology Platform\n\tdata governance\n\tdata catalog\n\tdata quality\n\tdata privacy\n\tvalue-based selling\n\tcost-benefit analysis\n\tROI analysis\n\tintegration\n\tdata management\n\tenterprise architecture\n\tregulatory compliance\n\tData Lakes\n\tintegration platforms\n\ttechnical integration\n\tcommunication",
  "apply_company": "Collibra"
}