{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Frontend Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "Results-driven Senior Frontend Engineer with 8 years of comprehensive experience in developing high-quality user interfaces and applications utilizing expert knowledge in **TypeScript**, **React**, and **UI/UX design** principles. Proficient in building scalable APIs and managing SQL databases like **PostgreSQL**, while delivering on cloud services via **AWS** infrastructure. I have hands-on experience with modern testing frameworks such as **Cypress** to ensure robust application performance and user satisfaction. Additionally, my background in **Python** and developing applications within **Docker** and **Kubernetes** ecosystems enhances my versatility in collaborative environments. \n\nMy previous roles have enabled me to lead initiatives in microservices architecture and implement CI/CD pipelines, promoting seamless integration, quality assurance, and accelerated deployment cycles. I am committed to continuous improvement and driving innovation, resulting in optimized performance and enhanced user experiences.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Frontend Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Utilized **TypeScript** and **React (17-18)** to architect and develop high-performance front-end interfaces, focusing on exceptional UI/UX for healthcare and financial platforms.\n- Collaborated closely with APIs built using **Python (FastAPI)** for seamless integration, ensuring a robust user experience across various applications.\n- Designed and executed unit and integration tests using **Cypress**, enhancing code reliability and maintaining optimal performance standards.\n- Engaged with back-end data through **PostgreSQL**, implementing effective querying strategies for data retrieval and manipulation within applications.\n- Employed **Docker** and **Kubernetes (AKS/EKS)** for containerization and orchestration of applications, driving efficient deployment processes and resource management.\n- Integrated CI/CD pipelines with **GitHub Actions** for automated testing and deployment, delivering features in faster cycles.\n- Championed responsive web designs and performance optimization, improving load times by **30%** for all applications.\n- Developed user-centric features incorporating real-time data visualization using libraries like D3.js and Chart.js, providing critical insights into financial metrics and operational KPIs.\n- Collaborated with cross-functional teams to create a unified design system, ensuring consistency and usability across platforms while enhancing overall user satisfaction metrics.\n- Integrated **AWS** services for cloud functionality, improving scalability and reliability in application performance.\n- Participated in code reviews and contributed to documentation, elevating team standards and knowledge sharing among **10+** engineers."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Utilized **TypeScript** to develop robust front-end applications with **React (18)**, enhancing the UI/UX experience for 1000+ users while ensuring cross-platform compatibility.\nImplemented efficient APIs leveraging **Node.js (NestJS/Express)** and **Python (Django/FastAPI)**, significantly improving data retrieval times by 30% for high-traffic financial platforms.\nDesigned and executed automated testing frameworks using **Cypress**, achieving a test coverage of 95% and improving deployment reliability by reducing bugs in production by 40%.\nCollaborated with backend teams to optimize SQL queries and database interactions with **PostgreSQL**, resulting in performance enhancements that improved transaction processing speeds by up to 25%.\nManaged containerization and orchestration through **Docker** and **Kubernetes**, facilitating a CI/CD pipeline that reduced deployment times from 2 hours to 20 minutes.\nIntegrated various third-party services and cloud enhancements, utilizing **AWS** to streamline deployment processes and ensure high availability.\nDeveloped data-driven decision support tools, implementing business logic with **Python** and leveraging **SQL** for real-time data analytics, deriving insights that informed strategic planning for finance teams.\nEngaged in continuous learning and application of emerging technologies; participated in code reviews and mentorship sessions to elevate the overall skill set of the engineering team."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Developed interactive frontend applications using **React 18**, **TypeScript**, and **Vue 3**, ensuring a seamless user experience through UI/UX best practices, achieving a **30%** increase in user engagement.\nCollaborated with backend teams to integrate APIs to enhance functionality, utilizing **PostgreSQL** for efficient data retrieval and management, resulting in a **20%** reduction in load times.\nEmployed testing frameworks like **Cypress** to ensure high code quality and reliability, achieving a **95%** code coverage in critical components.\nOptimized web applications for responsiveness across devices, enhancing mobile-first access and ensuring compliance with accessibility standards (WCAG 2.1).\nUtilized **Docker** and **Kubernetes** for efficient deployment processes, contributing to a **50%** decrease in deployment time across environments.\nEngaged in continuous integration and delivery practices to ensure rapid feature delivery with minimal downtime, leveraging **AWS** for scalable infrastructure.\nImplemented role-based access control (RBAC) strategies for secure user authentication, ensuring GDPR compliance and protecting sensitive user data throughout the platform.\nDesigned and developed API endpoints in collaboration with backend services, focusing on performance optimization and adherence to architectural best practices.\nCreated visually appealing and SEO-friendly ecommerce interfaces that significantly improved search rankings and user retention rates.\nActively contributed to team discussions on architecture design and technology choices, ensuring alignment with overall project goals and user needs."
    }
  ],
  "skills": "**Programming Languages:**\n\tPython, Typescript, Golang\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tAPI\n\n**Serverless and Cloud Functions:**\n\tAWS, Docker, Kubernetes\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis, SQL\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, Cypress, UI/UX",
  "apply_company": "Timescale"
}