{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Application Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-152840397/",
  "profile_summary": "As a dedicated Senior Application Engineer with 8 years of experience, I specialize in security automation and vulnerability assessment utilizing tools like **Burp Suite**, **OWASP**, **SAST**, **DAST**, and **SonarQube**. My technical expertise encompasses implementing CI/CD pipelines with **Jenkins** and **GitLab CI**, as well as infrastructure automation using **Terraform** and **Helm**. I have a proven track record in developing secure applications aligned with compliance standards and conducting thorough security assessments to identify and address vulnerabilities. \nAdditionally, I leverage my full-stack development capabilities in **JavaScript**, **TypeScript**, **Python**, **React**, **Next.js**, **Node.js**, and **Django**, combined with cloud proficiency in **Azure** and **AWS**. My strength in microservices architecture not only enhances system performance but also supports real-time data processing and integration of AI/ML capabilities. I am passionate about delivering robust, high-performance solutions while maintaining a focus on security best practices.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Application Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Implemented robust **security automation** protocols in application development ensuring compliance with **OWASP** standards, effectively mitigating vulnerabilities through the use of **Burp Suite**, **SonarQube**, and **Snyk**.\nDeveloped and maintained CI/CD pipelines utilizing **Jenkins**, **GitLab CI**, and **Terraform** for consistent deployment and integration, enhancing application stability by reducing deployment times by up to **30%**.\nArchitected applications with integrated **SAST** and **DAST** tools, leading to a **20%** reduction in security incidents during development phases.\nCollaborated on bug bounty programs to identify and resolve security vulnerabilities, leveraging community insights to enhance overall application integrity.\nDesigned and implemented **WAF** strategies to protect applications from common threats and risks, optimizing security layers for critical healthcare and financial platforms.\nConducted thorough code reviews and audits using tools such as **SonarQube** to ensure adherence to security best practices and standards, fostering a culture of secure coding across teams.\nEngaged in cross-functional collaboration to improve security measures in the development lifecycle, driving initiatives that resulted in a **15%** increase in compliance metrics.\nLed training sessions for development teams on best practices in secure software development, increasing awareness around the **Bug Bounty** program and ongoing security assessments.\nSuccessfully integrated security testing in the complete software development process, ensuring that applications were built with security as a priority from inception to deployment."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Implemented effective **security automation** strategies, leveraging **Burp Suite** and **OWASP** best practices to identify and remediate vulnerabilities in applications, ensuring secure financial transactions.\nDeveloped CI/CD pipelines using **Jenkins** and **GitlabCI**, enhancing deployment efficiency by **40%** and reducing time to market for new features and security enhancements.\nConducted SAST and DAST assessments with tools like **SonarQube** and **Snyk**, achieving an application security score improvement by **30%** as part of continuous integration workflows.\nLed a team in employing **Terraform** and **Helm** for infrastructure as code, facilitating a scalable cloud environment in **Azure**, and optimizing resource management for dynamic workloads.\nOrchestrated security monitoring using Web Application Firewalls (WAF), enhancing protection against web threats while maintaining performance for **9 million** monthly transactions.\nCollaborated on a comprehensive Bug Bounty program to identify and address potential vulnerabilities, resulting in a **50%** reduction in critical security findings over **6 months**.\nEnhanced development quality through automated testing frameworks and code analysis tools, promoting a culture of security-first development among team members."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Ensured application security by integrating **OWASP** guidelines, performing comprehensive **SAST** and **DAST** analyses, and utilizing **Burp Suite** for web application vulnerability assessments to bolster the security posture of development processes.\nConducted regular security reviews, incorporating tools like **SonarQube** and **Snyk** to identify and remediate vulnerabilities within the codebase, maintaining a secure and resilient application environment.\nImplemented continuous integration and deployment (CI/CD) pipelines using **Jenkins** and **GitlabCI**, streamlining the deployment process and reducing deployment times by **30%** while maintaining high code quality standards.\nAutomated security workflows with **Terraform** and **Helm**, increasing efficiency in provisioning and managing security policies across the platform's infrastructure.\nDeveloped security measures such as **WAF** (Web Application Firewall) configurations to protect against common exploits, ensuring the application remained compliant with industry standards.\nCollaborated in a *Bug Bounty* program to proactively identify and resolve security vulnerabilities through the input of ethical hackers, which improved vulnerability detection rate by **25%**.\nEnsured that all engineering teams adopted security-first practices across the full software development lifecycle, enhancing overall application resilience especially during major updates.\nMonitored security events and logs, refining processes for responding to incidents to maintain uninterrupted service and protect user data, with a focus on ensuring compliance with GDPR regulations.\nFostered a strong culture of security awareness within the team through training sessions focused on best practices for secure coding and application design."
    }
  ],
  "skills": "****API Technologies:****\n\tBug Bounty, Burp Suite, OWASP, SAST, DAST, SonarQube, Snyk, WAF, security automation\n\n****Backend Frameworks:****\n\tPython(FastAPI, Flask, Django)\n\n****Frontend Frameworks:****\n\tJavaScript/TypeScript (React, Vue, Angular)\n\n****DevOps:****\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Jenkins, CI/CD, Terraform, Helm\n\n****Cloud & Infrastructure:****\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n****Databases:****\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n****Other:****\n\tMLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot",
  "apply_company": "Swapcard"
}