{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior iOS Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "As a results-driven Senior iOS Engineer with 8 years of experience, I specialize in developing high-quality, maintainable, and scalable iOS applications using the **MVVM** and **VIPER** architecture patterns. My technical expertise includes proficiency in **RESTful** and **SOAP** web services, with experience in handling data formats such as **JSON** and **XML**. I utilize **xCode** for building intuitive user interfaces and integrate secure authentication methods using **JWT** for enhanced application security.\nIn addition to my strong technical capabilities, I excel in communication and problem-solving, enabling effective collaboration with cross-functional teams. I possess a robust understanding of Object-Oriented Analysis (OOA) and Object-Oriented Programming (OOP), allowing me to create clean and efficient code. I have a proven track record in enabling team success through proactive engagement and a commitment to continuous learning and development.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior iOS Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Designed and developed iOS applications using **Xcode** with **MVVM** and **VIPER** architecture patterns, focusing on **RESTful** and **SOAP** API integration to enhance user experience and application performance.\n- Implemented efficient data handling and parsing utilizing **JSON** and **XML**, ensuring seamless data exchange between client and server applications.\n- Collaborated with cross-functional teams to deploy features through **Storyboards**, enhancing the speed of development by **30%** and improving user interface consistency across the iOS platform.\n- Applied **OCR** technologies for text recognition, enabling the app to process documents and images effectively, improving user engagement by **25%**.\n- Utilized **JWT** for secure API authentication, enhancing application security and user data protection.\n- Developed comprehensive communication channels within the app to enhance **English** language functionality, facilitating better problem-solving and user support.\n- Led problem-solving sessions to troubleshoot and optimize application performance, resulting in a **40%** reduction in downtime incidents.\n- Conducted thorough code reviews and implemented OOP principles to ensure maintainability and scalability of iOS applications, adhering to best practices within the field.\n- Established effective communication pathways within the team to streamline project workflows and promote shared knowledge, contributing to a **20%** increase in project delivery efficiency.\n- Implemented unit testing frameworks to enhance code reliability and reduce bugs, leading to a **15%** improvement in application stability."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Designed and implemented **iOS** applications utilizing **MVVM** and **VIPER** architectural patterns to enhance code maintainability and scalability in line with user requirements.\nDeveloped robust **RESTful** and **SOAP** APIs, ensuring efficient data exchange between the app and backend services, with a focus on **JSON** and **XML** data formats for seamless integration.\nLed a team in adopting advanced **OCR** technology to streamline document processing and improve user input accuracy, enabling a significant reduction in errors by **15%**.\nUtilized **xCode** for application development, ensuring adherence to Apple’s design philosophy and optimizing build processes for efficient deployment cycles.\nImplemented secure user authentication and data encryption using **JWT**, enhancing application security and safeguarding sensitive financial data.\nFacilitated user interface design through Storyboards, creating intuitive layouts that improved user engagement resulting in a **20%** increase in user retention.\nCollaborated with cross-functional teams to solve technical issues and ensure timely delivery of features, demonstrating strong **problem-solving** and **communication** skills.\nConducted code reviews and mentoring sessions, improving overall team productivity by **30%** through shared best practices and knowledge transfer.\nMaintained high standards of software quality by utilizing **IDE** tools for debugging and testing, contributing to a **40%** reduction in post-release defects."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Developed and maintained robust **RESTful** APIs and **SOAP** services to ensure seamless data interchange between frontend and backend systems, leveraging **XML** and **JSON** formats for data representation.\nDesigned user interfaces using **xCode** and **Storyboards**, adhering to **MVVM** and **VIPER** architectural patterns to facilitate modular and maintainable code structures in iOS applications.\nCreated dynamic and responsive views for iOS applications optimized for different devices, ensuring high performance and a smooth user experience throughout the app lifecycle.\nCollaborated with cross-functional teams to implement **OCR** technologies for enhanced data processing capabilities, streamlining workflows related to text recognition from images.\nIntegrated **JWT** for secure user authentication and access control, maintaining high standards of security and compliance across applications.\nConducted in-depth problem-solving sessions leveraging **OOP** and **OOA** principles, leading to the enhancement of existing application features and performance optimization.\nUtilized modern development environments and tools (**IDE**) to increase development efficiency, resulting in a **30%** reduction in project turnaround time.\nCommunicated effectively with stakeholders in **English**, providing clear updates and ensuring alignment on project goals, timelines, and deliverables."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython(FastAPI, Flask, Django), JavaScript/TypeScript (React, Vue, Angular), iOS\n\n **Backend Frameworks:**\n\tFlask, Django\n\n **Frontend Frameworks:**\n\tReact, Vue, Angular\n\n **API Technologies:**\n\tRESTful, SOAP, JSON, XML, JWT\n\n **Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n **Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:**\n\tAWS, Azure\n\n **Other:**\n\tMLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), Let’s Encrypt, Nginx, Certbot, English, communication, problem-solving, OOA, OOP, MVVM, VIPER, Storyboards, IDE, OCR",
  "apply_company": "Atos"
}