{
  "name": "Tomasz Lee",
  "role_name": "Senior Quality Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Results-oriented Senior Quality Engineer with 9+ years of experience in software testing and automated testing frameworks. Proficient in **Python**, **Git**, **Appium**, and **Pytest** for robust test automation solutions. Extensive expertise in Linux and QNX environments, along with knowledge of **HIL**, **CAN**, and **Ethernet** protocols. Strong background in cross-functional collaboration, problem-solving, and meticulous attention to detail to ensure high-quality software releases. Proven ability to lead quality assurance initiatives and enhance testing methodologies while leveraging your existing skills in **.NET**, **C#**, **ReactJS**, and **NextJS** to bridge the gap between development and testing teams.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Senior Quality Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "• Executed **automated testing** strategies utilizing **Python**, **Pytest**, and **Appium** to ensure software quality and functionality across multiple platforms.\n• Conducted rigorous **software testing** on applications developed in **Linux** and **QNX**, identifying critical issues and reducing defect rates by 30%.\n• Led cross-functional collaboration efforts, working with development and UX/UI teams to identify and solve complex problems in the software lifecycle, enhancing product stability.\n• Implemented **Git** for version control, facilitating easier code management and collaboration within the team.\n• Developed scripts for **shell scripting** automation, streamlining testing processes and reducing manual effort by 50%.\n• Collaborated on testing strategies for **Android** applications, expanding coverage and improving overall app performance.\n• Utilized **CAN** and **Ethernet** protocols in testing automotive systems, ensuring compliance with industry standards and enhancing system reliability.\n• Enhanced attention to detail in testing methodologies, leading to a 20% decrease in post-release bug reports.\n• Innovated solutions for testing in complex embedded systems, demonstrating exceptional problem-solving skills within diverse project requirements."
    },
    {
      "role": "Software Engineer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "Executed automated testing strategies using **Python** and **Appium**, increasing test coverage by 40% and ensuring robust software quality.\nDeveloped and maintained test frameworks with **Pytest** for consistent and scalable software testing processes.\nApplied **Git** for version control, enabling seamless collaboration with cross-functional teams and reducing merge conflicts by 25%.\nUtilized **Shell scripting** to automate repetitive testing tasks, enhancing efficiency and freeing up 20% of testing time for additional focus areas.\nEngaged in cross-functional collaboration to communicate requirements and troubleshoot issues, achieving a 95% on-time project delivery rate.\nInterpreted and managed software testing metrics, leading to a 30% reduction in post-release defects.\nImplemented testing in **Linux** and **QNX** environments for automotive software, ensuring compatibility and performance on diverse platforms.\nLeveraged knowledge of **CAN** and **Ethernet** protocols for effective validation of embedded systems and communication standards.\nExercised strong problem-solving skills to resolve critical performance issues, achieving a 50% improvement in bug resolution time.\nMaintained meticulous attention to detail, producing detailed documentation and test plans that upholds high-quality standards across the software lifecycle."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "Utilized **Python** and **Appium** to implement automated testing frameworks, enhancing software testing efficiency by 30%.\nConducted meticulous software testing on **Android** applications, ensuring high-quality user experiences through attention to detail.\nDeveloped and maintained scripts for test automation using **Pytest**, achieving a 25% reduction in testing time across projects.\nEngineered solutions for hardware-in-the-loop (HIL) testing, improving validation processes for embedded systems within **QNX** environments.\nCollaborated cross-functionally with development teams to establish robust testing protocols, reinforcing problem-solving skills and enhancing product reliability.\nLeveraged **Git** for version control, ensuring consistent code integrity throughout the project's lifecycle.\nCreated and documented testing procedures and results in a **Linux** environment, streamlining the communication of findings to stakeholders.\nImplemented Shell scripting to automate repetitive tasks, resulting in increased operational efficiency by 15%.\nParticipated in agile ceremonies to promote cross-functional collaboration and swift adaptation to project changes, ensuring alignment with business objectives.\nProvided training and mentorship to junior engineers on best practices for automated testing, fostering a culture of quality assurance."
    }
  ],
  "skills": "**Programming Languages**\n\tPython, JavaScript, TypeScript, C#, Solidity\n\n**Backend Frameworks**\n\tNodeJS, ExpressJS, NestJS, .NET, Entity Framework\n\n**Frontend Frameworks**\n\tReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n**API Technologies**\n\tRESTful API, GraphQL\n\n**Serverless and Cloud Functions**\n\tAWS, Azure\n\n**Databases**\n\tMSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB\n\n**DevOps**\n\tCI/CD pipelines, Git, GitHub, Linux, Shell scripting\n\n**Cloud & Infrastructure**\n\tCross-functional collaboration, Problem-solving, Attention to detail\n\n**Other**\n\tFrontend Technologies, Automated testing, Software testing, Appium, Pytest, HIL, QNX, CAN, Ethernet, Messaging & Caching: Apache Kafka, RabbitMQ, Redis, Testing Tools: NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest, UX/UI Design",
  "apply_company": "Unikie"
}