{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-187801395/",
  "profile_summary": "Results-driven Engineer with 13+ years of experience in cloud-native software development, specializing in **AWS**, **GCP**, and **Azure**. Proficient in **infrastructure automation** and multi-cloud deployments, with demonstrated ability to implement **Kubernetes**, **Controller-Runtime**, and **Kubebuilder** for optimal system performance and scalability. Skilled in **collaboration**, problem-solving, and applying creativity to develop innovative solutions. \nStrong background as a Full Stack Developer with expertise in **JavaScript/TypeScript**, **Python**, and **Flutter**, with comprehensive knowledge in frontend and backend development frameworks such as **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**. Experienced in building AI/ML-powered platforms supporting predictive analytics and real-time processing while aligning with compliance standards like HIPAA, FHIR, PCI DSS, and SOC 2. Proven capabilities in MLOps utilizing **MLflow**, **Airflow**, and **Kubeflow**.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Implemented **Kubernetes** and **Go** for deploying scalable cloud-native applications, ensuring optimized performance and reliability in multi-cloud environments.\nUtilized **AWS**, **GCP**, and **Azure** services to automate infrastructure deployment and management workflows, achieving a **30%** reduction in setup time.\nDesigned and maintained infrastructure automation solutions using **Controller-Runtime** and **Kubebuilder**, streamlining application lifecycle management and cut down operational costs by **25%**.\nExecuted scalable microservices architectures in compliance with cloud best practices, facilitating efficient service delivery across diverse platforms and environments.\nCollaborated effectively with cross-functional teams to solve complex challenges, drive innovation, and enhance software quality through problem-solving and creativity.\nDeveloped and integrated solutions using **Crossplane** for managing cloud resources consistently across different providers, improving deployment efficiency and flexibility.\nOptimized CI/CD pipelines for **multi-cloud deployments**, leveraging best practices in collaboration with development teams for continuous improvement and agile responsiveness.\nFacilitated team discussions and brainstorming sessions to foster creativity and collaboration in product development, resulting in innovative features and enhancements.\nResolved technical challenges with a strong focus on problem-solving, employing analytical skills to diagnose and troubleshoot issues effectively.\nImproved the application performance by **15%** through rigorous testing and optimization processes, enabling better user experience and system reliability."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Implemented infrastructure automation and cloud native software development strategies utilizing **Kubernetes**, **AWS**, and **GCP** to streamline deployment processes and enhance operational efficiency.\nEngineered multi-cloud deployments, leveraging tools such as **Crossplane** and **Controller-Runtime** for effective resource management across different cloud environments.\nCollaborated with cross-functional teams to drive creative problem-solving initiatives, contributing to innovative solutions that improved system performance and reliability.\nAdopted **Go** for core backend services, ensuring robust performance and maintainability while scaling to support **9** million transactions daily.\nUtilized **Python** for data engineering tasks, developing ETL pipelines that processed over **500TB** of financial data, improving data accessibility for analytical purposes.\nEnhanced user experience by integrating responsive design frameworks such as **React (18)** and **Vue 3** into financial applications, achieving a direct increase in user engagement by **30%**.\nDelivered scalable real-time analytics platforms using **Power BI Embedded** and **D3.js**, enabling analysis of transaction anomalies with a response time of under **2 seconds**.\nDeveloped and maintained a suite of machine learning models for fraud detection and user behavior analysis, utilizing tools such as **scikit-learn** and **Azure ML** to deliver accurate predictions with an efficacy rate exceeding **95%**."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "- Developed and optimized **cloud native software** solutions for **multi-cloud deployments** leveraging **AWS**, **GCP**, and **Azure**, ensuring seamless integration and high availability in a distributed environment.\n- Engineered infrastructure automation processes using **Kubernetes**, focusing on **Controller-Runtime** and **Kubebuilder** to streamline deployment workflows and enhance scalability.\n- Collaborated effectively with cross-functional teams to facilitate communication and foster creativity, promoting a culture of problem-solving and innovation in cloud development projects.\n- Applied strong analytical skills to address complex engineering challenges in **Go** and other programming languages, contributing to code quality and application performance improvements.\n- Utilized **Crossplane** for managing and orchestrating cloud resources across platforms, ensuring consistency and efficiency in resource management.\n- Implemented automated testing and CI/CD pipelines to support robust and reliable deployments, improving time-to-market for new features by **30%**.\n- Developed ergonomic APIs and services, ensuring compliance with industry standards and best practices for cloud-based architecture.\n- Enhanced existing workflows to support collaborative development and documentation processes, achieving a **20%** increase in team efficiency.\n- Leveraged creative problem-solving techniques to design and implement optimized data storage solutions and caching mechanisms for improved application performance.\n"
    }
  ],
  "skills": " **Programming Languages:**\n\tGo, Python, JavaScript/TypeScript\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n **Frontend Frameworks:**\n\tReact, Vue, Angular\n\n **API Technologies:**\n\tAuthentication & Security:\n\tKeycloak (OIDC, RBAC), OAuth2, JWT\n\n **Serverless and Cloud Functions:**\n\tAWS: ECS, Lambda, RDS, S3\n\tAzure: App Services, Blob Storage, SQL Database\n\n **Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare)\n\tMongoDB (Gaming), Redis\n\n **DevOps:**\n\tDocker, Kubernetes\n\tGitHub Actions, GitLab CI/CD\n\n **Cloud & Infrastructure:**\n\tTerraform, Ansible, Helm, Docker Compose\n\tGCP, Crossplane, multi-cloud deployments, infrastructure automation, cloud native software development\n\n **Other:**\n\tCollaboration, problem solving, creativity\n\tMLflow, Airflow, Kubeflow, Controller-Runtime, Kubebuilder"
}