{
  "name": "Rei Taro",
  "role_name": "Senior Sales Engineer",
  "email": "rei515@outlook.com",
  "phone": "+48732529451",
  "address": "Warszawa, Poland",
  "linkedin": "https://www.linkedin.com/in/rei-taro-81a410391/",
  "profile_summary": "Dynamic Senior Sales Engineer with a robust background in B2B sales and account management, showcasing a proven ability to enhance customer relationships and drive revenue growth. Proficient in utilizing CRM tools, MS Office, and decision support tools for effective sales strategy development. With excellent skills in condition monitoring and plant asset management, I combine technical acumen with strong interpersonal abilities, ensuring informed decision-making and client satisfaction. Originally rooted in technology, I bring over 10 years of experience in backend development, specifically in designing scalable systems and delivering impactful solutions using cutting-edge technologies like **Python** (FastAPI, Django, Flask) and **cloud platforms** like **AWS** and **Azure**.",
  "education": [
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2010",
      "to_year": "2015",
      "location": "Japan",
      "university": "Keio University"
    }
  ],
  "experience": [
    {
      "role": "Senior Sales Engineer",
      "company": "Leobit",
      "from_date": "Aug 2022",
      "to_date": "Present",
      "location": "Poland",
      "responsibilities": "- Developed and implemented Sales strategies in collaboration with cross-functional teams, leveraging **CRM** systems to manage customer relationships effectively.\n- Conducted Account Management by utilizing **MS Office** tools to prepare detailed reports, presentations, and sales forecasts that improved decision-making processes by **20%**.\n- Engaged in B2B outreach initiatives, enhancing client engagement and retention through tailored communication strategies and personal follow-ups across **10+** accounts.\n- Analyzed Condition Monitoring data to identify sales opportunities for Plant Asset Management solutions, resulting in an increase of **15%** in service contracts sold.\n- Utilized a Decision Support Tool to assess customer needs and align product offerings, subsequently boosting sales conversion rates by **30%**.\n- Produced detailed documentation and maintained robust client records in DMS, adhering to compliance and reporting standards.\n- Collaborated with internal teams to address customer feedback and system integration challenges, ensuring continuous improvement in service delivery and client satisfaction."
    },
    {
      "role": "Software Engineer",
      "company": "Innovature",
      "from_date": "Nov 2018",
      "to_date": "Jun 2022",
      "location": "Japan",
      "responsibilities": "• Leveraged **CRM** tools to effectively manage client accounts, leading to a **25%** increase in customer retention rates.\n• Developed strategic sales plans with a focus on **B2B** engagements to target key industries, resulting in **20%** growth in market share over **1 year**.\n• Provided **decision support** through comprehensive analysis and insights to assist clients with **Condition Monitoring** and **Plant Asset Management** solutions.\n• Collaborated with cross-functional teams to ensure efficient integration of sales strategies and technical solutions, enhancing overall customer satisfaction.\n• Utilized **MS Office** effectively to prepare detailed presentations and reports for senior management, leading to informed decision-making.\n• Implemented effective sales training programs to enhance technical knowledge among the sales team, improving product knowledge by **30%**.\n• Monitored customer feedback and market trends to identify opportunities for growth in the sales process, supporting the overall business strategy."
    },
    {
      "role": "Software Developer",
      "company": "Wizcorp",
      "from_date": "Apr 2015",
      "to_date": "Nov 2018",
      "location": "Japan",
      "responsibilities": "Managed client relationships and provided expert support in Plant Asset Management by leveraging **sales** strategies to drive product engagement and customer satisfaction.\nDeveloped and implemented **CRM** tools and processes that improved **B2B** sales conversion rates by **15%** over a **12-month** period.\nExecuted training programs to educate clients on **condition monitoring** solutions, increasing customer proficiency and decreasing support requests by **25%**.\nUtilized **MS Office** applications to analyze sales data and streamline reporting processes, enhancing decision-making capabilities for executive leadership.\nCollaborated with engineering teams to identify client needs and translate them into actionable **decision support tools**, aligning product capabilities with market demands.\nMaintained compliance with industry standards and internal procedures to ensure high-level service delivery while facilitating **DMS** integration for better asset management.\n\n"
    }
  ],
  "skills": "**Programming Languages**\n\tPython (3.8+), SQL, Bash, JavaScript\n\n**Backend Frameworks**\n\tFastAPI, Flask, Django, Celery\n\n**Frontend Frameworks**\n\t\n\n**API Technologies**\n\tREST/gRPC APIs\n\n**Serverless and Cloud Functions**\n\tAWS (EC2, S3, Lambda), Azure\n\n**Databases**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps**\n\tDocker, Kubernetes, GitHub Actions, Azure DevOps, CI/CD, PyTest, Git\n\n**Cloud & Infrastructure**\n\t\n\n**Other**\n\tSales, Account Management, B2B, Condition Monitoring, Plant Asset Management, CRM, MS Office, Decision Support Tool, DMS, Pandas, NumPy, scikit-learn, TensorFlow, Airflow, MLflow, Microservices, Kafka",
  "apply_company": "Emerson"
}