{
  "name": "Tomasz Lee",
  "role_name": "Senior Node Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Results-driven Senior Node Engineer with 9+ years of experience in API development and system integration, proficient in **Node.js**, **JavaScript**, and **MongoDB**. Demonstrated expertise in utilizing **AWS**, **Azure**, and **Linux** to design and deploy robust applications in DevOps environments. Strong background in CI/CD processes and version control using **Git** to streamline development workflows. Additionally, possesses valuable experience in microservices architecture and distributed systems, with technical knowledge of **Apache Kafka**, **RabbitMQ**, and **Redis**. Recognized for delivering high-quality solutions, optimizing performance, and leading cross-functional teams in achieving project milestones.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Senior Node Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Developed and maintained scalable applications using **Node.js** and **JavaScript**, focusing on performance improvements and system integration.\nDesigned and implemented RESTful APIs to ensure robust **API development** processes, enhancing the system’s functionality with a standard response time of less than **200ms**.\nLed the integration of **MongoDB** for efficient data management, optimizing database operations to reduce retrieval times by **30%**.\nExecuted **CI/CD** pipelines utilizing **Azure** and **Git**, resulting in a deployment frequency increase by **50%**.\nOversaw system integration processes that allowed seamless communication between microservices and third-party services, improving data flow by **40%**.\nImplemented security measures with JWT-based authentication, increasing user data protection and compliance.\nCollaborated with cross-functional teams to refine application functionalities based on user feedback, leading to a **20%** rise in user engagement.\nUtilized cloud services like **AWS** for deploying applications in a reliable environment, optimizing resource allocation.\nApplied Linux-based infrastructures for hosting applications, ensuring a reliable and stable runtime environment.\nAdopted best practices in **DevOps** methodologies to streamline development workflows, fostering a culture of collaboration and continuous improvement."
    },
    {
      "role": "Software Engineer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "Developed and integrated highly efficient **API development** using **Node.js** and **JavaScript**, enhancing system integration and communication across various platforms.\nDesigned and maintained **MongoDB** databases to ensure optimal data storage and retrieval, improving database query performance by 20%.\nImplemented **DevOps** practices by adopting **CI/CD** pipelines with **Git** that decreased deployment frequency issues by 30% and enhanced feature delivery speed.\nLed the migration of application components to **AWS** and **Azure**, successfully improving application reliability and scalability by 15%.\nWorked in a Linux environment to build and deploy web applications, resulting in smoother operational processes across the development lifecycle.\nCollaborated with cross-functional teams to gather project requirements, effectively translating stakeholder feedback into actionable development plans, ensuring 95% on-time delivery of project milestones.\nMentored junior developers in best practices and code reviews, increasing overall team productivity by 25%.\nCreated engaging user interfaces utilizing **ReactJS** and **Tailwind CSS**, leading to a 25% rise in user engagement.\nConducted performance tuning by optimizing **APIs** and integrating caching strategies like Redis, significantly reducing API response times by 30%."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "Developed high-performance applications using **Node.js** and **JavaScript** for efficient API development and system integration, achieving a 30% reduction in response time.\nImplemented **MongoDB** for data storage solutions, enhancing data retrieval speeds by **25%** compared to previous systems.\nCollaborated with the DevOps team to establish **CI/CD** pipelines on **AWS** and **Azure**, resulting in a **15%** increase in deployment frequency and reducing errors during releases.\nAutomated configurations and deployments in a **Linux** environment, improving server management efficiency.\nUtilized **Git** for version control, ensuring seamless collaboration and tracking of changes across **10+** team members.\nContributed to the implementation of asynchronous messaging queues with **RabbitMQ** for efficient background processing.\nParticipated in system integration projects with third-party APIs, ensuring seamless communication and data sharing, impacting system performance positively.\nDelivered detailed technical documentation and user guides to facilitate onboarding and enhance knowledge transfer among team members.\nActively participated in agile ceremonies, including daily standups and code reviews, to align project goals and maintain coding standards."
    }
  ],
  "skills": " **Programming Languages** \n\t JavaScript, TypeScript, Node.js, C#, .NET, Python, Perl\n\n **Backend Frameworks** \n\t NodeJS, ExpressJS, NestJS, Microservices\n\n **Frontend Frameworks** \n\t HTML, CSS, ReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n **API Technologies** \n\t RESTful API, GraphQL, API development\n\n **Serverless and Cloud Functions** \n\t AWS, Azure\n\n **Databases** \n\t MongoDB, MSSQL Server, MySQL, PostgreSQL, DynamoDB, CosmosDB\n\n **DevOps** \n\t Git, GitHub, CI/CD, DevOps, Linux\n\n **Cloud & Infrastructure** \n\t AWS, Azure\n\n **Other** \n\t UX/UI Design, Testing Tools: NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest, Messaging & Caching: Apache Kafka, RabbitMQ, Redis, Blockchain: Solidity, Ether.js, Web3.js, Ethereum",
  "apply_company": "Infused Solutions"
}