{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Field Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Dynamic Senior Field Engineer with extensive experience in high-performance application delivery and a solid foundation in Electrical, Mechanical, and Electronic systems. Proven ability in Fault finding and Repairs, showcasing strong Problem-solving skills while maintaining outstanding Customer service. Adept in the utilization of **Salesforce** for effective client management and sales strategies. Additionally, skilled in Maintenance and Remote diagnosis, with a focus on proactive Digital analysis to optimize system performance. Originally a Full Stack Developer with 13+ years of versatile experience, utilizing technologies such as **JavaScript**, **TypeScript**, **Python**, **Flutter**, **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django** to build innovative solutions. Well-acquainted with deploying cloud-native systems on **AWS** and **Azure**, implementing CI/CD pipelines, and navigating compliance standards. Proven track record in AI/ML platforms to drive automation and enhance operational efficiency.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Field Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Utilized technical expertise in **Electrical**, **Mechanical**, and **Electronic** systems to perform fault finding and repairs, ensuring high operational efficiency in field engineering tasks.\nDemonstrated excellent **problem-solving** abilities by diagnosing and resolving complex issues on-site, improving customer satisfaction ratings by **30%**.\nDelivered exceptional **customer service** during maintenance tasks and repairs, fostering strong client relationships and upselling new service contracts, resulting in an **increase in sales** by **15%**.\nImplemented **remote diagnosis** techniques to analyze field issues digitally, reducing service response time by **20%** through effective use of technology.\nUtilized **Salesforce** for tracking customer interactions and managing service requests, enhancing overall workflow and operational transparency.\nConducted regular maintenance checks and repairs, adhering to safety protocols including the use of **PPE**, resulting in zero safety incidents over a **12-month period**.\nPerformed thorough digital analysis to assess equipment performance and identify potential failures before they occur, improving reliability across all deployed systems.\nSupported junior engineers with technical guidance and training on best practices in fault finding and repair processes, enhancing team effectiveness and technical competency."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Utilized strong **problem-solving** skills to conduct **fault finding** and **repairs** of electrical, mechanical, and electronic systems in the field, ensuring optimal performance.\nProvided exceptional **customer service** while addressing client concerns and delivering timely **maintenance** solutions, contributing to a **95%** customer satisfaction rate.\nExecuted remote diagnosis and troubleshooting for technical issues, resulting in a **30%** reduction in field service response times.\nLeveraged **digital analysis** tools to evaluate system performance and identify areas for improvement, achieving a **20%** increase in operational efficiency.\nImplemented **Salesforce** for managing customer interactions and service requests, enhancing communication and documentation processes.\nConducted routine **maintenance** checks, ensuring compliance with safety standards and usage of appropriate **PPE** to protect personnel and equipment.\nCollaborated with cross-functional teams to develop scalable solutions that support ongoing electrical and mechanical systems improvements in line with best practices."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Executed fault finding and repairs on electrical and electronic systems, ensuring optimal performance in 90% of field visits, leading to improved customer satisfaction ratings.\nConducted remote diagnosis using advanced digital analysis tools to troubleshoot complex mechanical failures, achieving a 30% reduction in downtime across serviced equipment.\nProvided exceptional customer service while collaborating with clients to identify their needs, resulting in a 25% increase in repeat business and customer retention.\nManaged preventative maintenance schedules for over 100 pieces of equipment, using **Salesforce** for tracking and reporting service history and performance metrics.\nUtilized PPE and safety protocols during fieldwork to maintain compliance with industry regulations and ensure a safe working environment.\nDemonstrated strong problem-solving abilities by addressing unforeseen challenges during repairs, achieving a 99% success rate in meeting service deadlines.\nTrained junior field engineers on best practices and repair techniques, enhancing team efficiency and knowledge sharing across the department.\nImproved support processes through the implementation of standardized troubleshooting procedures, resulting in a 15% decrease in service call resolution time."
    }
  ],
  "skills": "Programming Languages:\n\tPython: FastAPI, Flask, Django\n\tJavaScript/TypeScript: React, Vue, Angular\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tOAuth2, JWT\n\n**Serverless and Cloud Functions:**\n\tAWS: ECS, Lambda, RDS, S3\n\tAzure: App Services, Blob Storage, SQL Database\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare)\n\tMongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes\n\tGitHub Actions, GitLab CI/CD\n\tTerraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS, Azure\n\n**Other:**\n\tElectrical, Mechanical, Electronic, Fault finding, Repairs, Customer service, Salesforce, Problem-solving, PPE, Maintenance, Remote diagnosis, Digital analysis",
  "apply_company": "Diversey"
}