{
  "name": "Tomasz Lee",
  "role_name": "Senior DFM Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Results-driven Senior DFM Engineer with extensive proficiency in CNC, 3D CAD, and **SolidWorks** to design and optimize manufacturing processes. Utilizing advanced techniques such as **DFM** and **GD&T**, I ensure high-quality production through effective material selection and design strategy. Committed to leveraging my 9+ years of experience in engineering principles including **sheet metal**, **3D printing**, and various machining processes like **milling**, **turning**, and **EDM**. Known for excellent problem-solving abilities and adaptability, I have a strong focus on customer needs while collaborating across teams to drive successful project outcomes and improve operational efficiency.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Senior DFM Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Utilized **SolidWorks** and **3D CAD** software to design and develop detailed models for manufacturability, ensuring optimal design for manufacturing (DFM) principles and improving efficiency by **25%**.\nConducted comprehensive material selection analysis to optimize production processes and reduce costs, resulting in a **35%** decrease in material waste.\nApplied **GD&T** principles to create precise engineering drawings, improving communication among teams and enhancing product quality.\nDeveloped innovative solutions for sheet metal fabrication and assembly, leveraging techniques such as **laser cutting**, **waterjet cutting**, and **welding** to streamline production, reducing cycle time by **20%**.\nEngaged in CNC milling, turning, and grinding processes to produce high-quality components, achieving a **40%** improvement in production rates through effective problem-solving.\nCollaborated across departments to adapt designs based on customer feedback, ensuring the final product meets customer expectations and requirements.\nLed training sessions for junior engineers on best practices in DFM, enhancing team skills in **3D printing** and **EDM** techniques to foster continuous improvement.\nDeveloped prototypes using various manufacturing methods, including **stamping** and **press brake** operations, ensuring rapid turnaround and high-quality outputs.\nProactively identified production challenges and implemented strategic solutions, showcasing strong communication and adaptability skills to enhance project outcomes."
    },
    {
      "role": "Software Engineer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "Utilized **SolidWorks** and **3D CAD** tools to design and prototype 3D models, ensuring adherence to **DFM** principles and leading to a **20%** reduction in manufacturing costs.\nApplied **GD&T** standards to enhance design accuracy and manufacturing efficiency, resulting in **95%** adherence to specifications in production.\nConducted **material selection** for various components, optimizing choices based on durability and cost, improving overall product lifespan by **30%**.\nCollaborated across departments to improve fabrication processes using **sheet metal, milling**, and **laser cutting** techniques, which enhanced production speed by **15%**.\nImplemented **3D printing** methods for rapid prototyping, decreasing design-to-production time by **40%**.\nDeveloped and maintained relationships with vendors and suppliers, ensuring uninterrupted availability of materials and tools, resulting in a **10%** decrease in supply chain disruptions.\nLed a team of engineers in the application of **welding**, **EDM**, and **waterjet cutting** methods, promoting best practices and reducing waste by **25%**.\nFacilitated troubleshooting sessions, employing problem-solving techniques to address design challenges and increase product reliability, with a **50%** success rate in issues resolved.\nPrepared comprehensive documentation for all designs and processes while ensuring effective communication with stakeholders to align project goals and timelines, achieving on-time delivery in **90%** of projects.\nMentored junior engineers in **turning**, **grinding**, and **honing** processes, improving their skill set and productivity, with feedback indicating a **30%** improvement in their performance."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "• Applied **3D CAD** skills to develop and optimize designs for manufacturing, ensuring adherence to **DFM** principles, resulting in a **15%** reduction in production time.\n• Utilized **SolidWorks** to create detailed models and assemblies, streamlining the design process and improving accuracy by **25%**.\n• Implemented **GD&T** practices in design specifications to enhance product quality and compliance with customer standards.\n• Conducted material selection analysis for new projects, effectively balancing cost and performance, resulting in a savings of **12%** on materials.\n• Designed and overseen prototypes using **3D printing** technology, accelerating validation phases and reducing lead times by **30%**.\n• Collaborated with cross-functional teams to improve manufacturing processes through effective communication and problem-solving strategies.\n• Assisted in the development of manufacturing methods for **sheet metal**, **milling**, and **turning** operations, ensuring fit and function of components.\n• Led investigations into production issues, utilizing root cause analysis to implement corrective actions that improved efficiency.\n• Engaged in training sessions on **welding**, **EDM**, and **laser cutting** techniques to enhance team skills and capabilities.\n• Provided customer-focused solutions by adapting designs based on client feedback and operational constraints."
    }
  ],
  "skills": "Frontend Technologies: HTML, CSS, JavaScript, TypeScript, ReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS,\n\tBackend Technologies: NodeJS, ExpressJS, NestJS, C#, .NET, Entity Framework, Microservices,\n\tAPI Technologies: RESTful API, GraphQL,\n\tDatabases: MSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB,\n\tCloud & Infrastructure: AWS, Azure,\n\tDevOps: CI/CD pipelines,\n\tOther: CNC, 3D CAD, SolidWorks, DFM, GD&T, sheet metal, 3D printing, milling, turning, EDM, grinding, honing, lapping, material selection, press brake, laser cutting, waterjet cutting, welding, stamping, communication, problem-solving, adaptability, customer-focused, UX/UI Design, Git, GitHub, Python, Redux, Testing Tools: NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest, Blockchain: Solidity, Ether.js, Web3.js, Ethereum",
  "apply_company": "Xometry Europe"
}