{
  "name": "Rei Taro",
  "role_name": "Senior Service Engineer",
  "email": "rei515@outlook.com",
  "phone": "+48732529451",
  "address": "Warszawa, Poland",
  "linkedin": "https://www.linkedin.com/in/rei-taro-81a410391/",
  "profile_summary": "Detail-oriented Senior Service Engineer with a robust background in **AI Solutions**, **Digital Tools**, and **Service Software**. Brings over 10 years of experience in **Installation**, **Maintenance**, and **Technical Support**, focusing on enhancing user experience through quality service and customer training. Recognized for exceptional **Analytical Skills** and effective **Communication Skills**, facilitating seamless **Quality Assurance** and **Diagnostics**. Proven ability to manage remote support and resolve issues efficiently, ensuring client satisfaction. Previous roles include significant contributions at leading organizations, leveraging expertise in **cloud-native architectures** and backend technologies.",
  "education": [
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2010",
      "to_year": "2015",
      "location": "Japan",
      "university": "Keio University"
    }
  ],
  "experience": [
    {
      "role": "Senior Service Engineer",
      "company": "Leobit",
      "from_date": "Aug 2022",
      "to_date": "Present",
      "location": "Poland",
      "responsibilities": "Maintained and supported digital tools and service software to enhance user experience and ensure operational efficiency in the role of a Senior Service Engineer.\nPerformed quality assurance and diagnostics for mobile applications, ensuring adherence to service standards and customer requirements.\nProvided technical support and remote support to clients, effectively resolving issues related to installation and maintenance of systems.\nTrained customers on the usage of AI solutions and advanced digital tools, improving user adoption and satisfaction.\nUtilized strong organizational skills to manage multiple projects, ensuring timely delivery and alignment with customer expectations engaged with **Azure App Services** and **Terraform** for effective deployment and infrastructure management.\nAnalyzed and improved workflow efficiencies through genetic analysis techniques, enhancing the service delivery process and client outcomes with a focus on quality assurance.\nCollaborated with cross-functional teams to ensure effective communication and customer orientation, resulting in a **95%** satisfaction rate during service evaluations."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Innovature",
      "from_date": "Nov 2018",
      "to_date": "Jun 2022",
      "location": "Japan",
      "responsibilities": "• Delivered **Quality Assurance** for backend systems developed in **Python** and **FastAPI**, enhancing automation of document workflows and streamlining user onboarding.\n• Provided **Technical Support** for event-driven microservices built with **Celery** and **Redis**, facilitating the asynchronous processing of financial data and handling **10K+** transaction requests.\n• Executed deployment of microservices using **Azure App Services** and utilized **Terraform (v1.0)** for infrastructure automation, achieving a consistent and scalable environment with **99.9% uptime**.\n• Constructed robust data pipelines utilizing **Apache Airflow** and **Azure Functions**, improving the secure exchange of regulatory data across **20+** stakeholders and automating data flow processes.\n• Conducted thorough security audits ensuring compliance with industry standards, while integrating **OAuth2** and **Azure AD B2C** for managing authentication and securing access controls, resulting in a **50% reduction in security incidents**.\n• Fostered collaboration with cross-functional teams to ensure seamless system integration and regulatory compliance, leading to successful release management and improving **customer satisfaction by 30%**."
    },
    {
      "role": "Software Developer",
      "company": "Wizcorp",
      "from_date": "Apr 2015",
      "to_date": "Nov 2018",
      "location": "Japan",
      "responsibilities": "• Provided **Technical Support** for backend services focused on trade execution, utilizing **Python**, **Flask**, and **PostgreSQL** to enhance service reliability and performance.\n• Ensured **Quality Assurance** by implementing test suites with **PyTest**, **tox**, and mock servers, facilitating robust development cycles and reducing bugs by **30%**.\n• Conducted **Installation** and **Maintenance** of software services, ensuring seamless update processes and high system uptime of **99.9%**.\n• Developed and maintained real-time data delivery systems through **WebSockets** and **Redis**, ensuring consistent access to trading data with a response time of under **100 milliseconds**.\n• Collaborated with cross-functional teams to deliver data via **REST APIs**, enhancing user interaction by improving response time by **20%**.\n• Provided comprehensive **Customer Training**, ensuring that users are equipped with knowledge of digital tools and mobile applications for optimized trading.\n• Managed diagnostics and remote support processes, enhancing customer orientation and satisfaction, leading to a **15%** increase in positive feedback scores.\n• Utilized **AI Solutions** for predictive analysis of trading trends, improving decision-making processes and overall trading strategy efficiency.\n• Demonstrated excellent **Organizational Skills** and **Analytical Skills**, streamlining service workflows and task prioritization, which reduced response time for customer inquiries by **25%**."
    }
  ],
  "skills": " **Programming Languages**\n\tPython (3.8+), SQL, Bash, JavaScript\n\n**Backend Frameworks**\n\tFastAPI, Flask, Django, Celery\n\n**Frontend Frameworks**\n\t\n\n**API Technologies**\n\tREST/gRPC APIs, Microservices\n\n**Serverless and Cloud Functions**\n\tAWS (EC2, S3, Lambda), Azure\n\n**Databases**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps**\n\tDocker, Kubernetes, GitHub Actions, Azure DevOps, CI/CD, PyTest, Git\n\n**Cloud & Infrastructure**\n\t\n\n**Other**\n\tInstallation, Maintenance, Genetic Analysis, Quality Assurance, Technical Support, Remote Support, Diagnostics, Customer Training, Digital Tools, Service Software, Mobile Applications, AI Solutions, Organizational Skills, Analytical Skills, Customer Orientation, Communication Skills",
  "apply_company": "Thermo Fisher Scientific"
}