{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Sales Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "Dynamic Senior Sales Engineer with 8 years of full stack development experience, adept in utilizing **AWS**, **Google Cloud Services**, **Docker**, and **Kubernetes** to deliver comprehensive solutions tailored for the healthcare and financial industries. Proficient in managing databases including **MS SQL Server**, **Oracle**, and **PostgreSQL**, and ensuring robust data integrity across platforms. Skilled in programming languages such as **JavaScript** and **Python**, leveraging these technologies for seamless integration and RESTful API development.\n\nAccomplished in building high-performance applications with an emphasis on AI/ML integration for predictive analytics and intelligent automation. My extensive experience includes facilitating CI/CD automation and ensuring compliance with industry standards like HIPAA and PCI DSS. I excel in crafting event-driven architectures and implementing microservices to enhance system efficiency and performance.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Sales Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Demonstrated expertise in **AWS**, **Docker**, and **Kubernetes** for building and deploying scalable solutions in cloud environments, improving deployment efficiency by **30%**.\n- Utilized **Python** and **JavaScript** to architect robust and secure RESTful APIs, facilitating smooth user interactions in applications and reducing downtime by **25%**.\n- Worked on Microsoft Windows Server and Linux environments, achieving **99.9%** uptime for critical systems while conducting regular maintenance and updates.\n- Collaborated with cross-functional teams to enhance infrastructure security using **PowerShell** and automate operational tasks, leading to a **40%** reduction in manual errors.\n- Developed and maintained databases using **PostgreSQL** and **MS SQL Server**, optimizing queries to improve performance by **15%** on average.\n- Integrated monitoring tools into cloud architecture to track application performance metrics, resulting in timely interventions that cut downtime by **20%**.\n- Designed and delivered technical presentations and demonstrations to clients, translating complex technical concepts into understandable business propositions that elevated client satisfaction ratings.\n- Fostered strong relationships with stakeholders through effective communication and support, contributing to a **50%** increase in customer engagement.\n- Implemented DevOps practices to streamline project workflows, enhancing product delivery timelines by **35%** through consistent CI/CD pipelines."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Utilized cloud services including **AWS** and **Google Cloud Services** to enhance deployment strategies and improve application reliability for sales engineering solutions.\nImplemented scalable server environments on **Microsoft Windows Server**, **Linux**, and other operating systems to support diverse application requirements and increase operational efficiency.\nDeveloped and maintained backend services with **Python** and **JavaScript**, creating RESTful APIs to facilitate seamless integrations with various sales engineering tools.\nOptimized and managed database solutions like **MS SQL Server**, **Oracle**, and **PostgreSQL** for performance, data integrity, and processed over **1000 daily transactions** with high accuracy.\nEmployed **Docker** and **Kubernetes** for containerization and orchestration, ensuring consistent deployment across multiple environments, which reduced deployment times by up to **40%**.\nAutomated system monitoring and management tasks using **PowerShell** scripts, improving system responsiveness and reducing manual intervention by **30%**.\nCollaborated with cross-functional teams to understand client requirements and provide technical support, leading to a **25%** increase in customer satisfaction rates.\nCreated comprehensive technical documentation and training materials to assist clients in utilizing sales solutions effectively, enhancing user experience and adoption rates."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "- Developed and maintained **RESTful API** services for seamless integration with front-end applications, leveraging **Python** and **JavaScript** for robust performance.\n- Collaborated on deployment and orchestration using **Docker** and **Kubernetes**, achieving a 30% faster deployment process across environments.\n- Implemented cloud-based solutions on **AWS** and **Google Cloud Services**, optimizing server resource usage, reducing costs by 25% through efficient scaling strategies.\n- Utilized **PostgreSQL** for high-performance data management and retrieval, ensuring quick access to customer data and reducing query response time by 40%.\n- Executed effective scripts with **PowerShell** to automate various backend processes, improving operational efficiency and reducing manual errors.\n- Provided technical sales support for potential clients, showcasing the integration of enterprise-level solutions on **Microsoft Windows Server**, **Linux**, and **AIX** systems.\n- Led training sessions for sales team members on the technical capabilities of products, enhancing their understanding of cloud and on-premises solutions, resulting in a 15% increase in sales conversion rates.\n- Conducted product demonstrations utilizing **MS SQL Server** and **Oracle** to highlight the benefits of database management and analytics for enterprise-level customers.\n- Engaged with client feedback to inform product development, ensuring solutions aligned with market needs and driving a 20% increase in customer satisfaction scores."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, JavaScript\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tRESTful API\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Google Cloud Services\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis, MS SQL Server, Oracle\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tMicrosoft Windows Server, Linux, HPUX, AIX, z/OS, Azure (App Services, Blob, SQL)\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot",
  "apply_company": "Rocket Software"
}