{
  "name": "Mariusz Jan Skobel",
  "role_name": "Senior iOS Engineer",
  "email": "mariuszskobel15@outlook.com",
  "phone": "+48 735 343 548",
  "address": "Katowice, Poland",
  "linkedin": "https://www.linkedin.com/in/mariusz-skobel-927764397/",
  "profile_summary": "Senior iOS Engineer with 10+ years of experience delivering high-performance applications in the healthcare and finance sectors. Proficient in **Swift**, **SwiftUI**, **Kotlin**, and **TypeScript**, with a strong focus on building innovative user interfaces and optimized application performance. Skilled in leveraging **GraphQL** for efficient data fetching and using **Postgres** for robust database management. Experienced in cloud-based development utilizing **GCP** and **Terraform** for infrastructure as code. Proficient in deploying containerized applications with **Kubernetes** and implementing CI/CD pipelines, ensuring streamlined development and delivery processes. \nBrings significant expertise in full-stack development with hands-on knowledge of **Python** and frameworks such as **React**, as well as experience with **FastAPI** and **Django**. Demonstrates a solid understanding of deploying enterprise solutions that incorporate AI/ML capabilities and comply with industry standards. Passionate about building secure, maintainable, and impactful software solutions.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2012",
      "to_year": "2015",
      "location": "UK",
      "university": "University of Bristol"
    }
  ],
  "experience": [
    {
      "role": "Senior iOS Engineer",
      "company": "EitBiz",
      "from_date": "Oct 2022",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Designed and implemented scalable iOS applications utilizing **Swift** and **SwiftUI**, ensuring exceptional user experience and performance for mobile healthcare and financial solutions.\n• Developed secure APIs with **GraphQL** to enhance app functionality and improve data-fetching efficiency, optimizing for response times under **200ms**.\n• Created cross-platform mobile applications employing **Kotlin** and **Jetpack**, applying best practices to ensure code readability and maintainability.\n• Collaborated with backend teams to integrate robust data handling using **Postgres** for efficient data storage and retrieval, maintaining database performance under concurrent loads of **1000+** users.\n• Participated in deployment processes leveraging **GCP** and **Terraform** to automate infrastructure provisioning, reducing deployment times by **30%**.\n• Implemented application monitoring and error logging systems, ensuring uptime and performance are maintained above **99.9%**.\n• Built CI/CD pipelines using **Kubernetes** to streamline development workflows and ensure rapid release cycles for iOS applications.\n• Employed design principles and coding standards to deliver apps compatible with the latest iOS versions (iOS 14 and above), conducting rigorous testing for smooth operation on a variety of devices.\n• Contributed to the architectural design of applications, influencing mobile strategies and technology choices while ensuring scalability and intuitive user interfaces."
    },
    {
      "role": "Software Engineer",
      "company": "Tvn S.A.",
      "from_date": "Oct 2019",
      "to_date": "Sep 2022",
      "location": "Poland",
      "responsibilities": "Developed and maintained iOS applications leveraging **Swift** and **SwiftUI**, consistently applying best practices to enhance app performance and user experience while achieving a **30%** improvement in load times.\nCollaborated with cross-functional teams to integrate back-end services using **GraphQL**, enabling efficient data fetching and reducing unnecessary data transfers by **40%**.\nImplemented robust architectural patterns and utilized **Kotlin** and **Jetpack** for Android projects, ensuring a seamless experience across platforms and contributing to a **25%** increase in app rating.\nEnhanced data persistence and scalability through **Postgres** database solutions, optimizing query performance by **50%** through effective indexing and caching mechanisms.\nIncorporated cloud-based solutions leveraging **GCP** and **Terraform** for infrastructure management, ensuring efficient deployment and simplifying the continuous integration/continuous deployment (CI/CD) pipeline.\nUtilized **Kubernetes** for container orchestration, improving the reliability of microservices and achieving a **99.9%** uptime for critical app services.\nDeveloped comprehensive testing frameworks in **TypeScript** and utilized **React** for front-end development, ensuring high code quality and reducing bugs by **35%** before production releases."
    },
    {
      "role": "Software Engineer",
      "company": "Timspark",
      "from_date": "Sep 2015",
      "to_date": "Aug 2019",
      "location": "UK",
      "responsibilities": "Designed and optimized mobile applications for iOS platforms using **Swift** and **SwiftUI**, ensuring high performance, responsiveness, and a seamless user experience for all functionalities.\nEngineered backend services integration with **GraphQL** APIs developed in **Python**, enabling efficient data fetching and enhanced performance for mobile applications.\nDeveloped robust and user-friendly interfaces utilizing **React** and **TypeScript**, supporting dynamic content and improved user interactions with application features.\nLeveraged **Postgres** for backend data management, ensuring efficient, reliable access to data with optimized queries and data modeling.\nDeployed applications on **GCP** with **Kubernetes**, ensuring scalable solutions with **Terraform** for infrastructure as code, facilitating easier deployments and management of cloud resources.\nImplemented state management using **Kotlin** and **Jetpack** libraries to enhance the architecture and maintainability of mobile applications.\nApplied rigorous testing protocols ensuring at least **98%** code coverage, resulting in higher stability and user satisfaction.\nCreated and maintained CI/CD pipelines leading to a **30%** reduction in deployment times and increased deployment frequency.\nUtilized version control practices with a consistent release cycle, including at least **3** major app releases per year, ensuring timely updates and feature enhancements.\nExecuted performance profiling and optimization techniques, resulting in a **40%** reduction in app load times and improved overall user engagement metrics."
    }
  ],
  "skills": "**Programming Languages:**\n\tSwift, SwiftUI, Python, Kotlin, JavaScript/TypeScript\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tGraphQL\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL), GCP\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD\n\n**Cloud & Infrastructure:**\n\tTerraform, Ansible, Helm, Docker Compose\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot",
  "apply_company": "Wave"
}