{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Quality Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "As a results-driven Senior Quality Engineer with 8 years of experience, I excel in **test automation**, **software testing**, and **version control** using **Git**. My strong scripting skills in **Python** and **Shell** enable me to develop efficient testing frameworks for embedded systems on **Linux** and **Android**, including experience with **QNX** and **Android/ADB**. I am proficient in using **Pytest** and **Appium** for comprehensive testing of automotive software, including familiarity with **CAN** and **Ethernet** protocols.\nI possess exceptional **analytical skills** and **problem-solving abilities**, combined with excellent **time management** and a proactive **initiative** to drive quality improvements. My background in full-stack development, complemented by deep technical expertise in modern frameworks such as **React**, **Next.js**, and **Node.js**, along with **AWS** and **Azure** cloud environments, empowers me to lead quality assurance for high-performance solutions in health and finance sectors.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Quality Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Implemented comprehensive **test automation** solutions using **Pytest** to enhance software quality and reduce release cycles by **30%**.\nManaged **version control** processes using **Git** to ensure code integrity and streamlined collaboration across multi-functional teams.\nDeveloped and maintained **scripting** tools in **Python** and **Shell** to automate repetitive tasks, improving efficiency by **20%** in testing workflows.\nConducted **software testing** for embedded systems on both **Linux** and QNX platforms, enhancing system reliability and performance.\nExecuted end-to-end testing for mobile applications on **Android** platforms using **Appium**, ensuring optimal user experience and compliance with product specifications.\nApplied advanced **analytical skills** to troubleshoot software issues and drive resolutions, achieving a defect reduction of **40%**.\nDemonstrated strong **problem-solving skills** to analyze and rectify quality issues during the software development lifecycle, ensuring timely problem resolution.\nUtilized effective **time management** to prioritize testing tasks and deliver high-quality software while meeting stringent deadlines.\nTook the **initiative** to integrate automated testing approaches that align with agile development practices, fostering a culture of continuous improvement."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Implemented comprehensive **test automation** strategies to enhance software testing efficiency and accuracy in financial applications, reducing testing time by **30%**.\nUtilized **version control** systems such as **Git** to manage code repositories, ensuring streamlined collaboration and deployment across a team of **6** engineers.\nDeveloped and executed test scripts using **Python** and **Shell**, enhancing test coverage and facilitating the validation of critical financial transactions and system behaviors.\nIntegrated **Appium** and **Pytest** for mobile and web application testing, enabling robust software testing procedures for cross-platform compatibility and responsiveness, leading to a **25%** increase in identified defects prior to release.\nEnhanced performance of embedded systems through detailed test planning and execution on **Linux** and **Android**, significantly improving the reliability of large-scale financial platforms.\nCollaborated with cross-functional teams to troubleshoot software issues using strong analytical and problem-solving skills, proactively initiating solutions that reduced incident response times by **15%**.\nUtilized time management skills to prioritize critical testing phases, ensuring high-quality deliverables within project deadlines, while maintaining initiative in adapting to changing requirements.\nConducted root cause analysis on defects to inform future test automation and software quality improvements, driving a culture of continuous improvement across the development lifecycle."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Implemented **test automation** strategies to enhance software testing efficiency, utilizing **Python** and **Shell scripting** for robust and scalable testing frameworks.\nConducted thorough **software testing** practices on embedded systems, leveraging tools like **Pytest** and **Appium** to ensure high-quality deliverables.\nUtilized **Git** for version control, managing code changes over **50+ releases** while maintaining code integrity across multiple development environments.\nDemonstrated proficiency in **Linux** and **Android** environments, executing regression and performance tests on **QNX** and **Android/ADB** platforms to validate system functionality under varying conditions.\nApplied **analytical skills** and **problem-solving skills** to troubleshoot complex issues, driving timely resolutions to ensure project milestones were met ahead of schedule by **20%**.\nShowcased **time management** capabilities by prioritizing and managing multiple projects simultaneously, enhancing team productivity.\nTook the initiative to develop comprehensive test plans and documentation, fostering collaborative efforts within cross-functional teams to elevate product quality.\nEngaged with automotive protocols including **CAN** and **Ethernet** to validate communication between embedded systems, contributing to automotive product innovations and safety standards.\nTracked and reported test outcomes to stakeholders, ensuring transparency and alignment on project development phases while maintaining compliance with industry standards."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, Shell, JavaScript/TypeScript\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n **Frontend Frameworks:**\n\tReact, Vue, Angular\n\n **API Technologies:**\n\tOIDC, RBAC, JWT, OAuth2\n\n **Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n **Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:**\n\tNginx, Certbot\n\n **Other:**\n\ttest automation, software testing, version control, Git, scripting, embedded systems, Linux, Android, QNX, Android/ADB, Pytest, Appium, automotive, CAN, Ethernet, analytical skills, problem-solving skills, time management, initiative",
  "apply_company": "Unikie"
}