{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Java Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Senior Java Engineer with 13+ years of experience in delivering robust applications, specializing in **Java**, **Spring**, **Microservices**, and CI/CD methodologies. Proficient in creating scalable solutions utilizing **Docker**, **Kubernetes**, and cloud platforms such as **AWS**. Strong expertise in both SQL and NoSQL databases, ensuring efficient data management. Demonstrated ability in effective **Unit Testing** and meticulous **Documentation** to enhance software quality.\nAdditionally, I bring hands-on experience with **JavaScript/TypeScript**, **Python**, and **Flutter**, providing a well-rounded approach to full-stack development. I have developed AI/ML-powered platforms employing **FastAPI**, **Django**, and can integrate with modern frontend frameworks like **React** and **Angular**. I thrive in compliance-focused environments, adhering to standards such as HIPAA and PCI DSS while fostering team communication and collaboration.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Java Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Designed and built full-stack platforms for healthcare and fintech using **Java** and **Spring**, ensuring high performance and scalability in various applications.\n- Deployed and maintained **Docker** containers in a **Kubernetes** environment, facilitating microservices architecture for seamless integration and fault tolerance.\n- Developed and optimized database solutions utilizing both **SQL** (PostgreSQL) and **NoSQL** (MongoDB), tailored to support diverse data needs across sectors.\n- Implemented CI/CD pipelines leveraging tools such as **Jenkins** and **GitHub Actions**, ensuring automated testing and deployment methodologies that improved release timelines by **30%**.\n- Collaborated on Agile teams, emphasizing effective communication and documentation practices to streamline processes and enhance team alignment.\n- Led the transformation of legacy systems into microservices architectures, utilizing **Docker**, **Kubernetes**, and cloud services like **AWS** for efficient deployments.\n- Conducted unit testing and quality assurance with frameworks such as **JUnit** and **Mockito**, enforcing robust testing strategies across the application layers with a **95%** code coverage rate.\n- Built and maintained data infrastructure designed for high-volume data processing using both relational (SQL) and non-relational (NoSQL) databases, enhancing data retrieval speed by **40%**.\n- Improved application performance leveraging asynchronous programming and effective RESTful API design with **Spring** and **React** for dynamic user experiences.\n- Documented project specifications and processes, creating comprehensive user guides that improved onboarding times for new team members by **20%**.\n- Fostered a culture of continuous integration and development through the implementation of test automation frameworks ensuring high-quality code delivery.\n"
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Utilized **Java** and **Spring** frameworks to develop and maintain microservices, improving system architecture and maintainability for financial applications.\nImplemented containerization strategies with **Docker** for efficient deployment in cloud environments like **OpenShift** and **Kubernetes**, significantly reducing deployment times by **40%**.\nCollaborated with cross-functional teams to build scalable applications, managing **SQL** and **NoSQL** databases to ensure optimal data storage and retrieval performance.\nApplied CI/CD practices to automate testing and deployment workflows, resulting in a **30%** decrease in production deployment errors and improved code quality.\nConducted unit testing and documentation to maintain high standards of code integrity and maintainability throughout the software development lifecycle.\nEngaged in clear communication with stakeholders to understand requirements and deliver solutions aligned with company goals, enhancing team collaboration and project success rates.\nOptimized performance by configuring and scaling backend services hosted on **AWS**, achieving a **25%** reduction in response latency.\n"
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Engineered microservices architecture leveraging **Java** and **Spring**, ensuring robust and scalable backend systems to support high-traffic applications while adhering to best practices in **CI/CD** and **Docker**.\nDeveloped and maintained **SQL** and **NoSQL** databases to support dynamic e-commerce functionalities, optimizing queries for performance improvements on over **10,000** transactions per day.\nImplemented automated unit testing frameworks to ensure high-quality code, achieving a code coverage of **85%** and significantly reducing the incidence of bugs during deployment phases.\nCollaborated effectively with cross-functional teams, applying strong communication skills to document architectural decisions and to facilitate knowledge sharing, ensuring all team members are aligned on project objectives.\nUtilized **Kubernetes** and **OpenShift** for container orchestration and deployment, achieving a streamlined deployment process that reduced deployment time by **40%**.\nEnhanced frontend applications built with **Angular** and **React**, focusing on user engagement metrics and implementing features that increased user retention rates by **25%**.\nDesigned responsive user interfaces that comply with accessibility standards (WCAG 2.1), focusing on mobile-first engagement and integrating best practices in UI development.\nApplied role-based access control (RBAC) for secure access management, ensuring GDPR compliance by managing customer and admin access effectively.\nIntegrated cloud services such as **AWS** for scalable storage solutions and cost management, reducing operational costs by **30%** through optimized resource utilization."
    }
  ],
  "skills": "    **Programming Languages:**\n    \tJava, Python, JavaScript/TypeScript\n\n    **Backend Frameworks:**\n    \tSpring, FastAPI, Flask, Django\n\n    **Frontend Frameworks:**\n    \tAngular, React, Vue\n\n    **API Technologies:**\n    \tOpenShift, Microservices\n\n    **Serverless and Cloud Functions:**\n    \tAWS: Lambda, ECS, RDS, S3\n\n    **Databases:**\n    \tSQL, NoSQL, PostgreSQL, MySQL, MongoDB, Redis\n\n    **DevOps:**\n    \tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n    **Cloud & Infrastructure:**\n    \tAWS, Azure: App Services, Blob Storage, SQL Database\n\n    **Other:**\n    \tMLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), OAuth2, JWT, Nginx, Let’s Encrypt, Certbot, Unit Testing, CI/CD, Documentation, Communication",
  "apply_company": "R Systems"
}