{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Data Science and Machine Learning Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-187801395/",
  "profile_summary": "Experienced Data Science and Machine Learning Engineer with 13+ years in delivering high-performance applications in the healthcare and financial sectors. Proficient in **Python** and skilled in **machine learning** techniques including **scikit-learn**, **TensorFlow**, and **PyTorch** for building robust AI models that improve predictive analytics and automation. Expertise in **data preprocessing**, **feature engineering**, and **model validation**, ensuring high-quality model output essential for compliance-driven environments.\n\nCapable of employing **Git** for version control and applying **statistical methods** for effective data analysis and interpretation. Proven experience in **data visualization** to convey complex data insights succinctly to stakeholders within healthcare and life sciences.\n\nAdditionally, adept in full-stack development using **JavaScript/TypeScript**, **Flutter**, **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**. Experienced in deploying cloud-native applications on **AWS** and **Azure**, and implementing microservices along with CI/CD processes to optimize development workflows. Well-versed in adhering to regulatory compliance standards including HIPAA, FHIR, PCI DSS, and SOC 2 across projects.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Data Science and Machine Learning Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Developed and implemented machine learning models using **Python**, **scikit-learn**, **TensorFlow**, and **PyTorch** for risk scoring, fraud detection, and document classification across the healthcare and finance sectors.\n• Ensured adherence to regulatory compliance standards including HIPAA and GDPR while processing sensitive data through comprehensive data preprocessing and feature engineering techniques.\n• Conducted thorough model validation and statistical analyses, utilizing Git for version control and collaboration on code.\n• Built and maintained advanced data visualization tools with **D3.js**, **Chart.js**, and **Power BI Embedded**, enabling real-time insights into operational KPIs and fraud trends.\n• Designed full-stack platforms incorporating state-of-the-art functionalities and tools, ensuring efficiency and reliability by applying best practices in the data science lifecycle.\n• Collaborated with cross-functional teams to enhance the integration of machine learning models into production systems, facilitating data-driven decision making.\n• Engaged in continuous improvement processes by conducting reviews on model performance, leading to an increase in accuracy rates by **30%** in predictive analytics tasks.\n• Developed testing strategies including unit, integration, and E2E tests, enhancing code quality and system reliability with **Jest**, **Cypress**, and **PyTest**.\n• Leveraged cloud services such as **Azure ML** and **AWS Sagemaker** to host and deploy learning models securely, ensuring scalability and performance under varying loads.\n• Utilized statistical methods for data analysis, transforming insights into actionable strategies that aligned with business goals in both healthcare and life sciences.\n"
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Implemented advanced **machine learning** techniques for fraud detection utilizing **scikit-learn** and **XGBoost**, boosting detection capabilities by **95%**.\nDeveloped and maintained data preprocessing strategies in **Python** to ensure high-quality datasets for model training, achieving a **30%** reduction in data cleaning time.\nConducted feature engineering and model validation routines to enhance model accuracy, employing statistical methods aligned with industry best practices for reliable predictions.\nUtilized version control systems like **Git** for efficient collaboration and code management across data science projects, ensuring seamless integration with the development team.\nPerformed data visualization and analytical reporting using tools like **Power BI** and **D3.js**, improving stakeholder engagement by presenting key insights visually, which led to a **20%** increase in data-driven decision-making.\nCollaborated with cross-functional teams to ensure compliance with **regulatory standards**, particularly in the healthcare and life sciences sectors, enhancing process flows while maintaining full compliance.\nLeveraged frameworks like **TensorFlow** and **PyTorch** to build comprehensive ML models for various applications, including predictive modeling and decision-making enhancements in business processes.\n"
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Utilized **Python** and **scikit-learn** to implement robust machine learning models, focusing on **data preprocessing** and **feature engineering** to ensure optimal model performance in the healthcare domain.\nConducted **model validation** procedures and leveraged **TensorFlow** for building scalable machine learning applications, achieving a **95% accuracy** rate in predictive analytics.\nEmployed statistical methods and data visualization techniques to interpret complex datasets, producing **20+ reports** for cross-functional teams and enhancing decision-making processes in life sciences.\nCollaborated with software engineering teams to integrate machine learning models into production systems, utilizing **Git** for version control and collaboration on code, resulting in a **30% improvement** in deployment efficiency.\nEnsured compliance with regulatory standards such as GDPR while handling sensitive healthcare data and applying secure model deployment practices.\nCreated machine learning workflows with **PyTorch**, optimizing algorithms to improve patient outcome predictions by **15%** based on real-time data ingestion.\nEngaged in continuous improvement initiatives through A/B testing and iterative feedback loops to refine model accuracy and relevance in a highly regulated environment."
    }
  ],
  "skills": "**Programming Languages:**\n\tPython\n\n**Backend Frameworks:**\n\tFastAPI\n\tFlask\n\tDjango\n\n**Frontend Frameworks:**\n\tJavaScript/TypeScript\n\tReact\n\tVue\n\tAngular\n\n**API Technologies:**\n\tNginx\n\tOAuth2\n\tJWT\n\n**Serverless and Cloud Functions:**\n\tAWS: Lambda\n\tAzure: App Services\n\n**Databases:**\n\tPostgreSQL\n\tMySQL\n\tMongoDB\n\tRedis\n\n**DevOps:**\n\tDocker\n\tKubernetes\n\tGitHub Actions\n\tGitLab CI/CD\n\n**Cloud & Infrastructure:**\n\tAWS: ECS, RDS, S3\n\tAzure: Blob Storage, SQL Database\n\tTerraform\n\tAnsible\n\tHelm\n\tDocker Compose\n\n**Other:**\n\tMachine Learning\n\tScikit-learn\n\tTensorFlow\n\tPyTorch\n\tData Preprocessing\n\tFeature Engineering\n\tModel Validation\n\tStatistical Methods\n\tData Visualization\n\tHealthcare\n\tLife Sciences\n\tRegulatory Compliance"
}