{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior JavaScript Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "Results-driven Senior JavaScript Engineer with 8 years of extensive experience in crafting high-performance solutions for diverse sectors, prominently healthcare and finance. Proficient in **JavaScript**, **TypeScript**, **React**, **Node.js**, and modern web technologies including **HTML5**, **CSS3**, and **SASS**. Skilled in leveraging tools such as **Webpack** and **Gulp** for efficient build processes.\n\nExpertise in building and maintaining microservices architectures and utilizing frameworks that promote scalable application development. Demonstrated ability to work with CI/CD practices, ensuring timely deployment and integration. Proven track record of developing dynamic applications that adhere to compliance standards including HIPAA and PCI DSS.\n\nIn addition to technical acumen, I bring a solid foundation in team collaboration and project management, consistently delivering robust and secure applications, while also mentoring junior developers in best practices.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior JavaScript Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Developed and optimized scalable, full-stack applications using **JavaScript**, **TypeScript**, and **Node.js**, ensuring robustness and maintainability across various projects.\n- Leveraged modern front-end frameworks, specifically **React** (versions **17-18**) and **HTML5**, to create dynamic and interactive user interfaces, enhancing user engagement and experience.\n- Collaborated with cross-functional teams utilizing **Git** for version control, ensuring seamless integration and deployment processes.\n- Implemented responsive design techniques using **CSS3**, **SASS**, and **LESS** to deliver consistent and aesthetically pleasing interfaces across different devices and screen sizes.\n- Architected microservice-based architectures, enhancing performance and scalability of applications while ensuring adherence to best practices.\n- Employed **Webpack** and **Gulp** for efficient asset management and build processes, contributing to reduced load times and improved application performance.\n- Conducted unit and integration testing using **Playwright** ensuring high code quality and reliability across all features.\n- Integrated modern ECMAScript standards (**ECMAScript5** and **ECMAScript6**) to maintain code best practices while enhancing functionality and user experience.\n- Monitored application performance and user feedback to iteratively improve functionality and resolve any issues promptly, ensuring customer satisfaction.\n- Mentored junior developers by providing guidance on coding best practices and modern technologies, fostering a collaborative learning environment."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "• Developed dynamic, user-focused front-end applications using **React (18)**, **TypeScript**, **HTML5**, and **CSS3**, ensuring high performance and responsiveness for financial dashboards and admin portals.\n• Leveraged **Node.js** along with **Microservices** architecture to enhance the scalability and maintainability of high-volume transaction systems.\n• Collaborated with cross-functional teams using **Git** for version control, ensuring effective changes and improvements to the codebase across a team of 9 engineers.\n• Applied advanced styling techniques using **SASS** and **LESS** to create visually appealing and consistent user interfaces while adhering to design guidelines.\n• Optimized build processes utilizing **Webpack** and **Gulp**, resulting in a 30% reduction in loading times for enterprise-level applications.\n• Maintained and improved applications by implementing modern JavaScript features from **ECMAScript6**, ensuring adherence to best practices in coding standards.\n• Automated testing and deployment processes using **Playwright**, which led to a 25% increase in code quality and application stability."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Utilized **JavaScript** to develop and optimize scalable microservices for an e-commerce platform using **Node.js** (NestJS, Express), enhancing performance across key functionalities such as checkout and order processing with a focus on reducing latency to under **200ms**.\nConstructed dynamic, engaging frontend components in **React** (18), ensuring fast load times of under **3 seconds** on multiple devices and implementing responsive design via **HTML5** and **CSS3** for optimal user experience.\nCollaborated with cross-functional teams to implement version control practices using **Git**, facilitating smoother workflows and enhanced collaboration on code repositories.\nEmployed modern CSS preprocessors like **SASS** and **LESS**, achieving modular and maintainable styles across frontend applications while enhancing design consistency.\nOrchestrated build processes using **Webpack** and **Gulp**, resulting in optimized application bundles that reduce load times by up to **30%**.\nDeveloped and maintained high-quality codebases in line with **ECMAScript6** standards, implementing best practices to ensure maintainability and scalability of the code.\nTested and validated UI functionality through **Playwright**, achieving an automated test coverage of over **90%**, ensuring robust and bug-free deployments.\nWorked with backend teams to integrate APIs and improve application resilience, contributing to a microservices architecture that increased deployment frequency by more than **50%**.\nParticipated in extensive code reviews and contributed to team knowledge sharing, fostering a culture of continuous learning and improvement within the engineering department."
    }
  ],
  "skills": " **Programming Languages:**\n\tJavaScript, Python, TypeScript\n\n **Frontend Frameworks:**\n\tReact, Vue, Angular, HTML5, CSS3, SASS, LESS\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django, Node.js\n\n **API Technologies:**\n\tJWT, OAuth2, OIDC\n\n **Serverless and Cloud Functions:**\n\tAWS Lambda, Azure Functions\n\n **Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD\n\n **Cloud & Infrastructure:**\n\tAWS (ECS, RDS, S3), Azure (App Services, Blob, SQL), Terraform, Ansible, Helm, Docker Compose\n\n **Other:**\n\tMLflow, Airflow, Kubeflow, Nginx, Certbot, Microservice, Webpack, Gulp, ECMAScript5, ECMAScript6, Playwright",
  "apply_company": "Aylo"
}