{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Software Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-karol-kotlinski-bb2520397/",
  "profile_summary": "As a proficient Software Engineer with 8 years of experience, I specialize in delivering high-performance applications utilizing **Ruby**, **TypeScript**, **React**, and **Docker**. My technical expertise includes strong knowledge in API integration and cloud services, particularly with **AWS CDK**. I have a solid background in database management with **Postgres** and **Redis**, ensuring efficient data handling in developed applications.\nI have successfully contributed to enterprise projects that require stringent compliance standards, demonstrating my knowledge in cybersecurity practices. My experience also extends to full-stack development, covering both front-end and back-end frameworks, as well as applying best practices in software engineering. My foundational skills in automation and infrastructure management, paired with my strong commitment to building secure and scalable applications, enable me to deliver solutions that meet both user needs and business objectives.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Software Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Developed robust applications using **TypeScript** and **Ruby on Rails**, ensuring adherence to cybersecurity standards by incorporating secure coding practices and API integrations.\n• Designed containerized solutions using **Docker** for seamless deployment and scalability of applications, enhancing development workflows.\n• Implemented cloud infrastructure and services using **AWS CDK** for efficient resource management and deployment strategies.\n• Built and maintained databases utilizing **Postgres** and **Redis**, optimizing for transactional integrity and quick data retrieval.\n• Enhanced user interfaces and experiences through custom components in **React**, focusing on responsive design and user-centered functionality.\n• Collaborated with cross-functional teams to integrate various APIs, ensuring streamlined interaction and data flow between systems.\n• Conducted rigorous cybersecurity assessments, ensuring compliance with industry standards and protecting sensitive user information in all software solutions.\n• Engaged actively in Agile development cycles, delivering features on time while navigating product iterations and changes.\n• Achieved a reduction in application load times by **30%** through optimization techniques and better resource management.\n• Delivered high-quality code through peer reviews and unit testing, consistently maintaining a test coverage exceeding **85%**.\n• Contributed to continuous integration and continuous deployment (CI/CD) pipelines, enabling rapid release cycles and quick iteration of features."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Utilized **Ruby on Rails** to design and develop highly efficient APIs for integration with various financial services, ensuring robust data exchange and enhanced user experience.\nDeveloped scalable applications using **TypeScript** and **React** (18), implementing effective state management through **Redux Toolkit** to enhance user interactivity and performance in financial dashboards.\nManaged containerization and deployment processes using **Docker**, optimizing development workflows and ensuring consistent environments across all stages of deployment.\nImplemented cloud infrastructure strategies with **AWS CDK**, automating resource provisioning and improving application scalability and reliability.\nWorked with **Postgres** as the primary database, performing optimizations that improved query performance by **25%**, facilitating quicker data retrieval for end-users.\nLeveraged **Redis** for caching frequently accessed data, significantly reducing load times and improving application responsiveness by **30%**.\nApplied best practices in **Cybersecurity** to secure applications and user data, ensuring compliance with industry standards and regulations.\nCollaborated closely with cross-functional teams to gather requirements, resulting in delivering user-centered solutions that improved customer satisfaction scores by **15%**.\nIntegrated third-party APIs and services, enhancing the functionality of applications and broadening their capabilities across platform ecosystems."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Utilized **Ruby on Rails** and **PostgreSQL** for developing backend services, ensuring robust API integration and secure data management to enhance e-commerce functionalities.\nLeveraged **TypeScript** for building scalable and maintainable web applications, streamlining the development process and improving team collaboration through better code structure.\nImplemented **Docker** for containerization of applications, promoting consistent environment setups across development and production with version control metrics.\nApplied **AWS CDK** for automating infrastructure as code, ensuring efficient resource management and deployment processes in a secure cloud environment.\nEmployed **Redis** for caching mechanisms, effectively reducing the load on databases and increasing system responsiveness by up to **75%** during peak traffic.\nIntegrated advanced security measures with **Cybersecurity knowledge**, enforcing best practices for data encryption and secure API access to protect sensitive user information.\nDeveloped interactive frontend interfaces using **React** to deliver seamless user experiences, amplifying engagement and conversion rates by up to **25%**.\nCollaborated on cross-functional teams to ensure project alignment with business goals and timelines, demonstrating excellent communication skills and teamwork.\nOptimized deployment processes using **Docker** and scalable architectures to handle **over 1M** transactions per month with minimal downtime.\nManaged version control and collaborative development using Git, ensuring effective tracking of changes and streamlining workflows across the development team."
    }
  ],
  "skills": "**Programming Languages:**\n\tRuby, TypeScript\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django, Rails\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tAPI integration\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), AWS CDK\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, Cybersecurity knowledge"
}