{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Automation Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "As a Senior Automation Engineer with 8 years of experience, I excel in developing efficient automation solutions using **n8n**, **REST APIs**, and **webhooks** to streamline processes. I am proficient in integrating various tools such as **HubSpot**, **Airtable**, **Slack**, **Notion**, **Stripe**, and **Google Workspace** for enhanced productivity and seamless data flow. My solid foundation in **JavaScript** and **SQL** allows me to build data pipelines and execute ETL processes effectively. Additionally, I possess strong problem-solving and communication skills, ensuring clear collaboration across teams.\n\nI have a proven track record in building high-performance solutions within the healthcare and financial sectors, leveraging technologies like **Python**, **Flutter**, **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**. My cloud expertise encompasses **Azure** and **AWS**, where I have developed enterprise-grade platforms incorporating AI/ML capabilities for predictive analytics and real-time data processing. I am also experienced in microservices architecture, event-driven systems, and CI/CD automation, ensuring robust and compliant applications aligned with standards such as HIPAA, FHIR, PCI DSS, and SOC 2. Furthermore, I have hands-on expertise in developing machine learning pipelines and implementing MLOps workflows, utilizing tools like **MLflow**, **Airflow**, and **Kubeflow**.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Automation Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Designed and implemented robust **REST APIs** and **webhooks** for seamless integration with tools like **HubSpot**, **Airtable**, **Slack**, and **Stripe**, ensuring reliable data flow and automation across platforms.\nDeveloped scalable **data pipelines** and **ETL** processes using **n8n** for effective data management and transformation, enhancing data accessibility for automations.\nUtilized **JavaScript** extensively for building automation scripts, facilitating smooth interactions with various APIs, and streamlining workflows across systems.\nConfigured automation solutions that leverage **OAuth** for secure authentication and authorization, fostering safe connections between third-party applications and user data.\nExecuted detailed testing and verification processes, focusing on **JSON** payloads to validate the integrity and correctness of data integrations and automations.\nCollaborated cross-functionally to solve complex automation challenges, employing effective **communication** strategies and a **problem-solving** mindset to improve team workflows.\nMaintained meticulous attention to detail in designing automation systems, ensuring alignment with project goals and stakeholder expectations.\nAuthored documentation and guided best practices for automation processes, contributing to knowledge-sharing and team efficiency.\nLeveraged tools like **Google Workspace** for managing projects and coordinating with team members, promoting collaborative work environments and enhanced productivity.\nAnalyzed data to drive insights and optimize automation workflows, employing SQL for advanced data querying and reporting, which led to a **25%** increase in operational efficiency.\nImproved existing automation frameworks and implemented new features based on user feedback, resulting in a **30%** reduction in process errors and enhanced end-user satisfaction.\nDelivered automation solutions that supported compliance with data protection regulations, aligning with organizational security protocols and guidelines."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Designed and implemented automated workflows utilizing **n8n** for seamless integration with **REST APIs**, enhancing operational efficiency and reducing manual tasks by **75%**.\nDeveloped reliable data pipelines using **ETL** processes to extract, transform, and load data from various sources, ensuring data integrity and timely availability for analytics.\nBuilt and managed system integrations with third-party services including **HubSpot**, **Airtable**, **Slack**, and **Stripe**, maintaining a holistic view of automation across platforms and enabling real-time notifications and actions.\nCreated secure, token-based authentication flows using **OAuth** in compliance with industry standards, facilitating smooth and safe user experiences across platforms.\nImplemented webhooks to achieve real-time data exchange and event-driven automation, reducing latency and increasing responsiveness of integrated applications.\nOptimized JSON data handling and manipulation in **JavaScript** applications, enhancing performance and ensuring precise data formatting for RESTful services.\nFostered strong communication among cross-functional teams to resolve issues and improve automation processes, demonstrating exceptional problem-solving abilities.\nMaintained a detail-oriented approach to test and validate automation solutions, ensuring they met the highest standards of reliability and performance."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Designed and optimized automated workflows utilizing **n8n** for seamless integration between **HubSpot**, **Airtable**, and **Slack**, ensuring efficient communication and data flow across platforms.\nDeveloped and maintained **REST APIs** and **webhooks** for reliable data exchange, leveraging **JavaScript** and **JSON** to enhance system interoperability and user interactions.\nEngineered data pipelines to automate data extraction, transformation, and loading (ETL) processes, ensuring reliable and scalable data integration solutions for various applications.\nApplied **OAuth 2.0** for secure integration of external services, facilitating controlled access while ensuring data protection and compliance with privacy regulations.\nUtilized **SQL** to manage and query databases, enhancing data retrieval efficiency for various operational and reporting needs.\nImplemented automation capabilities to streamline operational tasks, reducing manual workload by approximately **30%** while enhancing accuracy and consistency in processes.\nLed problem-solving sessions focusing on automation challenges, driving continuous improvement initiatives that resulted in a **20%** reduction in average processing time across automated systems.\nWorked closely with cross-functional teams to refine communication strategies and optimize workflows, leveraging tools like **Google Workspace** and **Notion** for improved project management and collaboration.\nConducted thorough testing and validation of automated solutions, ensuring high reliability and adherence to specifications, which has maintained a platform uptime of **99.9%**.\nCrafted documentation for automation processes and workflows, focusing on clarity and detail-oriented descriptions to facilitate knowledge sharing within the organization."
    }
  ],
  "skills": "**API Technologies:**\n\tREST APIs, webhooks, OAuth, JSON\n\n**Programming Languages:**\n\tPython (FastAPI, Flask, Django), JavaScript/TypeScript (React, Vue, Angular), SQL\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda), Azure (App Services)\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis, SQL\n\n**Cloud & Infrastructure:**\n\tAWS (RDS, S3), Azure (Blob, SQL)\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, n8n, HubSpot, Airtable, Slack, Notion, Stripe, Google Workspace, communication, problem-solving, detail-oriented",
  "apply_company": "Pet Media Group (PMG)"
}