{
  "name": "Mariusz Jan Skobel",
  "role_name": "Senior Engineer - AI Solutions",
  "email": "mariuszskobel15@outlook.com",
  "phone": "+48 735 343 548",
  "address": "Katowice, Poland",
  "linkedin": "https://www.linkedin.com/in/mariusz-skobel-789557397/",
  "profile_summary": "Senior Engineer - AI Solutions with 10+ years of experience in developing high-performance software solutions in healthcare and finance, specializing in **generative AI**, **agentic AI**, and **deep learning** technologies. Proficient in **Python**, **C++**, and **Java**, with experience in frameworks and tools such as **FastAPI**, **LangChain**, **LangGraph**, and **LlamaIndex**. Demonstrated expertise in building cloud-native applications across **AWS**, **Azure**, and **GCP**, and integrating cutting-edge technologies such as **MLflow**, **Airflow**, and **Kubeflow** for MLOps workflows.\n\nSkilled in developing and deploying intelligent solutions that leverage **RAG** and **ONNX** for optimized model performance. Strong analytical and problem-solving abilities, coupled with effective business communication skills in both verbal and written English. Dedicated to creating secure, maintainable systems that enhance real-world impact while adhering to compliance standards, with a robust background in microservices architecture and CI/CD automation.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2012",
      "to_year": "2015",
      "location": "UK",
      "university": "University of Bristol"
    }
  ],
  "experience": [
    {
      "role": "Senior Engineer - AI Solutions",
      "company": "EitBiz",
      "from_date": "Oct 2022",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Integrated advanced AI functionalities utilizing **Python** and AI frameworks to develop generative AI and agentic AI solutions, enhancing decision-making processes in healthcare and finance.\n• Developed and optimized deep learning models using **TensorFlow** and **PyTorch** for applications such as patient risk prediction and financial fraud detection, achieving accuracy improvements of up to **15%**.\n• Designed robust APIs with **FastAPI** for seamless integration of AI-powered features, ensuring efficient communication between frontend and backend components.\n• Collaborated on the design and implementation of LLMs and SLMs, leveraging **LangChain** and **LangGraph** for enhanced data processing and user experience.\n• Engaged in critical thinking and problem-solving to address complex challenges in AI model performance, scalability, and deployment.\n• Delivered cloud-based solutions on **AWS** and **Azure**, maintaining infrastructure for AI applications and ensuring compliance with data security standards for healthcare (e.g., HIPAA, GDPR).\n• Established a CI/CD pipeline using **GitHub Actions** and **Azure DevOps**, facilitating version control and automated deployment of AI solutions, achieving a **30%** reduction in deployment time.\n• Conducted business communication with stakeholders to align AI solution development with organizational goals, ensuring usability and effectiveness in real-world applications.\n• Engaged in cross-team collaboration with data scientists to fine-tune NLP models using **spaCy** and **Hugging Face Transformers**, achieving a **20%** reduction in processing time for document parsing tasks.\n• Conducted performance evaluations and testing strategies using tools like **Postman** and **Cypress**, achieving a test coverage of **90%** across services to ensure robustness in AI solutions."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Tvn S.A.",
      "from_date": "Oct 2019",
      "to_date": "Sep 2022",
      "location": "Poland",
      "responsibilities": "Utilized **Python**, **FastAPI**, and **Azure** to leverage AI solutions focused on LLM and generative AI technologies, enhancing the capability of financial systems to incorporate advanced machine learning models.\nEmployed deep learning frameworks and libraries, such as **scikit-learn** and **XGBoost**, for developing and deploying fraud detection systems, significantly improving anomaly detection by **30%**.\nDesigned and implemented agentic AI systems focused on real-time transaction monitoring, integrating tools like **Kafka** and **RabbitMQ** for enhanced communication and data flow.\nOrchestrated the creation of Machine Learning pipelines for credit scoring and transaction classification, utilizing **Airflow** and **MLflow**, which streamlined predictive analytics and improved processing time by **25%**.\nContributed to the modernization of financial services by adopting a microservices architecture using technologies such as **Node.js (NestJS/Express)**, **Django**, and **Azure Service Bus**, resulting in a **40%** increase in system throughput.\nDeveloped user-focused applications utilizing **React (18)** and **Next.js**, ensuring responsive design and optimal user experiences in financial dashboards with a focus on business communication clarity.\nCollaborated with cross-functional teams to ensure effective problem-solving and critical thinking processes were integrated into AI project planning and development, enhancing project delivery timelines by **15%**.\nPioneered the integration of cloud services like **GCP** and **AWS** for scalable AI solution deployment, increasing overall system resiliency and flexibility in handling high-volume financial transactions.\n"
    },
    {
      "role": "Software Engineer",
      "company": "Timspark",
      "from_date": "Sep 2015",
      "to_date": "Aug 2019",
      "location": "UK",
      "responsibilities": "Leveraged **Python** (FastAPI) and **Java** to design robust backend systems for **AI solutions**, ensuring high scalability and performance across various **generative AI** and **agentic AI** features.\nEngineered solutions utilizing **deep learning** frameworks and **LlamaIndex** for dynamic data processing and model integration, driving enhancements in **LLM** functionalities and **RAG** processes for real-time data insights.\nDeveloped and optimized frontend interfaces using **React** (18) and **TypeScript** for seamless user interactions, implementing responsive designs that comply with accessibility standards (WCAG 2.1).\nUtilized cloud platforms such as **AWS** and **GCP** for hosting and deploying **AI models**, ensuring seamless integration and availability across global operations.\nImplemented and maintained microservices architectures using **Python** (FastAPI, Django) and **Node.js** (NestJS), promoting adaptability for evolving business needs while boosting system resilience.\nConducted comprehensive testing and debugging to enhance platform functionality, employing **problem-solving** and **critical thinking** skills to address complex issues effectively.\nCreated AI-driven workflows integrated with **Stripe** and **PayPal** for payment processing, ensuring tokenized transactions comply with **PCI** standards and enhancing user trust.\nEngaged in **business communication** to collaborate with cross-functional teams, translating technical specifications into actionable project plans to drive successful delivery.\nAdopted **LangChain** for simplifying AI model interactions, significantly streamlining data flows and enhancing performance metrics for end-user applications.\nEnhanced user privacy by applying role-based access control (RBAC) and **OAuth 2.0**, ensuring robust security practices while maintaining compliance with GDPR requirements."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, C++, Java, Kotlin, JavaScript/TypeScript\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n **Frontend Frameworks:**\n\tReact, Vue, Angular\n\n **API Technologies:**\n\tLLM, SLM, generative AI, agentic AI, deep learning, LangChain, LangGraph, RAG, MCP, smolagents, LlamaIndex, ONNX\n\n **Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL), GCP\n\n **Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:**\n\tAWS, Azure\n\n **Other:**\n\tcritical thinking, problem-solving, business communication, verbal and written English"
}