{
  "name": "Tomasz Lee",
  "role_name": "Senior Data Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Results-driven Senior Data Engineer with 9+ years of experience in ETL processes, Data Transformation, and CI/CD practices. Proficient in using **DBT**, **Snowflake**, and **Talend** for effective data management and integration. Strong expertise in SQL and Python for data processing and analytics. Familiar with Agile methodologies and DataOps principles to enhance project delivery. Proven track record of implementing Data Vault models and Data Mesh concepts to ensure data accessibility and governance. Recognized for exceptional analytical skills, collaborative team leadership, and the ability to streamline data workflows.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Senior Data Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Applied **SQL** and **Python** for data extraction, transformation, and loading (ETL) processes, ensuring high data quality and accuracy.\nDeveloped and maintained data pipelines using **Talend** and **Alteryx**, enhancing data processing efficiency by **30%**.\nImplemented **Data Vault** methodologies for effective data modeling and historical data tracking, leading to improved analytics capabilities.\nLeveraged **DBT** for data transformation processes, increasing production efficiency by **25%**.\nImplemented **CI/CD** practices using **GitLab**, which facilitated automated deployment of data workflows, reducing deployment errors by **40%**.\nUtilized **Snowflake** as a cloud data warehousing solution, optimizing data storage and access for analytics.\nCollaborated within an **Agile** team environment to iterate on data solutions, improving time-to-delivery of analytics reports by **20%**.\nPerformed data quality checks and validation processes to uphold the **FAIR** principles for data management.\nDesigned and maintained **Data Mesh** architectures for decentralized data management and accountability across teams.\nAnalyzed and processed large datasets to deliver actionable insights, aiding in strategic decision-making."
    },
    {
      "role": "Full Stack Developer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "Developed and implemented ETL processes using **Python** and **Talend** to efficiently transform and move data into **Snowflake**, leading to a **30%** reduction in data load times.\nDesigned and optimized SQL queries for data transformation within **Snowflake**, achieving a **20%** improvement in data retrieval speed.\nImplemented Data Vault methodology for structuring data in the **Data Mesh** architecture, enhancing data accessibility and usability across teams.\nCreated and maintained CI/CD pipelines using **GitLab**, which streamlined deployment processes and reduced errors by **25%**.\nCollaborated in an Agile environment with cross-functional teams to gather requirements and iteratively develop data solutions, improving project delivery timelines by **15%**.\nManaged and optimized data workflows using **DBT** for effective data transformation and model deployment, ensuring compliance with **FAIR** data principles.\nConducted data quality assessments and implemented monitoring tools to ensure data accuracy and integrity across systems.\nUtilized **Alteryx** for data preparation and analysis, transforming complex datasets into actionable insights for stakeholders.\nProvided mentorship and training sessions on DataOps best practices and tool usage to junior engineers, enhancing their capabilities in managing data lifecycle.\nDesigned and implemented strategies for effective Data Transformation, ensuring alignment with business goals and user needs."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "Utilized **SQL** for data retrieval and transformation processes, ensuring efficient management of large datasets and improving query performance by **30%**.  \nImplemented **ETL** processes using **Talend** to automate data flows between sources and our **Snowflake** data warehouse, enhancing data availability for analytics.  \nConverted data processes to align with **Data Vault** methodology, improving data integrity and consistency across systems.  \nDeveloped scripts in **Python** for data transformation and validation, increasing data accuracy by **25%**.  \nCollaborated in an **Agile** environment, participating in standups and code reviews to maintain alignment on project goals.  \nSet up **CI/CD** pipelines using **GitLab**, increasing deployment efficiency and reducing errors in production by **40%**.  \nApplied **DataOps** principles to streamline data management practices, leading to a **15%** reduction in operational overhead.  \nEnabled data sharing through integration with various external APIs, facilitating seamless updates for analytics dashboards.  \nDocumented data processing workflows and operational guidelines, improving team knowledge sharing and onboarding processes."
    }
  ],
  "skills": "  \n**Programming Languages**  \n\tPython, JavaScript, TypeScript, C#, HTML, CSS  \n\n**Backend Frameworks**  \n\tNodeJS, ExpressJS, NestJS, .NET, Entity Framework, Microservices, Talend  \n\n**Frontend Frameworks**  \n\tReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS  \n\n**API Technologies**  \n\tRESTful API, GraphQL  \n\n**Serverless and Cloud Functions**  \n\tAWS, Azure  \n\n**Databases**  \n\tMSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB, Snowflake, SQL  \n\n**DevOps**  \n\tCI/CD pipelines, GitLab  \n\n**Cloud & Infrastructure**  \n\tDatabase Systems, DataOps  \n\n**Other**  \n\tUX/UI Design, Git, GitHub, Messaging & Caching: Apache Kafka, RabbitMQ, Redis, Testing Tools: NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest, Blockchain: Solidity, Ether.js, Web3.js, Ethereum, DBT, ETL, Data Vault, Data Transformation, Agile, Data Mesh, FAIR, Redux",
  "apply_company": "Billennium"
}