{
  "name": "Tomasz Lee",
  "role_name": "Senior Sales Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Results-driven Senior Sales Engineer with 9+ years of experience in technical standards and market segmentation within mechanical and process engineering sectors. Demonstrates strong communication skills and expertise in relationship building to effectively collaborate with clients and stakeholders. Proven ability to leverage analytical skills to inform pricing strategy and drive sales initiatives. Technical proficiency in **.NET**, **C#**, **ReactJS**, **NextJS**, and cloud services enhances the capability to understand intricate product specifications and integrate feedback efficiently. Adept at leading cross-functional teams to deliver comprehensive solutions while optimizing performance and streamlining processes.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Senior Sales Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Utilized strong **communication skills** to engage with clients and understand their needs, resulting in a **20%** increase in customer retention.\nCollaborated with cross-functional teams, fostering **teamwork** and relationship building to streamline sales processes and enhance client satisfaction.\nEngaged in **market segmentation** analysis to identify potential customer bases, driving a tailored **pricing strategy** that increased revenue by **15%**.\nEstablished and maintained **technical standards** for product presentations to ensure clarity and effectiveness in communication with both technical and non-technical stakeholders.\nDeveloped comprehensive sales presentations and reports using **MS Office**, showcasing the value propositions of engineering solutions effectively.\nApplied **Mechanical Engineering** and **Process Engineering** knowledge to explain complex technical products to prospective clients, facilitating informed purchasing decisions.\nConducted in-depth discussions on **PED** and **ATEX** compliance with engineering teams to ensure product adherence to industry standards, enhancing credibility in market.\nLeveraged sales techniques in alignment with **marketing** strategies to maximize product visibility and market penetration, resulting in increased sales leads.\nMonitored competitive products and market trends to inform future engineering solutions, contributing to proactive adjustments in sales tactics."
    },
    {
      "role": "Software Engineer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "Developed and implemented **technical standards** for sales presentations, enhancing product understanding by 30% among potential clients.\nCollaborated with cross-functional teams to create **market segmentation** strategies that increased targeted outreach effectiveness by 20%.\nDesigned pricing strategies based on comprehensive market analysis, leading to a **15%** increase in annual revenue.\nUtilized **MS Office** tools to prepare detailed reports and presentations, streamlining communication of product features to clients.\nFostered **relationship building** with key clients, resulting in a **25%** growth in long-term contracts.\nDemonstrated strong **communication skills** by conducting training sessions for sales teams, improving knowledge on **mechanical engineering** products.\nApplied **process engineering** concepts to streamline sales processes, reducing lead time by **20%**.\nExhibited strong **teamwork** abilities by collaborating effectively with marketing and sales departments to align on sales goals and target audiences.\nParticipated in the development of **PED** and **ATEX** compliant products, ensuring adherence to industry safety standards and expanding market reach.\nProvided mentorship to junior engineers in **sales strategies**, enhancing their performance by fostering a collaborative team environment."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "• Leveraged **sales** and **marketing** strategies to enhance customer relationships and drive product engagement, resulting in a **20%** increase in sales team productivity.\n• Utilized strong **communication skills** and **teamwork** to effectively support cross-functional teams in achieving market segment goals and pricing strategies.\n• Analyzed customer data to inform **market segmentation** decisions, enhancing targeted sales approaches and increasing conversion rates.\n• Developed and maintained technical documentation and user guides in **MS Office**, fostering better knowledge transfer among internal teams.\n• Supported the implementation of technical standards related to **Mechanical Engineering** and **Process Engineering** to improve product offerings.\n• Designed customer relationship management tools that align with both technical and sales objectives, enhancing relationship building capabilities.\n• Participated in ongoing professional development (PED) to stay updated on industry best practices and regulatory standards like **ATEX**."
    }
  ],
  "skills": "**Frontend Frameworks**\n\tHTML, CSS, JavaScript, TypeScript, ReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n**Backend Frameworks**\n\tNodeJS, ExpressJS, NestJS, C#, .NET, Entity Framework, Microservices\n\n**API Technologies**\n\tRESTful API, GraphQL\n\n**Database Systems**\n\tMSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB\n\n**Cloud & Infrastructure**\n\tAWS, Azure\n\n**DevOps**\n\tCI/CD pipelines\n\n**Testing Tools**\n\tNUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest\n\n**Blockchain**\n\tSolidity, Ether.js, Web3.js, Ethereum\n\n**Other**\n\tUX/UI Design, Git, GitHub, Python, Redux, Communication Skills, Teamwork, Relationship Building, MS Office, Sales, Marketing, Market Segmentation, Pricing Strategy, Technical Standards, PED, ATEX, Mechanical Engineering, Process Engineering",
  "apply_company": "Atlas Copco"
}