{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Core Engine/C++ Optimization Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-karol-kotlinski-bb2520397/",
  "profile_summary": "As a Core Engine/C++ Optimization Engineer with 8 years of experience, I possess extensive expertise in **C++** programming and advanced optimization techniques, specializing in multithreading and performance profiling using **VTune** and console profiling tools. My background includes in-depth analysis of CPU/GPU crash dumps, ensuring system stability and performance enhancements. I am adept at developing high-performance solutions and optimizing existing codebases to meet stringent standards.\n\nMy original strengths lie in utilizing modern software development practices and frameworks. I have led projects leveraging **React**, **Next.js**, **Node.js**, and **Python** to create scalable applications across sectors. Furthermore, I bring experience in cloud services, primarily with **Azure** and **AWS**, focusing on CI/CD automation and compliance with standards like HIPAA and PCI DSS. Additionally, my hands-on work in machine learning workflows using **MLflow**, **Airflow**, and **Kubeflow** adds value to my profile by integrating advanced technological capabilities.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Core Engine/C++ Optimization Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Optimized and fine-tuned C++ applications for performance efficiency, utilizing **VTune** and console profiling tools to analyze CPU/GPU utilization and improve execution speed, resulting in a performance increase of **30%**.\n- Employed multithreading techniques to enhance the responsiveness and scalability of core engine applications, ensuring efficient resource utilization and reduction of processing time by **20%**.\n- Conducted thorough CPU/GPU crash dump analysis to identify and resolve issues, leading to improved system stability and reduced downtime by **15%**.\n- Collaborated with cross-functional teams to implement best practices for code optimization in **Unreal Engine**, ensuring high-quality graphics rendering and game performance across different platforms.\n- Developed and maintained performance testing frameworks, focusing on continuous integration and deployment (CI/CD) to automate testing processes, reducing manual testing efforts by **40%**.\n- Partnered with game designers and developers to integrate optimized features into gaming applications, ensuring seamless user experiences with minimal lag and high frame rates.\n- Trained team members on advanced optimization techniques in C++ and **Unreal Engine**, fostering a culture of continuous improvement and knowledge sharing within the engineering team."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Utilized **C++** and **Unreal Engine** to optimize core engine performance, enhancing throughput and reducing latency in high-demand environments.\nImplemented multithreading strategies to improve application responsiveness and efficiency, successfully supporting up to **1000+** concurrent users without degradation of service.\nEmployed **VTune** and other console profiling tools for in-depth performance analysis, identifying bottlenecks and implementing solutions that increased frame rates by up to **30%**.\nConducted thorough **CPU/GPU crash dump analysis** to troubleshoot and resolve critical issues, leading to a **50%** reduction in production downtime and improved overall system stability.\nCollaborated with cross-functional teams to gather requirements, ensuring that optimization efforts aligned with business objectives and end-user needs.\nMaintained documentation of optimization processes and results, providing stakeholders with clear insights into performance improvements and resource management strategies."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Utilized **C++** and **Unreal Engine** to optimize core game engine functionalities, ensuring enhanced performance through effective **multithreading** strategies.\nConducted performance analysis using **VTune** and various **console profiling tools**, achieving up to **50%** reduction in CPU/GPU resource usage during peak loads.\nExecuted detailed **CPU/GPU crash dump analysis** to quickly identify and resolve critical issues, enhancing game stability and user experience.\nCollaborated with cross-functional teams to gather requirements and translate them into scalable architectural designs, reducing iteration times by **30%**.\nDeveloped efficient algorithms that improved frame rates by **20%**, resulting in smoother gameplay and better player retention.\nImplemented best practices in coding standards and documentation, increasing maintainability and clarity for team members.\nMonitored performance metrics in real-time and conducted regular assessments, streamlining the optimization process based on player feedback and usage trends."
    }
  ],
  "skills": "**Programming Languages:**\n\tC++, Python, JavaScript, TypeScript\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tJWT, OAuth2\n\n**Serverless and Cloud Functions:**\n\tAWS (Lambda), Azure (App Services)\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS (ECS, RDS, S3), Azure (Blob, SQL), Nginx, Certbot\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), Let’s Encrypt, multithreading, Unreal Engine, VTune, console profiling tools, CPU/GPU crash dump analysis"
}