{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Frontend Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Senior Frontend Engineer with 13+ years of experience in high-performance application development, specializing in modern UI frameworks and libraries such as **React**, **Next.js**, and **TypeScript**. Proven track record of building dynamic web applications utilizing **WebGL**, **Three.js**, and state management tools like **Storybook** and **Radix UI**. Skilled in implementing visually appealing designs using **Tailwind** and creating interactive user experiences through **UI/UX** strategies. \n\nExpert in integrating AI functionalities into web applications leveraging tools such as **OpenAI**, **Hugging Face**, **LangChain**, and **Stable Diffusion**. Proficient in developing real-time applications using **WebSocket** and optimizing performance with **REST** and **GraphQL** APIs. Experienced in automating testing processes with **Cypress** and **Vitest**, and ensuring code quality with **Playwright**.\n\nIn addition to frontend expertise, I possess comprehensive backend skills with **Node.js** and **Python**, and am adept in containerization using **Docker**. My strong foundation in compliance-driven development ensures alignment with industry standards while continually enhancing project delivery through innovative solutions.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Frontend Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Developed advanced UI/UX solutions utilizing **React** (17–18) and **Next.js** to create responsive applications with high performance and seamless user experiences.\n• Integrated state management solutions using **TypeScript** and **Node.js** to enhance application efficiency and maintainability, ensuring implementation of best practices.\n• Collaborated with cross-functional teams to design and implement **REST** and **GraphQL** APIs that support interactive features, enabling intuitive user interactions and real-time data updates.\n• Employed modern animation techniques and visualizations with **WebGL** and **Three.js**, elevating user engagement and experience in interactive web applications.\n• Led the implementation of UI components with **Storybook** and **Radix UI**, driving consistency and reusability across multiple projects and teams.\n• Championed responsive design principles using **Tailwind CSS**, reducing development time by **30%** while ensuring high-quality design across various screen sizes.\n• Developed and executed testing strategies with **Cypress** and **Vitest**, achieving **90%** test coverage on critical components, resulting in higher reliability and reduced bug rates.\n• Collaborated with ML teams to leverage **Hugging Face** and **OpenAI** technologies for building intelligent features, elevating application capabilities through AI enhancements.\n• Utilized **Docker** for containerization of development environments, streamlining the onboarding process and reducing setup time by **50%**.\n• Designed and implemented seamless animations and transitions, enhancing the overall user experience with a focus on performance and accessibility.\n• Conducted code reviews and mentoring sessions to uphold best practices and foster continuous learning among team members in the adoption of new frameworks and technologies like **Framer** and **ComfyUI**."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "• Developed high-performance interactive front-end applications using **React (18)**, **Next.js**, and **TypeScript**, enhancing user engagement through responsive UI design and seamless navigation.\n• Implemented UI/UX best practices, leveraging tools such as **Figma** and **Framer**, to create intuitive user interfaces for financial services.\n• Collaborated with cross-functional teams to craft engaging animations and visual effects using **Tailwind CSS**, enhancing the overall aesthetic and interactivity of web applications.\n• Integrated **REST** and **GraphQL** APIs to ensure efficient data retrieval and manipulation, optimizing load times by **30%** through network performance tuning.\n• Automated testing processes for front-end applications with **Cypress** and **Vitest**, ensuring a **99%** bug-free deployment rate and improved CI/CD efficiency.\n• Developed creative, interactive elements using **WebGL**, **Three.js**, and **Radix UI**, resulting in enhanced data visualizations that simplified complex information for end users.\n• Engaged in AI-driven feature development by exploring capabilities offered by **OpenAI**, **Hugging Face**, and **LangChain**, contributing innovative solutions to address user needs.\n• Explored emerging trends in UI frameworks and tools, such as **Storybook**, to enhance component-driven development and maintainability for existing applications.\n• Optimized application performance and scalability by orchestrating containerized environments using **Docker**, resulting in **40%** faster deployment times and improved resource management."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Developed dynamic frontend applications leveraging **React (18)**, **Next.js**, and **TypeScript** to enhance user experience, incorporating best practices in **UI/UX** design and optimizing for performance across **mobile** and **desktop** platforms.\nImplemented responsive UI components and animations using **Tailwind CSS** and **Radix UI**, ensuring fast and accessible interfaces compliant with **WCAG 2.1** standards.\nEngineered seamless integrations with **WebSocket** for real-time features, enhancing interactions and live updates in the e-commerce environment, resulting in improved user engagement and satisfaction metrics by **25%**.\nApplied a strong understanding of architectural patterns, including **REST** and **GraphQL**, to optimize data fetching and improve application response time by **30%**.\nCollaborated with backend teams to enhance services built on **Node.js** and **Python** frameworks such as **FastAPI** and **Django**, ensuring compatibility and efficient data handling for frontend requests.\nUtilized modern testing frameworks like **Cypress** and **Vitest** to maintain high code quality and reliability, achieving a test coverage rate of over **90%**.\nEngaged in design processes using **Figma** and **Framer** to prototype and iterate on UI components, aligning with business goals and user needs.\nIncorporated AI technologies, leveraging tools such as **OpenAI** and **Hugging Face** for innovative features that predict user behavior and enhance product recommendations through machine learning algorithms.\nFostered collaboration between cross-functional teams for seamless product deployments, employing agile methodologies to accelerate development cycles and reduce delivery times by **15%**."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, JavaScript, TypeScript\n\n**Frontend Frameworks:**\n\tReact, Next.js, Vue, Angular, Tailwind, WebGL, Three.js, Storybook, Radix UI\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django, Node.js\n\n**API Technologies:**\n\tREST, GraphQL, WebSocket\n\n**Serverless and Cloud Functions:**\n\tAWS: Lambda, ECS, S3, RDS\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAzure: App Services, Blob Storage, SQL Database\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, AI, Figma, Framer, OpenAI, Hugging Face, LangChain, Stable Diffusion, ComfyUI, Midjourney, UI/UX, animation, Playwright, Vitest, Cypress",
  "apply_company": "Noxx"
}