{
  "name": "Mariusz Jan Skobel",
  "role_name": ".NET Developer",
  "email": "mariuszskobel15@outlook.com",
  "phone": "+48 735 343 548",
  "address": "Katowice, Poland",
  "linkedin": "https://www.linkedin.com/in/mariusz-skobel-789557397/",
  "profile_summary": "Proficient .NET Developer with over 10 years of experience in delivering high-performance applications, leveraging core technologies such as **.NET**, **C#**, and **Azure**. Skilled in developing secure, scalable, and maintainable applications following best practices in **RESTful** architecture and **Web API 2** development. Experienced in **Angular 19**, **JavaScript**, and **HTML5** for creating dynamic user interfaces. Strong focus on **Microservices** and **Multithreading**, ensuring optimal performance and efficient resource utilization. Adept in Agile methodologies to deliver projects on time while meeting compliance standards including HIPAA and PCI DSS.\n\nAdditionally, brings hands-on experience in Object Oriented Development, utilizing design principles such as SOLID and DRY. Proven track record in leading enterprise development projects, embedding innovative solutions that are technically sound and drive real-world impact.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2012",
      "to_year": "2015",
      "location": "UK",
      "university": "University of Bristol"
    }
  ],
  "experience": [
    {
      "role": ".NET Developer",
      "company": "EitBiz",
      "from_date": "Oct 2022",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Designed and implemented scalable, full-stack solutions utilizing **.NET 9**, **C#**, and **Azure**, ensuring robust API efficiency and adherence to RESTful standards.\n• Developed dynamic web applications with emphasis on **Angular 19** and **JavaScript**, implementing **HTML5** best practices for superior user experience and responsiveness.\n• Led the migration of traditional applications to a **Microservices** architecture, improving application scalability and maintainability by adhering to **Agile** methodologies.\n• Built and optimized database interactions using **MongoDB**, applying **LINQ** for efficient data querying within the development process.\n• Integrated multithreading capabilities to enhance application performance, resulting in a 30% increase in processing speed for concurrently executed processes.\n• Collaborated in environment-specific deployment strategies using **Azure**, ensuring seamless integration and maintenance of live systems with a downtime of less than 5%.\n• Employed Object-Oriented Development principles, following **SOLID** and **DRY** methodologies to enhance code readability and reusability across projects.\n• Established RESTful services with solid documentation for internal and external stakeholders, ensuring clarity in the functioning of **Web API 2**.\n• Conducted peer code reviews adhering to best practices, increasing overall code quality by 25% through constructive feedback loops.\n• Maintained legacy systems while simultaneously developing new features, leading to a 15% increase in customer satisfaction ratings as measured by surveys.\n"
    },
    {
      "role": "Senior Software Engineer",
      "company": "Tvn S.A.",
      "from_date": "Oct 2019",
      "to_date": "Sep 2022",
      "location": "Poland",
      "responsibilities": "Utilized **.NET 9** and **C#** to design and implement RESTful services and Web APIs, ensuring high performance and scalability in financial applications.\nEmployed **Microservices** architecture to enhance system modularity and facilitate agile deployment cycles, resulting in a 30% reduction in time-to-market for new features.\nDeveloped modern web applications using **Angular 19**, integrating **HTML5** and **JavaScript** technologies to create intuitive user interfaces for financial services.\nApplied **Multithreading** techniques to improve the responsiveness and efficiency of server-side applications, ultimately enhancing the user experience for over **100k** daily active users.\nImplemented **LINQ** for complex data queries against MongoDB, streamlining data access and management within the applications, cutting down response times by **25%**.\nChampioned and adhered to SOLID principles and DRY methodologies to ensure high code quality and maintainability, leading to a **40%** decrease in bug reports post-deployment.\nContributed to Agile development processes by participating in daily standups and retrospective meetings, fostering collaboration and continuous improvement.\n"
    },
    {
      "role": "Software Engineer",
      "company": "Timspark",
      "from_date": "Sep 2015",
      "to_date": "Aug 2019",
      "location": "UK",
      "responsibilities": "Developed and optimized **.NET 9** backend services for scalable e-commerce solutions utilizing **C#** and **RESTful** APIs, ensuring high performance and reliability for key application modules.\nEngineered cross-platform features using **Angular 19**, enhancing user engagement and maintaining a mobile-first design, while adhering to **HTML5** standards for accessibility and SEO compliance.\nImplemented multithreading solutions in the development process, significantly improving application responsiveness and resource management under high-load conditions.\nDesigned microservices architecture to facilitate continuous integration and deployment within an **Agile** framework, ensuring rapid delivery of features and essential updates to the e-commerce platform.\nApplied best coding practices including **SOLID** principles and **DRY** methodology for maintainability and readability of complex external and internal APIs, leading to a **25%** reduction in code duplication.\nManaged database integration and data handling using **MongoDB**, ensuring efficient data storage and fast access speeds in high-traffic scenarios, which resulted in a **30%** performance boost.\nCreated and maintained secure and efficient **Web API 2** endpoints, fostering seamless communication between the client-side and server-side applications.\nLeveraged **Microservices** for isolated feature development and deployment, which enhanced system scalability and facilitated rapid feature rollout with minimal impact on existing service architecture.\nImplemented role-based access control (RBAC) strategies to ensure authorized user access and data protection integration compliant with GDPR, enhancing user trust and data security measures.\nConducted thorough application testing and debugging using advanced object-oriented development techniques, ensuring a robust and error-free application environment."
    }
  ],
  "skills": "Programming Languages:\n\tC#, JavaScript, Python\n\nBackend Frameworks:\n\t.NET, .NET 9, FastAPI, Flask, Django\n\nFrontend Frameworks:\n\tAngular, Angular 19, React, Vue\n\nAPI Technologies:\n\tRESTful, Web API 2, OIDC, JWT, OAuth2\n\nServerless and Cloud Functions:\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\nDatabases:\n\tMongoDB, PostgreSQL, MySQL, Redis\n\nDevOps:\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\nCloud & Infrastructure:\n\tAzure\n\nOther:\n\tArtificial Intelligence & Machine Learning (MLflow, Airflow, Kubeflow), Multithreading, Microservices, Agile, Object Oriented Development, Solid, DRY"
}