{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Frontend Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "As a Senior Frontend Engineer with 8 years of experience, I excel in **TypeScript**, **React**, and **React Native** to build seamless cross-platform applications that prioritize user experience in the fintech sector. I integrate modern strategies in **authentication** and **WebAuthn** to ensure secure and compliant solutions, utilizing my knowledge in **clean architecture** and **agile** methodologies to enhance development processes. My background in collaboration and communication allows me to work effectively within cross-functional teams.\nBeyond frontend expertise, I possess strong full-stack capabilities with a tech stack that includes **Node.js**, **Python**, and libraries such as **Flutter** and **FastAPI**. I have a solid foundation in cloud solutions with **Azure** and **AWS**, leading the development of enterprise-grade platforms and employing **microservices architecture** and **CI/CD automation** to drive efficiency and quality. My proficiency in integrating AI/ML capabilities into applications further supports intelligent automation and real-time data processing.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Frontend Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Developed cross-platform applications using **TypeScript**, particularly focusing on **React** and **React Native**, ensuring optimal user experience in fintech applications.\n- Collaborated effectively with cross-functional teams to implement clean architecture within agile development processes, enhancing overall communication and collaboration.\n- Leveraged strong skills in frontend development to craft intuitive user interfaces that meet robust authentication standards, including **WebAuthn** for secure logins.\n- Integrated SDKs for seamless collaboration between frontend components and backend services, strengthening the interoperability and functionality of fintech products.\n- Prioritized user experience by implementing best practices in UI/UX design, resulting in a 30% increase in user engagement metrics over a 6-month period.\n- Championed the adoption of modern frontend frameworks, ensuring all web applications are built using the latest versions of **React (17-18)** and efficient development practices.\n- Maintained high coding standards by employing code reviews and fostering a culture of feedback, which improved the onboarding experience for new team members by 25%.\n- Produced thorough documentation for various components and functionalities, which streamlined the development process and enhanced team alignment across projects.\n- Implemented responsive design techniques, ensuring applications provide a seamless user experience across multiple devices and form factors.\n- Actively participated in Agile ceremonies, including daily stand-ups and retrospectives, to constantly improve development processes and team performance."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Developed dynamic, user-focused front-end applications using **React (18)** and **TypeScript**, ensuring exceptional user experience by leveraging clean architecture principles in collaboration with cross-functional teams.\nEngineered robust and scalable solutions, applying agile methodologies to enhance project transparency and team productivity, ensuring deliverables met or exceeded timelines by **25%**.\nCollaborated with design and backend teams to create responsive and performant user interfaces, integrating WebAuthn for secure authentication in fintech applications, thereby reducing user login times by **40%**.\nBuilt and maintained SDKs to streamline app development processes for clients, resulting in a **30%** decrease in time-to-market for cross-platform applications.\nOptimized application performance through code reviews and refactoring, achieving a **20%** increase in rendering speed, contributing to improved user engagement metrics.\nFostered effective communication and collaboration among team members through regular stand-ups and retrospectives, which led to higher team morale and a **15%** boost in overall team efficiency."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "• Developed responsive and user-friendly frontend applications using **React (18)** and **TypeScript**, adhering to **clean architecture** principles to enhance user experience and optimize functionality.\n• Executed cross-platform development strategies, leveraging **React Native** to ensure a consistent experience across mobile and web applications.\n• Collaborated effectively with cross-functional teams in an **agile** environment, promoting open communication to refine project goals and enhance team productivity.\n• Integrated **WebAuthn** protocols for secure authentication, improving user trust and compliance with industry standards in the fintech sector.\n• Designed and implemented SDKs to facilitate seamless integration of features, enhancing collaboration with third-party developers and streamlining onboarding processes.\n• Engaged in regular code reviews and pair programming, fostering a strong culture of collaboration and mentorship within the development team.\n• Managed project timelines and deliverables while communicating updates and technical challenges to stakeholders, ensuring transparency and timely project execution.\n• Participated in user testing sessions to gather feedback and iteratively improve the application, aligning development with user expectations and needs.\n• Implemented and maintained a robust versioning system for frontend components, ensuring consistency across deployments and reducing integration issues during updates."
    }
  ],
  "skills": "**Programming Languages**:\n\tTypeScript, Python, JavaScript\n\n**Frontend Frameworks**:\n\tReact, React Native, Vue, Angular\n\n**Backend Frameworks**:\n\tFastAPI, Flask, Django\n\n**API Technologies**:\n\tWebAuthn, JWT, OAuth2\n\n**Databases**:\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps**:\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure**:\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Other**:\n\tMLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), Let’s Encrypt, Nginx, Certbot, cross-platform development, SDK development, fintech, user experience, clean architecture, agile, collaboration, communication",
  "apply_company": "Career Renew"
}