{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Backend Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "With 8 years of experience in software development, I excel in **JavaScript**, **TypeScript**, and **API** integrations, making me a strong candidate for the Senior Backend Engineer role. My technical skills include expertise in **RDBMS** and **Postgres**, ensuring effective data management and integration solutions. I thrive in fast-paced environments and prioritize clean code principles while delivering high-quality, collaborative solutions.\nAs a seasoned Full Stack Developer, I have built high-performance solutions in the healthcare and financial sectors using **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**. My deep cloud experience with **Azure** and **AWS** enables me to develop enterprise-grade platforms that incorporate AI/ML capabilities, including predictive analytics and intelligent automation.\nI have a strong foundation in microservices architecture and event-driven systems, coupled with CI/CD automation practices. Additionally, I am well-versed in developing machine learning pipelines and implementing MLOps workflows with tools like **MLflow**, **Airflow**, and **Kubeflow**, aligning applications with compliance standards such as HIPAA, FHIR, PCI DSS, and SOC 2.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Backend Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Utilized **JavaScript** and **TypeScript** for developing robust APIs, ensuring high-performance backend solutions for healthcare and financial platforms, with adherence to **Clean Code** principles.\nCollaborated effectively within cross-functional teams to deliver full-stack applications, demonstrating strong **Problem Solving** skills in a **Fast-paced Environment**.\nImplemented RDBMS strategies utilizing **Postgres** to manage and optimize large-scale data integration for seamless operations across healthcare and financial systems.\nExecuted comprehensive **Integration Testing** strategies to validate API performance and functionality, ensuring reliability across both frontend and backend services.\nArchitected and deployed secure, scalable applications using **Python** (FastAPI), **Node.js**, and modern frameworks along with cloud services like **AWS** and **Azure**, effectively meeting compliance standards such as HIPAA and PCI DSS.\nDesigned and maintained efficient data access and processing layers, focusing on performance tuning and data migration using **Postgres** alongside NoSQL databases like MongoDB.\nEnhanced backend performance through continuous optimization routines and collaborative review processes, delivering impactful results in software functionality and user satisfaction.\nContributed to the development of CI/CD pipelines using tools such as GitHub Actions, aiming for streamlined deployment processes while adhering to best practices of clean architecture."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Utilized **JavaScript** and **TypeScript** to enhance API development, ensuring clean code practices and integration testing to deliver high-quality financial services applications.\nDesigned and maintained relational databases (RDBMS), specifically **Postgres**, ensuring optimal data storage, retrieval, and performance across financial platforms.\nCollaborated in a fast-paced environment, prioritizing problem solving and adaptability while working alongside cross-functional teams to improve system resilience and user experience.\nLed integration efforts for dynamic data solutions, ensuring seamless data integration and transfer processes to support real-time analytics and reporting.\nImplemented robust testing strategies to uphold integration standards across various services and architectures, reinforcing quality assurance and system reliability.\nMentored team members on best practices in clean coding, enhancing overall code quality and maintainability across the development teams.\nFacilitated collaborative workshops to brainstorm solutions, leading to the successful deployment of features that align with user needs and business goals."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Collaborated effectively in a **fast-paced environment** to deliver robust backend solutions by utilizing **JavaScript** and **TypeScript**, ensuring clean, maintainable, and scalable code across all modules.\nEngineered and integrated APIs to extend the functionality of the platform, ensuring seamless communication between frontend and backend systems with high performance.\nOptimized database interactions by leveraging **Postgres** and other **RDBMS** solutions, achieving a 30% reduction in query response time and supporting up to **10,000 concurrent users**.\nConducted integration testing to validate data pipelines and application logic, ensuring reliable data integration and maximizing system uptime with less than **2% downtime**.\nMaintained a focus on clean code practices and effective problem-solving techniques, leading to improved code quality and team productivity, resulting in a **25% faster deployment rate**.\nDemonstrated collaborative skills by actively participating in code reviews, team meetings, and knowledge-sharing sessions, enhancing team cohesion and project outcomes.\nFostered a culture of excellence by mentoring junior developers on best practices in **API** design and integration, improving onboarding efficiency and team skill sets."
    }
  ],
  "skills": " **Programming Languages:**\n\tJavaScript, TypeScript, Python\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n **Frontend Frameworks:**\n\tReact, Vue, Angular\n\n **API Technologies:**\n\tAPI\n\n **Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n **Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:**\n\tAWS, Azure\n\n **Other:**\n\tMLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, Integration Testing, Clean Code, Problem Solving, Collaborative, Fast-paced Environment",
  "apply_company": "Smartness"
}