{
  "name": "Tomasz Lee",
  "role_name": "Senior Full Stack Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Proficient Senior Full Stack Engineer with over 9 years of experience in developing high-performance applications leveraging **React**, **TypeScript**, **SQL**, **REST**, and **cloud services** (AWS). Expert in implementing asynchronous architectures and CI/CD practices, ensuring seamless deployments using **Docker** and **Kubernetes**. Strong background in microservices and micro-frontend design patterns, adhering to SOLID principles to create scalable and maintainable code. Well-versed in using **Git** for version control and collaborating effectively across multi-disciplinary teams. If needed, also experienced in using **Kotlin** in software development and familiar with AI/ML concepts for enhanced application functionality.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Senior Full Stack Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "• Spearheaded the design and development of a web-based customer management platform using **.NET 7** and **React** improving user satisfaction by **25%**.\n• Developed and deployed RESTful APIs utilizing **TypeScript** for seamless data access, ensuring services operate efficiently.\n• Designed and implemented a microservices architecture with a focus on **asynchronous architectures** using **.NET Core** to enhance scalability and maintainability.\n• Integrated **RabbitMQ** for task queuing and **Apache Kafka** for real-time data streaming, achieving improved system resilience and throughput.\n• Optimized database interactions with **MSSQL** by enhancing queries and indexing strategies, reducing average query execution time by **20%**.\n• Developed and maintained continuous integration/continuous deployment (CI/CD) pipelines on **Azure DevOps**, decreasing deployment time by **40%**.\n• Leveraged **Redis** for caching frequently accessed data, which led to a **35%** improvement in response times and reduced database load.\n• Collaborated with UX/UI designers to refine the platform’s user interface, enhancing overall user experience substantially.\n• Implemented JWT-based authentication and authorization mechanisms for enhanced security of the application framework.\n• Developed a reporting engine using **D3.js** and **Three.js** for interactive data visualizations, significantly enhancing data representation.\n• Demonstrated expertise in **design patterns** and **SOLID** principles to ensure high-quality code quality across development efforts."
    },
    {
      "role": "Software Engineer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "Utilized **React** to develop dynamic user interfaces, significantly enhancing user experience and engagement by **25%**.\nImplemented **TypeScript** for robust type checking in front-end applications, improving overall code quality and maintainability.\nDesigned and developed RESTful APIs, ensuring seamless **SQL** database integration for efficient data retrieval and interaction.\nLed the implementation of **CI/CD** pipelines using **Git**, resulting in a **30%** reduction in production deployment errors.\nCreated asynchronous architectures with **Kubernetes** and **Docker**, optimizing application deployment and scalability.\nIntegrated **AWS** services for cloud solutions, streamlining project management and reducing infrastructure costs.\nApplied **design patterns** and **SOLID principles** to enhance code efficiency and maintainability across projects.\nDeveloped interactive charts using **D3.js** for project tracking, enhancing visibility for stakeholders on project statuses.\nConducted mentorship sessions and code reviews, fostering an environment of continuous learning and enhancing team productivity.\nCollaborated closely with stakeholders to define requirements, ensuring project milestones were met on time and within budget."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "Utilized **React** and **TypeScript** to develop interactive user interfaces, enhancing user engagement by **30%**.\nImplemented **REST**ful APIs to streamline communication between frontend and backend services, contributing to a more efficient data flow.\nManaged and optimized data storage solutions using **SQL** databases, achieving a **40%** improvement in query performance.\nEmployed **CI/CD** pipelines for seamless integration and deployment, reducing release times by **50%**.\nDesigned and implemented asynchronous architectures using **Kubernetes** and **Docker**, promoting scalability and maintainability of applications.\nCollaborated with cross-functional teams to integrate AI/ML technologies, improving predictive analytics capabilities.\nContributed to the development of micro-frontend architectures, allowing for independent deployments and improving development speed.\nUtilized **Git** for version control, ensuring code integrity and allowing for effective collaboration among team members.\nSupported the hosting of applications on **AWS**, providing reliable cloud solutions and enhancing system availability.\nConducted code reviews with a focus on **SOLID** principles and design patterns, ensuring high coding standards and reducing technical debt.\nEngaged in daily standups to align project milestones and adapt to changing requirements dynamically."
    }
  ],
  "skills": "Frontend Technologies: HTML, CSS, JavaScript, TypeScript, ReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\tBackend Technologies: NodeJS, ExpressJS, NestJS, C#, .NET, Entity Framework, Microservices\n\tMessaging & Caching: Apache Kafka, RabbitMQ, Redis\n\tDatabase Systems: MSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB, SQL\n\tAPI Technologies: REST, GraphQL\n\tServerless and Cloud Functions: AWS, Azure, AI/ML\n\tDevOps: CI/CD pipelines, Kubernetes, Docker\n\tCloud & Infrastructure: Unix/Linux\n\tOther: Git, GitHub, Python, Redux, design patterns, SOLID, asynchronous architectures, micro-frontend, Blockchain: Solidity, Ether.js, Web3.js, Ethereum, Testing Tools: NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest",
  "apply_company": "Zenitech"
}