{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Java Developer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-karol-kotlinski-bb2520397/",
  "profile_summary": "Results-oriented Senior Java Developer with 8 years of full-stack development experience, specializing in **Java**, **Spring Boot**, and **Spring Framework**. Proven track record in building high-performance solutions across various sectors, adept in **PostgreSQL**, **Hibernate**, and CI/CD methodologies. Expertise extends to **Gradle** and **Liquibase** for seamless build and database management processes.\n\nI leverage my strong skills in system architecture and software development to create secure, robust applications in alignment with industry compliance standards. My background includes integrating **AI** capabilities to enhance applications, further solidified by experience in project management using tools such as **Jira**. Committed to delivering innovative solutions through collaboration and technical excellence.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Java Developer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Developed robust, scalable applications using **Java**, **Spring Boot**, and **Spring Framework**, contributing to high-quality and maintainable code.\n- Designed and implemented database solutions utilizing **PostgreSQL** and **Hibernate** to support data persistence and complex queries in enterprise applications with **versioning** via **Liquibase**.\n- Established CI/CD pipelines leveraging **Gradle** and automation tools to streamline the deployment process, ensuring rapid and reliable delivery of software solutions.\n- Collaborated with cross-functional teams using **Jira** for agile project management, enhancing team communication and project visibility.\n- Integrated AI-based features into Java applications, improving functionality and user experience through innovative solutions.\n- Participated in code reviews and mentoring sessions, fostering professional development and knowledge sharing among team members.\n- Conducted unit, integration, and E2E testing to maintain code quality and application reliability, incorporating automated testing frameworks for continuous quality assurance.\n- Advocated for and implemented best practices in software development, contributing to an improvement in overall project delivery timelines by **15%**.\n- Contributed to the re-architecture of systems for improved performance, scaling to **5000+** concurrent users and ensuring application reliability during peak load times."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Utilized **Java**, **Spring Boot**, and **Spring Framework** to develop enterprise-grade financial applications that enhanced transactional efficiency by **30%**.\nImplemented **PostgreSQL** and **Hibernate** for robust data management, achieving **99.9%** uptime on database services through proactive scalability and optimization strategies.\nDeveloped and maintained CI/CD pipelines using **Gradle** and integrated them with **Jira** for effective project tracking and continuous delivery of features, reducing deployment time by **50%**.\nCollaborated with cross-functional teams to architect solutions that align with business goals, particularly focused on AI-driven features for improved customer insights and experience.\nSuccessfully integrated **Liquibase** for database version control, facilitating seamless migrations across development, staging, and production environments by managing **3** database versions simultaneously.\nLed code reviews and developed best practices documentation that improved code quality and workflow efficiency within the development team.\nMentored junior developers on the effective use of **Spring Data JPA** and other related technologies, fostering a culture of knowledge sharing and continuous improvement."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "• Developed scalable backend applications using **Java**, **Spring Boot**, and **Spring Framework**, ensuring reliability and performance in high-traffic environments spanning **thousands** of transactions per hour.\n• Leveraged **Spring Data JPA** and **Hibernate** to optimize data access, achieving a **30%** increase in query response times for **PostgreSQL** databases.\n• Collaborated on CI/CD pipelines utilizing **Gradle** for automated testing and deployment, improving release times by **40%** and enabling faster feature delivery.\n• Managed project documentation and task tracking through **Jira**, facilitating agile project management and ensuring timely iteration on critical features.\n• Integrated AI modules to enhance system capabilities, personalizing user experiences and improving conversion rates by utilizing data-driven insights.\n• Employed **Liquibase** for database version control, ensuring smooth rollbacks and deployment across multiple environments, reducing downtime to **less than 5 mins** during releases.\n• Implemented comprehensive unit and integration testing strategies to maintain code quality and minimize defects, achieving a code coverage of **over 85%**.\n• Applied role-based access control (RBAC) and user authentication mechanisms using OAuth 2.0, ensuring system security and adherence to compliance standards.\n• Contributed to design discussions and architecture decisions, leveraging expertise in both backend and AI technologies to innovate and refine system functionality."
    }
  ],
  "skills": "Programming Languages:\n\tJava, Python, JavaScript, TypeScript\n\n**Backend Frameworks:**\n\tSpring Boot, Spring Framework, Spring Data JPA, Hibernate, FastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tMLflow, Airflow, Kubeflow, Keycloak, JWT, OAuth2\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis, Liquibase\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose, CI/CD, Jira\n\n**Cloud & Infrastructure:**\n\tAWS, Azure\n\n**Other:**\n\tAI"
}