{
  "name": "Tomasz Lee",
  "role_name": "Senior PHP Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Detail-oriented Senior PHP Engineer with 9+ years of experience in developing and implementing robust web applications. Proficient in **PHP**, **Symfony**, and **Laravel**, with a strong foundation in **OOP** principles and **MVC** architecture. Demonstrated expertise in database management systems including **MySQL** and **PostgreSQL**. Skilled in version control using **Git** and implementing **CI/CD** practices for streamlined development processes. Adept at designing and consuming **REST**ful APIs, ensuring optimal functionality and performance. Strong collaborative skills with a proven track record in successfully leading projects and enhancing team dynamics.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Senior PHP Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Developed robust, high-performance web applications using **PHP**, **Symfony**, and **Laravel**, enhancing system functionality and user engagement by 30%.\nImplemented Object-Oriented Programming (**OOP**) principles and **MVC** architecture to create scalable and maintainable code structures.\nDesigned and optimized MySQL and PostgreSQL databases, achieving a 25% reduction in query execution time through effective indexing and query refinement.\nUtilized **Git** for version control, ensuring code integrity and facilitating smooth collaboration across development teams.\nEstablished CI/CD pipelines, reducing deployment time by **40%** and increasing deployment frequencies, thus improving the team's agility.\nDeveloped and exposed RESTful APIs, fostering seamless communication between frontend and backend systems, improving data accessibility by 20%.\nIntegrated testing frameworks to enhance code reliability, achieving a **95%** test coverage rate before releases.\nCollaborated with cross-functional teams to gather requirements and implement features in line with user needs, resulting in better user experiences.\nParticipated in code reviews and design discussions to uphold code quality and share best practices within the engineering team."
    },
    {
      "role": "Software Engineer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "• Developed robust web applications using **PHP**, **Symfony**, and **Laravel**, ensuring adherence to **OOP** and **MVC** principles to maintain clean and scalable code.\n• Engineered and optimized MySQL and PostgreSQL databases, improving query performance by **20%** and ensuring efficient data storage and retrieval.\n• Implemented RESTful APIs for seamless integration with frontend components, enhancing application interoperability and user experience.\n• Established CI/CD pipelines with **Git** for automated testing and deployment, significantly reducing deployment time by **40%** and minimizing production errors by **30%**.\n• Collaborated with cross-functional teams to define project scope and deliver on tight timelines, directly contributing to a **15%** increase in overall project delivery efficiency.\n• Provided technical mentorship to junior developers, boosting team capabilities and improvement in code quality through regular code reviews.\n• Created dynamic web interfaces and enhanced UX using modern front-end frameworks, focusing on user engagement and retention.\n• Led workshops on advanced PHP concepts, fostering a culture of continuous improvement and innovation within the team."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "Developed web applications using **PHP** frameworks such as **Symfony** and **Laravel**, ensuring clear and efficient **OOP** and **MVC** design patterns for scalable applications.\nImplemented RESTful APIs to enhance application interoperability, maintaining responsiveness under load and supporting up to **500** concurrent users.\nUtilized **MySQL** and **PostgreSQL** for backend database management, optimizing query performance by **30%** through better indexing strategies.\nAutomated the deployment process using **Git** for version control, improving code release efficiency with **CI/CD** practices.\nParticipated in team code reviews and daily stand-ups, fostering collaborative development environments to align with project goals and maintain coding standards.\nCreated comprehensive technical documentation for projects, facilitating enhanced knowledge transfer across teams and reducing onboarding time by **25%**.\nEngaged with cross-functional teams to support integration with third-party APIs, thereby increasing system capabilities and data exchange efficiency."
    }
  ],
  "skills": " **Programming Languages**\n\t PHP, OOP, JavaScript, TypeScript, Python\n\n **Backend Frameworks**\n\t Symfony, Laravel, NodeJS, ExpressJS, NestJS, C#, .NET\n\n **Frontend Frameworks**\n\t ReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n **API Technologies**\n\t RESTful API, GraphQL\n\n **Serverless and Cloud Functions**\n\t DynamoDB, CosmosDB, AWS, Azure\n\n **Databases**\n\t MySQL, PostgreSQL, MSSQL Server, MongoDB\n\n **DevOps**\n\t CI/CD pipelines, Git, GitHub\n\n **Cloud & Infrastructure**\n\t AWS, Azure\n\n **Other**\n\t UX/UI Design, Messaging & Caching: Apache Kafka, RabbitMQ, Redis, Testing Tools: NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest, Blockchain: Solidity, Ether.js, Web3.js, Ethereum",
  "apply_company": "Whirr Crew s.r.o."
}