{
  "name": "Tomasz Lee",
  "role_name": "Senior Rust Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Results-driven Senior Rust Engineer with 9+ years of experience specializing in **Rust** development, including expertise in **memory safety**, **concurrency**, and **error handling**. Proficient in implementing **idiomatic syntax** and utilizing tools such as **cargo test**, **quickcheck**, **Cargo**, **Clippy**, and **rustfmt** for efficient code management and quality analysis. Demonstrated success in conducting thorough **code reviews**, performing **profiling**, and executing **debugging** techniques to enhance software performance. Original strengths include designing and developing complex applications within a **microservices architecture** and distributed systems, leading projects to fruition, and optimizing development workflows. Familiar with CI/CD processes and defect documentation, ensuring high-quality, reliable software delivery.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Senior Rust Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Conducted in-depth **quality analysis** and **code review** processes to maintain high standards in Rust-based applications, ensuring adherence to **idiomatic syntax** and best practices.\nEmployed **cargo test** and **quickcheck** for robust **error handling** and testing, enhancing application reliability.\nImplemented **CI/CD** pipelines that streamlined the development processes, reducing deployment times significantly.\nOptimized code for **memory safety** and **concurrency**, achieving seamless performance under high-load conditions.\nUtilized **profiling** and **debugging** techniques to identify and resolve defects proactively, resulting in fewer bugs reported post-deployment.\nLed the design and development of Rust applications with a focus on maintainability and scalability, ensuring code efficiency and ease of upgrades.\nCollaborated with cross-functional teams to foster an agile environment and iterate on project requirements effectively, enhancing overall team productivity.\nParticipated in hands-on **defect documentation** to create clear and concise records of observed issues, improving resolution times.\nUtilized tools such as **Clippy** and **rustfmt** to enforce code quality and style consistently across the codebase."
    },
    {
      "role": "Software Engineer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "Implemented robust **Rust** applications emphasizing **memory safety** and **concurrency**, ensuring high performance and reliability of crucial software components.\nDeveloped quality assurance strategies using **cargo test** and **quickcheck** to enhance code robustness and facilitate error handling, achieving a defect rate reduction by 20%.\nConducted thorough **code reviews** and provided mentorship to junior developers, resulting in a 30% increase in overall team productivity.\nUtilized **Clippy** and **rustfmt** for code quality analysis and formatting, maintaining code standards throughout the development cycle.\nDesigned and executed CI/CD pipelines, improving deployment efficiency and reducing integration issues by 25%.\nEmployed effective debugging techniques to identify and rectify critical errors, leading to a 15% improvement in application response times.\nCollaborated with cross-functional teams to define project requirements and timelines, ensuring delivery within **90** days.\nCreated documentation for defect identification and resolution processes, facilitating knowledge sharing across teams.\nLeveraged advanced features of **Rust** to implement idiomatic syntax that improved code readability and maintainability, aligning with best practices in software development."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "Utilized **Rust** to enhance system performance and ensure **memory safety** in codebase, effectively reducing runtime errors by **30%**.\nImplemented **concurrency** features in existing modules to improve application scalability and responsiveness, achieving a throughput increase of **25%**.\nConducted **code reviews** and provided quality analysis to maintain high coding standards and idiomatic syntax across the team.\nDeveloped and executed **cargo test** cases using **Quickcheck** to validate functionality and improve defect documentation practices by **40%**.\nEmployed tools like **Cargo**, **Clippy**, and **rustfmt** to streamline code management and formatting, enhancing overall development efficiency.\nParticipated in CI/CD processes to automate testing and deployment, reducing integration issues and deployment times by **50%**.\nEngaged in profiling and **debugging** sessions to identify performance bottlenecks, collaborating closely with team members for effective resolutions.\nFacilitated knowledge sharing through documentation of best practices and workflows, ensuring all team members are proficient in core **Rust** concepts."
    }
  ],
  "skills": "**Programming Languages**\n\tRust, Python, JavaScript, TypeScript\n\n**Backend Frameworks**\n\tNodeJS, ExpressJS, NestJS, C#, .NET, Entity Framework, Microservices\n\n**Frontend Frameworks**\n\tReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n**API Technologies**\n\tRESTful API, GraphQL\n\n**Serverless and Cloud Functions**\n\t\n\n**Databases**\n\tMSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB\n\n**DevOps**\n\tAWS, Azure, CI/CD pipelines \n\n**Cloud & Infrastructure**\n\t\n\n**Other**\n\tUX/UI Design, Git, GitHub, Blockchain: Solidity, Ether.js, Web3.js, Ethereum, Messaging & Caching: Apache Kafka, RabbitMQ, Redis, Testing Tools: NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest, memory safety, concurrency, error handling, idiomatic syntax, cargo test, quickcheck, Cargo, Clippy, rustfmt, code review, quality analysis, defect documentation, profiling, debugging",
  "apply_company": "FRATCH"
}