{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior RemoteSensing Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "Results-driven Senior Remote Sensing Engineer with 8 years of experience in **Python**, **AWS**, **Linux**, and advanced data analysis techniques. I specialize in machine learning and deep learning, utilizing **Databricks** for effective data processing and analysis across various projects. My expertise in algorithm development and validation ensures accurate and reliable results in remote sensing applications.\n\nProficient in radiometry and radiative transfer principles, I leverage data from numerical weather prediction (NWP) models to inform project strategies. I possess a strong ability to calibrate and cross-calibrate complex systems, ensuring compliance with industry standards. My collaborative approach fosters teamwork, and I excel in communication with cross-functional teams. I have successfully led initiatives that integrate cutting-edge technologies into strategic solutions while maintaining a strong focus on continuous improvement and innovation.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior RemoteSensing Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Utilized **Python** for advanced **data analysis** and **algorithm development** to enhance processing of microwave radiometry data.\nImplemented deep learning techniques and machine learning algorithms for modeling and interpreting complex environmental data within **cloud** environments such as **AWS** and **Databricks**.\nCollaborated effectively within cross-functional teams to develop robust solutions in **Linux** environments, ensuring high-quality results through teamwork and communication.\nExecuted calibration and validation processes for radiative transfer models, ensuring accuracy in measurements across multiple iterations, achieving specifications within **±5%** of expected values.\nDeveloped NWP models integrating real-time data feeds, improving predictive capabilities by over **30%**.\nDesigned and maintained user-friendly interfaces and dashboards to present radiometric data clearly, resulting in a **25%** increase in stakeholder engagement and understanding.\nEngineered cloud-based solutions for enhanced data storage and access, leading to a **40%** improvement in processing time for large datasets.\nConducted cross-calibration exercises between various measurement systems, achieving a standard deviation of less than **2%** in comparison results.\nLed initiatives to optimize machine learning models towards operational efficiency, resulting in a reduction of computational costs by **15%**.\nProduced comprehensive documentation and communicated technical findings effectively to ensure alignment across project stakeholders."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Utilized **Python** for data analysis and algorithm development in the realm of remote sensing, enhancing the calibration and validation of radiometric data.\nImplemented machine learning techniques within **AWS** platforms to develop predictive models for radiative transfer and cross-calibration of remote sensing data, increasing model accuracy by **25%**.\nCollaborated effectively with cross-functional teams to communicate complex data analysis findings and present solutions in a clear and concise manner, resulting in improved decision-making within a **3-member** data analysis team.\nDeveloped and executed validation strategies on **Linux** environments that led to a **30%** reduction in processing time for remote sensing data.\nDesigned and executed algorithms for microwave radiometry applications, contributing to advancements in NWP models and integration of deep learning methods for enhanced data interpretation.\nLed the training and onboarding of new team members on remote sensing techniques and tools, improving team productivity by **15%** through effective knowledge transfer and teamwork practices.\nEmployed **Databricks** for managing and analyzing large datasets derived from multiple sources, optimizing workflows, and ensuring seamless integration into existing cloud infrastructure.\nCreated documentation for algorithm development processes and results, aiding in cross-calibration processes and establishing best practices for future projects."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Utilized **Python** for data analysis, algorithm development, and machine learning processes to enhance remote sensing applications, significantly improving data accuracy and processing speed by **25%**.\nLeveraged **AWS** cloud services and **Databricks** for scalable data processing and storage, managing high-volume datasets with efficient validation and calibration methods, resulting in a **40%** increase in operational efficiency.\nConducted thorough radiometric calibration and cross-calibration of remote sensing datasets, ensuring compliance with industry standards and contributing to reliable data outputs for validation purposes.\nDesigned and implemented deep learning models for advanced data analysis and predictive modeling in remote sensing, achieving an accuracy improvement of **15%** over baseline measurements.\nCollaborated effectively in a team environment and communicated complex technical concepts clearly to stakeholders, resulting in a **50%** increase in project alignment and client satisfaction.\nDeveloped algorithms for NWP (Numerical Weather Prediction) data integration and analysis, enhancing the overall performance of meteorological models used in remote sensing applications.\nApplied radiative transfer principles to refine data interpretation processes, leading to a marked increase in precision in climate and weather research projects.\nEnsured the platform's security and data integrity by implementing role-based access control (RBAC) and maintaining data privacy in accordance with GDPR guidelines."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, JavaScript, TypeScript\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n **Frontend Frameworks:**\n\tReact, Vue, Angular\n\n **API Technologies:**\n\tJWT, OAuth2, Keycloak (OIDC, RBAC)\n\n **Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n **Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:**\n\tAWS, Azure\n\n **Other:**\n\tArtificial Intelligence & Machine Learning (MLflow, Airflow, Kubeflow), dataAnalysis, microwave, radiometry, deepLearning, calibration, validation, algorithmDevelopment, crossCalibration, teamwork, communication, NWP, cloud",
  "apply_company": "Spire"
}