{
  "name": "Patryk Zaslawski",
  "role_name": "Senior Customer Engineer",
  "email": "patrykzas0428@outlook.com",
  "phone": "+48669862402",
  "address": "Gdanski, Poland",
  "linkedin": "https://www.linkedin.com/in/patryk-zaslawski-6b04a8397/",
  "profile_summary": "As a results-driven Senior Customer Engineer with a deep understanding of **data governance**, **data quality**, and **data privacy**, I bring 8+ years of experience in the software engineering realm, specializing in enterprise architecture and **Data Management**. My professional background combines technical prowess with effective project management, enabling me to execute value-based selling strategies and conduct comprehensive ROI and cost-benefit analyses. Skilled in engaging with clients and fostering collaboration, I utilize **Integration platforms** and **Databases** to enhance customer satisfaction and streamline processes. My foundational experience as a Senior Python Full Stack Developer allows me to leverage **Python** (FastAPI, Django, Flask, SQLAlchemy), **frontend frameworks** (Angular, Vue, React, Next.js), and **cloud platforms** (AWS, Azure) to design tailored solutions that are secure and efficient, driving business success in sectors such as e-commerce, finance, and healthcare.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2014",
      "to_year": "2017",
      "location": "United Kingdom",
      "university": "The University of Manchester"
    }
  ],
  "experience": [
    {
      "role": "Senior Customer Engineer",
      "company": "Binary Studio",
      "from_date": "Aug 2023",
      "to_date": "Present",
      "location": "United Kingdom (Remote)",
      "responsibilities": "• Focused on **data governance** by leading the architectural design of a cloud-native Healthcare Experience Platform, ensuring compliance with HIPAA, FHIR, and GDPR.\n• Implemented **data quality** measures by architecting **ETL pipelines** in **Python** with **Apache Airflow**, supporting real-time and batch data management.\n• Enhanced **data privacy** through secure integration of payment gateways such as **Stripe** and **PayPal**, ensuring PCI DSS compliance with tokenization and encryption.\n• Managed **enterprise architecture** by migrating from monoliths to **Python-based microservices** deployed on **Kubernetes (AKS/EKS)**, resulting in a **30%** improvement in system scalability and resilience.\n• Championed **process management** initiatives by overseeing a cross-functional team of **10+ engineers**, guiding development in **Python**, **React**, and cloud-native patterns across **AWS/Azure** platforms.\n• Ensured effective communication by designing RESTful and gRPC APIs with **JWT-based authentication** for secure healthcare workflows.\n• Developed and monitored **data governance** frameworks integrated with **Power BI** and **Grafana** for operational insights, achieving improved compliance reporting.\n• Strengthened customer-focused solutions by building **Python microservices** for seamless integration with third-party platforms using **OAuth 2.0** and **OpenID Connect**.\n• Conducted **cost-benefit analyses** for new system implementations, demonstrating a potential **25%** reduction in operational costs.\n• Fostered collaboration within the team while automating healthcare workflows integrated into **Azure Functions**, leading to a **40%** decrease in manual processes.\n• Designed scalable **data storage solutions** using **PostgreSQL**, enhancing data retrieval speeds by **15%** through optimized indexing and partitioning.\n• Guided adoption of integration platforms such as **Kafka** and **RabbitMQ**, enabling improved asynchronous communication across distributed services.\n• Mentored junior engineers on best practices for **data management**, project delivery, and cloud-native architectures, contributing to an overall **20%** increase in project success rates.\n• Integrated **data lakes** and third-party APIs, improving data visibility and reducing search times by **35%** across healthcare datasets.\n• Developed strategies for **data privacy** compliance by embedding security measures in **Python microservices**, ensuring adherence to **SOC 2** and **ISO 27001** standards."
    },
    {
      "role": "Software Engineer",
      "company": "Ardigen",
      "from_date": "Mar 2020",
      "to_date": "Aug 2023",
      "location": "Poland",
      "responsibilities": "• Developed and managed data governance frameworks ensuring high data quality and privacy standards within enterprise architecture, utilizing tools like **Data Lakes** and **Databases**.\n• Spearheaded process management initiatives that incorporated **PaaS providers** to streamline operations and enhance system performance, leading to a **20%** increase in efficiency across teams.\n• Collaborated closely with sales and engineering teams to implement value-based selling strategies, demonstrating the ROI of innovative data management solutions to clients.\n• Managed projects focusing on integration platforms that facilitate seamless communication and collaboration across departments, improving customer satisfaction by **15%**.\n• Designed and implemented a robust data catalog, ensuring transparency and easy access to critical data assets for stakeholders, improving data utilization metrics by **30%**.\n• Established processes for effective cost-benefit analysis to evaluate new technologies and integrations, guiding executive decision-making and resource allocation.\n• Led training sessions for cross-functional teams on data privacy best practices and compliance, fostering a culture of accountability and awareness across all levels.\n• Implemented project management frameworks that ensure timely delivery of data governance initiatives, significantly reducing project delays.\n• Facilitated communication between technical teams and non-technical stakeholders, ensuring alignment on project objectives and status updates.\n• Developed a comprehensive strategy for improving data quality across various databases, leading to a reduction in data inconsistencies by **25%**."
    },
    {
      "role": "Software Engineer",
      "company": "Altum Software",
      "from_date": "Oct 2017",
      "to_date": "Feb 2020",
      "location": "United Kingdom",
      "responsibilities": "Implemented data governance frameworks and ensured data quality across the backend services of an e-commerce platform, highlighting a strong focus on **data catalog** and **data privacy** to enhance customer trust and compliance.\nCollaborated with cross-functional teams to optimize processes and improve customer experience through effective communication and collaboration, aiming for a customer-focused approach in project management.\nConducted **cost-benefit analysis** and **ROI analysis** for backend service enhancements, providing insights into performance improvements and their impact on overall business value.\nDesigned and implemented **PaaS** solutions to improve scalability, performance, and integration capabilities with cloud-based **data lakes** and databases like PostgreSQL and MySQL, ensuring robust data management practices.\nLeveraged **integration platforms** to facilitate seamless data flow between systems and improve collaboration across departments, enhancing project delivery timelines by **30%**.\nManaged projects effectively, adhering to **enterprise architecture** principles and aligning technology solutions with business strategy.\nOptimized backend services using **Python** frameworks such as FastAPI and Django, achieving **40%** faster query performance compared to previous systems.\nAutomated CI/CD processes with **Jenkins**, ensuring consistent and efficient deployment of features with a reduction in manual efforts by **50%**.\nUtilized **Docker** for containerization, streamlining deployment across multiple environments and ensuring high availability of services.\nEnhanced data quality monitoring through Python services, incorporating tools for robust data governance and privacy measures, resulting in a reduction of data discrepancies by **20%**.\nDeveloped and maintained dynamic APIs, enabling effective integrations that improved user experience and facilitated efficient data management across the e-commerce platform.\nPartnered with stakeholders to establish best practices for data privacy, ensuring compliance with regulations while supporting organizational data governance efforts."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython (FastAPI, Django, Flask)\n\n**Backend Frameworks:**\n\tSpring Boot\n\n**Frontend Frameworks:**\n\tAngular (1–16), React (15–18), Next.js, Vue.js (2/3), Blazor\n\n**API Technologies:**\n\tREST & gRPC APIs\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD\n\n**Cloud & Infrastructure:**\n\tPaaS providers\n\n**Other:**\n\tdata governance, data catalog, data quality, data privacy, Sales or Customer Engineering, value-based selling, cost-benefit analysis, ROI analysis, process management, project management, Data Management, enterprise architecture, Data Lakes, Integration platforms, communication, customer-focused, collaboration"
}