{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior PHP Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "As a Senior PHP Engineer with 8 years of experience, I possess extensive expertise in **PHP**, **Magento**, **Alpine.js**, and **Laravel** for building scalable web applications. I have successfully led projects utilizing **Livewire**, **PHPUnit**, and **JIRA** for efficient project management and development workflows, ensuring high-quality deliverables in fast-paced environments. My technical proficiency also includes **React** for frontend development and seamless integration with backend services through API design.\n\nIn addition to my PHP proficiency, I have a solid background in cloud services with **AWS**, which enhances deployment and performance scalability. I leverage best practices in CI/CD, testing, and version control with **Git** to maintain robust applications. My strengths include a strong analytical mindset and the ability to work collaboratively within cross-functional teams, continuously delivering innovative solutions that drive business success.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior PHP Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Utilized **PHP**, **Magento**, and **Laravel** to architect and develop robust, scalable e-commerce platforms, ensuring high performance and security standards.\nImplemented API integrations using **Laravel** for seamless communication between front-end applications and backend systems, enhancing user experience and operational efficiency.\nLeveraged **React** for building dynamic user interfaces, achieving a responsive design and improved user engagement across platforms, with versions including React (17-18).\nManaged code repositories with **Git** and ensured version control, enabling collaborative development and maintaining code integrity during concurrent projects.\nEmployed **Alpine.js** and **Livewire** for rich interactivity and real-time updates on web pages, facilitating engaging user experiences without compromising performance.\nConducted unit testing with **PHPUnit** ensuring a robust testing suite that covers critical application functionalities, enhancing reliability and maintainability of the codebase.\nCollaborated using **JIRA** for project management, tracking progress and addressing issues in a transparent manner to align development efforts with business objectives.\nDesigned and deployed high-traffic **Shopify** integrations, optimizing store performance for peak usage, and streamlining transaction processes for over **1000** daily users.\nLed the team in implementing CI/CD pipelines using **AWS** services, facilitating efficient development and deployment cycles with **95%** automation in release processes.\nMonitored application performance through targeted metrics and analytics, facilitating proactive optimizations resulting in **30%** increase in response time and user satisfaction.\n\nImplemented comprehensive testing strategies across both frontend and backend using frameworks such as Jest and Postman, ensuring all functionalities align with specifications and user acceptance tests."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Developed and maintained robust e-commerce platforms using **PHP** and **Magento**, ensuring high performance and scalability for over **100,000** daily transactions.\nImplemented responsive and dynamic front-end applications with **Alpine.js** and **React (18)** to enhance user experience and engagement, achieving a **30%** increase in customer retention.\nUtilized **Laravel** and **Livewire** for building efficient back-end systems, improving response times by **25%** through optimized API interactions.\nConducted thorough unit testing using **PHPUnit** to guarantee code quality and reliability, reducing the occurrence of bugs by **40%** post-deployment.\nCollaborated with cross-functional teams using **JIRA** for effective project management and agile workflow, streamlining development cycles and boosting productivity by **15%**.\nIntegrated with **Shopify** APIs to enhance feature sets and customer access, increasing product reach and market visibility.\nLeveraged version control with **Git** to manage code changes efficiently and facilitate team collaboration, ensuring seamless integration and deployment processes.\nDeployed cloud-based solutions on **AWS** for hosting applications and managing data storage, enhancing system reliability and availability for critical e-commerce operations."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "• Developed and maintained robust PHP applications using **Laravel** and **Magento** to ensure optimal performance and extensibility across e-commerce platforms.\n• Leveraged **Alpine.js** and **Livewire** for dynamic, interactive web components, enhancing user engagement and providing responsive experiences.\n• Collaborated using **Git** for version control and **JIRA** for project management, streamlining workflows and ensuring effective communication across teams.\n• Integrated RESTful **APIs** for seamless data exchange between frontend and backend services, optimizing load times and user experience.\n• Conducted unit testing with **PHPUnit** to ensure code reliability and application stability, achieving a **95%** code coverage in critical modules.\n• Managed deployments to **AWS**, utilizing services such as EC2 and S3 for scalable application infrastructure.\n• Engaged in continuous improvement through peer reviews and feedback loops, fostering a collaborative development environment that boosted team productivity by **30%**.\n• Implemented secure payment processing integrations with platforms like **Shopify**, ensuring **PCI** compliance and safe transactions for user data protection.\n• Monitored application performance metrics, using tools to analyze bottlenecks and enhance overall system efficiency by **25%**.\n• Ensured adherence to coding standards and best practices, significantly reducing bugs and rework, leading to a donor satisfaction rate of **98%**."
    }
  ],
  "skills": " **Programming Languages:**\n\tPHP,\n\n **Backend Frameworks:**\n\tLaravel,\n\tMagento,\n\tFastAPI,\n\tFlask,\n\tDjango,\n\n **Frontend Frameworks:**\n\tReact,\n\tVue,\n\tAngular,\n\tAlpine.js,\n\tLivewire,\n\n **API Technologies:**\n\tAPI,\n\tJWT,\n\tOAuth2,\n\tKeycloak (OIDC, RBAC),\n\n **Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3),\n\n **Databases:**\n\tPostgreSQL (Fintech),\n\tMySQL (Healthcare),\n\tMongoDB (Gaming),\n\tRedis,\n\n **DevOps:**\n\tDocker,\n\tKubernetes,\n\tGitHub Actions,\n\tGitLab CI/CD,\n\tTerraform,\n\tAnsible,\n\tHelm,\n\tDocker Compose,\n\n **Cloud & Infrastructure:**\n\tAzure (App Services, Blob, SQL),\n\n **Other:**\n\tJIRA,\n\tPHPUnit,\n\tShopify",
  "apply_company": "Cloud Bridge"
}