{
  "name": "Tomasz Lee",
  "role_name": "Frontend Tech Lead",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-477994390/",
  "profile_summary": "Results-driven Frontend Tech Lead with 9+ years of experience in building and optimizing high-performance applications. Proficient in **React**, **TypeScript**, **Next.js**, with a strong focus on SEO optimizations and PageSpeed enhancements. Skilled in using **Crowdin** for localization (i18n) and integrating **third-party tools** seamlessly. Experienced in leveraging **NX** and **Turborepo** for efficient project management and development workflows. Backed by solid expertise in design and implementation using **Figma** and effective communication in English. Proven track record of leading teams to deliver robust, scalable, and user-centric solutions.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Frontend Tech Lead",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Apr 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Led the frontend development of a web-based customer management platform utilizing **React** and **Next.js**, achieving a **25%** increase in user satisfaction.\nEnhanced application performance through **SEO optimizations** and **PageSpeed** improvements, resulting in a measurable boost in loading times.\nImplemented internationalization (i18n) solutions with **Crowdin**, supporting multilingual capabilities.\nUtilized **TypeScript** to improve code quality and maintainability across the project.\nLeveraged **NX** and **Turborepo** for efficient management of monorepo architecture, streamlining the build process.\nIntegrated third-party API services to extend platform capabilities, fostering robust functionality and user engagement.\nCollaborated closely with UX/UI designers using **Figma** to create intuitive interfaces, enhancing overall user experience.\nCommunicated effectively in English to coordinate project goals and deliverables among cross-functional teams.\nConducted code reviews and mentored junior developers, fostering a culture of excellence within the development team."
    },
    {
      "role": "Full Stack Developer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "• Led the development of user interfaces using **React**, **TypeScript**, and **Next.js**, resulting in a 25% improvement in user engagement on the platform.\n• Integrated internationalization (i18n) solutions using **Crowdin** to enhance multi-language support, improving accessibility for global users.\n• Implemented build tools and project management strategies with **NX** and **Turborepo**, leading to reduced build times by **20%**.\n• Collaborated with design teams using **Figma** to create responsive and intuitive interfaces, ensuring a cohesive user experience across devices.\n• Optimized web applications for SEO with a focus on **PageSpeed**, achieving a performance score increase to **90%+**.\n• Managed third-party integrations to enhance functionality, leading to a streamlined workflow and reduced time to deployment by **15%**.\n• Maintained strong English communication skills to effectively collaborate with cross-functional teams and stakeholders, ensuring project requirements were met.\n• Conducted mentorship and code review sessions, fostering growth among junior developers and enhancing overall team productivity.\n• Developed and maintained high-quality codebases, following industry best practices to ensure scalability and performance."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "Led the development of user-friendly interfaces using **React**, **TypeScript**, and **Next.js**, enhancing user engagement by 30%.\nImplemented **i18n** strategies to localize applications, resulting in a 25% increase in global accessibility. \nManaged third-party integrations seamlessly, ensuring smooth data exchange between systems. \nUtilized **Crowdin** for effective translation management, improving localization workflow efficiency by 40%.\nStreamlined project management and collaboration by using **NX** and **Turborepo** for monorepo setup, reducing build times by 50%.\nDesigned and executed **SEO optimizations** on multiple web pages, increasing organic traffic by **15%** due to better visibility.\nEnhanced page performance by applying **PageSpeed** techniques, achieving a load time reduction of 35%.\nUtilized **Figma** for creating high-fidelity prototypes, aligning design and development with project goals.\nEnsured effective English communication across teams through regular updates and presentations, fostering collaboration.\nParticipated in daily standups and code reviews to ensure adherence to best practices and project timelines."
    }
  ],
  "skills": "Frontend Frameworks:\n\tReact, TypeScript, Next.js, HTML, CSS, JavaScript, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\nBackend Frameworks:\n\tNodeJS, ExpressJS, NestJS, C#, .NET, Entity Framework, Microservices\n\nAPI Technologies:\n\tRESTful API, GraphQL, third-party integrations\n\nDatabases:\n\tMSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB\n\nCloud & Infrastructure:\n\tAWS, Azure, CI/CD pipelines\n\nDevOps:\n\tNUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest\n\nOther:\n\ti18n, Crowdin, NX, Turborepo, SEO optimizations, PageSpeed, Figma, English communication, Git, GitHub, Blockchain, Solidity, Ether.js, Web3.js, Ethereum, UX/UI Design"
}