{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Software Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-karol-kotlinski-bb2520397/",
  "profile_summary": "Accomplished Senior Software Engineer with 8 years of experience in **cloud-native development**, specializing in **C#** and the **.NET framework**. Proficient in designing and implementing **microservices** architecture and **RESTful APIs**, utilizing strong **object-oriented programming (OOP)** techniques. Adept at managing **NoSQL databases** and **SQL Server**, with practical experience in **asynchronous programming** and **multithreading**. Skilled in using **Git**, **CI/CD tools**, and **automated testing frameworks** to maintain software quality and accelerate development cycles.\n\nFluent in modern web technologies, including **JavaScript**, **React**, **Angular**, and **HTML/CSS**, I excel in delivering user-centric applications. Expertise in monitoring and performance visualization with tools like **Datadog** and **Grafana**, combined with a solid understanding of **Identity and Access Management (IAM)**, **OAuth**, **JWT**, and other security protocols.\n\nMy robust background in agile development, along with strong **problem-solving**, **communication**, and **collaboration** skills, ensure the successful delivery of high-performance solutions in fast-paced environments. Additionally, I have experience with **Docker**, **Kubernetes**, and cloud platforms such as **Azure**, **AWS**, and **GCP**, enabling me to contribute effectively to innovative projects.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Software Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Developed and maintained scalable microservices-based architectures utilizing **C#**, **.NET framework**, and **Docker**, enhancing system performance and reliability.\nLeveraged cloud-native development practices on **Azure**, **AWS**, and **GCP** to build efficient and resilient applications in line with business requirements.\nImplemented RESTful APIs for seamless integration and data exchange, adhering to best practices in **API design** and **object-oriented programming (OOP)** principles.\nUtilized **NoSQL databases** like **MongoDB** and SQL platforms like **SQL Server** and **MySQL** for optimized data storage and retrieval strategies, ensuring rapid access to large datasets.\nDesigned and executed automated testing strategies using frameworks such as **Jest**, **Cypress**, and **PyTest**, maximizing code quality and reducing deployment failures.\nCreated CI/CD pipelines with **GitHub Actions** and **Azure DevOps**, enforcing processes for continuous integration and delivery that accelerated development cycles by **30%**.\nEmployed asynchronous programming, **multithreading**, and **parallelism** to enhance system responsiveness and user experience, accommodating **up to 1000** concurrent users.\nCollaborated with cross-functional teams to deliver advanced **identity and access management (IAM)** solutions utilizing **OAuth**, **JWT**, and **SAML** for secure authentication and authorization.\nIntegrated monitoring and logging solutions using **Datadog**, **Grafana**, and **OpenTelemetry** to track application performance, facilitating proactive maintenance and troubleshooting.\nParticipated in agile development processes, ensuring effective communication and collaboration within teams to meet project deadlines and objectives.\nCoordinated code review sessions to promote best practices in software development, resulting in a **20%** reduction in bugs post-deployment.\nActively contributed to the improvement of existing applications by performing routine refactoring, enhancing code maintainability and scalability."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Implemented cloud-native development practices, adopting **microservices** architecture with **C#** and the **.NET framework** to enhance system scalability and maintainability in high-traffic financial platforms.\nUtilized **RESTful APIs** to streamline data exchanges between components, ensuring efficient communication within distributed systems while maintaining high performance.\nDeveloped and maintained robust back-end systems using **NoSQL databases** and **SQL Server**, optimizing data storage and retrieval to support **high-volume transactions** and real-time analytics.\nEnhanced asynchronous programming capabilities with **multithreading** and **parallelism** techniques, resulting in a 30% increase in system throughput and responsiveness.\nPioneered automated testing frameworks, ensuring 95% code coverage through CI/CD practices using **Git**, and monitoring performance with tools such as **Datadog** and **Grafana**.\nDesigned and implemented Identity and Access Management (IAM) solutions utilizing **OAuth**, **JWT**, and **OIDC** for secure authentication and authorization across applications, adhering to compliance standards.\nCreated dynamic, user-friendly front-end applications using **React** (18) and **Angular**, enhancing user engagement by providing an intuitive interface for financial dashboards.\nParticipated actively in agile development processes, collaborating with cross-functional teams to resolve complex problems while ensuring attention to detail in all aspects of development.\nContributed to DevOps practices using **Docker**, **Kubernetes**, and **Azure** for container orchestration, achieving continuous deployment and scaling capabilities.\n"
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Designed and optimized cloud-native microservices for a global e-commerce platform using **C#** and the **.NET Framework**, ensuring high availability and scalability across key modules like checkout, cart, and order fulfillment.\nEngineered asynchronous programming solutions and multithreaded services for real-time features, applying **RESTful APIs** for responsive order updates and dynamic inventory tracking.\nDeveloped frontend applications using **React** and **Angular**, focusing on delivering fast, responsive user experiences with a strong grasp of **JavaScript**, **HTML**, and **CSS**.\nEmployed **NoSQL databases** like MongoDB alongside **SQL Server** and **MySQL**, ensuring scalable, fault-tolerant data storage and optimized data access for high-traffic e-commerce workflows.\nImplemented A/B testing and automated testing frameworks to ensure quality in application delivery, boosting conversion rates and performance metrics by **25%**.\nUtilized **Docker** and **Kubernetes** for orchestrating services, enabling efficient CI/CD practices with a focus on rapid deployment cycles and infrastructure consistency through **Git**.\nIntegrated Identity and Access Management (IAM) protocols using **OAuth**, **JWT**, and **SAML** to manage secure customer and admin access, ensuring compliance with GDPR and protection of user data.\nConducted extensive logging and monitoring via **Datadog** and **Grafana**, enabling proactive identification of application bottlenecks and uptime improvements by **30%**.\nApplied role-based access control (RBAC) to enhance security protocols while enabling controlled rollouts and infrastructure observability using **OpenTelemetry**.\nCollaborated with cross-functional teams in an **agile development** environment, focusing on problem-solving and meticulous attention to detail to deliver high-quality software solutions."
    }
  ],
  "skills": "Programming Languages:\n\tC#, Python, JavaScript, TypeScript\n\n**Backend Frameworks:**\n\t.NET framework, FastAPI, Flask, Django, Entity Framework\n\n**Frontend Frameworks:**\n\tAngular, React, Vue, HTML, CSS\n\n**API Technologies:**\n\tRESTful APIs, API design, OAuth, JWT, OIDC, SAML, SCIM\n\n**Serverless and Cloud Functions:**\n\tAWS (Lambda, ECS), Azure (App Services), GCP\n\n**Databases:**\n\tPostgreSQL, MySQL, SQL Server, MongoDB, Redis, NoSQL databases\n\n**DevOps:**\n\tDocker, Kubernetes, Git, GitHub Actions, GitLab CI/CD, CI/CD tools, automated testing frameworks, Docker Compose, AKS, EKS\n\n**Cloud & Infrastructure:**\n\tAWS, Azure, GCP, Terraform, Ansible, Helm, Datadog, Grafana, OpenTelemetry\n\n**Other:**\n\tcloud-native development, microservices, object-oriented programming (OOP), asynchronous programming, multithreading, parallelism, agile development, problem-solving, communication, collaboration, attention to detail"
}