{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Golang Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Senior Golang Engineer with 13+ years of experience in developing high-performance applications, specializing in **Golang**, **Kubernetes**, and **Microservices**. Proven expertise in building **API** integrations and designing **Distributed Systems** that enhance operational efficiency. Proficient in implementing **Event-Driven Architecture** and ensuring high code quality through rigorous **Testing**, **Code Review**, and **Version Control** practices. Adept at fostering a collaborative environment with a **Startup Mindset**, driving innovation and agile methodologies.\n\nAdditionally skilled in **JavaScript/TypeScript**, **Python**, and **Flutter**, with hands-on experience in both frontend and backend development using **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**. Experienced in delivering AI/ML-powered platforms that support predictive analytics and automation. Strong background in deploying cloud-native systems on **AWS** and **Azure**, and adept at implementing **Continuous Integration** and **Open Source** solutions. Well-versed in compliance-driven development, aligning solutions with industry standards such as HIPAA and PCI DSS.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Golang Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Developed and maintained microservices architecture leveraging **Golang** to enhance system performance and scalability in healthcare and fintech applications.\nImplemented and optimized **API** services for distributed systems, ensuring efficient communication between microservices and external integrations in compliance with industry standards.\nLed the migration of legacy systems to **Kubernetes**, ensuring seamless deployment and management of containerized applications, improving system reliability and fault tolerance.\nConducted thorough **code reviews** and enforced robust testing strategies across the technology stack, utilizing tools such as Jest and PyTest to maintain high-quality code and coverage of at least **90%**.\nEstablished and managed **Continuous Integration** pipelines, integrating tools like GitHub Actions and CircleCI to streamline development processes and enhance collaboration within the team.\nPioneered the adoption of **Event-Driven Architecture**, enhancing responsiveness and scalability of applications to handle increasing client demands effectively.\nFostered a **startup mindset** within the team, encouraging innovative approaches to problem-solving and the integration of open-source solutions for rapid development.\nEmphasized collaboration across cross-functional teams to drive successful project outcomes, enhancing communication and project visibility.\nExplored and integrated modern frameworks and technologies to revolutionize legacy applications, focusing on performance improvements and advanced feature implementations.\nUtilized **Version Control** systems to manage and track changes across projects, ensuring a seamless workflow and code integrity within the team."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Designed and implemented **microservices** architecture utilizing **Golang** to enhance the scalability and performance of financial platforms for high-volume transactional systems.\nDeveloped and maintained RESTful **APIs** for core functionalities, ensuring seamless integration with front-end applications and third-party services.\nCollaborated within cross-functional teams, fostering a **startup mindset**, to drive projects from inception to delivery while maintaining high standards in **code review** and **testing** processes.\nLed the deployment of **Kubernetes** for container orchestration, improving deployment frequency by **30%**, thus enhancing system reliability and scalability.\nEngineered a powerful **event-driven architecture** utilizing Kafka and RabbitMQ, ensuring efficient asynchronous communication to support critical workflows in payment processes and compliance.\nEmployed **Continuous Integration** practices and tools to automate build and deployment pipelines, reducing the release time by **25%**.\nActively contributed to **open source** projects, demonstrating a commitment to community collaboration and knowledge sharing.\nImplemented best practices for **version control** and documentation, ensuring smooth onboarding for new team members and enhanced project maintainability.\n"
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Designed and optimized microservices architecture using **Golang** for a global e-commerce platform, ensuring high availability and scalability with **Kubernetes** orchestration.\nDeveloped and integrated APIs to facilitate communication between distributed systems, enhancing system interactions and data handling across various modules.\nEngineered event-driven architecture powered by Kafka and RabbitMQ, enabling responsive order updates and real-time event broadcasting.\nImplemented rigorous testing practices and participated in code reviews to maintain high code quality and reliability across **Golang** applications.\nLeveraged version control tools for continuous integration and deployment processes, facilitating seamless updates and collaboration within the development team.\nEmployed **Open Source** technologies for enhancing productivity, while applying a startup mindset to innovate and improve existing systems rapidly.\nCollaborated cross-functionally with product and design teams to ensure alignment on project goals and deliverables, improving the overall team performance and project outcomes.\n"
    }
  ],
  "skills": "**Programming Languages:**\n\tGolang\n\tPython\n\tJavaScript/TypeScript\n\n**Backend Frameworks:**\n\tFastAPI\n\tFlask\n\tDjango\n\n**Frontend Frameworks:**\n\tReact\n\tVue\n\tAngular\n\n**API Technologies:**\n\tAPI\n\n**Serverless and Cloud Functions:**\n\tAWS: Lambda\n\tAzure: App Services\n\n**Databases:**\n\tPostgreSQL\n\tMySQL\n\tMongoDB\n\tRedis\n\n**DevOps:**\n\tDocker\n\tKubernetes\n\tGitHub Actions\n\tGitLab CI/CD\n\tTerraform\n\tAnsible\n\tHelm\n\tDocker Compose\n\n**Cloud & Infrastructure:**\n\tAWS: ECS, RDS, S3\n\tAzure: Blob Storage, SQL Database\n\n**Other:**\n\tArtificial Intelligence & Machine Learning\n\tMLflow\n\tAirflow\n\tKubeflow\n\tDistributed Systems\n\tModel Context Protocol\n\tMicroservices\n\tEvent-Driven Architecture\n\tTesting\n\tCode Review\n\tVersion Control\n\tContinuous Integration\n\tOpen Source\n\tStartup Mindset\n\tCollaboration",
  "apply_company": "Stacklok"
}