{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Angular Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "Results-driven Senior Angular Engineer with 8 years of full stack development experience focusing on **JavaScript**, **TypeScript**, and **Angular** technologies. Proficient in Agile methodologies, I have a proven track record of building high-performance solutions within the healthcare and financial sectors. My technical expertise encompasses frameworks such as **React**, **Next.js**, and **Vue**, alongside backend technologies like **Node.js**, **FastAPI**, and **Django**, ensuring robust application development.\nMy experience with cloud services such as **Azure** and **AWS** enhances my ability to deliver scalable enterprise-grade applications. I possess strong foundations in developing and implementing **Clean Code** practices and leveraging testing frameworks to ensure quality deliverables in line with business requirements. Fluent in English, I excel in collaborative environments, driving projects with a focus on continuous improvement and software compliance standards.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Angular Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Developed high-quality, maintainable web applications using **Angular** and **TypeScript**, ensuring adherence to **Agile** methodologies, clean code principles, and robust testing strategies.\n- Collaborated in cross-functional teams to establish project plans and timelines, effectively managing to meet deadlines and deliverables within a **6-month** project cycle.\n- Implemented **unit**, **integration**, and **end-to-end** testing using frameworks such as Jest and Cypress, achieving a **95%** code coverage metric that improved software reliability.\n- Spearheaded the migration of legacy systems to **Angular** architecture, enhancing performance speed by **30%** and reducing technical debt significantly.\n- Authored comprehensive documentation and tutorials in **English** for best practices and onboarding processes, facilitating smoother transitions for new team members.\n- Utilized **JavaScript** frameworks and libraries, alongside **Angular** features, to optimize front-end processes and enhance user experience across platforms.\n- Participated in code reviews to ensure the application of clean coding standards and pragmatic approach, contributing to the overall quality of development efforts.\n- Engaged in continuous learning and implementation of best practices in **Agile** development environments to keep the team well-versed in cutting-edge technologies and trends.\n- Actively participated in sprint planning sessions and retrospectives, pushing for improvements in team delivery and efficiency over **4 quarters**.\n- Mentored junior developers on effective usage of **Angular**, alongside fostering a culture of quality and collaboration within the team."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Utilized **Angular**, **TypeScript**, and **JavaScript** to develop and enhance dynamic, user-centric front-end applications, improving user experience and functionality for financial solutions.\nAdopted Agile methodologies to streamline development processes, enhancing collaboration and efficiency across cross-functional teams.\nConducted thorough testing and verification of applications to ensure high code quality and compliance with **Clean Code** principles, which improved system stability by **30%**.\nParticipated in code reviews and implemented best practices, leading to a reduction in bugs and improving product release cycles by **25%**.\nCollaborated with UX/UI designers to create visually appealing interfaces that meet client requirements and provide an intuitive user experience.\nEngaged in continuous learning and adaptation of latest frameworks and tools including **Magnolia** to keep the applications up to date with market trends and user expectations.\nProduced technical documentation and conducted training sessions for team members to enhance their skills in **Angular** and modern web development technologies, contributing to team growth and expertise."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "- Developed robust and interactive frontend applications utilizing **Angular** (version 12) and **TypeScript**, ensuring high performance and responsiveness aligned with modern web standards.\n- Collaborated effectively in an **Agile** environment to iterate on development tasks, enhancing product quality through continuous feedback and regular testing.\n- Emphasized **Clean Code** principles while implementing features, resulting in a more maintainable codebase and an increased team efficiency of up to **30%**.\n- Integrated JavaScript libraries and frameworks to complement **Angular** applications, enhancing user experience through dynamic content updates.\n- Conducted thorough **testing** using frameworks such as Jasmine and Karma to ensure all components function as intended, achieving a reduction in bugs by **25%** prior to deployment.\n- Demonstrated strong communication skills in **English** by articulating complex technical concepts to cross-functional teams, fostering a collaborative development atmosphere.\n- Utilized additional tools such as **Magnolia** for content management, effectively managing digital assets and improving deployment speed by **40%**.\n- Participated in code reviews, providing constructive feedback to peers, ultimately contributing to qualitative enhancements in our coding practices and team cohesion."
    }
  ],
  "skills": "**Frontend Frameworks**:\n\tAngular, JavaScript, TypeScript\n\n**Backend Frameworks**:\n\tPython(FastAPI, Flask, Django)\n\n**API Technologies**:\n\t\n\n**Databases**:\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**DevOps**:\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD\n\n**Cloud & Infrastructure**:\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL), Terraform, Ansible, Helm, Docker Compose\n\n**Other**:\n\tMLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, Agile, Testing, Clean Code, English",
  "apply_company": "INNOCV Solutions"
}