{
  "name": "Tomasz Lee",
  "role_name": "Senior Software Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Results-driven Senior Software Engineer with 9+ years of expertise in developing and implementing applications with a strong focus on **C/C++**, **Linux**, **AWS**, **Azure**, **GCP**, and **Python**. Proficient in building **microservices** architecture and adept at using cutting-edge technologies such as **DPDK**, **Terraform**, and **CI/CD** practices to ensure high-quality delivery and performance optimization. Demonstrated experience in **network segmentation**, **virtualization**, and delivering solutions with a focus on **Quality of Service**. Exceptional teamwork and communication skills with proven success in leading projects and collaborating across multifunctional teams to achieve strategic objectives.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Senior Software Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Utilized **AWS**, **Azure**, and **GCP** for cloud deployment and infrastructure management to ensure system reliability and scalability.\nImplemented **CI/CD** pipelines and automated processes to enhance development workflow and reduce deployment time by **40%**.\nDesigned and developed microservices using **Python** and **Golang** to modularize applications for improved maintainability and scalability.\nEmployed **Linux** and **DPDK** to optimize network performance and handle high-throughput applications.\nEngineered software solutions that improved **Quality of Service** through effective **network segmentation** and **IPSec** security protocols.\nDeveloped embedded systems that streamline various processes, ensuring high performance and reliability.\nLeveraged **Terraform** for infrastructure as code, facilitating environment replication and management.\nFostered teamwork and communication within a multidisciplinary team to achieve project objectives efficiently.\nOptimized existing software applications using **C/C++** for enhanced performance, contributing to a **20%** reduction in execution time across modules.\nImplemented software forwarding and **DPI** solutions for improved control over network data flows."
    },
    {
      "role": "Software Engineer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "• Developed and implemented **CI/CD** pipelines to enhance deployment efficiency, utilizing **AWS** and **Azure**, resulting in a **30%** reduction in production deployment errors.\n• Designed robust microservices architectures, improving system scalability for project management tools, demonstrating expertise in **microservices**.\n• Leveraged **Linux** environments for application deployment, leading to improved system performance and reliability.\n• Optimized data storage and access through **PostgreSQL**, ensuring real-time data retrieval with minimal latency.\n• Created interactive visualizations with **D3.js**, improving project status tracking efficiency, enhancing teamwork and communication among stakeholders.\n• Integrated **Redis** as a caching solution, leading to a **25%** increase in system performance and reduced API call latency.\n• Coached junior developers through code reviews and mentorship, fostering a culture of teamwork and enhancing overall team productivity.\n• Developed RESTful API interfaces using **.NET Core**, ensuring integration with various cloud services, ultimately improving overall software quality.\n• Conducted system performance testing and optimization using **Golang**, ensuring Quality of Service and reliability for embedded systems.\n• Managed and optimized **MSSQL** and **MySQL** databases, enhancing data retrieval efficiency by refining query strategies for better performance."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "Utilized **Python** and **Golang** for developing and maintaining microservices architecture, enhancing overall system performance by **30%**.\nImplemented CI/CD strategies with **Terraform** for automated infrastructure management, resulting in a **25%** reduction in deployment times.\nDesigned and optimized applications on **AWS** and **Azure**, ensuring high availability and disaster recovery, achieving **99.9%** uptime.\nDeveloped algorithms for **Quality of Service** and **Network Segmentation** that improved network performance and security across multiple services.\nCollaborated closely with cross-functional teams to ensure seamless integration of **embedded systems**, fostering a culture of teamwork and communication.\nLeveraged **Linux** for server management and deployment, ensuring system reliability and performance tuning.\nDeveloped code in **C/C++** to enhance embedded application features, improving functionality and compatibility across platforms.\nConducted thorough performance testing and debugging of software applications to ensure quality and adherence to best practices in software development.\nDelivered technical documentation and facilitated knowledge sharing sessions, contributing to improved team efficiency and project alignment.\nEngaged in daily standups and code reviews, promoting best coding practices and collaborative problem-solving within the engineering team."
    }
  ],
  "skills": " **Programming Languages**\n\tC/C++, Python, Golang, JavaScript, TypeScript\n\n**Backend Frameworks**\n\tNodeJS, ExpressJS, NestJS, C#, .NET, Microservices\n\n**Frontend Frameworks**\n\tHTML, CSS, ReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n**API Technologies**\n\tRESTful API, GraphQL\n\n**Serverless and Cloud Functions**\n\tAWS, Azure, GCP\n\n**Databases**\n\tMSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB\n\n**DevOps**\n\tCI/CD, Terraform, Linux\n\n**Cloud & Infrastructure**\n\tNetwork Segmentation, Virtualization, AWS, Azure\n\n**Other**\n\tGit, GitHub, UI/UX Design, Quality of Service, Communication, Teamwork, Blockchain, Apache Kafka, RabbitMQ, Redis, Testing Tools: NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest, IPSec, Software Forwarding, DPI, Embedded Systems",
  "apply_company": "Arista Networks"
}