{
  "name": "Rei Taro",
  "role_name": "Software / Application Developer",
  "email": "rei515@outlook.com",
  "phone": "+48732529451",
  "address": "Warszawa, Poland",
  "linkedin": "https://www.linkedin.com/in/rei-taro-81a410391/",
  "profile_summary": "Results-driven Software/Application Developer with over 10 years of experience in backend development and a strong proficiency in **C#**, **.NET**, **SQL**, and **Microsoft Azure**. Specialized in crafting robust **RESTful APIs**, implementing **PowerShell**, and leveraging **Power Apps** and **Power Automate** for process automation and optimization. Possess a solid foundation in Agile development methodologies combined with excellent problem-solving skills, technical support, and collaboration abilities. Proven success in developing high-quality software solutions at leading organizations, using a data-driven approach to deliver impactful results.",
  "education": [
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2010",
      "to_year": "2015",
      "location": "Japan",
      "university": "Keio University"
    }
  ],
  "experience": [
    {
      "role": "Software / Application Developer",
      "company": "Leobit",
      "from_date": "Aug 2022",
      "to_date": "Present",
      "location": "Poland",
      "responsibilities": "Utilized **C#** and **.NET** frameworks to develop robust RESTful APIs, enhancing system capabilities and supporting integration with various applications.\nImplemented **Microsoft Azure** services including Azure Functions and Azure App Services to ensure efficient and scalable application deployment, with **99.9%** uptime.\nDesigned workflows in **Power Automate** to automate processes, reducing manual intervention by **80%** and improving efficiency.\nEngaged in Agile development methodologies, contributing to sprint planning and daily stand-ups to ensure timely project delivery within a **2-week** sprint cycle.\nExecuted database queries and optimizations with **SQL**, ensuring data integrity and boosting performance by **30%** in key operations.\nProvided technical support and problem-solving expertise, addressing issues promptly to minimize downtime and maintain user satisfaction ratings above **90%**.\nFacilitated effective communication and collaboration with cross-functional teams to deliver innovative solutions and meet business objectives."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Innovature",
      "from_date": "Nov 2018",
      "to_date": "Jun 2022",
      "location": "Japan",
      "responsibilities": "Developed backend systems in **C#** and **.NET** to automate document workflows, streamline user onboarding, and handle complex reporting processes.\nCreated event-driven microservices using **Power Automate** and **Azure Functions**, enabling asynchronous processing of financial data and transaction requests.\nManaged the deployment of microservices on **Microsoft Azure** with version **3.1** of the **.NET** framework, leveraging **PowerShell** for infrastructure automation to maintain consistent and scalable environments.\nEngineered data pipelines for the secure exchange of regulatory data, using **RESTful APIs** and implementing security features to automate and streamline the data flow.\nPerformed security audits, ensuring compliance with industry standards, and integrated **OAuth2** and **Azure AD B2C** to manage authentication and secure access controls.\nCollaborated with cross-functional teams to ensure smooth system integration, regulatory compliance, and successful release management, achieving a **25%** increase in deployment efficiency."
    },
    {
      "role": "Software Developer",
      "company": "Wizcorp",
      "from_date": "Apr 2015",
      "to_date": "Nov 2018",
      "location": "Japan",
      "responsibilities": "Developed applications using **C#**, **.NET** for backend services focused on trade execution and account tracking, enhancing operational efficiency by **30%**.\nEngineered RESTful APIs and integrated them with trading platforms, ensuring robust communication and data interaction, achieving a **90%** uptime.\nApplied **SQL** for database management and optimization, resulting in a **20%** improvement in query performance.\nCollaborated in an **Agile development** environment, participating in sprints and stand-ups, facilitating effective communication and problem-solving among team members.\nImplemented automation workflows using **Power Apps** and **Power Automate**, reducing manual tasks and improving overall process efficiency by **25%**.\nProvided technical support and troubleshooting, resolving issues promptly and enhancing user satisfaction ratings by **15%**.\nEnhanced cloud services integration with **Microsoft Azure**, contributing to a scalable and secure deployment infrastructure.\nIntroduced streamlined testing procedures utilizing PowerShell for automation, improving deployment frequency by **40%**."
    }
  ],
  "skills": "**Programming Languages**\n\tC#, Python (3.8+), SQL, Bash, JavaScript\n\n**Backend Frameworks**\n\t.NET, FastAPI, Flask, Django, Celery\n\n**Frontend Frameworks**\n\t\n\n**API Technologies**\n\tRESTful APIs, REST/gRPC APIs, Microservices\n\n**Serverless and Cloud Functions**\n\tAWS (EC2, S3, Lambda), Azure\n\n**Databases**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps**\n\tDocker, Kubernetes, GitHub Actions, Azure DevOps, CI/CD\n\n**Cloud & Infrastructure**\n\tMicrosoft Azure\n\n**Other**\n\tPowerShell, Power Apps, Power Automate, Agile development, Technical support, Problem-solving, Communication, Collaboration, AI/ML Tools: Pandas, NumPy, scikit-learn, TensorFlow, Airflow, MLflow, PyTest, Git"
}