{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Unity Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "As a dedicated Senior Unity Engineer with a proven background in optimizing mobile performance, I bring expertise in **C#**, **ECS**, **DOTS**, and multithreaded programming. I have successfully implemented advanced **profiling tools**, **CPU/GPU profiling**, and memory management strategies to ensure high-performance applications. My skill set includes optimizing rendering pipelines and utilizing the **Burst Compiler** and **Job System** to enhance application efficiency. I excel in managing asset streaming, developing modular architectures, and establishing effective telemetry systems and diagnostic frameworks. \n\nWith 8 years of experience as a Full Stack Developer in the healthcare and financial sectors, I've led the development of enterprise-grade platforms using modern technologies such as **JavaScript**, **TypeScript**, **Python**, **Flutter**, **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**. My deep understanding of cloud environments, specifically **Azure** and **AWS**, and my knowledge of compliance standards, allow me to build robust solutions that align with HIPAA, FHIR, PCI DSS, and SOC 2. I also bring hands-on experience in AI/ML capabilities, developing machine learning pipelines, and implementing MLOps workflows with tools like **MLflow**, **Airflow**, and **Kubeflow**.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Unity Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Developed and maintained high-performance games and applications using **Unity** and **C#**, optimizing mobile performance through best practices in **asset streaming** and **memory management**.\nEngineered multithreaded programming solutions to ensure efficient task execution, utilizing **DOTS** and the **Job System** to enhance application responsiveness and runtime performance.\nImplemented GPU and CPU profiling practices to identify performance bottlenecks, applying various **profiling tools** for continuous optimization, resulting in a **30%** increase in frame rates across multiple platforms.\nDesigned and executed rendering pipelines to enhance visual fidelity, leveraging the **Burst Compiler** to maximize performance during intensive computational tasks, contributing to a significant reduction in load times by **25%**.\nManaged mobile-specific CI/CD processes to streamline the development lifecycle, integrating telemetry systems for real-time performance tracking and diagnostics, improving iteration speed and product quality.\nPioneered modularity approaches within codebases, promoting efficient communication between various components and ensuring maintainability of complex systems, leading to a **20%** decrease in bug reports post-deployment.\nConducted thorough memory management strategies to minimize footprint and maximize performance in mobile environments, achieving a **15%** enhancement in user retention through optimized gameplay experiences.\nCollaborated closely with cross-functional teams to establish diagnostic frameworks facilitating quicker resolution of issues and implementing feedback loops that improved overall product stability.\nActively participated in knowledge sharing sessions on mobile performance optimization techniques, fostering a culture of continuous improvement and professional growth within the engineering team."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "• Designed and implemented efficient **multithreaded programming** solutions within the **Unity** engine to optimize mobile performance, enhancing user experience and system responsiveness by up to **30%**.\n• Leveraged **C#** to develop modular and scalable **ECS (Entity Component System)** architecture, improving project maintainability and facilitating team collaboration across **3 major releases** per year.\n• Conducted thorough **CPU profiling** and **GPU profiling** using advanced **profiling tools**, achieving an overall performance improvement of **25%** in processing times for graphics-intensive mobile applications.\n• Optimized **memory management** processes within the game engine, reducing memory usage by approximately **40%**, resulting in fewer crashes and smoother gameplay.\n• Implemented **asset streaming** techniques to dynamically load and unload game assets, reducing initial loading times by **50%** and delivering a more engaging user experience.\n• Developed and managed **rendering pipelines** tailored for mobile platforms, enhancing visual fidelity while maintaining performance under constraints.\n• Utilized **Burst Compiler** and job systems to optimize compute-heavy tasks, leading to significant increases in frame rates and responsiveness during gameplay.\n• Designed and maintained effective telemetry systems and diagnostic frameworks to track application performance metrics, enabling faster identification and resolution of issues.\n• Collaborated effectively with cross-functional teams, enhancing communication strategies that led to improved project alignment and delivery timelines."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Leveraged **Unity** for developing high-performance mobile applications, focusing on mobile performance optimization to achieve smooth frame rates and responsive user interactions.\nUtilized **C#** in multithreaded programming, enhancing application performance through efficient CPU and GPU profiling techniques, ensuring optimal resource utilization during gameplay.\nImplemented advanced memory management strategies and asset streaming to minimize load times and memory overhead, resulting in a **30%** improvement in overall application performance.\nDesigned and integrated effective rendering pipelines within the **DOTS** architecture, utilizing **ECS** for improved modularity and performance optimization across various game features.\nDeveloped applications that utilized the **Burst Compiler** to enhance execution speed, achieving substantial frame rate improvements and ensuring a seamless gaming experience.\nEmployed the **Job System** alongside profiling tools to identify performance bottlenecks, achieving reduced latency and memory consumption by over **20%** through applied optimizations.\nCreated telemetry systems to monitor application performance and diagnose issues, leading to faster iteration cycles and enhanced user experience.\nImplemented robust diagnostic frameworks for real-time analytics, ensuring maintainability and scalability as applications evolved.\nFacilitated effective communication between game modules to streamline development processes and improve team collaboration.\nUtilized modularity principles in design to enhance the reusability of game components and assets, contributing to a more efficient workflow and expedited delivery timelines."
    }
  ],
  "skills": " **Programming Languages:**\n\tC#, Python, JavaScript, TypeScript\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda), Azure (App Services)\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD\n\n**Cloud & Infrastructure:**\n\tTerraform, Ansible, Helm, Docker Compose, Azure (Blob, SQL)\n\n**Other:**\n\tUnity, mobile performance optimization, multithreaded programming, CPU profiling, GPU profiling, memory management, asset streaming, rendering pipelines, Burst Compiler, Job System, profiling tools, telemetry systems, diagnostic frameworks, modularity, communication, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot",
  "apply_company": "Fortis Games"
}