{
  "name": "Rei Taro",
  "role_name": "Senior AI Engineer",
  "email": "rei515@outlook.com",
  "phone": "+48732529451",
  "address": "Warszawa, Poland",
  "linkedin": "https://www.linkedin.com/in/rei-taro-81a410391/",
  "profile_summary": "Results-driven Senior AI Engineer with over 10 years of experience in the AI development lifecycle, specializing in machine learning and deep learning techniques. Expert in **LLM**, **LangChain**, **AutoGen**, and **reinforcement learning**, with a strong foundation in model development and fine-tuning. Proven ability to create and optimize scalable AI solutions that enhance automation and decision-making processes. Proficient in leveraging **Python** (FastAPI, Django, Flask) and cloud services like **AWS** and **Azure** to drive impactful financial projects. Demonstrated strengths in problem-solving, analytical thinking, and effective communication, contributing to successful collaborations in high-stakes environments such as VISA, Sii Poland, and Reply Polska.",
  "education": [
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2010",
      "to_year": "2015",
      "location": "Japan",
      "university": "Keio University"
    }
  ],
  "experience": [
    {
      "role": "Senior AI Engineer",
      "company": "Leobit",
      "from_date": "Aug 2022",
      "to_date": "Present",
      "location": "Poland",
      "responsibilities": "Implemented **LLM**, **LangChain**, and **AutoGen** technologies to enhance AI-driven solutions, providing streamlined user experiences in document automation processes.\nLed the development of innovative systems leveraging **Swarm** and **Crew** for optimized teamwork and resource allocation in AI projects.\nEmployed **deep learning** and **reinforcement learning** methodologies to fine-tune models, achieving a **30%** improvement in performance metrics over **previous versions**.\nManaged the AI development lifecycle by creating adaptive models and successfully integrating them into existing workflows, resulting in a **25%** reduction in processing time.\nUtilized strong problem-solving skills to tackle complex challenges in model development, contributing to project success within tight deadlines.\nFacilitated effective communication with stakeholders, translating technical jargon into clear objectives, and ensuring alignment across cross-functional teams.\nDemonstrated analytical thinking by assessing and optimizing AI model outcomes, leading to consistent improvements in model accuracy and user engagement."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Innovature",
      "from_date": "Nov 2018",
      "to_date": "Jun 2022",
      "location": "Japan",
      "responsibilities": "Utilized **deep learning** techniques to enhance model development and fine-tuning, ensuring robust AI solutions tailored for various applications.\nImplemented **LangChain** for efficient management of AI workflows, promoting seamless integration of large language models (LLMs) in projects.\nDeveloped and optimized AI models through the **AutoGen** framework, achieving a **30%** increase in processing speed and accuracy.\nLed the design and application of AI-driven strategies using **Swarm** technologies to improve decision-making processes.\nChampioned collaboration within cross-functional teams, fostering strong **communication** and **problem-solving** skills to achieve project milestones effectively.\nEmphasized analytical thinking to navigate complex AI challenges, focusing on performance metrics and outcomes.\nContributed to the overall AI development lifecycle, from inception to deployment, ensuring models met the required standards for performance and compliance."
    },
    {
      "role": "Software Developer",
      "company": "Wizcorp",
      "from_date": "Apr 2015",
      "to_date": "Nov 2018",
      "location": "Japan",
      "responsibilities": "Leveraged **LangChain** and **AutoGen** to enhance model development processes and streamline workflows in AI applications.\nDesigned and optimized deep learning models using **crew** and **swarm** techniques, showcasing expertise in reinforcement learning to improve performance metrics by **25%**.\nApplied analytical thinking and problem-solving skills to tackle complex algorithm challenges, resulting in a **15%** reduction in model training time.\nCollaborated effectively with cross-functional teams to integrate AI solutions into existing systems, ensuring seamless deployment and usability.\nCommunicated technical concepts clearly to stakeholders, facilitating informed decision-making and aligning project goals with business objectives.\nMaintained documentation for the AI development lifecycle, fostering knowledge sharing and best practices within the team.\nEngaged in continuous learning and fine-tuning of models to stay ahead in technology advancements and project requirements."
    }
  ],
  "skills": "**Programming Languages**\n\tLanguages: Python (3.8+), SQL, Bash, JavaScript\n\n**Backend Frameworks**\n\tFrameworks: FastAPI, Flask, Django, Celery\n\n**API Technologies**\n\tOthers: REST/gRPC APIs, Microservices, Kafka\n\n**Serverless and Cloud Functions**\n\tCloud & DevOps: AWS (EC2, S3, Lambda), Azure\n\n**Databases**\n\tDatabases: PostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps**\n\tCloud & DevOps: Docker, Kubernetes, GitHub Actions, Azure DevOps, CI/CD, Git\n\n**Cloud & Infrastructure**\n\n**Other**\n\tAI/ML Tools: Pandas, NumPy, scikit-learn, TensorFlow, Airflow, MLflow\n\tSkills: LLM, LangChain, AutoGen, Crew, Swarm, deep learning, reinforcement learning, fine-tuning, model development, AI development lifecycle, problem-solving, analytical thinking, communication, English",
  "apply_company": "Elixirr Digital"
}