{
  "name": "Mariusz Jan Skobel",
  "role_name": "Senior Software Engineer",
  "email": "mariuszskobel15@outlook.com",
  "phone": "+48 735 343 548",
  "address": "Katowice, Poland",
  "linkedin": "https://www.linkedin.com/in/mariusz-skobel-789557397/",
  "profile_summary": "Senior Software Engineer with 10+ years of experience specializing in SQL, Data Models, APIs, and Data Pipelines. Extensive expertise in **Python**, **ETL**, **Airflow**, and **DBT**, ensuring efficient data processing and integration within complex systems. Proven track record of managing Relational Databases, Data Warehousing, and Columnar Storage, contributing to the development of robust and optimized data architecture. Committed to fostering Lean/Agile Methodologies to enhance team collaboration and deliver high-quality software solutions.\n\nTechnical proficiencies include **JavaScript/TypeScript**, **Flutter**, and full stack frameworks such as **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**. Experienced in building cloud-native applications on **Azure** and **AWS**, with a background in microservices architecture and event-driven systems. Adept at CI/CD automation and ensuring compliance with standards like HIPAA and PCI DSS.\n\nBrings practical experience in MLOps with tools like **MLflow**, **Airflow**, and **Kubeflow**, driving impactful data-driven decisions. Recognized for strong problem-solving skills, critical thinking, and effective communication, fostering teamwork and proactivity in diverse environments.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2012",
      "to_year": "2015",
      "location": "UK",
      "university": "University of Bristol"
    }
  ],
  "experience": [
    {
      "role": "Senior Software Engineer",
      "company": "EitBiz",
      "from_date": "Oct 2022",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Designed and maintained **data models** and **APIs** for scalable, full-stack applications, leveraging **PostgreSQL** and **MongoDB** to enhance data storage and querying efficiency across healthcare and finance sectors.\n• Developed and orchestrated **data pipelines** using **Apache Airflow** for effective ETL processes, ensuring seamless data ingestion and transformation within robust **cloud infrastructures**.\n• Implemented automated testing strategies utilizing **Jest**, **Cypress**, and **PyTest** across both front-end and backend services, improving code quality and reliability through continuous integration practices.\n• Collaborated within **Agile teams** to address complex problems using critical thinking and proactive communication, resulting in improved project timelines and team efficiency.\n• Spearheaded the transition from monolithic architectures to microservices, utilizing technologies such as **Docker** and **Kubernetes (AKS/EKS)**, promoting scalability and flexibility in software deployment.\n• Integrated advanced analytics and **data warehousing** solutions, optimizing for **performance** with **columnar storage** techniques and **in-memory databases** for healthcare data processing.\n• Cultivated strong teamwork and communication skills, leading cross-functional discussions that promoted collaboration across **data science** and engineering teams for AI model integration.\n• Delivered real-time data visualization tools, using **D3.js** and **Power BI Embedded** to present actionable insights into operational KPIs, enhancing decision-making processes for stakeholders.\n• Established comprehensive **test strategies** that supported **automated testing** across all cycles, contributing to the maintenance of high code quality and user satisfaction.\n• Engaged in active listening and sustained empathy, fostering an inclusive work environment and ensuring all team members felt valued and heard."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Tvn S.A.",
      "from_date": "Oct 2019",
      "to_date": "Sep 2022",
      "location": "Poland",
      "responsibilities": "Developed and maintained **SQL** databases and optimized **data models** to enhance performance and accessibility for financial applications, reducing query response time by **30%**.\nDesigned and implemented **APIs** for seamless data communication between frontend applications and backend services, leading to a **25%** increase in data retrieval efficiency.\nBuilt and orchestrated end-to-end **data pipelines** using **Apache Airflow** and **ETL** processes to automate data flows from multiple internal and third-party sources, ensuring accuracy and consistency in financial reporting.\nUtilized **Python** for data integration tasks, focusing on scalable solutions for **data warehousing** and **columnar storage**, which improved data processing times by **40%**.\nCollaborated with cross-functional teams to align project goals, applying **lean/agile methodologies** to facilitate open communication and effective teamwork throughout the software development lifecycle.\nEngaged in automated testing processes to improve software reliability and reduce bugs by targeting a **20%** decrease in post-release defects through rigorous testing practices.\nEmployed **relational databases** and **in-memory databases** to enhance data retrieval speeds, catering to high-demand environments without compromising performance.\nApplied **critical thinking** and **problem solving** skills to identify key areas of improvement in existing systems, leading to innovative solutions that boosted overall project success rates.\nDemonstrated **proactivity** in detecting potential issues in software deployment and provided actionable insights that contributed to **10%** faster project completions.\nFostered an inclusive team environment through **active listening**, demonstrating **empathy** by understanding team members' challenges and adapting to ensure project milestones were achieved."
    },
    {
      "role": "Software Engineer",
      "company": "Timspark",
      "from_date": "Sep 2015",
      "to_date": "Aug 2019",
      "location": "UK",
      "responsibilities": "Utilized **Python** and **SQL** to design and develop efficient data models and APIs for data pipelines, ensuring seamless integration of backend services with ETL processes and enhancing data warehousing capabilities for high-traffic e-commerce workflows.\nEngineered automated testing strategies and established CI/CD pipelines to guarantee reliability and increased deployment frequency, adhering to **Lean/Agile Methodologies** for continuous improvement and faster delivery cycles.\nCollaboratively created and maintained robust relational databases such as **PostgreSQL** and **MongoDB**, ensuring data integrity and optimized performance for databases handling up to **1 million users**.\nDeveloped and optimized data processing workflows using **Airflow** and **DBT**, facilitating efficient data transformation and governance, and reducing data processing time by **40%**.\nLed initiatives in team problem-solving sessions leveraging **Critical Thinking** and effective **Communication Skills**, resulting in successful resolutions for complex software challenges and improvements in team collaboration.\nEstablished best practices for in-memory database caching with **Redis**, significantly improving application response times by over **30%** on high-demand features like product search and inventory updates.\nFostered a culture of empathy and active listening within the team to enhance collaboration and knowledge sharing, leading to improved project outcomes and team morale.\nApplied a proactive approach to identify bottlenecks in existing data workflows, leading to the successful implementation of new features that resulted in better user engagement metrics by **25%**."
    }
  ],
  "skills": "**Programming Languages:**\n\tPython\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tJavaScript/TypeScript (React, Vue, Angular)\n\n**API Technologies:**\n\tAPIs\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Databases:**\n\tSQL, PostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis, Relational Databases, In-Memory Databases\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS, Azure\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, Data Models, Data Pipelines, ETL, DBT, Data Warehousing, Columnar Storage, Automated Testing, Lean/Agile Methodologies, Communication Skills, Teamwork, Problem Solving, Critical Thinking, Proactivity, Empathy, Active Listening"
}