{
  "name": "Tomasz Lee",
  "role_name": "Integration Engineer for Enterprise Solution",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Results-driven Integration Engineer with 9+ years of experience in optimizing and implementing enterprise solutions. Proficient in **OpenShift**, **Kubernetes**, **http2**, **TCP**, **IPSEC**, and **DNS**, with a strong understanding of networking concepts and protocols such as **DIAMETER**, **VoLTE**, and **RAN**. Experienced in using tools like **Wireshark**, **iPerf**, **putty**, **FileZilla**, and **MobaXterm** to troubleshoot and document complex systems effectively. Strong collaboration skills, adept at working across teams to drive continuous improvement and ensure successful project execution. Originally specialized as a .NET Full Stack Developer, skilled in **microservices architecture**, **ReactJS**, **NextJS**, **.NET**, and **C#**, with a deep commitment to delivering robust applications and optimizing performance.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Integration Engineer for Enterprise Solution",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Utilized **OpenShift** and **Kubernetes** to deploy and manage scalable containerized applications in an efficient manner, ensuring high availability.\nImplemented **TCP**, **DNS**, and **IPSEC** protocols to enhance network security and data integrity within integration processes.\nDeveloped and maintained documentation on system architecture and integration flows, facilitating knowledge sharing and troubleshooting efforts for team members.\nExecuted continuous improvement initiatives that led to a **25%** increase in operational efficiency across integration processes.\nLeveraged **HTTP/2** and **TLS** protocols to optimize communications and enhance security measures for data transmission.\nConducted regular troubleshooting sessions using tools such as **Wireshark**, **iPerf**, **Putty**, and **FileZilla** to monitor and resolve network issues effectively.\nCollaborated with cross-functional teams to align on integration requirements across **5G Core (5GC)** and EPC frameworks.\nEngaged in effective communication with stakeholders, ensuring clarity in project timelines and objectives within the integration landscape.\nParticipated in the design and implementation of **IMS**, VoLTE, and RAN solutions, driving modernization and efficiency across communication systems.\nUtilized **DIAMETER** for signaling and authentication processes in telecom environments, enhancing service delivery accuracy.\nCoordinated with team members on modernization efforts related to **HSS** and **UDM** systems, aligning with industry standards like **3GPP**."
    },
    {
      "role": "Full Stack Developer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "Utilized **OpenShift** and **Kubernetes** for deploying and managing containerized applications, ensuring efficient resource utilization and application scalability.\nConfigured and optimized **TCP**, **TLS**, and **http2** protocols for enhanced data transmission security and reliability, leading to a 20% decrease in network latency.\nImplemented and maintained **EPC** and **5GC** network architectures, contributing to a stable and efficient communication environment for VoLTE and IMS systems.\nApplied **DIAMETER** protocols for managing subscriber data in **HSS** and **UDM**, which improved user experience by reducing authentication time by **15%**.\nConducted in-depth networking troubleshooting using tools like **Wireshark**, **iPerf**, and **MobaXterm**, achieving a 30% increase in fault resolution speed.\nDocumented network configurations and deployment processes, creating comprehensive manuals that improved collaboration and onboarding for new engineers by **25%**.\nFostered collaboration between cross-functional teams, ensuring integration aligns with overall enterprise solution strategies and timelines.\nLed continuous improvement initiatives in system performance and reliability, utilizing data from **FileZilla** and **putty** for analysis and reporting.\nFacilitated training sessions on networking concepts and tools for junior engineers, enhancing team knowledge and troubleshooting capabilities."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "• Contributed to the integration of 5GC and EPC components in the enterprise solution, enhancing system interoperability and performance metrics.\n• Utilized **OpenShift** and **Kubernetes** for container orchestration, improving deployment consistency and scalability by **30%**.\n• Implemented **TCP**, **TLS**, and **http2** protocols to ensure secure and efficient data transmission, achieving a **15%** reduction in latency.\n• Conducted thorough troubleshooting of network issues using **Wireshark** and **iPerf**, maintaining system uptime above **99%**.\n• Developed and maintained clear and comprehensive documentation for integration processes, facilitating knowledge sharing and compliance with **3GPP** standards.\n• Collaborated with cross-functional teams to align on project requirements and deliverables, fostering a culture of continuous improvement.\n• Engaged in requirements gathering and analysis to support the integration of **HSS**, **UDM**, and VoLTE architectures, aligning solutions with customer needs.\n• Leveraged networking concepts to design resilient network topologies, improving service availability and performance.\n• Assisted in configurations using tools such as **putty**, **FileZilla**, and **MobaXterm** to manage server and device connections effectively.\n• Participated in the development of integration test plans and executed performance testing strategies to ensure system readiness before deployment."
    }
  ],
  "skills": " **Programming Languages**\n\t Python, HTML, CSS, JavaScript, TypeScript\n\n**Frontend Frameworks**\n\t ReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n**Backend Frameworks**\n\t NodeJS, ExpressJS, NestJS, C#, .NET, Entity Framework, Microservices\n\n**API Technologies**\n\t RESTful API, GraphQL\n\n**Serverless and Cloud Functions**\n\t AWS, Azure\n\n**Databases**\n\t MSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB\n\n**DevOps**\n\t CI/CD pipelines, OpenShift, Kubernetes\n\n**Cloud & Infrastructure**\n\t Networking concepts, DNS, IP, TCP, IPSEC, http2, TLS\n\n**Other**\n\t EPC, 5GC, DIAMETER, Wireshark, iPerf, putty, FileZilla, MobaXterm, 3GPP, IMS, VoLTE, RAN, HSS, UDM, Continuous improvement, Troubleshooting, Documentation, Collaboration, Git, GitHub, Redux, Testing Tools: NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest, Blockchain: Solidity, Ether.js, Web3.js, Ethereum, UX/UI Design, Apache Kafka, RabbitMQ, Redis"
}