{
  "name": "Tomasz Lee",
  "role_name": "Senior LLM Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Senior LLM Engineer with 9+ years of experience in **API Development** and **Microservices** architecture, specializing in **FastAPI**, **Python**, and **GenAI Stack** technologies, including **LangChain** and **LangSmith**. Proven expertise in **Cloud/DevOps** environments leveraging **AWS** and **Azure**, as well as cultivating a strong foundation in **Event-driven design** and **Messaging queues**. Strong architectural thinking skills to design robust and scalable solutions while ensuring adherence to **Governance frameworks** and **Responsible AI** practices. Track record of leading cross-functional teams and mentoring junior developers, driving projects to successful completion while enhancing collaboration and communication across systems.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Senior LLM Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "• Leveraged **Python** and **FastAPI** to develop scalable APIs, ensuring efficient data access and integration for LLM solutions.\n• Designed and implemented **microservices** architecture utilizing **AWS** and **Azure** to enhance system performance and reliability.\n• Applied **event-driven design** principles with **Apache Kafka** and **RabbitMQ** for efficient real-time data streaming and messaging.\n• Executed governance frameworks to ensure responsible AI practices, thereby maintaining compliance and ethical standards in model deployment.\n• Implemented robust **cross-system integration** strategies that facilitate seamless communication across diverse LLM components and services.\n• Developed AI solutions utilizing **LangChain**, **LangGraph**, and **LangSmith**, enhancing generative AI capabilities and operational flexibility.\n• Engaged in continuous integration and deployment (CI/CD) using **Azure DevOps**, achieving a **40%** reduction in deployment time.\n• Led efforts in **MCP** (Managed Cloud Platform) initiatives, optimizing database performance and improving query execution times by **20%**.\n• Mentored junior engineers on best practices in AI development, fostering a collaborative team environment and enhancing overall skills.\n• Conducted architectural assessments and strategy sessions, driving innovative solutions in AI model implementation and integration.\n• Developed user-centric applications to harness LLM capabilities, improving end-user satisfaction by **25%** through enhanced UX/UI design."
    },
    {
      "role": "Full Stack Developer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "Utilized **Python** and **FastAPI** to develop robust and scalable APIs, contributing to an efficient backend architecture.\nDesigned and implemented **microservices** architecture to enhance the modularity and scalability of the project, utilizing **RabbitMQ** for messaging and **Apache Kafka** for event-driven data processing, resulting in a 20% increase in system responsiveness.\nApplied **Architectural Thinking** principles to ensure the architecture supports efficient **cross-system integration** and governance frameworks aligned with **Responsible AI** practices.\nConducted the integration of **LangChain**, **LangGraph**, and **LangSmith** within the existing tech stack, allowing for seamless integration with **LLMs** to improve project capabilities.\nLed the deployment strategy in **cloud environments (AWS, Azure)** to enhance system performance and reliability, achieving a 40% reduction in operational costs.\nEmployed orchestration frameworks to streamline workflows and enhance the orchestration of **A2A agents**, which improved operational efficiency by 15%.\nMentored junior engineers through hands-on sessions, focusing on **API Development**, **Event-driven design**, and best practices in **Messaging queues**, boosting team competence and productivity.\nCollaborated effectively with stakeholders on project requirements, delivering features on time and within scope.\nDeveloped interactive visualizations and dashboards using **D3.js** for enhanced project tracking and insightful reporting, leading to improved stakeholder engagement.\nOversaw code review processes to enhance coding standards and practices, reinforcing a culture of quality and continuous improvement among the development team."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "Utilized **Python** and **FastAPI** to develop robust APIs, enabling seamless communication between various systems and enhancing integration efficiency by **30%**.\nDesigned and implemented solutions leveraging **GenAI Stack**, including **LangChain** and **LangGraph**, to utilize advanced **LLMs** in applications, significantly improving response accuracy.\nDeveloped and deployed microservices architecture on **AWS** and **Azure**, ensuring increased scalability and reduced operational overhead by **25%**.\nExploited messaging queues with **RabbitMQ** for event-driven design, optimizing message handling and improving system responsiveness by **15%**.\nArchitected cross-system integration strategies that ensured effective data flow and interoperability among various platforms.\nLed the development of orchestration frameworks to streamline workflows and enhance the efficiency of automated processes.\nMentored junior developers in **Responsible AI** practices and governance frameworks, fostering a culture of accountability and ethical development.\nCollaborated with teams to set up a cloud-based DevOps environment, facilitating automated builds and deployments, improving deployment frequency by **40%**.\nConducted code reviews and provided leadership during project scrums, ensuring adherence to coding standards and project goals.\nPrepared comprehensive technical documentation and user guides for internal tools, boosting knowledge sharing across the team."
    }
  ],
  "skills": "  **Programming Languages**\n\tPython\n\n  **Backend Frameworks**\n\tNodeJS, ExpressJS, NestJS, FastAPI, C#, .NET, Entity Framework, Microservices\n\n  **Frontend Frameworks**\n\tHTML, CSS, JavaScript, TypeScript, ReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n  **API Technologies**\n\tRESTful API, GraphQL, API Development\n\n  **Serverless and Cloud Functions**\n\tAWS, Azure\n\n  **Databases**\n\tMSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB\n\n  **DevOps**\n\tCI/CD pipelines, Cloud/DevOps\n\n  **Cloud & Infrastructure**\n\tMCP\n\n  **Other**\n\tUX/UI Design, Git, GitHub, Redux, Blockchain: Solidity, Ether.js, Web3.js, Ethereum, Messaging & Caching: Apache Kafka, RabbitMQ, Redis, Testing Tools: NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest, RAG Expertise, Architectural Thinking, A2A agents, Orchestration frameworks, Responsible AI, Governance frameworks, Leadership, Mentorship, Cross-System Integration, Event-driven design, Messaging queues, LangChain, LangGraph, LangSmith, LLMs"
}