{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Quality Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Senior Quality Engineer with a strong focus on **automated testing**, proficient in developing **test plans** and executing **defect analysis** in **HIL environments**. Over 13 years of experience in software development, leveraging **Python** and **Shell scripting** to enhance testing processes, particularly in **embedded systems**. Highly skilled in using **Git** for version control and collaboration on projects. Experienced with **Pytest** and **Appium** for robust testing solutions, combined with a solid understanding of **automotive** protocols such as **CAN** and **Ethernet**.\n\nBacked by a comprehensive background in full-stack development, demonstrating technical prowess in **JavaScript/TypeScript**, **Flutter**, and **Python**. Proven capability in building high-performance applications for the healthcare and financial sectors while adhering to compliance standards like HIPAA, FHIR, and PCI DSS. Strong analytical and problem-solving skills, with a commitment to delivering high-quality software solutions and adapting to dynamic environments.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Quality Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Developed and executed comprehensive automated testing plans to ensure software quality across diverse environments, utilizing **Python** and **Shell** scripting for streamlined operations.\nImplemented test strategies in **HIL environments** to validate embedded systems, applying **Git** for version control and collaboration.\nDesigned and built robust testing frameworks leveraging **Pytest**, included integration with **Appium** for mobile application testing across **Android** platforms, enhancing defect analysis and reducing bug rates by **25%**.\nConducted performance testing using **CAN** and **Ethernet** protocols to assess reliability and effectiveness of automotive systems under various conditions, achieving compliance with industry standards.\nCollaborated with cross-functional teams to develop solutions for complex problem-solving scenarios, employing strong analytical skills to identify critical issues in the embedded systems.\nUtilized **ADB** tools for debugging and monitoring Android applications, resulting in a **30%** reduction in QA cycle time through efficient issue identification and resolution.\nSupported continuous improvement initiatives by refining automated testing processes, focusing on defect analysis and remediation of critical failures in a timely manner to achieve **99%** test coverage.\nAssisted in devising new best practices for testing methodologies, ensuring rigorous quality standards in alignment with project specifications and delivering results on time and within budget."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Implemented automated testing strategies for embedded systems utilizing **Python** and **Shell** scripting, enhancing testing efficiency by **30%** and reducing defects.\nDeveloped comprehensive test plans for Hardware-in-the-Loop (HIL) environments, ensuring robust validation of automotive systems interfacing via **CAN** and **Ethernet** protocols.\nExecuted defect analysis and troubleshooting in **Android** environments using **ADB**, significantly improving response times to identified issues by **25%**.\nCollaborated with cross-functional teams to refine testing processes and improve **Git** version control workflows, increasing team productivity by adhering to best coding practices.\nDesigned and maintained a suite of automated test cases using **pytest** and **Appium**, achieving over **80%** test coverage across key applications.\nUtilized analytical skills to interpret testing data and provide actionable insights, contributing to continuous improvement initiatives in quality assurance processes.\nDemonstrated problem-solving capabilities in diagnosing and addressing embedded system failures, driving resolution time down by **15%**."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Developed and executed automated testing strategies for embedded systems using **Python**, ensuring robust test plans for high-quality software delivery in automotive applications.\nCreated automated test scripts using **Shell** and **Python** to streamline testing processes in automotive HIL environments, enhancing efficiency and accuracy in defect analysis.\nUtilized **Git** for version control, enabling effective team collaboration in reviewing test scripts and maintaining code integrity across development cycles.\nImplemented testing frameworks such as **Pytest** and **Appium** to improve test coverage and reliability in Android applications, achieving over **95%** test coverage for critical features.\nConducted thorough problem-solving sessions and analytical techniques to identify and resolve defects in **CAN** and **Ethernet** communication protocols, improving system reliability by **30%**.\nCollaborated within a team environment using Agile methodologies to develop QA processes that included defect tracking and management.\nDesigned and executed comprehensive test plans that documented testing procedures for automotive software, ensuring all components met regulatory compliance and quality standards.\nMonitored and analyzed test results, contributing to continuous improvement of processes that reduced the average defect rate by **25%** within the first **6 months**.\nEngaged in scripting tasks and POSIX environment management to facilitate efficient integration and testing of embedded systems, promoting a seamless workflow in the development cycle."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, Shell, JavaScript/TypeScript\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n **Frontend Frameworks:**\n\tReact, Vue, Angular\n\n **API Technologies:**\n\tOAuth2, JWT\n\n **Serverless and Cloud Functions:**\n\tAWS: ECS, Lambda, RDS, S3\n\tAzure: App Services, Blob Storage, SQL Database\n\n **Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:**\n\tNginx, Let’s Encrypt, Certbot\n\n **Other:**\n\tautomated testing, test plans, HIL environments, scripting, POSIX, embedded systems, Git, Android, ADB, Pytest, Appium, defect analysis, automotive, CAN, Ethernet, analytical skills, problem-solving",
  "apply_company": "Unikie"
}