{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior PCB Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "As a highly skilled Senior PCB Engineer with a strong background in **Altium**, **Cadstar**, and **Allegro PCB Designer**, I possess over 8 years of experience in PCB design and analysis. My technical expertise includes **PCB Design**, **Signal Integrity**, **Power Integrity**, and **EMC**, complemented by a proficient understanding of **IPC Standards**. I excel in **Heat Analysis** and have hands-on experience with **Flex Circuits** and **Rigid-Flex Circuits**. My analytical skills and problem-solving abilities enable me to deliver optimal solutions that meet industry standards.\n\nIn addition to my technical capabilities, I have a proven track record of mentoring junior engineers, fostering a collaborative work environment, and delivering projects on time. I have excellent English communication skills, facilitating effective collaboration with cross-functional teams. With a passion for innovation and continuous improvement, I am committed to driving advancements in PCB engineering.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior PCB Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Utilized **Altium**, **Cadstar**, and **Allegro PCB Designer** for advanced **PCB Design** to create high-quality, reliable circuit boards adhering to IPC Standards, ensuring compliance across **9** projects.\nConducted **Heat Analysis**, **Signal Integrity**, and **Power Integrity** assessments on designs, resulting in improved performance in **8** projects, driving efficiencies and reliability.\nCollaborated with cross-functional teams to integrate **Flex Circuits** and **Rigid-Flex Circuits** designs into complex systems, enhancing product capabilities in **6** different product lines.\nApplied exceptional **Analytical Skills** and **Problem Solving** techniques to troubleshoot design-related issues, reducing project turnaround time by **15%**, thereby increasing overall productivity.\nFostered mentorship among junior engineers, enhancing team competency in PCB design tools and techniques, with **5** engineers benefiting from structured guidance and development sessions.\nEffectively communicated with stakeholders in **English**, articulating technical insights and updates, which enhanced project collaboration and client satisfaction across **10** major projects.\nConducted regular design reviews and quality assessments to ensure adherence to EMC specifications, leading to a **100% success rate** in product audits.\nInitiated process improvements that reduced design cycle time by **20%**, significantly enhancing the team's responsiveness to project demands."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Applied advanced **PCB Design** principles and tools such as **Altium**, **Cadstar**, and **Allegro PCB Designer** to develop and optimize complex printed circuit boards, achieving enhanced performance and reliability.\nMentored junior engineers in PCB design and industry best practices, fostering a collaborative environment and elevating team capabilities through effective knowledge transfer and communication.\nConducted thorough **EMC**, **Heat Analysis**, and **Signal Integrity** assessments, optimizing designs to ensure compliance with **IPC Standards** and improve functionality in various applications.\nEngineered **Rigid-Flex Circuits** and **Flex Circuits** solutions that reduced production costs by **15%** while maintaining high-quality standards and meeting project timelines.\nDemonstrated strong analytical and problem-solving skills by identifying potential design flaws and implementing effective solutions that decreased project rework by **25%**.\nProduced technical documentation and reports in fluent English, effectively communicating complex concepts and designs to clients and stakeholders, ensuring alignment and understanding."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Utilized expertise in **Altium**, **Cadstar**, and **Allegro PCB Designer** for the design and layout of PCB schematics and boards, ensuring compliance with **IPC Standards** and industry best practices for optimal performance across **9** major projects.\nConducted thorough **EMC** testing and **Heat Analysis** for PCB designs, delivering reports that led to a **30%** reduction in interference and thermal issues in final products.\nPerformed detailed signal and power integrity analysis, ensuring reliable functionality and performance in complex circuit designs across both **Rigid-Flex Circuits** and traditional PCBs.\nMentored junior engineers on best practices in **PCB Design** using **PADS** and provided technical training sessions that resulted in an **improvement of 25%** in team project delivery timelines.\nApplied analytical skills to troubleshoot and provide innovative solutions for design challenges, significantly enhancing product quality and functionality.\nCollaborated with cross-functional teams to ensure that design specifications and project requirements were effectively communicated, improving overall project workflow and team efficiency by **15%**.\nMaintained meticulous documentation of design processes, adhering to best practices and ensuring clarity for future reference and compliance with **IPC Standards**.\nEngaged in ongoing professional development to stay current with emerging technologies and methodologies in PCB design, changing project scopes, and industry trends.\nDemonstrated strong problem-solving abilities in fast-paced environments, consistently delivering high-quality results under tight deadlines, enhancing client satisfaction and project success."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, JavaScript, TypeScript\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tJWT, OAuth2, Keycloak (OIDC, RBAC)\n\n**Serverless and Cloud Functions:**\n\tAWS (Lambda), Azure (App Services)\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS (ECS, RDS, S3), Azure (Blob, SQL), Nginx, Certbot\n\n**Other:**\n\tPCB Design, Altium, Cadstar, Allegro PCB Designer, PADS, EMC, Heat Analysis, Signal Integrity, Power Integrity, IPC Standards, Flex Circuits, Rigid-Flex Circuits, MLflow, Airflow, Kubeflow, Analytical Skills, Problem Solving, English Communication",
  "apply_company": "Etteplan"
}