{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Backend Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Senior Backend Engineer with 13+ years of experience in developing robust, high-performance applications within the healthcare and financial sectors. Highly skilled in **Python**, **MLOps**, and adept in building AI-powered platforms utilizing **PredictiveAI** and **GenerativeAI** solutions. Proficient in orchestrating Kubernetes environments and leveraging **AWS**, **Azure**, and **GoogleCloud** for cloud-native deployments. Strong expertise in database management including **PostgreSQL**, **MongoDB**, and search solutions with **ElasticSearch**. Additionally, experienced in implementing **OpenTelemetry** for observability, and developing efficient backend systems using modern frameworks and technologies while ensuring adherence to best practices in compliance and security. Committed to enhancing application performance through the integration of microservices, event-driven architectures, and continuous integration/continuous deployment (CI/CD) methodologies.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Backend Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Utilized **Python** to design and build advanced backend systems, facilitating data management with **PostgreSQL** and **MongoDB** for enhanced performance and scalability across various applications in health and finance sectors.\nLeveraged **Kubernetes** for container orchestration and deployment, ensuring high availability and fault tolerance of microservices architectures, resulting in reduced downtime by **30%**.\nImplemented **MLOps** strategies for deploying machine learning models in production, leading to an increase in deployment efficiency by **40%** through automation and continuous integration practices.\nDeveloped features for predictive and generative AI applications, enhancing user engagement through smart insights and alerts, utilizing frameworks such as **AWS** and **Azure** for cloud-based solutions.\nIntegrated **Elasticsearch** for search capabilities, enabling real-time querying and analytics across complex datasets, which improved search latency by **25%**.\nEmployed **OpenTelemetry** for distributed tracing, significantly improving observability and performance monitoring across multi-cloud environments, enhancing debugging efficiency.\nCollaborated with cross-functional teams to deliver secure, compliant solutions in line with HIPAA and GDPR regulations by conducting regular security audits and code reviews.\nMaintained Linux-based server environments to ensure optimal performance, security, and reliability in application deployments.\nDeveloped CI/CD pipelines using automation tools, improving deployment speed and accuracy, achieving **97%** test pass rates on production releases.\nDocumented processes and created knowledge-sharing resources to transfer expertise and promote best practices within the engineering team."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "• Developed and maintained backend systems using **Python**, ensuring high performance and efficiency in microservices architecture.\n• Deployed applications in **Kubernetes**, improving scalability and resource management in a cloud-native environment.\n• Designed and optimized databases with **PostgreSQL** and **MongoDB** for efficient data storage and retrieval processes, handling over **1 million transactions** daily.\n• Enhanced data search and retrieval operations by implementing **ElasticSearch**, resulting in query speeds improved by **50%**.\n• Implemented monitoring and tracing with **OpenTelemetry** to ensure observability and performance of distributed systems.\n• Played a key role in migrating legacy systems to AWS and **Azure**, leading to a **30% reduction** in operational costs.\n• Contributed to projects involving **Go**, building microservices that handled high-volume data processing with **99.9% uptime**.\n• Participated in MLOps initiatives for deploying machine learning models within cloud environments, paving the way for AI-driven financial insights and fraud detection strategies.\n• Collaborated with cross-functional teams to integrate **GenerativeAI** and **PredictiveAI** features into existing applications, improving user engagement and predictive accuracy.\n• Leveraged **Linux** for the deployment and maintenance of server environments, streamlining CI/CD processes to accelerate development cycles."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Utilized **Python** and **Go** to develop robust backend services, ensuring high performance and scalability capabilities across microservices architecture in support of a global e-commerce platform.\nLeveraged **PostgreSQL** and **MongoDB** for effective data storage and management, achieving up to **65%** faster data access times through optimized queries and indexing strategies.\nImplemented container orchestration leveraging **Kubernetes** for seamless deployments, ensuring zero downtime and high availability during a peak traffic period of **100,000+** concurrent users.\nEmployed **AWS** and **GoogleCloud** services for cloud infrastructure management, optimizing resource usage and reducing operational costs by **30%** through effective scaling strategies.\nIntegrated monitoring and observability enhancements using **OpenTelemetry**, enabling real-time system performance insights and traceability for complex transaction workflows.\nDrove the automation of deployment processes using **Kubernetes** for continuous integration and delivery (CI/CD), improving deployment speed by **50%** and reducing rollbacks.\nDesigned and implemented predictive and generative AI features through **MLOps** practices, significantly enhancing user experience by delivering targeted product recommendations and improving conversion rates by **25%**.\nCollaborated across engineering teams to ensure integration of security protocols using role-based access control (RBAC) and OAuth 2.0, adhering to GDPR compliance for user data protection.\nConducted performance tuning for backend services, resulting in a **40%** increase in application responsiveness and lower latency in critical backend operations."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, Go\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n **Frontend Frameworks:**\n\tJavaScript/TypeScript, React, Vue, Angular\n\n **API Technologies:**\n\tOpenTelemetry\n\n **Serverless and Cloud Functions:**\n\tAWS Lambda, Azure App Services\n\n **Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis, ElasticSearch\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:**\n\tAWS: ECS, S3, RDS, Azure: Blob Storage, SQL Database, GoogleCloud\n\n **Other:**\n\tMLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), OAuth2, JWT, Nginx, Let’s Encrypt, Certbot, MLOps, AI, PredictiveAI, GenerativeAI",
  "apply_company": "DataRobot"
}