{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior FHIR Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "As a Senior FHIR Engineer with 8 years of extensive experience, I possess a solid foundation in **FHIR**, **HL7**, and **RESTful API** development, alongside strong proficiencies in programming languages such as **Java**, **C#**, and **Python**. My background includes significant hands-on experience with **JavaScript** technologies and frameworks, ensuring the delivery of high-performance applications tailored to healthcare solutions. \nI have a proven track record of developing solutions that are compliant with regulations such as **HIPAA** and standards like **SNOMED CT**, **LOINC**, **ICD-10**, and **CPT**. I am adept at utilizing cloud services including **Azure**, **AWS**, and **GCP** to enhance application scalability and performance.\nAdditionally, I excel in analytical and problem-solving tasks, combined with strong communication and leadership skills that drive projects for impactful innovations within healthcare. My experience also encompasses integrating **SMART on FHIR** standards and leveraging OAuth 2.0 for secure application development.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior FHIR Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Ensured compliance with **FHIR**, **HIPAA**, **HL7**, and other healthcare regulations while architecting and developing scalable, full-stack healthcare platforms using **Python** (FastAPI), **JavaScript**, and modern front-end frameworks like **React** (17-18) and **Vue** (3.x).\n- Designed and implemented **RESTful APIs** following **SMART on FHIR** specifications, enhancing interoperability and ease of access to healthcare data.\n- Led cross-functional teams utilizing effective **communication** and **leadership** skills to re-architect monolithic applications into microservices using **Docker** and **Kubernetes** (AKS/EKS), ensuring high availability of health applications.\n- Integrated **OAuth 2.0** for secure authorization across healthcare applications, facilitating safe access to sensitive patient data.\n- Developed cloud-native solutions on **Azure** and **AWS**, utilizing components like **Azure Functions** and **AWS Lambda** to enhance application scalability and performance.\n- Collaborated with multidisciplinary teams to analyze requirements and deliver high-quality solutions, acquiring productive results through effective **problem-solving** and analytical skills.\n- Built and maintained machine learning models for healthcare use cases, employing **Python** and various libraries like **scikit-learn** and **TensorFlow**, enabling real-time patient risk prediction and financial anomaly detection.\n- Established robust DevOps practices with tools such as **GitHub Actions**, **Azure DevOps**, and **CircleCI**, ensuring smooth deployments across multiple environments while incorporating automated testing and security scanning.\n- Created advanced search capabilities using **Azure Cognitive Search** and **ElasticSearch** for healthcare documents and financial data, facilitating faster data retrieval and analysis.\n- Led the deployment of mobile applications using **Flutter** and **React Native**, enhancing user experience on both iOS and Android platforms, integrating state management with **Provider** and **Redux**.\n- Executed enterprise-level test strategies using **Jest**, **Cypress**, and **Postman**, covering various testing methodologies for quality assurance across both front-end and backend services.\n- Delivered complex data visualization solutions using **D3.js** and **Power BI Embedded**, enabling insights into healthcare operations and financial KPIs with real-time data processing capabilities."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Designed and implemented **RESTful APIs** for seamless data exchange adhering to **FHIR**, **HL7**, and **HIPAA** standards, improving interoperability and accessibility of healthcare information in real-time systems.\nUtilized **Java**, **C#**, and **Python** to build scalable backend systems that effectively integrate with **Epic EHR** and **SMART on FHIR** frameworks, increasing efficiency by **25%** in data retrieval and processing.\nLed cross-functional teams in developing solutions that leverage **OAuth 2.0** for secure authentication and authorization, enhancing the security model of healthcare applications.\nApplied strong analytical and problem-solving skills to troubleshoot and resolve complex issues related to healthcare data integration, achieving a **30%** reduction in system downtimes.\nConducted comprehensive training sessions and communicated technical concepts to stakeholders, fostering collaboration and understanding of health tech solutions across departments.\nImplemented cloud deployment strategies on **Azure**, **AWS**, and **GCP**, optimizing infrastructure costs and enhancing system performance, achieving a **40%** improvement in response times.\nDeveloped custom applications utilizing **SNOMED CT**, **LOINC**, **ICD-10**, **CPT**, and **RxNorm** to ensure accurate coding and classification of healthcare data, streamlining compliance processes.\nDrove leadership and innovation within the team while mentoring junior engineers, cultivating a culture of continuous improvement and technical excellence."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Developed and optimized **RESTful APIs** using **Python** and **Java** to ensure seamless communication between systems, leveraging **FHIR** and **HL7** standards for efficient data exchange in health information systems.\nCrafted secure integration solutions with **Epic EHR** and other health information systems, implementing **OAuth 2.0** for robust user authentication and data access control in compliance with **HIPAA** regulations.\nEngineered scalable services on **Azure**, **AWS**, and **GCP** to support health applications, maintaining high availability and performance across all essential operations.\nUtilized **JavaScript** frameworks to build responsive front-end applications that comply with **WCAG 2.1**, ensuring accessibility for all users within the healthcare domain.\nEmployed analytical problem-solving skills to design, implement, and enhance workflows that utilize **SNOMED CT**, **LOINC**, **ICD-10**, and **CPT** codes for accurate clinical data management.\nImplemented robust logging and monitoring systems to ensure compliance with HIPAA and to facilitate effective communication with stakeholders, achieving a **99.9%** uptime for health systems integration.\nLed enhancements and troubleshooting efforts, managing a team of developers with a focus on fostering collaboration and clear communication, leading to a **30%** increase in team productivity.\nGuided the adoption of **SMART on FHIR** applications, aiding in the development of innovative health technologies that improve patient outcomes and streamline clinical workflows.\nApplied leadership in designing transformation projects that resulted in effective data sharing, decreasing integration times by **40%** and enhancing operational workflows."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, Java, JavaScript, C#\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tRESTful API, FHIR, HL7, SMART on FHIR, OAuth 2.0\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL), GCP\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis, SNOMED CT, LOINC, ICD-10, CPT, RxNorm\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAzure, AWS, GCP\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, HIPAA, analytical, problem-solving, communication, leadership",
  "apply_company": "Experis"
}