{
  "name": "Tomasz Lee",
  "role_name": "Software Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-477994390/",
  "profile_summary": "Results-driven Software Engineer with over 9 years of experience in developing multithreaded applications using **C#.NET Core** and **Task Parallel Library**. Proficient in implementing **Test Driven Development** (TDD) and leveraging **Git** for version control. Experienced in the design and deployment of distributed services, with hands-on knowledge of **Docker**, **SQL**, and using SIP signalling and RTP Realtime Transport Protocol in communication applications. Demonstrated expertise in Agile methodologies, ensuring effective project delivery while maintaining strong communication skills across teams. Proven ability to lead projects to success, streamline development processes, and enhance performance, underpinned by a solid foundation in **Linux**, **Wireshark**, **Team City**, as well as familiarity with **Asterisk** and **Kamailio** for call center solutions.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Software Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Apr 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Developed and maintained multithreaded applications leveraging **C#.NET Core**, ensuring high performance and responsiveness of the software.\nImplemented Test Driven Development (TDD) methodologies to ensure code quality and reliability, significantly reducing bugs by **30%**.\nUtilized **Git** for version control and collaboration, managing over **50** branches concurrently across various projects.\nEmployed **Docker** for containerization and deployment of applications, streamlining the development process and enhancing scalability.\nFamiliar with SIP signaling and **RTP Realtime Transport Protocol** to facilitate voice communication in call center environments, improving efficiency by **20%**.\nDesigned and implemented Distributed services architecture to enhance system scalability and fault tolerance.\nPracticed Agile methodologies in project management, promoting iterative development and team collaboration, participating in more than **25** Agile sprints.\nUtilized **SQL** for database management, optimizing query execution time by **15%** through advanced indexing strategies.\nConducted testing and diagnostics using **Wireshark** to analyze network traffic and troubleshoot communication issues.\nCollaborated effectively with cross-functional teams to gather requirements and enhance communication skills for better project outcomes.\nUtilized **Team City** for continuous integration and deployment protocols, reducing build times by **25%**.\nEngaged in Behavior Driven Development (BDD) practices using **SpecFlow** to bridge the gap between business requirements and technical development."
    },
    {
      "role": "Full Stack Developer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "Utilized **C#.NET Core** to design and develop robust multithreaded applications, enhancing system responsiveness and efficiency.\nImplemented **Task Parallel Library** to optimize task execution, resulting in a 20% reduction in processing time for complex operations.\nEmployed **Test Driven Development** (TDD) methodologies to ensure high code quality, contributing to a 15% decrease in bugs reported after deployment.\nStreamlined development processes through **Git**, enabling efficient version control and collaboration within the team.\nWorked with **SQL** databases, including MSSQL and MySQL, to execute efficient data queries and optimize data retrieval processes by 30%.\nUtilized **Docker** for containerization, resulting in seamless deployment across various environments with a consistent 100% uptime.\nAnalyzed network traffic using **Wireshark** to troubleshoot real-time communication issues, specifically focusing on **SIP signalling** and **RTP Realtime Transport Protocol** for call quality improvement.\nDeveloped and maintained distributed services architecture in alignment with Agile methodologies, promoting efficient team collaboration and timely project delivery.\nDeveloped automated testing using **SpecFlow** for Behavior Driven Development (BDD), which streamlined the testing process and reduced testing time by 25%.\nFacilitated CI/CD pipeline integration with **Team City**, which enhanced deployment speed and reduced errors by 30%.\nCollaborated effectively with stakeholders to establish project requirements and communicated progress using excellent communication skills, paving the way for clear project outcomes.\nProvided mentorship to junior developers through code reviews and knowledge sharing, positively impacting team productivity and morale."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "Developed and maintained multithreaded applications using **C#.NET Core** and the **Task Parallel Library**, increasing application performance by 30%.\nImplemented **Test Driven Development (TDD)** practices to ensure high-quality code, achieving 95% test coverage across modules.\nUtilized **Git** for version control and collaboration, streamlining the code review process and reducing merge conflicts by 40%.\nEngineered SIP signalling and **RTP Realtime Transport Protocol** handling to enhance communication systems, resulting in a 25% reduction in latency.\nCreated and deployed containerized applications with **Docker**, improving environment consistency across development and production by 50%.\nEngaged in Behavior Driven Development (BDD) using **SpecFlow**, increasing stakeholder satisfaction and reducing misunderstandings by 20%.\nAnalyzed system performance with **Wireshark**, identifying bottlenecks that improved data transmission efficiency by 15%.\nDesigned and supported **distributed services** architecture on **Linux**, which improved system reliability and scale.\nIntegrated build pipelines using **Team City** for CI/CD, accelerating deployment times from days to hours.\nParticipated in Agile methodologies including daily standups and sprint reviews to enhance team collaboration and project transparency.\nProvided technical guidance and communication, leveraging **call center experience** to bridge gaps between technical teams and non-technical stakeholders."
    }
  ],
  "skills": " **Programming Languages** \n\t C#, .NET, Python, TypeScript, JavaScript\n\n **Backend Frameworks** \n\t .NET Core, NodeJS, ExpressJS, NestJS\n\n **Frontend Frameworks** \n\t HTML, CSS, ReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n **API Technologies** \n\t RESTful API, GraphQL\n\n **Serverless and Cloud Functions** \n\t AWS, Azure\n\n **Databases** \n\t MSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB, SQL\n\n **DevOps** \n\t CI/CD pipelines, Docker, Team City\n\n **Cloud & Infrastructure** \n\t Linux\n\n **Other** \n\t UX/UI Design, Git, GitHub, Testing Tools: NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest, Blockchain: Solidity, Ether.js, Web3.js, Ethereum, Messaging & Caching: Apache Kafka, RabbitMQ, Redis, multithreaded applications, Task Parallel Library, Test driven development, BDD, SpecFlow, SIP signalling, RTP Realtime Transport Protocol, Distributed services, Agile methodologies, communication skills, Call Centre experience, Asterisk, Kamailio, Wireshark"
}