{
  "name": "Tomasz Lee",
  "role_name": "Full Stack Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Proficient Full Stack Engineer with 9+ years of extensive experience in designing and implementing robust applications. Strong expertise in **Node.js**, **Python**, and **Go**, alongside adeptness in **React** for frontend development. Proven capabilities in **API design**, **Database design**, **CI/CD**, and performance optimization, ensuring high-quality deliverables. Committed to user-centric design while emphasizing security best practices and reliability engineering. Known for exceptional collaboration, mentoring abilities, and a strong sense of ownership. A clear communicator driven by curiosity and empathy, I excel in fostering teamwork to achieve successful project outcomes.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Full Stack Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Developed and maintained robust applications using **Node.js** and **Python**, ensuring seamless integration and functionality across different systems.\nDesigned user-centric APIs, emphasizing **API design** principles to create efficient and effective endpoints that enhance user interactions.\nImplemented **CI/CD** methodologies to streamline development processes, ensuring rapid and reliable deployment; improved deployment efficiency by **40%**.\nCollaborated with cross-functional teams to enhance product features, showcasing strong **Collaboration** skills and clear communication techniques.\nOptimized application performance by leveraging techniques for **Performance optimization**, leading to significant reductions in load times and overall system efficiency.\nApplied **Security best practices** through strategic implementation of **JWT-based authentication**, securing sensitive user data and ensuring robust access control.\nMentored junior developers, fostering an environment of learning and growth while demonstrating leadership and mentorship capabilities.\nCultivated a culture of **Empathy** and **Curiosity** within teams to inspire innovative solutions that focus on user needs and industry best practices.\nDrove ownership in projects by overseeing the full software development lifecycle, maintaining high standards throughout the **Development**, **Testing**, and **Deployment** stages.\nEngaged in **Reliability engineering** to ensure system stability and performance, significantly improving uptime and reliability metrics."
    },
    {
      "role": "Full Stack Developer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "• Designed and developed cloud-based applications with **React** and **Node.js**, enhancing collaboration and user experience through a user-centric design approach.\n• Implemented robust API design principles and developed RESTful APIs using **Node.js** for seamless data exchange and real-time functionality.\n• Utilized **CI/CD** practices with GitHub Actions to streamline deployment processes, achieving a **30% reduction** in deployment errors.\n• Designed and optimized database schemas in **PostgreSQL**, **MSSQL**, and **MySQL** for efficient data storage and retrieval, incorporating performance optimization techniques.\n• Built a microservices architecture with **RabbitMQ** and **Kafka**, yielding a 15% increase in system scalability and task orchestration efficiency.\n• Developed user-friendly components and features in **React** and **Tailwind CSS**, resulting in a **25% improvement** in user engagement and satisfaction.\n• Conducted thorough code reviews and provided mentoring to junior developers, fostering a culture of collaboration and continuous improvement.\n• Designed and created interactive visualizations using **D3.js**, providing stakeholders with clear project status tracking and insights.\n• Collaborated effectively with cross-functional teams to define project goals and requirements, leading to timely project completion.\n• Applied software security best practices throughout the development lifecycle, ensuring reliable and secure application performance."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "• Designed and developed scalable web applications using **React** for an improved user-centric experience, aligning with modern UI/UX practices.\n• Implemented API design principles to ensure robust communication between the frontend and backend components, achieving a response time improvement of **30%**.\n• Enhanced database design and management strategies using SQL databases, achieving a **25%** increase in query efficiency and optimizing data retrieval processes.\n• Established and maintained CI/CD pipelines to automate testing and deployment processes, reducing manual efforts by **40%**.\n• Led mentoring sessions for junior developers, fostering a collaborative environment and promoting knowledge sharing within the team.\n• Coordinated with cross-functional teams to integrate security best practices and reliability engineering methods into the project lifecycle, enhancing system resilience.\n• Utilized **Node.js** and **Python** to build backend services that efficiently handle asynchronous tasks, ensuring high performance and scalability.\n• Promoted curiosity and empathy in the team by advocating for user feedback in the development process, ultimately enhancing product features.\n• Displayed ownership over project deliverables, ensuring rigorous adherence to coding standards, performance optimization, and timely completion of features while participating in daily standups and code reviews."
    }
  ],
  "skills": "  **Programming Languages**\n\tPython, Node.js, Go\n\n  **Backend Frameworks**\n\tNodeJS, ExpressJS, NestJS, C#, .NET, Entity Framework, Microservices\n\n  **Frontend Frameworks**\n\tHTML, CSS, JavaScript, TypeScript, ReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n  **API Technologies**\n\tRESTful API, GraphQL, API design\n\n  **Serverless and Cloud Functions**\n\t\n\n  **Databases**\n\tMSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB, Database design\n\n  **DevOps**\n\tAWS, Azure, CI/CD pipelines, CI/CD\n\n  **Cloud & Infrastructure**\n\t\n\n  **Other**\n\tUX/UI Design, Git, GitHub, Blockchain: Solidity, Ether.js, Web3.js, Ethereum, Messaging & Caching: Apache Kafka, RabbitMQ, Redis, Testing Tools: NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest, Mentoring, Collaboration, User-centric design, Performance optimization, Security best practices, Reliability engineering, Clear communication, Curiosity, Empathy, Ownership"
}