{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Software Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-karol-kotlinski-bb2520397/",
  "profile_summary": "Results-driven Senior Software Engineer with 8 years of comprehensive experience in building enterprise-scale applications, specializing in **Python**, **SQL**, **Airflow**, and **APIs**. Skilled in data modeling, data warehousing, and developing robust ETL and ELT pipelines, I leverage modern frameworks and methodologies to ensure data integrity and high performance across projects. I have a strong command over relational databases and advanced data storage solutions, along with a profound understanding of automated data quality processes. My proficiency in **DBT** combined with data architecture expertise places me at the forefront of transforming complex data into actionable insights.\n\nIn my previous roles, I successfully led cross-functional teams in an Agile environment, delivering projects through a commitment to teamwork and effective communication. Additionally, my technical toolkit includes **React**, **Next.js**, **Node.js**, **FastAPI**, and **Django**, along with cloud services expertise in **Azure** and **AWS**. I emphasize critical thinking while implementing solutions that comply with industry standards like HIPAA and PCI DSS. My hands-on approach with machine learning pipelines and MLOps using tools like **MLflow** and **Kubeflow** reflects my proactive attitude towards embracing innovative technologies.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Software Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Utilized **Python** and **SQL** to architect and optimize data storage solutions, ensuring efficient data modeling and quality in healthcare and financial applications, adhering to best practices in **data warehousing** and **ETL** processes.\nDesigned and implemented automated data quality frameworks to ensure high integrity and reliability across diverse data sets while managing large-scale data ingestion and storage with **PostgreSQL**, **MongoDB**, and **Redis**.\nDeveloped and maintained robust APIs to facilitate seamless data flow between systems, with a focus on agile collaboration and teamwork, ensuring effective communication with cross-functional teams.\nExecuted complex data transformation tasks using **DBT** and **Airflow**, leading to enhanced operational efficiency and reduced processing times by over **30%**.\nFostered a proactive approach to problem-solving, engaging in critical thinking to address challenges in data consistency and performance, leading to improved project outcomes.\nLed initiatives to integrate advanced data storage solutions, including **columnar storage** and **in-memory databases**, improving query performance times by up to **50%**.\nCollaborated with stakeholders to refine data modeling strategies that enhanced reporting capabilities and business insights, ensuring alignment with user needs through active listening and empathy.\nAdopted **Agile** and **Lean** methodologies to streamline project workflows, resulting in a **20%** increase in project delivery speed while maintaining high-quality standards.\nEstablished test strategies that included automated testing for ETL processes, enhancing the reliability of data pipelines and ensuring best practices in software development and deployment.\nDesigned solutions that facilitated improved data visualization and analysis, incorporating feedback loops to iterate on features, thereby elevating user engagement and satisfaction."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Utilized **Python** and **SQL** to develop and modernize financial platforms, adopting a microservices-based architecture to enhance scalability and maintainability across high-volume transaction systems.\nDesigned and implemented data storage solutions using **DBT** and relational databases, ensuring efficient data modeling and warehousing to support analytics needs.\nBuilt and maintained automated ETL processes with **Apache Airflow** for real-time ingestion of financial data from various sources, leading to a processing efficiency increase of **30%**.\nCollaborated with cross-functional teams adopting **Agile** methodologies, fostering teamwork and clear communication to align development objectives and deliver high-quality solutions.\nCreated robust APIs to facilitate seamless integration between internal applications and third-party services, improving system interoperability and responsiveness.\nImplemented data quality automation techniques and ensured compliance with data governance standards, raising data accuracy metrics by **25%**.\nOrchestrated data workflows effectively, applying critical thinking to optimize data transformations and storage strategies, resulting in a **50%** reduction in processing time for large datasets.\nProactively engaged in problem resolution and provided insights through data analysis, employing **Lean** principles to streamline processes and remove inefficiencies.\nEnhanced user interfaces for financial applications by integrating feedback mechanisms, demonstrating empathy and active listening to cater to user needs and improve overall experience."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "• Engineered robust and scalable backend services using **Python** (FastAPI, Django) and **SQL** to support data modeling and storage for a global e-commerce platform, ensuring high availability and low latency in workflows involving checkout and order fulfillment.\n• Developed and optimized ETL processes and data pipelines using **Airflow** for efficient data extraction and transformation, ensuring reliable and automated data quality checks across the system.\n• Designed and implemented APIs to facilitate seamless data exchange between various microservices and applications, enhancing overall architecture and user experience.\n• Leveraged **Relational Databases** such as PostgreSQL and in-memory databases like **Redis** for efficient data storage and real-time application performance, handling over **1M** transactions daily.\n• Collaborated in an Agile environment, enhancing team productivity through proactive communication and effective teamwork, thereby reducing project turnaround time by **25%**.\n• Utilized **DBT** for transforming raw data into analyzable formats, resulting in improved data warehousing solutions and cohesive reporting.\n• Ensured smooth data warehousing operations with columnar storage solutions, optimizing analytical query performance for big data applications.\n• Applied Lean principles to streamline workflows and reduce waste in the development process, achieving a **15%** decrease in deployment times.\n• Committed to fostering a culture of empathy, active listening, and critical thinking within team dynamics, leading to enhanced collaboration and project outcomes.\n• Implemented Agile methodologies to promote a proactive approach to problem-solving, significantly improving overall team cohesion and project success rates."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, JavaScript, TypeScript\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tAPIs\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis, SQL, Relational Databases, In-memory Databases\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS, Azure\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, Data Modeling, Data Storage, Data Warehousing, Columnar Storage, Automated Data Quality, ETL, ELT, Agile, Lean, Teamwork, Communication, Proactive, Critical Thinking, Empathy, Active Listening"
}