{
  "name": "Mariusz Jan Skobel",
  "role_name": "Senior FullStack Engineer",
  "email": "mariuszskobel15@outlook.com",
  "phone": "+48 735 343 548",
  "address": "Katowice, Poland",
  "linkedin": "https://www.linkedin.com/in/mariusz-skobel-927764397/",
  "profile_summary": "Results-driven Senior Full Stack Engineer with a robust background in delivering scalable software solutions with a focus on performance optimization. Proficient in core technologies such as **Go**, **HTML5**, **PostgreSQL**, **GitLab**, **CI/CD**, and **Docker**. Experienced with cloud platforms including **AWS** and **GCP**, leveraging CI/CD practices and agile methodologies like **Scrum** and **Kanban** to streamline development processes. Strong expertise in **Test Automation** and building responsive applications using **HTMX** and **Templ**.\n\nWith over 10 years of software development experience in healthcare and finance sectors, I have effectively led the development of enterprise platforms that incorporate AI/ML capabilities for enriched analytics, automation, and intelligent decision-making. My skill set encompasses a wide-ranging tech stack including **JavaScript/TypeScript**, **Python**, **Flutter**, **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**. I have a proven track record in microservices architecture, event-driven systems, and securing compliant solutions adhering to standards such as HIPAA, FHIR, PCI DSS, and SOC 2.\n\nI bring hands-on experience in MLOps, focusing on ML pipeline development and model deployment with tools like **MLflow**, **Airflow**, and **Kubeflow**, and maintain a strong passion for creating systems that are technically sound and drive impactful solutions.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2012",
      "to_year": "2015",
      "location": "UK",
      "university": "University of Bristol"
    }
  ],
  "experience": [
    {
      "role": "Senior FullStack Engineer",
      "company": "EitBiz",
      "from_date": "Oct 2022",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Developed and implemented dynamic, scalable, and cloud-based solutions using **Go**, **HTML5**, and **PostgreSQL**, ensuring high performance and security in line with industry regulations.\n• Created CI/CD pipelines with **GitLab**, accelerating deployment times by **50%** and improving code quality through continuous integration.\n• Enhanced user interfaces for web applications using **HTMX** and **Templ**, leading to a **30%** increase in user engagement.\n• Designed and deployed containerized applications using **Docker**, facilitating consistent development and production environments and reducing setup time by **45%**.\n• Leveraged **AWS**, **GCP**, and **Azure** services for hosting solutions, achieving **99.9%** uptime and ensuring robust infrastructure resilience.\n• Collaborated within an agile framework, employing **Scrum** and **Kanban** methodologies to streamline workflow and enhance team communication.\n• Implemented comprehensive test automation strategies that improved application reliability, reducing bug rates in production by **25%**.\n• Conducted performance optimization across applications, resulting in a **40%** improvement in load times and responsiveness for end-users.\n• Participated in code reviews and mentoring sessions to elevate development standards within the engineering team."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Tvn S.A.",
      "from_date": "Oct 2019",
      "to_date": "Sep 2022",
      "location": "Poland",
      "responsibilities": "Utilized **Go** to enhance back-end services and deliver scalable, high-performance applications, successfully improving response times by **30%** in financial systems.\nEmployed **HTML5** to build accessible and interactive user interfaces, focusing on user experience and responsiveness for financial platforms.\nImplemented **PostgreSQL** as a reliable database solution, optimizing query performance and reducing data retrieval times by **20%** for critical services.\nVersion-controlled all projects using **GitLab**, fostering a collaborative development environment and ensuring code quality through continuous integration practices.\nLed the implementation of **CI/CD** pipelines to automate deployment processes, achieving a **50%** reduction in release times and improved deployment frequency.\nAdopted **Docker** containers for application development and deployment, ensuring consistency and portability of applications across environments.\nLeveraged **AWS** and **Azure** cloud services to optimize resource usage, resulting in a **25%** cost reduction for cloud infrastructure over **12 months**.\nImplemented methodologies such as **Scrum** and **Kanban** to enhance team productivity and project visibility, achieving an increase in sprint completion rates by **40%**.\nConducted **Test Automation** to improve code reliability, reducing manual testing efforts and increasing test coverage to **90%**.\nExecuted **Performance Optimization** strategies, which improved overall application throughput, making it capable of handling **10,000+** transactions per minute."
    },
    {
      "role": "Software Engineer",
      "company": "Timspark",
      "from_date": "Sep 2015",
      "to_date": "Aug 2019",
      "location": "UK",
      "responsibilities": "• Developed robust backend services utilizing **Go** and **PostgreSQL**, ensuring high performance and scalability for a high-traffic e-commerce platform while managing over **100,000** daily transactions.\n• Implemented **CI/CD** pipelines using **GitLab** to streamline deployment processes, reducing deployment time by **30%** and improving delivery efficiency.\n• Employed **Docker** for containerization, enhancing the development workflow and facilitating consistent environments across deployment stages, achieving a **40%** reduction in environment-related issues.\n• Conducted thorough **Test Automation** to ensure code quality and application stability, leading to a **50%** decrease in production bugs, ultimately enhancing user experience.\n• Collaborated in an agile environment utilizing **Scrum** and **Kanban** methodologies to improve team productivity and project visibility, delivering features **two weeks** ahead of schedule on average.\n• Optimized web application performance through **Performance Optimization** techniques, achieving load times under **2 seconds** for key user interaction flows.\n• Developed user interfaces with **HTML5** and **HTMX**, ensuring responsive and accessible designs that comply with current accessibility standards, improving engagement metrics by **25%**.\n• Engaged with multiple cloud platforms including **AWS**, **GCP**, and **Azure** to host applications and services efficiently, implementing best practices for security and scalability.\n• Integrated modern frameworks and libraries alongside a cloud strategy while maintaining legacy system connectivity, enhancing user experiences across all devices and platforms."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython(FastAPI, Flask, Django), JavaScript/TypeScript (React, Vue, Angular), Go\n\n **Frontend Frameworks:**\n\tHTML5, HTMX, Templ\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n **API Technologies:**\n\tOAuth2, JWT, OpenID Connect (OIDC)\n\n **Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL), GCP\n\n **Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, GitLab, Terraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:**\n\tAWS, Azure, GCP\n\n **Other:**\n\tScrum, Kanban, Test Automation, Performance Optimization, MLflow, Airflow, Kubeflow, Keycloak, Let’s Encrypt, Nginx, Certbot",
  "apply_company": "Rapidly Growing Technology Company"
}