{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior QA Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "Results-driven Senior QA Engineer with 8 years of experience in test automation, utilizing frameworks such as **Selenium**, **Playwright**, and cloud services like **AWS**. Proficient in quality assurance processes with a strong command of test automation strategies. My technical acumen includes **Python** and **Django**, enhancing collaboration with development teams to deliver high-quality software solutions. I have a solid foundation in **React**, enabling effective cross-functional communication in fast-paced environments.\nIn addition to my technical expertise, I excel in leadership and problem-solving, having successfully led teams to streamline testing processes and implement best practices. My extensive experience in mentoring and guiding junior QA engineers fosters a collaborative atmosphere that drives project success.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior QA Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Implemented and enhanced **test automation** frameworks using **Selenium** and **Playwright**, ensuring high-quality deliverables in web applications, adhering to best practices and standards.\nDesigned and executed comprehensive QA strategies for cross-platform applications, focusing on **browser compatibility** through tools such as **BrowserStack** and **SauceLabs**, increasing test coverage by **40%**.\nLed QA teams in the development of automated test scripts utilizing **Python** with **Django** for backend testing, improving test execution speed by **30%**.\nCollaborated closely with development teams, leveraging strong **communication** and **collaboration** skills to identify, assess, and resolve potential issues early in the development cycle.\nUtilized **Gitlab** CI/CD pipelines to integrate automated tests into development workflows, resulting in a **25%** reduction in production bugs.\nConducted regular performance and regression testing for applications built with **React** and backend services, ensuring functional stability and application performance under load.\nDemonstrated **leadership** in the adoption of modern testing frameworks and practices, mentoring junior QA engineers and fostering a culture of continuous improvement.\nExecuted end-to-end test scenarios and documented defects using project management tools, prioritizing issues based on risk assessments and collaborating with stakeholders for resolutions.\nFacilitated **problem-solving** sessions to address testing challenges and promote best practices in automation, contributing to team efficiency and effectiveness.\nEstablished testing metrics and reports to provide valuable insights to management and stakeholders on project quality status and testing outcomes."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Implemented test automation frameworks leveraging **Selenium**, **Playwright**, and **BrowserStack** to ensure high-quality delivery in line with QA best practices, leading to a reduction in manual testing time by **30%**.\nLed cross-functional collaboration efforts with development teams to enhance communication and establish testing standards that improved the defect detection rate by **25%**.\nDeveloped comprehensive test strategies for applications built on **Python** (Django) and **React** (18), supporting the continuous integration/continuous deployment (CI/CD) pipeline managed through **Gitlab** and deployed on **AWS**, ensuring seamless updates and high availability.\nCreated and maintained automated regression tests while utilizing **Selenium** and **Playwright** to minimize post-release defects and enhanced the overall user experience of the front-end applications, effectively increasing user satisfaction scores by **20%**.\nConducted leadership and mentoring sessions for junior QA engineers, focusing on test automation principles, which fortified team expertise and proficiency in quality assurance methodologies.\nCollaborated effectively with stakeholders to clearly communicate problems, solutions, and project statuses, which facilitated smooth execution of testing initiatives and improved team collaboration.\nUtilized problem-solving skills to identify root causes of issues in production environments, leveraging **Python** scripts for rapid troubleshooting and resolution, decreasing issue recovery time by **40%**."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Designed and executed comprehensive **test automation** strategies for e-commerce applications to ensure high-quality deliverables, leveraging **Selenium** and **Playwright**.\nCollaborated with cross-functional teams, providing leadership and guidance in QA best practices, ensuring effective **communication** and **collaboration** on project goals and timelines.\nDeveloped automated test scripts in **Python** using **Django** backend services and implemented CI/CD pipelines in **Gitlab**, enhancing deployment frequency by **30%**.\nUtilized **BrowserStack** and **SauceLabs** for cross-browser testing, ensuring consistent user experiences across **9** different browsers and mobile devices.\nParticipated in root cause analysis and implemented solutions for bugs, contributing to a **20%** reduction in critical issues reported after deployment.\nManaged test environments on **AWS**, ensuring smooth performance of applications in production and staging, while enhancing test execution speed by **40%** through optimized resource allocation.\nImplemented and monitored CI/CD test suites, achieving test coverage of over **90%**, which contributed to the rapid release cycles of project features.\nFostered a culture of quality assurance through regular training sessions, boosting team capabilities in modern testing frameworks and methodologies.\nProvided feedback to development teams on application usability and stability, ensuring high-quality software that meets user needs and enhances overall product performance."
    }
  ],
  "skills": "**Programming Languages**\n\tPython, JavaScript/TypeScript\n\n**Backend Frameworks**\n\tDjango, FastAPI, Flask\n\n**Frontend Frameworks**\n\tReact, Vue, Angular\n\n**API Technologies**\n\t\n\n**Serverless and Cloud Functions**\n\tAWS (Lambda), Azure (App Services)\n\n**Databases**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure**\n\tAWS (ECS, RDS, S3), Azure (Blob, SQL)\n\n**Other**\n\tAI & ML: MLflow, Airflow, Kubeflow, Authentication & Security: Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, QA, test automation, Selenium, Playwright, BrowserStack, SauceLabs, leadership, communication, collaboration, problem-solving",
  "apply_company": "Founderful"
}