{
  "name": "Tomasz Lee",
  "role_name": "AI Tutor in Auto Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Dynamic AI Tutor with 9+ years of experience in Mechanical and Auto Engineering, specializing in Generative AI and AI prompt generation. Proven expertise in model evaluation and navigation of complex guidelines. Highly adaptable with strong task-switching abilities to meet diverse educational needs. Adept at leveraging domain-specific knowledge to enhance learning outcomes. Excellent communicator with advanced English (C1) proficiency, capable of collaborating across various engineering teams to deliver innovative solutions.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "AI Tutor in Auto Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "- Adapted mechanical engineering principles to incorporate **Generative AI** into the auto engineering curriculum, enhancing student engagement through real-world applications.\n- Utilized **AI prompt generation** techniques to facilitate interactive learning experiences tailored to individual student needs.\n- Conducted model evaluations on simulations and AI-driven projects, ensuring high-quality outputs and relevance to industry standards.\n- Demonstrated advanced English (C1) proficiency to effectively communicate complex engineering concepts to students of various backgrounds, improving overall comprehension by **30%**.\n- Developed and implemented flexible teaching strategies that allowed for efficient task switching, accommodating the diverse learning paces and styles of students.\n- Navigated complex guidelines in automotive education, ensuring adherence to both academic and industry requirements while enhancing program effectiveness.\n- Fostered adaptability in learners through hands-on projects and **problem-solving** tasks, increasing student adaptability rates by **40%**.\n- Engaged in continuous professional development to stay current with advancements in **AI** and auto engineering, influencing curriculum updates yearly.\n- Facilitated discussions and team activities to empower students to draw connections between mechanical engineering principles and practical applications, improving retention by **25%**.\n- Provided one-on-one tutoring support, adjusting instructional methods based on ongoing assessment of student needs and capabilities."
    },
    {
      "role": "Full Stack Developer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "Utilized **Generative AI** techniques to develop engaging educational content tailored for auto engineering students, fostering a deep understanding of mechanical principles.\nCreated and refined AI prompts for automated assessments, ensuring **model evaluation** aligns with industry-specific standards for auto engineering.\nDemonstrated **adaptability** by effectively switching between complex guideline navigation, addressing varied learning styles and needs of students.\nFacilitated hands-on learning through AI-based simulations for practical applications in auto engineering, enhancing critical thinking skills.\nEvaluated student performance through innovative feedback mechanisms, significantly improving student's comprehension scores by **20%**.\nConducted workshops and webinars in **Advanced English (C1)** to foster clear communication of complex mechanical concepts, reaching an audience of over **100** participants.\nCollaborated with a team of educators to integrate technology in curricula, leading to a course enhancement that improved student satisfaction ratings by **30%**.\nMentored junior tutors and provided guidance on the latest trends in AI and auto engineering, ultimately improving their instructional quality.\nResearched and reported on **domain-specific knowledge** advancements, contributing to a comprehensive knowledge base for continuous curriculum improvement.\nImplemented dynamic task switching strategies to manage multiple learning modules efficiently, meeting the academic needs of diverse student cohorts."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "Utilized advanced English (C1) skills to effectively communicate complex concepts in mechanical and auto engineering to diverse audiences.\nLeveraged **Generative AI** techniques for creating tailored learning experiences for auto engineering students, enhancing engagement by 30%.\nImplemented AI prompt generation strategies to facilitate rapid response times and improve instructional quality, achieving an accuracy rate of 95% in model evaluations.\nDemonstrated adaptability and task switching capabilities by handling multiple student queries and tutoring sessions simultaneously, maintaining a satisfaction rate of 90%.\nNavigated complex guidelines in the educational domain to develop curriculum that aligns with current trends in auto engineering, ensuring relevance and applicability.\nConducted evaluations of learning models and AI tools, contributing to a 15% increase in student performance metrics.\nCollaborated with multidisciplinary teams to integrate insights from mechanical engineering into AI tutoring methodologies, resulting in comprehensive learning modules.\nDelivered training sessions on advanced mechanical concepts, utilizing hands-on demonstrations and real-world applications to reinforce learning outcomes.\n"
    }
  ],
  "skills": "• **Programming Languages**\n\tJavaScript, TypeScript, C#, Python, Solidity\n\n• **Backend Frameworks**\n\tNodeJS, ExpressJS, NestJS, .NET, Entity Framework, Microservices\n\n• **Frontend Frameworks**\n\tHTML, CSS, ReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n• **API Technologies**\n\tRESTful API, GraphQL\n\n• **Serverless and Cloud Functions**\n\tAWS, Azure\n\n• **Databases**\n\tMSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB\n\n• **DevOps**\n\tCI/CD pipelines, Git, GitHub\n\n• **Cloud & Infrastructure**\n\tCloud computing principles\n\n• **Other**\n\tUX/UI Design, Testing Tools: NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest, Apache Kafka, RabbitMQ, Redis, Generative AI, AI prompt generation, Model evaluation, Advanced English (C1), Adaptability, Task switching, Complex guideline navigation, Domain-specific knowledge, Blockchain"
}