{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Backend Developer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-187801395/",
  "profile_summary": "Backend Developer with 13+ years of experience specializing in **Python**, **Django**, and **RESTful APIs** for high-performance applications in the healthcare and financial sectors. Proficient in **SQL** and **ORMs**, ensuring seamless data management and retrieval. Skilled in deploying **AWS** cloud infrastructure, with hands-on experience in monitoring and logging using **Datadog**, **Grafana**, and **CloudWatch**. Expertise in implementing asynchronous task management with **Celery**, and conducting rigorous testing with various **Testing Frameworks** to maintain high code quality.\n\nDemonstrated history of leveraging innovative technologies, including the development of AI/ML-powered platforms and microservices. Strong advocate for collaborative practices such as **Pair Programming** and offering **Technical Mentorship** to enhance team skills. Committed to delivering high-quality, compliance-driven solutions aligned with industry standards.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Backend Developer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Utilized **Python** and **Django** to design and develop robust **RESTful APIs** for applications, ensuring high reliability and compliance with business requirements.\nImplemented SQL databases, employing **ORMs** for seamless data management and retrieval, enhancing the performance of backend systems.\nLeveraged **AWS** cloud services to build secure and scalable cloud infrastructure, improving system availability and resilience by **30%**.\nEmployed monitoring tools such as **Datadog**, **Grafana**, and **CloudWatch** for proactive system monitoring and performance optimization, resulting in a **25%** reduction in downtime.\nIncorporated **Celery** for task management and asynchronous processing, effectively distributing workloads and improving application responsiveness.\nLed code reviews and pair programming sessions, emphasizing **Code Quality** and collaborative development practices to enhance team productivity and knowledge sharing.\nDeveloped comprehensive testing frameworks to streamline the QA process, achieving **95%** code coverage with unit tests using various **Testing Frameworks**.\nMentored junior developers, sharing insights on best practices and fostering a culture of technical excellence within the team.\nOptimized backend performance and reliability, handling over **1 million** API requests monthly through effective system architecture and design patterns."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Developed robust **RESTful APIs** using **Python** and **Django** to support high-demand financial applications, ensuring optimal performance and scalability.\nImplemented **SQL** database solutions with **ORMs** for efficient data management and retrieval, improving transaction handling by **30%**.\nDesigned and maintained cloud infrastructure on **AWS**, leveraging services like **CloudWatch** for monitoring and **Datadog** for performance metrics, significantly enhancing system reliability.\nConducted thorough testing using various **Testing Frameworks** to ensure code quality and functionality, achieving a **99%** bug-free release rate.\nEngaged in **pair programming** sessions to foster teamwork and enhance code quality through shared knowledge and techniques.\nProvided **technical mentorship** to junior developers, leading workshops and code review sessions aimed at improving development practices and adherence to project standards.\nOptimized backend processes using **Celery** for asynchronous task management, increasing throughput by **25%** during peak operations.\nUtilized **Grafana** for visualizing performance data, facilitating swift identification of workflow bottlenecks and enabling quick resolution actions."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Developed robust backend services using **Python** and **Django** for a global e-commerce platform, focusing on **RESTful APIs** that ensure high availability and scalability across critical modules.\n Leveraged **SQL** with ORMs for efficient data management and storage solutions, enabling fast access to customer data and transaction histories, achieving up to **90%** reduction in query response time.\n Engineered seamless integrations with **AWS** cloud infrastructure to enhance application performance, applying services like **CloudWatch** for monitoring and logging to maintain system health and efficiency.\n Utilized **Datadog** and **Grafana** for system performance insights, driving proactive optimization strategies that improved uptime metrics by **30%**.\n Designed and implemented asynchronous task processing utilizing **Celery**, significantly enhancing application responsiveness and overall user experience during peak traffic periods.\n Conducted **technical mentorship** sessions with junior developers, promoting best practices in code quality and collaboration through **pair programming**, which led to a **25%** increase in team efficiency.\n Focused on creating efficient and maintainable code through the application of **testing frameworks**, ensuring high-quality delivery in our development cycles.\n Participated in code reviews to uphold code quality standards and best practices throughout the development process.\n Delivered documentation for system architecture and API specifications to support future development and onboarding of new team members."
    }
  ],
  "skills": "**Programming Languages:**\n\tPython\n\n**Backend Frameworks:**\n\tDjango\n\n**Frontend Frameworks:**\n\tJavaScript/TypeScript: React, Vue, Angular\n\n**API Technologies:**\n\tRESTful APIs\n\n**Serverless and Cloud Functions:**\n\tAWS\n\n**Databases:**\n\tPostgreSQL\n\tMySQL\n\tMongoDB\n\n**DevOps:**\n\tDocker\n\tKubernetes\n\tGitHub Actions\n\tGitLab CI/CD\n\tTerraform\n\tAnsible\n\tHelm\n\tDocker Compose\n\n**Cloud & Infrastructure:**\n\tAWS: ECS, Lambda, RDS, S3\n\tAzure: App Services, Blob Storage, SQL Database\n\n**Other:**\n\tMLflow\n\tAirflow\n\tKubeflow\n\tDatadog\n\tGrafana\n\tCloudWatch\n\tCelery\n\tKeycloak (OIDC, RBAC)\n\tOAuth2\n\tJWT\n\tNginx\n\tLet’s Encrypt\n\tCertbot\n\tRedis\n\tTesting Frameworks\n\tPair Programming\n\tTechnical Mentorship\n\tCode Quality"
}