{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Software / Application Developer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-187801395/",
  "profile_summary": "Results-driven Software/Application Developer with over 13 years of experience, adept in utilizing **C#**, **.NET**, **SQL**, and **Microsoft Azure** to develop high-performance applications. Proficient in building **RESTful APIs** to deliver seamless integration and enhance application functionality. Demonstrates a strong understanding of **PowerShell**, **Power Apps**, and **Power Automate** for automating workflows and improving operational efficiency.\n\nExperienced in Agile development methodologies, showcasing exceptional problem-solving skills and effective communication abilities to foster collaboration within teams. Proven track record of deploying cloud-native solutions, ensuring robust IT infrastructure and leveraging **Agile development** practices to refine and deliver quality software products. Additional expertise in frontend and backend development utilizing **JavaScript/TypeScript**, **Python**, and frameworks such as **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**, further enhancing the capability to deliver innovative applications across diverse industries.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Software / Application Developer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Utilized **C#** and **.NET** to develop and maintain robust applications, ensuring performance and scalability aligned with best practices.\nDesigned and implemented **RESTful APIs** for seamless data integration with third-party services and internal systems, enhancing efficiency in data exchange processes.\nAutomated workflows using **Power Apps** and **Power Automate** to streamline business processes, achieving a **30%** reduction in manual handling time across operations.\nDeveloped SQL databases for data storage and retrieval, optimizing queries for performance, with an average improvement of **25%** in response times.\nCollaborated in an **Agile development** environment, participating in daily stand-ups, sprint planning, and retrospectives to drive continuous improvement.\nManaged IT infrastructure to ensure high availability and reliability, applying solid **networking concepts** and troubleshooting methods to mitigate potential issues.\nProvided solutions to complex problems through critical thinking and innovative approaches, resulting in a **15%** increase in project delivery speed.\nCommunicated effectively with stakeholders to gather requirements and deliver solutions that meet their needs, fostering a collaborative work environment.\n\n"
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "- Developed RESTful APIs using **C#** and **.NET** frameworks to support robust software applications and enhance system integrations.\n- Leveraged **SQL** for effective database management, ensuring optimal data retrieval and manipulation in financial applications.\n- Automated processes with **PowerShell**, enhancing operational efficiency and simplifying deployments.\n- Created and managed workflows with **Power Apps** and **Power Automate**, streamlining business processes and enhancing productivity.\n- Implemented solutions within **Microsoft Azure**, focusing on cloud service architecture to host scalable applications.\n- Collaborated in an **Agile development** environment, participating in sprint planning and reviews to iterate on software features based on user feedback.\n- Analyzed and resolved IT infrastructure issues, applying **networking concepts** to maintain system integrity and performance.\n- Demonstrated excellent **problem-solving** skills when faced with technical challenges, ensuring timely resolution of development blockers.\n- Communicated effectively with team members and stakeholders to align development goals, leading to a **30%** increase in project delivery efficiency compared to previous cycles."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Developed and deployed applications using **C#** and **.NET** framework to create robust backend services tailored for client requirements, ensuring high performance and maintainability.\nUtilized **SQL** for effective data management and integration of **RESTful APIs**, allowing seamless communication between systems and enhancing application functionality.\nImplemented solutions on **Microsoft Azure** to leverage cloud capabilities for scalable and reliable infrastructure, optimizing resource allocation and reducing operational costs by **30%**.\nDesigned workflows using **PowerApps** and **Power Automate**, streamlining business processes to improve efficiency and user experience, leading to a **25%** increase in task automation.\nConducted thorough testing and debugging using **PowerShell** scripts to ensure code quality and performance, achieving a bug resolution rate of **98%** before deployment.\nAdopted Agile development methodologies to enhance team collaboration and project timelines, resulting in reduced development cycle by **15%**.\nCollaborated with cross-functional teams, demonstrating exceptional problem-solving skills and strong communication to align technical solutions with business goals.\nMaintained an understanding of **IT infrastructure** and **networking concepts** to ensure software compatibility and efficiency, contributing to overall system performance improvements."
    }
  ],
  "skills": " **Programming Languages:**\n\tC#, Python, JavaScript/TypeScript\n\n **Backend Frameworks:**\n\t.NET, FastAPI, Flask, Django\n\n **Frontend Frameworks:**\n\tReact, Vue, Angular\n\n **API Technologies:**\n\tRESTful APIs, Keycloak (OIDC, RBAC), OAuth2, JWT\n\n **Serverless and Cloud Functions:**\n\tAWS: ECS, Lambda, RDS, S3\n\tAzure: App Services, Blob Storage, SQL Database\n\n **Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare)\n\tMongoDB (Gaming), Redis, SQL\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD\n\tTerraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:**\n\tMicrosoft Azure, IT infrastructure, Networking concepts\n\n **Other:**\n\tArtificial Intelligence & Machine Learning: MLflow, Airflow, Kubeflow\n\tAgile development, Problem-solving, Communication, Let’s Encrypt, Certbot"
}