{
  "name": "Rei Taro",
  "role_name": "Senior iOS Engineer",
  "email": "rei515@outlook.com",
  "phone": "+48732529451",
  "address": "Warszawa, Poland",
  "linkedin": "https://www.linkedin.com/in/rei-taro-81a410391/",
  "profile_summary": "Results-driven Senior iOS Engineer with over 10 years of experience in backend development and a solid foundation in **Python** for building high-performing APIs and scalable services. Proficient in **Swift** and **SwiftUI**, with a strong focus on **A/B testing** and **data analysis** to inform product decisions. Skilled at code reviews, documentation, and delivering impactful solutions in startup environments. Demonstrated expertise in creating robust architecture for applications in **international commerce** and **ads systems**. A proven problem solver with hands-on experience at leading organizations, contributing to projects that align technology with business goals.",
  "education": [
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2010",
      "to_year": "2015",
      "location": "Japan",
      "university": "Keio University"
    }
  ],
  "experience": [
    {
      "role": "Senior iOS Engineer",
      "company": "Leobit",
      "from_date": "Aug 2022",
      "to_date": "Present",
      "location": "Poland",
      "responsibilities": "Developed and executed **Swift** and **SwiftUI** applications, enhancing user experience through innovative design and seamless functionality.\nEngineered backend services in **Python** using **FastAPI** to streamline document automation, user onboarding, and reporting workflows, achieving a performance improvement by **30%**.\nConducted **A/B testing** and **data analysis** to refine application features, driving user engagement up by **15%**.\nImplemented structured **code reviews** to maintain high-quality code output, reducing bugs by **25%** in production releases.\nLeveraged strong **problem solving** skills to overcome integration challenges within systems, ensuring compliance and adherence to best practices.\nDocumented engineering processes and solutions to enhance knowledge sharing within the team and facilitate product management decisions.\nUtilized startup experience to contribute agile methodologies, speeding project delivery times by **20%**.\nCollaborated cross-functionally with ads systems and international commerce teams to innovate and support revenue generation initiatives."
    },
    {
      "role": "Software Engineer",
      "company": "Innovature",
      "from_date": "Nov 2018",
      "to_date": "Jun 2022",
      "location": "Japan",
      "responsibilities": "Developed backend systems in **Python** and **FastAPI** to support mobile applications and improve document workflows, ensuring a seamless integration with **Swift** and **SwiftUI**.\nEngineered A/B testing frameworks to analyze user behavior and enhance product performance through data-driven decisions.\nConducted code reviews and collaborated closely with product management to deliver high-quality features on **iOS** platforms, adhering to best practices and documentation standards.\nUtilized data analysis techniques to identify and resolve issues, contributing to an overall improved user experience for international commerce.\nDemonstrated problem-solving skills in developing scalable backend solutions for advertising systems, achieving a **30%** reduction in load times.\nCollaborated with cross-functional teams to ensure smooth integration and deployment of features, aligning with strategic goals in a fast-paced startup environment.\nImplemented secure access protocols and authentication mechanisms using **OAuth2** and **Azure AD B2C** to protect user data.\nManaged deployments using **Terraform** for **Azure App Services**, ensuring scalable and reliable production environments."
    },
    {
      "role": "Software Developer",
      "company": "Wizcorp",
      "from_date": "Apr 2015",
      "to_date": "Nov 2018",
      "location": "Japan",
      "responsibilities": "Utilized **Python** and **Flask** to develop backend services that support trade execution and account tracking to enhance trading operations in a fast-paced environment.\nCollaborated with cross-functional teams, including frontend developers, to ensure seamless integration of data via REST APIs and WebSocket channels, thus ensuring user satisfaction and smooth application performance.\nImplemented data analysis techniques to optimize backend processes, leading to a **30%** reduction in latency for trades.\nConducted thorough code reviews and documentation to enhance team productivity and maintain high coding standards.\nEngineered real-time data processors using **asyncio**, **WebSockets**, and **Redis**, providing live trading updates for up to **1000 trades per second**.\nMaintained compliance with regulatory requirements such as MiFID II and GDPR while enhancing data security protocols by implementing best practices in coding and system architecture.\nDeveloped comprehensive test suites using **PyTest** and **tox**, improving QA processes and reducing bugs in production by **25%** in the release cycle.\nLeveraged **Celery** and **RabbitMQ** for job queuing and scheduling to optimize task execution and process management in the backend environment."
    }
  ],
  "skills": "**Programming Languages**\n\tPython, Swift\n\n**Backend Frameworks**\n\tFastAPI, Flask, Django, Celery\n\n**Frontend Frameworks**\n\tSwiftUI\n\n**API Technologies**\n\tREST/gRPC APIs\n\n**Serverless and Cloud Functions**\n\tAWS (EC2, S3, Lambda), Azure\n\n**Databases**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps**\n\tDocker, Kubernetes, GitHub Actions, Azure DevOps, CI/CD\n\n**Cloud & Infrastructure**\n\tAWS, Azure\n\n**Other**\n\tJavaScript, A/B testing, Data analysis, Backend development, Code reviews, Documentation, Product management, Problem solving, Startup experience, Ads systems, International commerce, AI/ML Tools: Pandas, NumPy, scikit-learn, TensorFlow, Airflow, MLflow, Microservices, Kafka, PyTest, Git",
  "apply_company": "Whatnot"
}