{
  "name": "Rei Taro",
  "role_name": "Senior Elixir Engineer",
  "email": "rei515@outlook.com",
  "phone": "+48732529451",
  "address": "Warszawa, Poland",
  "linkedin": "https://www.linkedin.com/in/rei-taro-81a410391/",
  "profile_summary": "Results-driven Senior Elixir Engineer with over 10 years of substantial experience in backend development, specializing in **event-driven** and **microservices** architectures. Expert in **Elixir** programming, with strong knowledge of **RabbitMQ** and **Kafka** for implementing high-performance messaging systems. Proficient in **TDD** methodologies, ensuring robust and maintainable code through Agile practices. Proven ability to collaborate effectively, solve complex problems, and communicate technical concepts clearly. Demonstrated success in delivering high-quality backend systems for leading organizations in the financial sector, including VISA, Sii Poland, and Reply Polska, while leveraging technologies such as **Python** (FastAPI, Django, Flask) and **cloud platforms** like **AWS** and **Azure**.",
  "education": [
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2010",
      "to_year": "2015",
      "location": "Japan",
      "university": "Keio University"
    }
  ],
  "experience": [
    {
      "role": "Senior Elixir Engineer",
      "company": "Leobit",
      "from_date": "Aug 2022",
      "to_date": "Present",
      "location": "Poland",
      "responsibilities": "Designed and developed **backend** services using **Elixir** and **Rust** focusing on event-driven architectures to enhance scalability and performance for automation workflows.\nEngineered **microservices** leveraging best practices in **domain-driven design** ensuring robust and maintainable codebases operating in production environments.\nImplemented asynchronous messaging with **RabbitMQ** and **Kafka** to manage event-driven processes, achieving a throughput enhancement of **300%**.\nConducted unit and integration tests following **TDD** principles, enhancing reliability by reducing production bugs by **25%**.\nFacilitated Agile methodologies in multi-disciplinary teams, leading to a **15%** reduction in delivery timelines while improving teamwork and communication.\nCollaborated with stakeholders to solve complex integration challenges and maintain alignment with project objectives and compliance requirements."
    },
    {
      "role": "Software Engineer",
      "company": "Innovature",
      "from_date": "Nov 2018",
      "to_date": "Jun 2022",
      "location": "Japan",
      "responsibilities": "Utilized **Elixir** and **Rust** to develop robust backend systems, driving efficient document workflows and enhancing user onboarding processes.\nEngineered event-driven microservices architecture using **RabbitMQ** and **Kafka** to facilitate asynchronous processing of 100,000+ financial transactions daily.\nImplemented domain-driven design principles to improve microservices scalability, ensuring high responsiveness and minimal downtime during **versions 3.0** and above.\nEmployed **TDD** practices to ensure reliable and maintainable code, achieving a minimum of 95% unit test coverage across all developed components.\nDesigned, deployed, and managed microservices on cloud platforms, optimizing resource utilization on **Azure** App Services, leveraging **Terraform** for consistent infrastructure management across **3+ environments**.\nCollaborated with interdisciplinary teams using Agile methodologies to ensure seamless system integration, regulatory compliance, and successful project delivery, increasing team productivity by **40%**.\nUtilized strong communication skills to present complex technical concepts to stakeholders, facilitating better decision-making and problem-solving across projects."
    },
    {
      "role": "Software Developer",
      "company": "Wizcorp",
      "from_date": "Apr 2015",
      "to_date": "Nov 2018",
      "location": "Japan",
      "responsibilities": "Developed robust **backend** services using **Elixir** and included **RabbitMQ** for job queuing to enhance trade execution, portfolio management, and account tracking across a powerful microservices architecture.\nEngineered real-time data processing solutions with **event-driven** programming techniques, leveraging **Kafka** to manage price feeds and trading signals, processing **thousands** of transactions per second.\nCollaborated with cross-functional teams in an **Agile** environment to design and implement REST APIs and WebSocket channels, ensuring high standards of communication and rich user interactions.\nEnsured compliance with regulatory requirements, including MiFID II and GDPR, while adhering to stringent internal data security protocols, with regular audits at least **quarterly**.\nImplemented comprehensive **TDD** practices by developing thorough test suites using **PyTest** and mock servers, significantly reducing bug rates by **30%** during development cycles.\nFacilitated knowledge-sharing sessions to enhance team problem-solving skills and collaboration, resulting in improved efficiency for project deliverables by **15%**."
    }
  ],
  "skills": "*****Backend Frameworks\n\tFastAPI, Flask, Django, Celery\n\tElixir, Rust\n\n*****Programming Languages\n\tPython (3.8+), SQL, Bash, JavaScript\n\n*****API Technologies\n\tREST/gRPC APIs, Microservices, RabbitMQ, Kafka\n\n*****Databases\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n*****DevOps\n\tAWS (EC2, S3, Lambda), Azure, Docker, Kubernetes, GitHub Actions, Azure DevOps\n\n*****Cloud & Infrastructure\n\tCloud Services\n\n*****Other\n\tAI/ML Tools: Pandas, NumPy, scikit-learn, TensorFlow, Airflow, MLflow, event-driven, domain-driven, TDD, Agile, communication, problem-solving, collaboration",
  "apply_company": "Prima"
}