{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Field Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Dedicated Senior Field Engineer with a proven ability in troubleshooting, root cause analysis, and maintenance of mechanical systems. Boasts 13+ years of experience in delivering high-performance applications across multiple industries. Proficient in technical reporting and adherence to HSE standards, ensuring safe and effective operations. Strong communication and intercultural skills enable exceptional customer service and team collaboration.\n\nTechnical strengths include a diverse tech stack featuring **JavaScript**, **TypeScript**, **Python**, **Flutter**, and frameworks such as **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**. Highly skilled in deploying cloud-native systems on **AWS** and **Azure**, automating processes through microservices and CI/CD pipelines. Experienced in integrating AI/ML solutions for predictive analytics while maintaining compliance with industry standards like HIPAA and PCI DSS.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Field Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Conduct thorough **troubleshooting** and **root cause analysis** on mechanical systems, ensuring compliance with HSE standards during all maintenance and repair activities.\nProvide exceptional **customer service** through effective communication, addressing client concerns and delivering technical support with a focus on maintaining strong relationships.\nPrepare detailed **technical reports** documenting findings, solutions, and improvements in **maintenance** procedures to ensure clarity and accountability.\nUtilize **Microsoft Office** for creating, sharing, and presenting project documentation and reports, improving team collaboration and communication.\nEmbrace **intercultural skills** to work effectively within diverse teams, facilitating knowledge exchange and collaboration to optimize operational workflows.\nImplement **engine automation** solutions to enhance system efficiency, reduce downtime, and streamline maintenance processes, leading to improved operational reliability.\nOversee the application of **mechanical systems** knowledge in field operations, ensuring all maintenance work meets or exceeds industry standards and client expectations.\nAssist in training junior engineers in maintenance practices, **troubleshooting** techniques, and safety measures to foster a culture of continuous improvement and learning."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "- Conduct regular maintenance and repair of mechanical systems, ensuring compliance with HSE standards to uphold safety and operational efficiency.\n- Troubleshoot and perform root cause analysis on equipment failures, leveraging technical expertise to implement effective solutions and minimize downtime.\n- Utilize **Microsoft Office** for technical reporting and documentation, enhancing communication with stakeholders and ensuring clarity of project statuses and findings.\n- Deliver exceptional customer service by effectively communicating complex technical concepts in an accessible manner to clients and team members, fostering positive relationships.\n- Collaborate across teams, exemplifying strong intercultural skills to effectively manage communication and project execution in diverse environments.\n- Implement engine automation strategies to optimize performance and reduce manual intervention in field operations, utilizing innovative technologies to enhance productivity."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Conducted thorough **root cause analysis** for mechanical systems and automation technologies to ensure efficient **maintenance** and **repair** operations in the field, minimizing equipment downtime to **less than 5%**.\nPerformed **troubleshooting** on complex engineering systems, utilizing advanced problem-solving techniques to resolve issues swiftly and effectively, achieving a resolution time of **2 hours** on average.\nDeveloped and maintained **technical reporting** systems to track operational metrics, providing insights to improve service quality and productivity, resulting in a **15%** increase in customer satisfaction scores.\nImplemented **engine automation** strategies as part of service delivery, enhancing operational efficiency and compliance with **HSE standards**, which led to a **10%** reduction in workplace incidents.\nPromoted strong **customer service** through effective **communication** strategies and **intercultural skills**, ensuring clear expectations and fostering positive relationships with clients.\nUtilized **Microsoft Office** Suite for documentation and presentation purposes, generating reports that informed key stakeholders about project status and operational efficiency improvements.\nTrained junior engineers in **mechanical systems** troubleshooting and automated procedures, improving team capabilities and fostering a collaborative work environment.\nExecuted regular maintenance schedules and conducted audits to assess compliance with safety regulations, maintaining a **100%** compliance record over a **12-month** period.\nEngaged with cross-functional teams to ensure seamless integration of engineering solutions, driving innovation and enhancing performance in field operations."
    }
  ],
  "skills": "Programming Languages:\n\tPython: FastAPI, Flask, Django\n\tJavaScript/TypeScript: React, Vue, Angular\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tNone\n\n**Serverless and Cloud Functions:**\n\tAWS: Lambda\n\tAzure: App Services\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare)\n\tMongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes\n\tGitHub Actions, GitLab CI/CD\n\tTerraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS: ECS, RDS, S3\n\tAzure: Blob Storage, SQL Database\n\n**Other:**\n\tmaintenance, repair, troubleshooting, root cause analysis, engine automation, mechanical systems, HSE standards, Microsoft Office, technical reporting, customer service, communication, intercultural skills",
  "apply_company": "Everllence"
}