{
  "name": "Tomasz Lee",
  "role_name": "OEM Sales Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Results-oriented OEM Sales Engineer with 9+ years of experience in managing technical projects and guiding cross-functional teams. Exceptional communication and coordination skills complement a proven ability to navigate complexities and resolve conflicts effectively. Fluent in both German and English, I demonstrate flexibility in working hours and a willingness to travel. My technical background includes expertise in **.NET**, **C#**, **ReactJS**, **NextJS**, and proficiency in cloud services and third-party integrations, which allows me to bridge the gap between technical specifications and client needs. Committed to accountability and driving collaborative success in challenging environments.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "OEM Sales Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Demonstrated strong **technisches Projektmanagement** skills by spearheading the design and development of a web-based customer management platform using **.NET 7**, **ReactJS**, and **Next.js**, enhancing user satisfaction by **25%**.\nUtilized effective **Kommunikationsfähigkeiten** in collaboration with UX/UI designers to improve the platform’s UI, significantly contributing to user experience enhancements.\nExhibited **Koordinationsfähigkeiten** while designing and implementing a microservices architecture with **.NET Core** for scalability and maintainability, resulting in streamlined operations.\nIntegrated **Apache Kafka** for real-time data streaming and **RabbitMQ** for task queuing, which improved system resilience and throughput significantly.\nLeveraged **Redis** for caching frequently accessed data, achieving a **35%** reduction in database load and enhancing response times.\nDeveloped RESTful APIs with **.NET**, in combination with a **MongoDB** database, providing seamless data access for a variety of services.\nExecuted CI/CD pipelines on **Azure DevOps**, resulting in a **40%** reduction in deployment time, showcasing **Verantwortlichkeit** and commitment to efficiency.\nOptimized **MSSQL** database queries and indexing, cutting average query execution time by **20%**.\nDemonstrated **Flexibilität bei Arbeitszeiten** by effectively managing project timelines and deliverables.\nCreated a reporting engine utilizing **D3.js** and **Three.js** for interactive data visualizations.\nImplemented JWT-based authentication and authorization, ensuring secure application interactions.\nAddressed and resolved project uncertainties with **Umgang mit Unklarheiten** and adept **Konfliktlösung** strategies, contributing to project success."
    },
    {
      "role": "Full Stack Developer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "Utilized exceptional **technisches Projektmanagement** skills to lead the design and development of a cloud-based project management tool, leveraging **Angular** and **.NET Core**, resulting in a **15%** increase in team collaboration efficiency.\nDemonstrated strong **Kommunikationsfähigkeiten** by collaborating closely with stakeholders to define system requirements and development timelines, which ensured timely project delivery.\nShowcased effective **Koordinationsfähigkeiten** by creating a microservices architecture employing **RabbitMQ** for task orchestration and **Apache Kafka** for handling event-driven data streams, thus enhancing system scalability.\nImplemented solutions that require **Verantwortlichkeit**, such as integrating **Redis** as a caching layer which reduced latency in frequent API calls and contributed to a **25%** boost in system performance.\nDeveloped comprehensive RESTful APIs using **.NET Core** and integrated them with a **PostgreSQL** database for real-time data access while demonstrating flexibility in working hours to accommodate project needs.\nBuilt and maintained user-friendly components utilizing **ReactJS** and **Tailwind CSS**, leading to a **25%** improvement in user engagement on the platform.\nLed the initiative to establish CI/CD pipelines with **GitHub Actions**, cutting production deployment errors by **30%** and enhancing overall team efficiency.\nManaged **MSSQL** and **MySQL** databases, optimizing queries to improve data storage and retrieval performance, showcasing expertise with third-party tools.\nConducted impactful code reviews and mentorship sessions with junior developers, leading to improved team productivity and showcasing strong conflict resolution skills through effective guidance.\nCreated insightful custom charts and graphs using **D3.js** for interactive project status tracking and reporting, emphasizing the capacity for dealing with uncertainties in project requirements."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "• Demonstrated **technisches Projektmanagement** by contributing to the development of an internal CRM system using **.NET Framework** and **Angular**, resulting in a **20%** improvement in sales team productivity.\n• Utilized strong **Koordinationsfähigkeiten** to implement **RabbitMQ** for managing message queues for processing customer notifications asynchronously, which reduced system load during peak usage.\n• Exhibited **Erfahrung mit Drittanbietern** by providing support for integrating the platform with various third-party APIs, allowing seamless data sharing across systems.\n• Leveraged **SQL Server** to manage and retrieve customer information, improving query efficiency and optimizing data handling.\n• Spearheaded the migration of legacy code from **ASP.NET WebForms** to **.NET Core**, which enhanced system performance and maintainability, alongside providing **Verantwortlichkeit** for project outcomes.\n• Collaborated with the DevOps team to set up automated builds and releases in **Azure**, accelerating deployment processes and improving team efficiency.\n• Created a set of reusable components in **Angular** and **C#** to accelerate development for future projects, showcasing **Flexibilität bei Arbeitszeiten** and adaptability in tasks.\n• Worked with **Vue.js** to enhance the frontend experience on a client-side dashboard, ensuring alignment with project goals.\n• Engaged in daily standups and code reviews to utilize **Kommunikationsfähigkeiten** and ensure adherence to coding standards.\n• Delivered comprehensive technical documentation and user guides for internal systems, greatly improving knowledge transfer among teams."
    }
  ],
  "skills": "Frontend Technologies: HTML, CSS, JavaScript, TypeScript, ReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS,\n\n\t**Backend Frameworks**\n\n\tBackend Technologies: NodeJS, ExpressJS, NestJS, C#, .NET, Entity Framework, Microservices,\n\n\t**API Technologies**\n\n\tRESTful API, GraphQL,\n\n\t**Databases**\n\n\tDatabase Systems: MSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB,\n\n\t**Cloud & Infrastructure**\n\n\tCloud & DevOps: AWS, Azure, CI/CD pipelines,\n\n\t**Other**\n\n\tUX/UI Design, Git, GitHub, Python, Redux, Solidity, Ether.js, Web3.js, Ethereum, NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest,\n\n\t**Project Management Skills**\n\n\ttechnisches Projektmanagement, Kommunikationsfähigkeiten, Koordinationsfähigkeiten, Erfahrung mit Drittanbietern, Konfliktlösung, Umgang mit Unklarheiten, Verantwortlichkeit, Deutschkenntnisse, Englischkenntnisse, Reisebereitschaft, Flexibilität bei Arbeitszeiten"
}