{
  "name": "Rei Taro",
  "role_name": "Software Engineer - AI trainer",
  "email": "rei515@outlook.com",
  "phone": "+48732529451",
  "address": "Warszawa, Poland",
  "linkedin": "https://www.linkedin.com/in/rei-taro-81a410391/",
  "profile_summary": "Skilled Software Engineer with a strong foundation in **computer science** and **software engineering**, offering over 10 years of experience in backend development and a keen focus on AI models and automation. Proficient in crafting technical assessments and coding challenges that leverage emerging trends in AI/ML, ensuring robust evaluation frameworks. Specialized in building high-performing APIs and scalable services with **Python** (using **FastAPI**, **Django**, and **Flask**) and cloud technologies such as **AWS** and **Azure**. Recognized for exceptional analytical capabilities, collaboration, and communication skills, with a proven ability to drive impactful projects, having contributed to esteemed organizations such as VISA, Sii Poland, and Reply Polska.",
  "education": [
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2010",
      "to_year": "2015",
      "location": "Japan",
      "university": "Keio University"
    }
  ],
  "experience": [
    {
      "role": "Software Engineer - AI trainer",
      "company": "Leobit",
      "from_date": "Aug 2022",
      "to_date": "Present",
      "location": "Poland",
      "responsibilities": "Utilized strong **computer science** and **software engineering** principles to engineer backend services in **Python** using **FastAPI** for efficient document automation and user onboarding, impacting a **30%** reduction in processing time.\nEmployed an **analytical mindset** to design event-driven solutions with **Celery** and **Redis**, effectively managing asynchronous processing for over **1,000** financial transaction requests weekly with a reliability rate of **99.9%**.\nDeployed and managed **microservices** architecture on **Azure App Services**, incorporating **Terraform** for Infrastructure as Code (IaC), leading to improved deployment efficiency by **40%**.\nDeveloped and maintained data pipelines utilizing **Apache Airflow** and **Azure Functions** for regulatory data exchange, ensuring a **95%** accuracy in data flow and compliance with regulations.\nConducted **technical assessments** and integrated **OAuth2** and **Azure AD B2C** for building secure and scalable authentication systems, enhancing the security metrics by **25%**.\nCommunicated effectively and fostered collaboration with cross-functional teams to tackle system integration challenges, ensuring compliance with emerging trends and overseeing release strategies."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Innovature",
      "from_date": "Nov 2018",
      "to_date": "Jun 2022",
      "location": "Japan",
      "responsibilities": "Utilized strong **computer science** principles to develop robust backend systems in **Python** and **FastAPI** for automating document workflows, enhancing user onboarding processes, and managing intricate reporting tasks.\nEmployed innovative **software engineering** techniques to create event-driven microservices using **Celery** and **Redis**, facilitating asynchronous processing of financial data and transaction requests with a system capable of handling over **1,000 events per minute**.\nOversaw the deployment of microservices on **Azure App Services**, utilizing **Terraform** for infrastructure automation to ensure scalable and consistent environments, achieving a setup time reduction from **4 hours to 1 hour**.\nEngineered secure data pipelines for regulatory data exchanges using **Apache Airflow** and **Azure Functions**, automating data flow processes that increased efficiency by **30%**.\nPerformed rigorous security audits to ensure adherence to industry standards, integrating **OAuth2** and **Azure AD B2C** to effectively manage authentication and secure access controls for over **5,000 users**.\nExhibited excellent **communication skills** while collaborating with cross-functional teams to ensure seamless system integration, regulatory compliance, and successful release management of software updates.\nDisplayed an analytical mindset by continuously researching **emerging trends** in AI models to enhance the team's coding challenges and technical assessments."
    },
    {
      "role": "Software Developer",
      "company": "Wizcorp",
      "from_date": "Apr 2015",
      "to_date": "Nov 2018",
      "location": "Japan",
      "responsibilities": "Utilized strong **software engineering** principles to develop backend services for trade execution, portfolio management, and account tracking, leveraging **Python** and **Flask** with **PostgreSQL** to enhance trading operations.\nApplied an **analytical mindset** to engineer real-time price feed processors integrated with **asyncio**, **WebSockets**, and **Redis**, providing up-to-the-minute trading data for high-frequency transactions.\nFostered collaboration with frontend teams to deliver seamless data through **REST APIs** and **WebSocket** channels, enhancing user interaction with the platform.\nMaintained compliance with regulatory requirements such as **MiFID II** and **GDPR**, integrating internal data security protocols to safeguard user information.\nDeveloped and implemented comprehensive test suites utilizing **PyTest**, **tox**, and mock servers, resulting in a streamlined QA and CI process that improved development cycles by **30%**.\nOptimized backend task execution by introducing job queuing and scheduling solutions with **Celery** and **RabbitMQ**, achieving a processing efficiency increase of **20%**.\nEngaged in ongoing technical assessments and coding challenges to stay abreast of **emerging trends** in **AI models**, providing insights to improve the training and evaluation process."
    }
  ],
  "skills": "**Programming Languages**\n\tPython (3.8+), SQL, Bash, JavaScript\n\n**Backend Frameworks**\n\tFastAPI, Flask, Django, Celery\n\n**Frontend Frameworks**\n\t\n\n**API Technologies**\n\tREST/gRPC APIs, Microservices, Kafka\n\n**Serverless and Cloud Functions**\n\tAWS (EC2, S3, Lambda), Azure\n\n**Databases**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps**\n\tDocker, Kubernetes, GitHub Actions, Azure DevOps, CI/CD, PyTest, Git\n\n**Cloud & Infrastructure**\n\t\n\n**Other**\n\tcomputer science, software engineering, AI models, technical assessments, rubrics, coding challenges, analytical mindset, communication skills, collaboration, emerging trends"
}