{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior FullStack Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Results-driven Senior Full Stack Engineer with 13+ years of experience specializing in delivering high-performance applications, particularly in the healthcare and financial sectors. Proficient in **Node.js**, with expertise in **AWS** for cloud deployment, and adept at implementing **CI/CD** pipelines and DevOps practices. Strong understanding of relational databases and experienced in Agile and Scrum methodologies, utilizing tools such as JIRA for project tracking. \nSkilled in frontend and backend development, including **JavaScript/TypeScript** and **Angular**, with hands-on experience in building AI/ML-powered platforms for predictive analytics and automation. Additionally, brings proficiency in **FastAPI** and **Django**, reinforcing a foundation in backend technologies. Committed to aligning solutions with compliance standards, including HIPAA and PCI DSS, while maintaining a robust understanding of MLOps through tools such as **MLflow**. Leveraging a complete tech stack to innovate and deliver value consistently.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior FullStack Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Developed and maintained full-stack applications leveraging **Node.js** and **Angular**, focusing on seamless integration and agile methodologies.\nImplemented CI/CD practices utilizing **AWS** services to streamline deployment processes, ensuring improved delivery speed and efficiency of up to **50%**.\nCollaborated within Agile teams, utilizing **JIRA** for project management and task tracking, maintaining a steady sprint velocity of **20 stories** per iteration.\nDesigned efficient relational database models ensuring data integrity and performance, collaborating with cross-functional teams to support complex queries and transactions.\nLed initiatives incorporating AI-driven solutions, including LLMs and AI algorithms, enhancing application functionalities for predictive analytics and user insights.\nOrchestrated infrastructure with DevOps tools, automating workflows that achieved a **30%** reduction in manual processes, and improved system reliability.\nFostered a culture of continuous improvement by adhering to Scrum principles, conducting regular retrospectives that improved team productivity by **15%**.\nEnsured thorough documentation and code reviews, promoting code quality and maintainability, resulting in a **40%** decrease in bug rates post-deployment.\nIntegrated third-party APIs and services to enhance application capabilities, delivering rich user experiences and interaction features."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Utilized **Node.js** (NestJS/Express) for back-end development, ensuring high-performance applications while managing scalability in an Agile environment using **Java** and **AWS** technologies.\nImplemented CI/CD pipelines to streamline deployment processes, enhancing development speed and reliability in collaboration with DevOps teams.\nLeveraged **Java** for building high-quality, scalable server-side applications, ensuring smooth integration with relational databases for comprehensive data management.\nCoordinated project tasks using **JIRA**, facilitating effective Agile and Scrum methodologies for project completion within deadlines.\nDeveloped interactive front-end applications using **Angular**, **React** (version **18**), and **TypeScript**, delivering responsive and user-friendly interfaces for various financial tools.\nApplied AI techniques to enhance application features, optimizing user experience and implementing data insights with advanced models.\nParticipated in cross-functional teams to deliver software solutions with a focus on innovative design and efficient execution, driving measurable outcomes in financial services."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Utilized **Node.js** for backend services, collaborating with cross-functional teams in an **Agile** environment, to ensure rapid delivery and responsiveness to user needs.\nDeveloped and maintained applications using **Angular** and **Java**, contributing to enhanced performance through effective coding practices and regular code reviews, resulting in a **30%** reduction in bugs and errors.\nIntegrated continuous integration and continuous deployment (**CI/CD**) processes, utilizing platforms like **AWS** to streamline deployment processes and automate testing, achieving faster release cycles.\nCollaborated with data teams to implement AI features, leveraging machine learning frameworks to improve user engagement and personalize experiences.\nManaged relational databases to ensure efficient data storage and retrieval, contributing to a **25%** improvement in application response time.\nLed Scrum meetings and utilized **JIRA** for task management and progress tracking, keeping the team aligned and projects on schedule.\nParticipated in DevOps practices to enhance delivery pipeline efficiencies, facilitating quick feedback loops and improved collaboration across teams.\nDesigned and executed tasks utilizing Agile methodologies to boost team productivity metrics by **20%** year-over-year.\nResearched LLM frameworks to assess potential integration into products, exploring ways to enhance user interaction and engagement.\nEngaged in regular code quality checks and optimizations, ensuring adherence to best coding standards across **Java** and **Node.js** projects."
    }
  ],
  "skills": "Programming Languages:\n\tJava, Python, JavaScript, TypeScript\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django, NodeJS\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tOAuth2, JWT, Keycloak (OIDC, RBAC)\n\n**Serverless and Cloud Functions:**\n\tAWS: ECS, Lambda, RDS, S3\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis, relational databases\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD\n\n**Cloud & Infrastructure:**\n\tAWS, Azure: App Services, Blob Storage, SQL Database, Terraform, Ansible, Helm, Docker Compose\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, AI, Agile, Scrum, JIRA, Nginx, Let’s Encrypt, Certbot",
  "apply_company": "World Intellectual Property Organization – WIPO"
}