{
  "name": "Tomasz Lee",
  "role_name": "Senior Frontend Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Results-driven Senior Frontend Engineer with 9+ years of comprehensive experience in developing interactive e-learning platforms and Learning Management Systems (LMS). Proficient in **HTML5**, **CSS3**, **JavaScript**, and **ASP.NET**, emphasizing front-end development while integrating back-end services effectively using **Visual Studio** and **SQL**. Demonstrated expertise in cloud services, particularly **Azure**, and DevOps practices for seamless deployments. Communicates effectively across teams to convey complex technical concepts and enhance collaboration. Strong skills in debugging and problem-solving, ensuring high-quality solutions delivered on time. Experienced with modern toolsets, including **GitHub** for version control and **npm** for package management, while also utilizing design tools like **Adobe Suite** for creating visually engaging content.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Senior Frontend Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Utilized **HTML5**, **CSS3**, and **JavaScript** to develop responsive front-end components for a web-based customer management platform, enhancing user interaction and satisfaction by **25%**.\nCollaborated with backend developers to integrate **ASP.NET** and **SQL** technologies, ensuring seamless data management and retrieval.\nManaged code repositories using **GitHub** and implemented CI/CD processes using **Azure DevOps**, reducing deployment times by **40%**.\nEngaged in problem-solving and debugging efforts to maintain high system reliability and performance.\nIncorporated e-learning principles and tools like **Articulate Rise** within the application, enhancing the LMS functionalities for users.\nWorked closely with UX/UI designers to improve the overall interface and user experience, leading to a boost in user engagement.\nExecuted COTS integration strategies for smooth interoperability across existing educational tools.\nKept abreast of current trends and technologies in the industry to offer innovative solutions and improvements.\nDeveloped dynamic and interactive features using **npm** for dependency management."
    },
    {
      "role": "Full Stack Developer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "• Implemented user interfaces using **HTML5**, **CSS3**, and **JavaScript**, enhancing the overall user experience and increasing engagement by **25%**.\n• Developed applications using **ASP.NET** and **Visual Studio**, creating dynamic, responsive designs tailored for e-learning environments.\n• Integrated **GitHub** for version control and collaboration, improving workflow efficiency and reducing deployment errors by **30%**.\n• Designed learning management systems (LMS) components that utilize **npm** to manage dependencies and streamline the development process.\n• Utilized **Azure** and **DevOps** practices to automate deployments and optimize project delivery timelines, achieving a **15%** increase in release frequency.\n• Collaborated effectively with stakeholders to gather system requirements and align on project goals, ensuring clear communication throughout the development process.\n• Conducted debugging sessions and implemented problem-solving strategies to enhance application performance and user satisfaction.\n• Managed data interactions using **SQL** for effective storage and retrieval, optimizing database queries for efficiency and performance improvement.\n• Created engaging e-learning materials and templates using **Articulate Rise** and **Adobe Suite** to support content developers.\n• Led team mentorship initiatives, conducting code reviews to foster knowledge sharing and improve overall team capabilities."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "Utilized **HTML5**, **CSS3**, and **JavaScript** to enhance the user interface of e-learning platforms, significantly improving user engagement by **30%**.\nImplemented **ASP.NET** and **SQL** for backend support in projects, ensuring robust data management and retrieval processes.\nLeveraged **Azure** for cloud service deployment, optimizing live system performance and achieving a **25%** reduction in downtime.\nCollaborated with stakeholders to integrate **e-learning** solutions and **LMS** features, facilitating effective project execution and user satisfaction.\nUtilized **GitHub** for version control on projects, maintaining effective workflow and collaboration among team members.\nEmployed **npm** for package management to streamline projects, increasing development efficiency by **15%**.\nProvided support for **COTS integration** with various third-party tools, enhancing platform interoperability.\nConducted debugging sessions and problem-solving workshops, addressing key issues related to application performance.\nDelivered high-quality technical documentation and user guides using **Adobe Suite**, improving the clarity and accessibility of project materials.\nParticipated in regular code reviews and daily standups, reinforcing communication practices and alignment with project goals."
    }
  ],
  "skills": "**Programming Languages**\n\tJavaScript, TypeScript, C#, Python, Solidity\n\n**Backend Frameworks**\n\tNodeJS, ExpressJS, NestJS, ASP.NET, .NET\n\n**Frontend Frameworks**\n\tHTML5, CSS3, HTML, CSS, ReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Chakra UI, TailwindCSS, Three.js, D3.js, React Native, Flutter\n\n**API Technologies**\n\tRESTful API, GraphQL\n\n**Serverless and Cloud Functions**\n\tAWS, Azure\n\n**Databases**\n\tMSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB, SQL\n\n**DevOps**\n\tCI/CD pipelines, Git, GitHub\n\n**Cloud & Infrastructure**\n\tAzure, DevOps\n\n**Other**\n\tUX/UI Design, Testing Tools: NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest, Messaging & Caching: Apache Kafka, RabbitMQ, Redis, e-learning, LMS, npm, Articulate Rise, Adobe Suite, IMC Learning Suite, COTS integration, debugging, problem-solving, communication",
  "apply_company": "TheWhiteam"
}