{
  "name": "Tomasz Lee",
  "role_name": "Senior Sales Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Dedicated and results-oriented Senior Sales Engineer with 9+ years of expertise in delivering technical solutions tailored to customer needs. Proven ability to manage projects effectively and oversee the entire lifecycle of technical proposals. Skilled in leveraging extensive knowledge in **Elektrotechnik** and **Projektmanagement** to craft compelling bids and ensure customer satisfaction. Adept at active listening and fluent in both German and English, facilitating clear communication with clients. Original strengths include a strong technical background as a .NET Full Stack Developer, with experience in microservices architecture and distributed systems utilizing technologies such as **Apache Kafka**, **RabbitMQ**, and **Redis**, alongside proficient use of **ReactJS**, **NextJS**, **.NET**, and **C#**.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Senior Sales Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Utilized technical expertise in **Elektrotechnik** to deliver effective technical solutions aligned with customer needs, leading to a **25%** increase in user satisfaction.\nDemonstrated project management skills by spearheading the design and development of complex customer management systems using **.NET 7** and **ReactJS**, ensuring timely delivery within project milestones.\nCreated detailed technical proposals and conducted **Ausschreibungserstellung** to facilitate smooth project execution and client engagement.\nActively listened to client requirements to tailor solutions, fostering strong customer orientation and relationship management.\nImplemented project timelines and coordinated with cross-functional teams to enhance communication and drive project success, exemplifying **Eigeninitiative**.\nMaintained fluency in both German and English to effectively communicate technical concepts and engage with diverse clients.\nManaged the implementation of **microservices architecture**, improving scalability and maintainability of systems in adherence to client specifications.\nDelivered presentations and product demonstrations showcasing technical solutions to clients, enhancing customer engagement.\nEngaged in continuous learning and professional development within the field, leading to innovative technical solutions.\n"
    },
    {
      "role": "Software Engineer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "Focused on delivering **technical solutions** and **project management** strategies to meet client needs and standards.\nUtilized **electrical engineering** principles to design and implement optimal solutions for lighting systems, enhancing customer satisfaction by 20%.\nDemonstrated **client-oriented** approaches, actively listening to stakeholder requirements and ensuring effective communication in both **German** and **English**.\nLed the **bid preparation** process, crafting comprehensive submissions that highlighted tailored technological solutions to prospective clients, achieving a **25%** increase in successful bids.\nLeveraged **active listening** and **initiative** to uncover client pain points, ensuring accurate identification of necessary technological enhancements.\nProvided comprehensive training and product demonstrations, enhancing clients' understanding and adoption of new systems, contributing to a **15%** increase in customer retention rates.\nManaged multiple projects simultaneously, ensuring delivery within designated timelines and maintaining relationships with clients throughout the project lifecycle.\nCollaborated with cross-functional teams to develop effective **technical solutions** and advocate for customer needs in engineering discussions.\nConducted regular follow-ups and feedback sessions to iterate on solutions based on client needs, enhancing project outcomes and fostering long-term partnerships.\nMentored junior team members in enhancing their technical knowledge and customer engagement strategies, resulting in a more cohesive team approach to **sales engineering**."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "• Demonstrated strong **elektrotechnisch** and **technische lösungen** skills by contributing to the development of an internal CRM system using **.NET Framework** and **Angular**, which improved sales team productivity by **20%**.\n• Showcased **kundenorientierung** by implementing **RabbitMQ** to manage message queues for processing customer notifications asynchronously, effectively reducing system load during peak usage.\n• Leveraged **projektmanagement** skills to create a set of reusable components in **Angular** and **C#**, accelerating development for future projects.\n• Enhanced **technische lösungen** through working with **SQL Server** to efficiently manage and retrieve customer information, significantly improving query efficiency.\n• Executed an active initiative in migrating legacy code from **ASP.NET WebForms** to **.NET Core**, which led to better system performance and maintainability.\n• Collaborated efficiently with the DevOps team to set up automated builds and releases in **Azure**, thereby speeding up deployment processes by **30%**.\n• Supported seamless integration with third-party APIs, demonstrating excellent **kundenorientierung** and enhancing data sharing across systems.\n• Enhanced frontend experience by effectively utilizing **Vue.js** on a client-side dashboard.\n• Engaged in daily standups and comprehensive code reviews to ensure project goals were met while adhering to coding standards, fostering a culture of **aktives zuhören**.\n• Delivered detailed technical documentation and user guides for internal systems, significantly improving knowledge transfer among teams."
    }
  ],
  "skills": "**Programming Languages**\n\tPython\n\n**Backend Frameworks**\n\tNodeJS, ExpressJS, NestJS, C#, .NET, Entity Framework, Microservices\n\n**Frontend Frameworks**\n\tHTML, CSS, JavaScript, TypeScript, ReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n**API Technologies**\n\tRESTful API, GraphQL\n\n**Serverless and Cloud Functions**\n\tAWS, Azure\n\n**Databases**\n\tMSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB\n\n**DevOps**\n\tCI/CD pipelines\n\n**Cloud & Infrastructure**\n\tGit, GitHub\n\n**Other**\n\tUX/UI Design, Testing Tools: NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest, Blockchain: Solidity, Ether.js, Web3.js, Ethereum, Notbeleuchtungssysteme, Elektrotechnik, Kundenorientierung, Projektmanagement, Technische Lösungen, Ausschreibungserstellung, Fließende Sprachkenntnisse in Deutsch, Englischkenntnisse, Aktives Zuhören, Eigeninitiative",
  "apply_company": "Eaton"
}