{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Frontend Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-karol-kotlinski-bb2520397/",
  "profile_summary": "As a Senior Frontend Engineer with 8 years of experience, I excel in *frontend development* utilizing *responsive design patterns* and *modern frontend tooling* to create high-performance applications. My technical expertise includes *React*, *Next.js*, and *Vue*, ensuring *UI/UX consistency* while optimizing performance. I have a proven track record in *code reviews* and providing *technical guidance* to enhance team productivity.\nIn addition to my frontend capabilities, I have a rich background in building full-stack solutions using *JavaScript/TypeScript*, *Python*, and *Flutter* across the healthcare and financial sectors. My experience extends to integrating AI/ML functionalities and employing *AI coding tools* and *prompt engineering* to drive intelligent automation and real-time data analytics. I work autonomously and am adept at employing *microservices architecture* and *CI/CD automation* to ensure robust, secure applications compliant with standards such as HIPAA and PCI DSS.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Frontend Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Developed and maintained modern front-end architectures using React (17-18), Next.js, and Vue (3.x) to ensure responsive design patterns and UI/UX consistency across healthcare and financial platforms.\nImplemented performance optimization techniques to enhance application speed and load times, improving user experience and retention by **30%**.\nConducted thorough code reviews and provided technical guidance to junior developers, fostering an environment of continuous learning and collaboration.\nUtilized **AI coding tools** to streamline development processes and integrate innovative features within the front-end, enhancing overall application functionality.\nEmployed modern frontend tooling to create scalable, high-quality user interfaces that comply with industry standards, ensuring superior **UI/UX consistency**.\nActively participated in autonomous working within cross-functional teams, contributing to effective communication and problem-solving efforts.\nAnalyzed and implemented responsive design patterns to achieve a seamless user experience on both desktop and mobile platforms, leading to a **25%** increase in mobile app engagement.\nCollaborated with backend teams to align frontend development with backend services using RESTful APIs, ensuring smooth transactions in highly regulated environments.\nEnhanced frontend performance tracking by integrating tools and frameworks aimed at monitoring user behavior and application analytics.\nProvided ongoing feedback and insights on emerging technologies and trends to improve the overall frontend development process."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Focused on **frontend development** to deliver high-quality user experiences by leveraging modern frameworks and technologies.\n\n- Led the development of dynamic, user-friendly front-end applications using **React (18)**, **Vue 3**, and **Next.js**, implementing **TypeScript** and applying responsive design patterns, which increased user engagement by **25%**.\n- Conducted extensive **code reviews** to uphold the highest coding standards and fostered **UI/UX consistency** across applications, improving the overall performance by **30%**.\n- Provided **technical guidance** to junior developers, enhancing team productivity through autonomous working opportunities and effective communication skills.\n- Developed and maintained responsive design strategies using **Tailwind CSS** and **Redux Toolkit**, contributing to a more efficient front-end architecture and optimizing load times by **50%**.\n- Collaborated with backend teams to ensure seamless integration with APIs and microservices, improving the application's scalability for supporting high user traffic.\n- Engaged in performance optimization techniques to enhance website speed and responsiveness, resulting in a better user experience and a lower bounce rate.\n- Utilized **modern frontend tooling** to streamline the development process, ensuring timely delivery of projects within strict deadlines."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Focused on **frontend development** to deliver dynamic and responsive web applications utilizing frameworks like **React (18)**, **Vue 3**, and **Angular**.\nApplied **technical guidance** and performed **code reviews** to ensure code quality and adherence to **UI/UX consistency** while maximizing performance optimizations across the various platforms.\nEngineered **responsive design patterns** to enhance user engagement on both desktop and mobile interfaces, maintaining high standards of accessibility compliance (WCAG 2.1).\nDesigned and implemented seamless integrations with backend services, emphasizing **modern frontend tooling** such as **TypeScript**, **Redux Toolkit**, and **Tailwind CSS** for enhanced frontend functionality.\nUtilized **AI coding tools** and engaged in **prompt engineering** to optimize development processes and improve feature delivery times.\nConducted performance optimization initiatives which have led to a **30%** increase in application loading speeds and responsiveness.\nEmployed **autonomous working** techniques to effectively manage project timelines, demonstrating strong **communication skills** across cross-functional teams to drive alignment and timely project completions.\nEngaged in the architectural discussions and decision-making processes to elevate the overall **frontend architecture** of the platform, aligning technical strategies with business objectives."
    }
  ],
  "skills": "**Frontend Frameworks:**\n\tJavaScript/TypeScript (React, Vue, Angular), responsive design patterns, modern frontend tooling, frontend architecture, performance optimization, UI/UX consistency\n\n**Programming Languages:**\n\tPython (FastAPI, Flask, Django)\n\n**Artificial Intelligence & Machine Learning:**\n\tMLflow, Airflow, Kubeflow, AI coding tools, prompt engineering\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, CI/CD & Infrastructure as Code: Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**Authentication & Security:**\n\tKeycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot\n\n**Other:**\n\tcode reviews, technical guidance, communication skills, autonomous working"
}