{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Senior Engineer with 13+ years of experience in delivering high-performance applications, leveraging advanced skills in **C#**, **Java**, and cloud technologies such as **AWS**, **GCP**, and **Azure**. Proficient in implementing **microservices** and **SOA** architectures, with a strong understanding of **Kafka** for real-time data processing and event-driven solutions. Adept at developing **CI/CD** pipelines and employing **TDD** methodologies to ensure high-quality code delivery within **Agile** frameworks, including **Kanban**.\n\nRecognized for strong technical mentorship abilities and effective stakeholder communication to influence project outcomes. Background includes building AI/ML-powered platforms with hands-on expertise in **JavaScript/TypeScript**, **Python**, **Flutter**, and comprehensive experience with frameworks such as **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**. Experienced in compliance-driven development, aligning solutions with standards like HIPAA, FHIR, PCI DSS, and SOC 2. Strong background in **MLOps**, including model training, serving, and orchestration using **MLflow**, **Airflow**, and **Kubeflow**.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Utilized **C#** and **Java** to design and build microservices architectures, ensuring efficient and scalable applications across cloud platforms like **AWS** and **Azure**.\nImplemented CI/CD strategies with tools such as GitHub Actions and Azure DevOps, achieving deployment frequency of up to **20 times per day** while adhering to TDD practices.\nLed agile development processes, incorporating Kanban methodologies to promote teamwork and improve project delivery timelines by **30%**.\nProvided technical mentorship to junior engineers, fostering an environment of continuous learning and adherence to **SOLID** and **DRY** principles.\nEngaged with stakeholders to influence project direction and deliver solutions that meet business needs, enhancing communication to achieve consensus across teams.\nDeveloped real-time data processing pipelines using **Kafka**, facilitating seamless data flow and improving system reliability by **25%**.\nDefined and enforced robust testing strategies across the tech stack, leveraging tools such as Jest and PyTest to secure code quality and minimize defects by **40%**.\nCollaborated with cross-functional teams to implement service-oriented architectures, enhancing system interoperability and reducing integration times by **15%**."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Implemented microservices architecture leveraging **C#**, **Java**, and **Azure**, significantly increasing system reliability and maintainability in line with enterprise standards.\nUtilized **CI/CD** pipelines for seamless deployment processes, achieving a deployment frequency of **9** releases per week while minimizing downtime.\nApplied **Agile** methodologies to enhance team productivity and deliver high-quality solutions, actively engaging in **Kanban** practices to streamline workflows.\nProvided technical mentorship across cross-functional teams, promoting best practices in **TDD**, **SOA**, and adherence to **SOLID** principles.\nFacilitated effective communication with stakeholders to influence project direction and ensure alignment with organizational goals.\nModernized core financial platforms by migrating to microservices architecture using **Node.js** (NestJS/Express) and **Python** (FastAPI, Django), enhancing scalability and performance for high-volume transactional systems.\nBuilt interactive front-end applications with **React** (18), **Vue 3**, **Next.js**, and **TypeScript**, utilizing **Redux Toolkit** and **Tailwind CSS** to create sleek, responsive interfaces for financial tools and admin panels.\nDelivered real-time analytics dashboards with **React**, **D3.js**, and **Power BI Embedded**, providing operations teams with instant insights into transactions and anomalies.\nDesigned and deployed a robust event-driven architecture using **Kafka**, **RabbitMQ**, and **Azure Service Bus**, ensuring asynchronous communication across critical workflows such as payments, alerts, and compliance.\nDeveloped ETL pipelines for ingesting financial data from internal and third-party sources using **Python**, **Apache Airflow**, and **Azure Data Factory**, supporting both batch and real-time processing.\nBuilt and deployed machine learning models for fraud detection using **scikit-learn**, **XGBoost**, and **Azure ML**, enabling proactive detection of suspicious activity based on user behavior and transaction patterns.\nCreated ML pipelines for real-time credit scoring, churn prediction, and transaction classification, leveraging **MLflow** and **Airflow** to integrate model inference into backend services."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "- Designed and optimized backend services leveraging **C#** and **Java** for robust microservices architecture, ensuring high availability and low latency throughout the e-commerce platform.\n- Implemented event-driven architecture using **Kafka** to facilitate real-time order updates and improve customer support, contributing to a seamless user experience.\n- Engaged in **CI/CD** practices to streamline deployment processes, reducing rollout times by **30%** and enhancing team collaboration under **Agile** methodologies.\n- Conducted **TDD** to ensure reliable product features, resulting in a **40%** reduction in post-deployment defects.\n- Provided technical mentorship to junior developers, promoting best practices in **SOA**, **SOLID**, and **DRY** principles within the engineering team.\n- Utilized **AWS**, **GCP**, and **Azure** cloud services for scalable solutions, optimizing resource allocation and reducing overhead costs by **25%**.\n- Employed **microservices** architecture to enable independent deployment cycles and facilitate stakeholder influence through effective communication with cross-functional teams.\n- Advocated for **Kanban** practices to improve workflow management, resulting in a **15%** increase in project delivery speed.\n- Managed stakeholder expectations through effective communication and regular updates, ensuring alignment with project goals and timelines."
    }
  ],
  "skills": " **Programming Languages:**\n\tC#, Java, Python, JavaScript/TypeScript\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django, microservices, SOA\n\n **Frontend Frameworks:**\n\tReact, Vue, Angular\n\n **API Technologies:**\n\tNginx, OAuth2, JWT\n\n **Serverless and Cloud Functions:**\n\tAWS: Lambda, Azure App Services\n\n **Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:**\n\tAWS: ECS, RDS, S3, GCP, Azure: Blob Storage, SQL Database\n\n **Other:**\n\tMLflow, Airflow, Kubeflow, Kafka, TDD, Agile, SOLID, DRY, Kanban, technical mentorship, stakeholder influence, communication\n",
  "apply_company": "The Difference Engine"
}