{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior DevOps Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Senior DevOps Engineer with 13+ years of experience in delivering high-performance applications across the healthcare and financial industries. Proficient in **Kubernetes**, **Terraform**, **Pulumi**, and CI/CD practices including **GitHub Actions** and **Argocd**. Experienced in implementing cloud-native solutions on **AWS** and **Azure**, and skilled in **IaaS** setup and management, enabling efficient infrastructure deployment.\n\nStrong background in observability tools like **Grafana** and **OpenTelemetry**, ensuring high-level system monitoring and performance tracking. Expertise in programming languages such as **JavaScript** and **Python**, with hands-on experience in deploying microservices and event-driven architectures.\n\nAdditionally, adept at compliance-driven development, aligning solutions with HIPAA, FHIR, PCI DSS, and SOC 2 standards. Significant experience with MLOps practices, including model training and orchestration using **MLflow**, **Airflow**, and **Kubeflow**. Committed to driving automation and enhancing system performance through innovative DevOps strategies.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior DevOps Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Focused on **Kubernetes**, **CI/CD**, and **Cloud** infrastructure to ensure seamless deployment and scalability across platforms.\nImplemented **GitHub Actions** for automated testing and deployment, allowing for rapid iteration with a **90%** automation success rate.\nDesigned and maintained infrastructure as code using **Terraform** and **Pulumi**, achieving a **50%** reduction in deployment times across environments.\nUtilized **Grafana** and **OpenTelemetry** to enhance observability and monitor application performance, maintaining system uptime of over **99.9%**.\nCollaborated with cross-functional teams to enhance application performance and resilience with **Service Mesh** strategies using **Envoy**, ensuring efficient communication between services.\nDeveloped full-stack applications with **Python** and **JavaScript**, employing the latest frameworks and libraries to deliver user-centric solutions in a timely manner.\nLed initiatives for robust network security and performance, introducing protocols that reduced latency by **30%** in data processing and retrieval.\nChampion of CI/CD using tools like **Argocd** and **GitHub Actions**, ensuring high-availability deployments integrated with thorough testing frameworks.\nIntegrated advanced observability solutions, establishing dashboards that centralized logs and metrics, vital for proactive system health monitoring.\nOptimized cloud resource management and cost-efficiency across IaaS platforms, resulting in a **20%** cost saving on cloud expenditures annually."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Implemented **CI/CD** pipelines using **GitHub Actions** and **Argocd** to automate deployment processes, improving deployment efficiency by **30%** across multiple projects.\nManaged and orchestrated containerized applications using **Kubernetes**, ensuring high availability and scalability of cloud resources in an **IaaS** environment.\nOptimized cloud infrastructure using **Terraform** and **Pulumi**, achieving cost reductions of **15%** through improved resource management and scaling policies.\nEnhanced service observability by integrating **OpenTelemetry** and **Grafana**, providing real-time monitoring and insights into application performance.\nDeveloped and maintained microservices using **Go** and **Python**, focusing on robust network communication patterns and security protocols.\nFacilitated seamless networking and service mesh integration using **Envoy**, ensuring secure service-to-service communication and enhancing overall system resilience.\nLed migrations of legacy systems to modern cloud solutions, adopting best practices and industry standards to deliver projects on time and within budget while achieving a **20%** increase in performance.\nExecuted thorough testing and refinement of cloud services, achieving a **99.9%** uptime, validating integrative components through continuous feedback loops in the development cycle."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Implemented and managed **Kubernetes** clusters for automated deployment and orchestration, ensuring high availability and scalability across multiple environments, handling over **3000** transactions per minute.\nDesigned CI/CD pipelines using **GitHub Actions** and **Argocd**, enabling seamless integration and delivery processes that reduced deployment time by **40%**.\nUtilized **Terraform** and **Pulumi** for infrastructure as code (IaaS) to provision scalable infrastructure in the cloud, optimizing resource allocation and optimizing costs by **30%**.\nMonitored system performance and reliability with **OpenTelemetry** and **Grafana**, providing observability for over **50** services to ensure optimal uptime and rapid anomaly detection.\nCollaborated with development teams to establish a **Service Mesh** using **Envoy**, improving inter-service communication and security policies throughout the application stack.\nImplemented robust networking strategies to configure and manage cloud-based networking solutions, enhancing data security and minimizing latency for global e-commerce applications.\nConducted security audits and risk assessments, ensuring compliance with best practices for GDPR and applying role-based access control (RBAC) for secure environments.\nImproved application performance through the integration of caching mechanisms and monitoring tools, leading to a **25%** reduction in load times across critical services.\nPerformed troubleshooting and resolution of complex technical issues in environments utilizing **Python**, **Go**, and **JavaScript**, leading cross-functional teams to enhance application performance and stability."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, Go, JavaScript\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tOAuth2, JWT\n\n**Serverless and Cloud Functions:**\n\tAWS: Lambda, ECS, S3\n\tAzure: App Services\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Pulumi, Argocd, CI/CD, Service Mesh\n\n**Cloud & Infrastructure:**\n\tAWS, Azure, Networking, IaaS\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, Nginx, Let’s Encrypt, Certbot, Grafana, OpenTelemetry, Observability",
  "apply_company": "Burny Games"
}