{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Trading Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "Results-oriented Senior Trading Engineer with 8 years of experience specializing in high-performance solutions for financial sectors. Proficient in technologies such as **AWS**, **SQL Server**, **Python**, **C#**, **React**, **Angular**, **Vue.js**, and **Databricks**. I possess a strong expertise in developing applications that enhance trading systems through intelligent automation, real-time data processing, and integration with AI systems. \n\nSkilled in leveraging **Snowflake** for data warehousing and analysis, I ensure robust data management strategies that facilitate decision-making in trading environments. My foundation in software engineering includes microservices architecture and CI/CD automation, enabling the delivery of compliant applications following necessary standards. I excel in fostering collaboration and communication within teams, adapting to challenges in fast-paced environments while driving innovation in trading platforms.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Trading Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Developed and maintained trading applications using **Python**, **C#**, **React**, and **Angular**, ensuring seamless performance and responsiveness with a focus on real-time data processing and analytics.\nArchitected data solutions leveraging **AWS**, **Snowflake**, and **SQL Server** for optimized data storage, retrieval, and analysis, supporting financial trading operations in a regulatory-compliant environment.\nImplemented cloud-based architecture and services on **AWS**, ensuring scalability and high availability for trading systems while managing data security and compliance standards.\nEngineered advanced analytics dashboards using **PowerBI** for financial insights, enabling traders to visualize key metrics and make data-driven decisions with real-time updates across various trading scenarios.\nDesigned and developed microservices using **Python** and **C#** to facilitate internal communication, improve maintainability, and enhance system performance in trading operations.\nCollaborated effectively with cross-functional teams to integrate AI-driven features, enhancing trading algorithms and decision-making processes in the trading systems, focusing on innovative solutions and continuous improvement.\nOptimized the CI/CD pipeline using **Databricks** and other tools to automate testing and deployment processes, thereby reducing operational friction and improving delivery cycles by **30%**.\nEnsured robust and adaptable software development practices, focusing on collaboration, communication, and quick adaptation to changing trading environments and market conditions.\nEstablished unit testing and integration testing protocols, utilizing **Python** testing frameworks and tools to maintain high-quality code standards throughout the development lifecycle.\nFacilitated knowledge sharing sessions among trading engineers to strengthen team collaboration and enhance skills in trading technologies and methodologies.\nDelivered meaningful trading insights by implementing advanced data visualization techniques for monitoring trading performance and market trends, ensuring traders have immediate access to necessary information."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Designed and implemented advanced trading platforms leveraging **AWS** and **Snowflake** for data storage and analytics, improving system performance by **30%** in handling trading queries.\nUtilized **C#** and **Python** to develop microservices-based trading applications, enhancing scalability and efficiency of transaction processing systems by **20%**.\nDeveloped dynamic user interfaces for trading applications using **React (18)** and **Angular**, integrating real-time data feeds and visualizations with **PowerBI** to provide traders with critical insights on market trends and performance metrics.\nCollaborated with cross-functional teams to establish best practices in trading system architecture, ensuring seamless integration of **SQL Server** and **Databricks** for optimized data retrieval and analysis.\nImplemented AI and machine learning algorithms to enhance trading strategies, increasing decision-making speed by **40%** through predictive analytics and trade simulations.\nDesigned and maintained ETL pipelines for efficient batch and real-time data processing, ensuring high availability and reliability for market data ingestion and analysis.\nFacilitated effective communication and collaboration within teams, showcasing adaptability to evolving project requirements and technologies while fostering a culture of continuous improvement."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Utilized **AWS** to deploy and manage scalable e-commerce solutions, ensuring the integration of **OMS** and **EMS** systems for streamlined order processing and management.\nEngineered robust backend services in **Python** (using **FastAPI** and **Django**) and **C#**, optimizing for high availability and low latency, essential for a trading platform handling thousands of transactions per minute.\nDeveloped interactive frontend applications using **React** (version **18**), **Angular**, and **Vue.js**, focused on delivering seamless user experiences across web and mobile devices.\nLeveraged **SQL Server** and **Snowflake** for data warehousing and analytics, ensuring efficient data retrieval and reporting for trading activities, which supported decision-making processes with real-time insights.\nImplemented data visualization tools using **PowerBI** to present complex trading data and performance metrics to stakeholders, enhancing communication and collaboration within the team.\nIntegrated machine learning algorithms for predictive analytics in trading, using frameworks such as **AI** tools to improve market strategies and execution efficiency.\nDesigned data pipelines using **Databricks** for processing large datasets, ensuring rapid access to trading data and analytics for improved performance and adaptability.\nPromoted a culture of collaboration and communication across cross-functional teams, facilitating on-time project deliveries and fostering a dynamic engineering environment.\nApplied best practices for software development, employing agile methodologies to ensure projects met tight deadlines while maintaining high quality and adaptability to changing requirements."
    }
  ],
  "skills": " **Backend Frameworks:** \n\tPython(FastAPI, Flask, Django) \n **Frontend Frameworks:** \n\tJavaScript/TypeScript (React, Vue, Angular) \n **API Technologies:** \n\tAWS (ECS, Lambda, RDS, S3) \n **Serverless and Cloud Functions:** \n\tAWS \n **Databases:** \n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis, SQL Server, Snowflake \n **DevOps:** \n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose \n **Cloud & Infrastructure:** \n\tAzure (App Services, Blob, SQL) \n **Other:** \n\tCollaboration, Communication, Adaptability, OMS, EMS, C#, AI, PowerBI, Databricks",
  "apply_company": "Soros Fund Management"
}