{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior JavaScript Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Senior JavaScript Engineer with 13+ years of experience in delivering high-performance applications, adept in **JavaScript**, **Node.js**, **REST**, **SOAP**, and proficient in **SQL**, including **SQLite** and **PostgreSQL**. Expertise in building scalable solutions using **AWS Lambda**, **API Gateway**, and the **Serverless Framework**. Skilled in automated testing methodologies, ensuring robust and reliable applications.\nStrong problem-solving abilities and excellent communication skills enhance collaboration within teams and with stakeholders. Additionally, well-versed in both frontend and backend development with a solid foundation in **React**, **Next.js**, **Vue**, **FastAPI**, and **Django**. Proven experience in implementing AI/ML-powered platforms and deploying cloud-native systems, aligning with compliance standards like HIPAA and PCI DSS.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior JavaScript Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Leveraged **JavaScript** and **Node.js** to design and build scalable full-stack platforms, ensuring seamless integration with **REST** APIs and implementing robust data management using **PostgreSQL** and **SQLite**.\nUtilized automated testing frameworks to enhance code quality, developing tests that cover unit, integration, and API levels, resulting in a **30%** reduction in bug reports during the QA phase.\nImplemented serverless architectures using **AWS Lambda** and **API Gateway**, facilitating a cloud-native approach that improved deployment efficiency by **25%**.\nExecuted complex SQL queries to optimize data retrieval processes across client applications, improving response times for large datasets by **40%**.\nDrove B2B performance improvements by effectively communicating project updates and technical solutions, leading to a **50%** increase in client satisfaction scores.\nProvided problem-solving expertise to troubleshoot and resolve issues within legacy systems, transitioning them to modern architectures that uphold performance and reliability.\nCollaborated with cross-functional teams to enhance REST and SOAP API endpoints, delivering extensive documentation that improved client understanding and integration success rates.\nConducted code reviews and implemented best practices in coding and design patterns to maintain high standards of software engineering, contributing to a **20%** improvement in overall team productivity.\nDeveloped and maintained databases using **PostgreSQL**, enabling advanced analytics capabilities that supported business intelligence insights for stakeholders."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Utilized **JavaScript** and **Node.js** to enhance application performance and scalability, ensuring robust solutions in line with business requirements.\nDesigned and implemented RESTful APIs for seamless integration with front-end and third-party services, contributing to an improved user experience across B2B platforms.\nEngaged in automated testing practices to maintain high-quality code and minimize bugs, achieving a code coverage of over **90%**.\nOptimized front-end applications via **React (18)** and **Vue 3**, ensuring responsive design and seamless functionality for users accessing financial tools.\nManaged backend services with **SQL**, **PostgreSQL**, and **SQLite**, ensuring efficient data retrieval and storage, with focus on performance and reliability.\nFacilitated effective communication within cross-functional teams to troubleshoot and resolve challenges, leveraging strong problem-solving capabilities in high-stakes environments.\nStreamlined workflows through integration with **AWS Lambda** and **API Gateway**, enabling better API management and serverless architecture.\nParticipated in code reviews and collaborative development, focusing on continuous improvement and adherence to best practices in software engineering."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Leveraged **JavaScript**, **Node.js**, and **PostgreSQL** to design and optimize backend services for a global e-commerce platform, delivering high availability and scalability across key modules like checkout, cart, and order fulfillment.\nEngineered solutions for REST APIs and **SOAP** services to enhance interoperability, resulting in a **30%** improvement in integration efficiency across systems.\nImplemented **serverless architectures** using **AWS Lambda** and **API Gateway** to boost application performance, achieving a **50%** reduction in server costs.\nConducted comprehensive automated testing to ensure reliability and performance, driving a **25%** decrease in production bugs and enhancing user satisfaction.\nPromoted effective communication practices with cross-functional teams, resulting in streamlined project timelines and a **15%** increase in deployment frequency.\nUtilized **SQLite** and **SQL** for local development environments, optimizing database queries for efficient data retrieval and significantly reducing average response time.\nApplied robust problem-solving skills to identify bottlenecks and propose solutions in data access layers, leading to an overall improvement in application efficiency.\nDesigned intuitive and responsive user interfaces leveraging **Vue 3** and **Next.js**, focusing on user experience enhancements compatible with mobile devices.\n"
    }
  ],
  "skills": "**Programming Languages:**\n\tJavaScript, Python, TypeScript\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django, Node.js\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tREST, SOAP, AWS Lambda, API Gateway, Serverless Framework\n\n**Serverless and Cloud Functions:**\n\tAWS Lambda\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis, SQLite\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS: ECS, S3, RDS; Azure: App Services, Blob Storage, SQL Database\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), OAuth2, JWT, Nginx, Let’s Encrypt, Certbot, automated testing, B2B, problem-solving, communication",
  "apply_company": "Memtime"
}