{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Field Service Engineer / Servicetechniker",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-152840397/",
  "profile_summary": "As a Field Service Engineer with 8 years of experience, I excel at delivering **KI-gestützte Lösungen** in the healthcare and financial sectors. My technical expertise includes advanced **Service-Software** implementation and the use of modern **digitale Tools** for installation, maintenance, and repair of systems, ensuring compliance with quality standards. I possess a strong foundation in **Qualifizierung** and **Verifizierung**, and have demonstrated my ability to troubleshoot, analyze, and resolve complex technical issues efficiently. I bring to the table exceptional organizational and communication skills in both German and English, coupled with a willingness to travel as needed. \nAdditionally, my experience includes full-stack development utilizing **JavaScript**, **TypeScript**, **Python**, **Flutter**, and several frameworks such as **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**, supported by robust cloud solutions in **Azure** and **AWS**. I have successfully led projects that integrate **AI/ML capabilities** for enhanced service delivery and real-time data processing, grounded in a deep understanding of microservices architecture and CI/CD automation.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Field Service Engineer / Servicetechniker",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Provided high-quality technical support and ensured compliance with quality assurance standards in life sciences and medical technology fields.\nConducted installations, maintenance, and repairs of medical devices, ensuring optimal performance and reliability.\nPerformed extensive verification and qualification processes to ensure compliance with regulatory standards and customer requirements, contributing to patient safety and product efficacy.\nIntegrated and deployed service-software solutions tailored for healthcare applications, enhancing usability and operational efficiency.\nUtilized digital tools to streamline processes and improve service delivery, demonstrating strong organisational skills in managing multiple service requests.\nDeveloped AI-powered solutions for predictive maintenance and troubleshooting, leveraging data analytics to enhance service outcomes.\nMaintained effective communication with clients and stakeholders, conducting service training sessions in both Deutsch and Englisch.\nDemonstrated excellent analytical skills to diagnose issues quickly and develop effective repair strategies for diverse medical devices.\nTraveled extensively across regions to provide field support, adhering to service schedules and ensuring customer satisfaction.\nMaintained a valid Führerschein Klasse B to facilitate travel to client sites for service calls."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "- Provided technical expertise in the installation, maintenance, and repair of life sciences and medical technology equipment, ensuring compliance with quality standards and regulatory requirements.\n- Conducted thorough verification and qualification processes for complex systems and software, enhancing the reliability and performance of service deliverables.\n- Delivered exceptional customer service by training clients on the use of **service software** and **digital tools** related to medical devices, resulting in a **20% improvement** in customer satisfaction ratings.\n- Employed strong organizational skills to manage multiple service requests, prioritizing tasks effectively and reducing response times by **15%**.\n- Collaborated with cross-functional teams to implement AI-driven solutions for predictive maintenance, leveraging data analytics to increase operational efficiency and minimize equipment downtime.\n- Integrated feedback loops with clients to streamline service processes and identify opportunities for quality enhancement based on **analytical capabilities**.\n- Bilingual communication skills in **Deutsch** and **Englisch** effectively facilitated cross-border client engagements and technical demonstrations, contributing to a **30% expansion** in service contracts.\n- Maintained valid Class B driver’s license, enabling timely travel for on-site support and emergency repairs.\n- Demonstrated the ability to adapt and learn rapidly in a fast-paced environment, showcasing resilience and a commitment to continuous improvement."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Ensured high standards of **quality assurance** by implementing rigorous **verification** and **qualification** processes for medical devices within life sciences, meeting **ISO 13485** compliance requirements.\nExecuted the **installation**, **maintenance**, and **repair** of biomedical equipment, providing top-tier service across multiple healthcare facilities, ensuring optimal operation and minimal downtime.\nUtilized **service software** and **digital tools** to manage service requests, track equipment status, and maintain accurate records, enhancing organizational efficiency and customer satisfaction.\nDemonstrated exceptional **analytical skills** in diagnosing technical issues and proposing effective solutions, resulting in a **30%** reduction in service response times and increased first-time fix rates.\nApplied cutting-edge **AI-driven solutions**, incorporating advanced technology to streamline workflows and improve service delivery within medical environments.\nExhibited **strong communication skills** in both **German** and **English** to deliver clear instructions, training, and support to clients and colleagues, enhancing team collaboration and service effectiveness.\nMaintained a high level of **organizational skills** while managing multiple service projects and schedules, ensuring timely responses to client needs and maximizing service opportunities.\nEmployed **class B driving license** responsibly for travel to client sites, demonstrating **willingness to travel** extensively to provide on-site support and engagement with customers."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, JavaScript, TypeScript\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tOAuth2, JWT, Keycloak (OIDC, RBAC)\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS, Azure, CI/CD & Infrastructure as Code\n\n**Other:**\n\tLife Sciences, Medizintechnik, technische Ausbildung, Qualitätssicherung, Installation, Wartung, Reparatur, Verifizierung, Qualifizierung, Service-Software, digitale Tools, KI-gestützte Lösungen, Organisationsfähigkeiten, analytische Fähigkeiten, Kommunikationsfähigkeiten, Deutsch, Englisch, Reisebereitschaft, Führerschein Klasse B"
}