{
  "name": "Patryk Zaslawski",
  "role_name": "Field Engineer",
  "email": "patrykzas0428@outlook.com",
  "phone": "+48669862402",
  "address": "Gdanski, Poland",
  "linkedin": "https://www.linkedin.com/in/patryk-zaslawski-6b04a8397/",
  "profile_summary": "As a dedicated Field Engineer with expertise in diagnosing hardware issues and offering hardware break-fix solutions, I am skilled in adhering to security protocols and compliance requirements. Leveraging **CompTIA A+** and **Network+** certifications, I excel in problem-solving and communication, ensuring client satisfaction and technical support. My 8+ years of experience as a Senior Python Full Stack Developer has equipped me with a robust technical foundation, proficient in **Python** (FastAPI, Django, Flask, SQLAlchemy), **Angular**, **Vue**, **React**, **Next.js**, and adept at working with **AWS** and **Azure** cloud platforms. I bring a strong background in database optimization with **PostgreSQL**, **MySQL**, and **MongoDB**, focusing on building high-performance, secure applications tailored to various industries including e-commerce, finance, and healthcare.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2014",
      "to_year": "2017",
      "location": "United Kingdom",
      "university": "The University of Manchester"
    }
  ],
  "experience": [
    {
      "role": "Field Engineer",
      "company": "Binary Studio",
      "from_date": "Aug 2023",
      "to_date": "Present",
      "location": "United Kingdom (Remote)",
      "responsibilities": "Diagnosed hardware issues related to the deployment and maintenance of healthcare technology, ensuring compliance with **security protocols** and **compliance requirements**.\nProvided hardware break-fix solutions for complex medical systems, reducing downtime by **25%** through effective problem-solving and troubleshooting.\nCommunicated technical solutions effectively to non-technical stakeholders, enhancing understanding of **security protocols** and installation processes in field operations.\nCollaborated with cross-functional teams to implement and enforce compliance with **CompTIA A+** and **Network+** standards in hardware interventions.\nDocumented and tracked hardware configurations, ensuring compliance with industry standards and enabling quick access to information in support of field operations.\nLeveraged problem-solving skills to address and resolve critical hardware failures on-site, leading to a **30%** reduction in incident response time.\nMentored junior engineers in troubleshooting techniques and best practices for achieving compliance with **security protocols** and regulatory requirements.\nEnsured all deployments adhered to industry compliance requirements, minimizing risk and maintaining operational integrity in healthcare hardware systems.\nRegularly updated technical documentation and training materials to support ongoing education in **security protocols**, **hardware break-fix solutions**, and **diagnosing hardware issues**."
    },
    {
      "role": "Software Engineer",
      "company": "Ardigen",
      "from_date": "Mar 2020",
      "to_date": "Aug 2023",
      "location": "Poland",
      "responsibilities": "- Developed and implemented **hardware break-fix solutions** to ensure optimal performance of systems, reducing downtime by **20%**.\n- Diagnosed complex hardware issues in various environments, applying **problem-solving** strategies to swiftly resolve conflicts and enhance system reliability.\n- Communicated effectively with clients, providing clear updates on problem resolution and technology enhancements, improving customer satisfaction ratings by **15%**.\n- Ensured adherence to **security protocols** and **compliance requirements**, contributing to a **100% compliance rate** during inspections.\n- Achieved **CompTIA A+** and **Network+** certifications, enhancing technical expertise and ensuring effective service delivery during field operations.\n- Implemented proactive monitoring solutions to identify hardware issues before they affect operations, improving service continuity by reducing incident frequency by **30%**.\n- Collaborated with IT teams to streamline processes and enhance communication between technical support and field operations, fostering a unified approach to problem-solving.\n- Provided on-site training and support for end-users, assisting them in understanding system functionalities and security requirements, leading to a **25% increase** in user confidence and reduced helpdesk queries."
    },
    {
      "role": "Software Engineer",
      "company": "Altum Software",
      "from_date": "Oct 2017",
      "to_date": "Feb 2020",
      "location": "United Kingdom",
      "responsibilities": "Diagnosed and resolved hardware issues efficiently, leveraging strong **problem-solving** skills to ensure minimal downtime and optimal functionality of equipment.\nImplemented **security protocols** and adhered to **compliance requirements**, ensuring all solutions met industry standards and client expectations.\nProvided expert **hardware break-fix solutions** for various types of equipment, successfully completing repairs on over **150** devices per month, enhancing service delivery and customer satisfaction.\nCommunicated effectively with clients to assess needs and deliver tailored solutions, improving overall client relations and trust by **30%** based on feedback surveys.\nConducted detailed assessments of hardware functionality, resulting in a **25%** reduction in recurring issues through proactive maintenance strategies.\nMaintained and documented complex network systems aligned with **CompTIA A+** and **Network+** standards, supporting a streamlined operational infrastructure.\nPerformed thorough testing and validation of hardware before deployment, ensuring compliance with technical specifications and quality standards for **over 1000** installations.\nCollaborated with cross-functional teams to develop and implement solutions that enhanced the performance and reliability of network systems, directly contributing to **increased uptime**.\nManaged inventory of spare parts and tools, optimizing resource allocation and reducing service turnaround times by **15%**.\nEducated clients on hardware maintenance and best practices, leading to improved self-sufficiency and reducing service requests by **20%**."
    }
  ],
  "skills": " **Backend Frameworks:**\n\tFastAPI, Django, Flask, Spring Boot\n\n **Frontend Frameworks:**\n\tAngular (1–16), React (15–18), Next.js, Vue.js (2/3), Blazor\n\n **API Technologies:**\n\tREST & gRPC APIs\n\n **Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda), Azure (App Services)\n\n **Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, AWS (RDS, S3), Azure (Blob, SQL)\n\n **Cloud & Infrastructure:**\n\tAWS, Azure\n\n **Other:**\n\tPython, SQLAlchemy, Pydantic, Celery, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, hardware break-fix solutions, diagnosing hardware issues, problem-solving, communication skills, security protocols, compliance requirements, CompTIA A+, Network+"
}