{
  "name": "Tomasz Lee",
  "role_name": "Machine Learning Specialist",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-477994390/",
  "profile_summary": "Results-driven Machine Learning Specialist with over 9 years of experience in Data Science, specializing in Machine Learning techniques including Supervised Learning, Unsupervised Learning, Deep Learning, and Reinforcement Learning. Proficient in **Python** and various **ML frameworks** to build and deploy machine learning models. Experienced in **cloud-based workflows** for scalable solutions, and skilled in optimizing workflows and debugging complex algorithms. Strong background in Natural Language Processing and Probabilistic Modeling, combined with exceptional communication skills, enabling effective collaboration across teams. Proven track record of delivering robust data-driven solutions and evaluating data efficiently.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Machine Learning Specialist",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Apr 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Applied **Machine Learning** techniques to enhance customer data analysis and improve decision-making processes.\nUtilized **Natural Language Processing** for text analysis, helping to derive insights from user-generated content.\nImplemented **Supervised Learning** and **Unsupervised Learning** models, achieving a predictive accuracy improvement of **30%**.\nDeveloped deep learning models using **Python** and relevant **ML Frameworks**, leading to optimized algorithms with enhanced performance metrics.\nLeveraged cloud-based workflows to deploy ML models, resulting in a **50%** reduction in model training time.\nEngaged in the **Data Science** lifecycle, from data evaluation and preprocessing to model deployment and monitoring, ensuring high-quality outputs.\nPerformed debugging for various ML algorithms, increasing the reliability of predictions by **25%**.\nCommunicated findings and model results to stakeholders with effective presentations, enhancing data-driven decision-making.\nCollaborated in a multidisciplinary team to integrate ML solutions into existing systems, promoting cross-functional knowledge sharing and increasing team efficiency.\nConducted probabilistic modeling for uncertainty quantification in predictions, significantly driving model trustworthiness."
    },
    {
      "role": "Full Stack Developer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "Utilized **Python** and various **ML Frameworks** to develop and implement machine learning models, enhancing predictive accuracy by **20%**.\nApplied **Supervised Learning**, **Unsupervised Learning**, and **Deep Learning** techniques in projects, leading to a **30%** increase in model performance over previous benchmarks.\nDeveloped and implemented workflows for **Cloud-based Workflows**, optimizing data processing and reducing latency by **15%**.\nConducted rigorous **Data Evaluation** to validate model effectiveness and improve decision-making accuracy.\nCollaborated with cross-functional teams to define project requirements and timelines, ensuring clear communication and successful project execution.\nDocumented and presented machine learning insights and results, reinforcing **Communication Skills** to effectively convey complex concepts.\nParticipated in debugging sessions to troubleshoot and refine algorithms, thus enhancing overall workflow efficiency.\nIntegrated **Probabilistic Modeling** techniques to inform dataset accuracy and broaden analysis capabilities.\nMentored junior team members in machine learning principles and practices, fostering a collaborative and knowledgeable team environment."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "Leveraged **Python** and various **ML Frameworks** to implement Machine Learning algorithms, significantly enhancing data processing capabilities.\nUtilized Natural Language Processing techniques to analyze and interpret data, achieving a 15% increase in predictive accuracy in customer insights.\nDeveloped and optimized complex **supervised** and **unsupervised learning** models, successfully reducing the processing time by **30%**.\nExecuted reinforcement learning strategies to improve model performance, yielding a **25%** improvement in real-time decision making.\nConducted probabilistic modeling and data evaluation to assess the effectiveness of algorithms, ensuring reliability and validity of results.\nCollaborated with other teams to integrate machine learning solutions into **cloud-based workflows**, enhancing scalability and efficiency.\nMaintained rigorous debugging protocols to address and resolve model performance issues, resulting in an overall system stability increase.\nPresented findings and insights with effective communication skills, enabling better understanding and collaboration across cross-functional teams.\nEngaged in continuous learning to stay updated on the latest trends in Data Science and Deep Learning, applying new techniques to enhance existing models.\nProduced detailed technical documentation for machine learning processes, facilitating knowledge transfer and comprehension among stakeholders."
    }
  ],
  "skills": " **Programming Languages**\n\t Python, JavaScript, TypeScript\n\n **Backend Frameworks**\n\t NodeJS, ExpressJS, NestJS, C#, .NET, Entity Framework, Microservices\n\n **Frontend Frameworks**\n\t ReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n **API Technologies**\n\t RESTful API, GraphQL\n\n **Serverless and Cloud Functions**\n\t AWS, Azure\n\n **Databases**\n\t MSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB\n\n **DevOps**\n\t CI/CD pipelines\n\n **Cloud & Infrastructure**\n\t Cloud-based Workflows\n\n **Machine Learning & Data Science**\n\t Machine Learning, Natural Language Processing, Data Science, Supervised Learning, Unsupervised Learning, Deep Learning, Reinforcement Learning, Probabilistic Modeling, Data Evaluation, Optimizing Workflows\n\n **Other**\n\t UX/UI Design, Git, GitHub, Messaging & Caching: Apache Kafka, RabbitMQ, Redis, Testing Tools: NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest, Blockchain: Solidity, Ether.js, Web3.js, Ethereum, Communication Skills, Debugging"
}