{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Frontend Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Results-driven Senior Frontend Engineer with over 13 years of experience in mobile and cross-platform development, specializing in **TypeScript**, **React Native**, and **WebAuthn**. Demonstrated expertise in designing and implementing secure authentication solutions and improving user experiences (UX) in fintech applications. Strong background in clean architecture and proficient in creating scalable SDKs tailored to user needs.\nSkilled in both frontend and backend frameworks, including **React**, **Node.js**, and **Django**, with an emphasis on collaboration across teams to deliver high-performance applications within compliance regulations. Highly competent in developing AI/ML features for enhanced automation and predictive analytics, and experienced in deploying cloud solutions using **AWS** and **Azure**.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Frontend Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Developed cross-platform mobile applications using **TypeScript**, **ReactNative**, and native SDKs, ensuring optimal user experience and secure authentication within the fintech domain.\n- Implemented clean architecture principles while delivering scalable mobile development solutions that prioritize UX for ease of use and accessibility.\n- Collaborated with cross-functional teams to integrate secure authentication methods, adhering to industry standards for financial applications.\n- Utilized **React** (version **17-18**) and **Next.js** to create responsive and interactive user interfaces for web applications, enhancing user engagement.\n- Conducted detailed assessments of mobile development frameworks, resulting in the adoption of best practices that improved application performance by **30%**.\n- Engaged in regular code reviews, promoting a collaborative environment that contributed to the continuous improvement of mobile applications.\n- Developed comprehensive documentation and user guides for complex functionalities, facilitating effective onboarding and user support.\n- Continuously monitored and optimized application performance using analytics tools, resulting in a **25%** reduction in load times and improved overall responsiveness.\n- Designed robust testing strategies with frameworks like **Jest** and **Cypress**, achieving **100%** coverage on unit and integration tests for critical components.\n- Participated in Agile ceremonies, collaborating closely with product managers and UX designers to align product expectations with frontend deliverables."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "- Developed interactive front-end applications using **TypeScript** and **React** (17/18), enhancing user interfaces in the fintech sector focused on secure authentication and UX best practices.\n- Collaborated on cross-platform mobile development projects using **ReactNative**, ensuring a seamless user experience and effective SDK integration.\n- Implemented secure authentication strategies, utilizing **WebAuthn**, to enhance the security and reliability of applications in compliance with fintech standards.\n- Designed and maintained clean architecture principles, improving code quality and collaboration across teams in developing robust financial applications.\n- Engaged in agile team collaboration, delivering features in sprints which increased deployment efficiency by **30%**.\n- Demonstrated proficiency in delivering high-quality mobile and web solutions, underscoring a commitment to best practices in both domains, leading to a **25%** reduction in bug occurrence post-deployment.\n- Actively participated in code reviews and team meetings to foster a culture of collaboration and continuous improvement, mentoring junior developers in both secure development practices and UI/UX principles."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Developed responsive, SEO-friendly UI components and applications using **React** (18) and **TypeScript**, ensuring a seamless user experience on both web and mobile platforms.\nEngineered mobile applications with **ReactNative**, applying **clean architecture** principles and enhancing UX through effective collaboration with design teams.\nImplemented secure authentication mechanisms utilizing **WebAuthn**, ensuring the highest standards for user data protection and compliance in fintech applications.\nDesigned and developed secure cross-platform functionalities, leveraging SDKs to streamline development processes and improve code maintainability across various platforms.\nCollaborated with backend teams to create efficient APIs, focusing on responsiveness and performance while adhering to best practices in **cross-platform development**.\nApplied optimization techniques and conducted usability testing to enhance user engagement and satisfaction metrics by over **30%**.\nEngaged in regular code reviews and agile methodologies, leading to a **25%** improvement in development cycle time and increased overall team productivity.\nParticipated in the architectural planning for scalable applications, incorporating user feedback and analytics to guide technical decisions."
    }
  ],
  "skills": "****Programming Languages****\n\tPython\n\tTypeScript\n\n****Frontend Frameworks****\n\tReact\n\tReactNative\n\tVue\n\tAngular\n\n****Backend Frameworks****\n\tFastAPI\n\tFlask\n\tDjango\n\n****API Technologies****\n\tWebAuthn\n\n****Serverless and Cloud Functions****\n\tAWS: Lambda\n\n****Databases****\n\tPostgreSQL\n\tMySQL\n\tMongoDB\n\tRedis\n\n****DevOps****\n\tDocker\n\tKubernetes\n\tGitHub Actions\n\tGitLab CI/CD\n\n****Cloud & Infrastructure****\n\tAWS: ECS, RDS, S3\n\tAzure: App Services, Blob Storage, SQL Database\n\tTerraform\n\tAnsible\n\tHelm\n\tDocker Compose\n\n****Other****\n\tMLflow\n\tAirflow\n\tKubeflow\n\tauthentication & security (Keycloak, OAuth2, JWT)\n\tNginx\n\tLet’s Encrypt\n\tCertbot\n\tcollaboration\n\tmobile development\n\tcross-platform development\n\tSDKs\n\tUX\n\tfintech\n\tclean architecture\n\tsecure authentication",
  "apply_company": "Career Renew"
}