{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Site Reliability Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-kotlinski-08ba40390/",
  "profile_summary": "As an accomplished Site Reliability Engineer with 8 years of experience, I excel in CI/CD automation, utilizing **GitHub Actions** and **Azure DevOps** to ensure reliable software delivery. My technical expertise encompasses **Infrastructure-as-Code** using **Terraform**, **Azure Bicep**, and **ARM Templates**, enabling efficient deployment and management of cloud infrastructure on **Azure** and **VMware vSphere**. I bring strong skills in **Linux**, **PowerShell**, and **Bash** for robust system administration across Windows and macOS environments. \nI have a proven track record of optimizing operational performance through deep insights from **Azure Monitor** and **Log Analytics**, while adhering to best practices in **Git workflows**. My background in mentoring teams enhances effectiveness and fosters a culture of problem-solving and communication. Additionally, I leverage my experience in full-stack development with **React**, **Node.js**, and **Python** to bridge gaps between development and operations, driving innovations in infrastructure stability and application reliability.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Site Reliability Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Implemented CI/CD pipelines using **GitHub Actions**, **Azure DevOps**, and **CircleCI**, enhancing deployment efficiency by **35%** and ensuring consistent delivery across environments.\n- Developed Infrastructure-as-Code solutions using **Terraform** and **Azure Bicep**, automating provisioning processes and reducing setup time by **60%**.\n- Monitored system health and performance by leveraging **Azure Monitor** and **Log Analytics**, proactively identifying and resolving issues to maintain a **99.9% uptime** for production services.\n- Mentored junior engineers on **Linux** server management and **Windows** administration, fostering skill development and fostering a collaborative team culture.\n- Enabled cross-platform compatibility and streamlined operations through **PowerShell** and **Bash** scripting, enhancing system automation and workflows.\n- Conducted comprehensive problem-solving sessions and enhanced communication among cross-functional teams to improve system reliability and incident response.\n- Successfully collaborated with application teams to integrate **VMware vSphere** for efficient virtualized infrastructure management, improving server utilization by **40%**.\n- Designed and maintained fault-tolerant systems by implementing backup, recovery, and failover strategies, ensuring data integrity and accessibility in high-demand environments."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "• Implemented **CI/CD** pipelines using **Azure DevOps** and **GitHub Actions** to automate deployment processes, reducing deployment time by **30%** and increasing release frequency by **20%**.\n• Managed infrastructure using **Infrastructure-as-Code** tools including **Terraform**, **Azure Bicep**, and **ARM Templates**, ensuring reproducibility and scalability of cloud resources in **Azure IaaS** and **Azure PaaS** environments.\n• Administered and optimized **Linux** and **Windows** servers along with **macOS** systems, achieving a system uptime of **99.9%** through effective monitoring and maintenance strategies with **Azure Monitor** and **Log Analytics**.\n• Developed and maintained scalable networking and virtualization solutions using **VMware vSphere**, leading to improved resource utilization and reduced costs by **15%**.\n• Utilized **PowerShell** and **Bash** scripting for automating system administration tasks, increasing operational efficiency and reducing workload on support teams.\n• Mentored junior engineers in best practices for **Git workflows** and infrastructure management, fostering a culture of collaboration and continual learning.\n• Collaborated with cross-functional teams to solve complex technical challenges and improve system reliability, leveraging strong **communication skills** and advanced **problem-solving** abilities."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Implemented CI/CD pipelines using **Azure DevOps** and **GitHub Actions** to automate deployment processes, enhancing deployment frequency by **30%** and reducing rollback incidents by **15%**.\nManaged infrastructure using **Infrastructure-as-Code** tools including **Terraform**, **Azure Bicep**, and **ARM Templates**, ensuring consistent and reproducible environments across all stages of development.\nMonitored system performance and health metrics using **Azure Monitor** and **Log Analytics**, identifying and resolving critical issues with a **98%** incident resolution rate within service level objectives.\nDeveloped and maintained Windows and macOS environments, ensuring efficient updates and security configurations using **PowerShell** and **Bash** scripts, improving system uptime by **25%**.\nMentored junior engineers on best practices in system reliability and incident response, fostering a culture of innovation and continuous improvement within the team.\nImplemented robust backup and disaster recovery plans for **Azure IaaS** and **PaaS** environments, enhancing data protection strategies and ensuring recovery time objectives (RTO) align with business needs.\nUtilized **VMware vSphere** for virtual machine management, optimizing resource allocation and cost efficiency in cloud deployments.\nFacilitated effective communication across teams for project updates, ensuring alignment with business objectives and enhancing cross-functional collaboration.\nEmphasized problem-solving skills to analyze and mitigate system inefficiencies, resulting in improved workflow and increased service reliability."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, JavaScript/TypeScript \n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\t\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, CI/CD, Infrastructure as Code (Terraform, Ansible, Helm, Docker Compose)\n\n**Cloud & Infrastructure:**\n\tAzure DevOps, Azure Bicep, ARM Templates, Packer, Azure IaaS, Azure PaaS, VMware vSphere, Azure Monitor, Log Analytics, PowerShell, Bash, Windows administration, macOS administration\n\n**Other:**\n\tMentoring, Problem-solving, Communication skills, MLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, Git workflows"
}