{
  "name": "Patryk Zaslawski",
  "role_name": "DEFI Front End Engineer",
  "email": "patrykzas0428@outlook.com",
  "phone": "+48669862402",
  "address": "Gdanski, Poland",
  "linkedin": "https://www.linkedin.com/in/patryk-zaslawski-6b04a8397/",
  "profile_summary": "Experienced DEFI Front End Engineer with 8+ years in software engineering, adept at building responsive Single Page Applications (SPAs) and leveraging **Typescript**, **React**, and **Vue.js** for dynamic user interfaces. Skilled in **Web3** technologies, including **Solidity** and Smart Contracts, I deliver seamless integrations that enhance decentralized financial solutions. Proficient in data management and server architecture, I ensure high-performance applications within the DEFI space. My background in **Python** (FastAPI, Django, Flask, SQLAlchemy) brings a strong foundation in backend development, complemented by experience in cloud services like **AWS** and **Azure**. With proven communication skills, autonomy, and creativity, I excel at tackling complex projects aligned with best practices.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2014",
      "to_year": "2017",
      "location": "United Kingdom",
      "university": "The University of Manchester"
    }
  ],
  "experience": [
    {
      "role": "DEFI Front End Engineer",
      "company": "Binary Studio",
      "from_date": "Aug 2023",
      "to_date": "Present",
      "location": "United Kingdom (Remote)",
      "responsibilities": "Developed responsive single-page applications (SPA) using **React**, **Vue.js**, and **Typescript**, ensuring an intuitive user experience for healthcare and financial platforms.\nImplemented smart contracts and DEFI solutions, leveraging **Solidity** to facilitate secure transactions and enhance functionality on blockchain networks.\nLed the architectural design of client-side server architecture, enhancing data management and retrieval processes, optimizing performance and scalability.\nUtilized **GitHub** for version control, enabling efficient collaboration and deployment of code across multiple projects and teams.\nDemonstrated strong communication skills while collaborating with cross-functional teams to gather requirements, conceptualize innovative solutions, and build user-centric applications.\nInstilled a high level of autonomy within the team, fostering an environment of creativity for generating new ideas and approaches to problem-solving in software development.\nEnhanced existing applications by integrating third-party APIs and services, improving the application's capabilities and user engagement metrics by **25%**.\nCollaborated closely with UI/UX designers to implement responsive web designs that meet accessibility standards and provide a seamless user experience on various devices.\nOptimized application performance and loading times by implementing efficient state management through **Redux** and **NgRx**, reducing response times by **30%**.\nMentored junior developers on best practices in **Typescript**, fostering a culture of continuous learning and knowledge sharing within the development team.\nConducted performance testing and optimization using tools such as **Apache JMeter** and **k6**, ensuring high availability and reliability of the application under peak loads.\nEngaged in continuous integration and deployment practices, leading to a **40%** reduction in deployment times and improved delivery cycles."
    },
    {
      "role": "Software Engineer",
      "company": "Ardigen",
      "from_date": "Mar 2020",
      "to_date": "Aug 2023",
      "location": "Poland",
      "responsibilities": "• Developed responsive web applications using **React**, **Vue.js**, and **Typescript** to create dynamic, user-centric interfaces and enhance user engagement.\n• Designed and implemented Single Page Applications (SPAs) with a focus on performance and responsiveness, utilizing best practices in **responsive web design**.\n• Collaborated on smart contract integration and **Web3** functionalities, ensuring seamless interaction with blockchain platforms and decentralized finance (DEFI) solutions.\n• Applied creativity and autonomy to deliver innovative features that meet user needs and project requirements within a fast-paced development cycle.\n• Maintained robust version control using **GitHub**, streamlining code management and collaboration across the development team.\n• Enhanced communication skills by actively engaging with cross-functional teams to gather requirements and provide updates on project progress.\n• Applied principles of effective data management in application development to ensure smooth handling of user data and interactions.\n• Documented development processes and created comprehensive API specifications to facilitate understanding and onboarding for future developers.\n• Contributed to the overall architecture of the client-side server environment to support scalable and efficient application delivery, reducing load times by **30%**.\n• Participated in code reviews and offered constructive feedback to enhance code quality and team collaboration, leveraging tools like **Selenium** for automated testing validation."
    },
    {
      "role": "Software Engineer",
      "company": "Altum Software",
      "from_date": "Oct 2017",
      "to_date": "Feb 2020",
      "location": "United Kingdom",
      "responsibilities": "Leveraged **Typescript** within **React** and **Vue.js** to develop responsive, user-centric frontends for decentralized finance (DEFI) applications, maximizing cross-device accessibility and user engagement.\nDesigned and implemented single-page applications (SPAs) enhancing user experience by focusing on responsive web design principles, leading to a **30%** increase in user satisfaction scores.\nUtilized **Web3** technologies for seamless interaction with **Smart Contracts**, ensuring secure and efficient transactions within the DEFI ecosystem.\nManaged data effectively by integrating sophisticated data management strategies, improving data retrieval times by **40%** via optimized state management solutions in **React** and **Vue** applications.\nCollaborated with cross-functional teams, demonstrating strong communication skills, to align frontend designs with backend service architectures, resulting in a streamlined development process.\nApplied **GitHub** for version control, enabling collaborative and autonomous development workflows while reducing code conflicts by **25%**.\nExercised creativity in designing innovative user interfaces and experiences, integrating DEFI functionalities like token swaps and liquidity pools to enhance application usability.\nConducted thorough testing of front-end functionalities using automated testing frameworks to maintain high-quality code standards.\nImplemented responsive design techniques and developed SEO-optimized web pages, leading to a significant boost in search engine visibility and user acquisition by **15%**.\nPlayed a pivotal role in ensuring application stability and performance by participating in load testing and stress testing, simulating real-world scenarios to identify bottlenecks and optimize performance.\nEngaged in continuous learning and adaptation of emerging **DEFI** technologies, ensuring cutting-edge solutions are integrated into frontend developments."
    }
  ],
  "skills": "****Programming Languages****\n\tPython, Typescript\n\n****Backend Frameworks****\n\tFastAPI, Django, Flask, Spring Boot\n\n****Frontend Frameworks****\n\tReact (15–18), Angular (1–16), Next.js, Vue.js (2/3)\n\n****API Technologies****\n\tREST & gRPC APIs\n\n****Serverless and Cloud Functions****\n\tAWS (Lambda), Azure\n\n****Databases****\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n****DevOps****\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD\n\n****Cloud & Infrastructure****\n\tAWS (ECS, RDS, S3), Azure (App Services, Blob, SQL)\n\n****Other****\n\tPydantic, Celery, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, Web3, DEFI, Smart Contracts, Responsive Web Design, Single Page Applications (SPAs), Solidity, Data Management, Server Architecture, GitHub, Communication Skills, Autonomy, Creativity"
}