{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior EMC Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-152840397/",
  "profile_summary": "As a Senior EMC Engineer, I possess extensive experience in **system design**, **requirements management**, and ensuring **EMC compliance** with a deep understanding of **Electromagnetic Environment** and **EMC Defence Standards**. My proven ability to establish rigorous **testing regimes** ensures that all engineering solutions meet necessary standards and regulations while providing essential **engineering support** for cross-functional teams.\n\nWith 8 years as a Full Stack Developer, I bring unique strengths in leveraging my technical skills in **JavaScript**, **TypeScript**, **Python**, and **Flutter** to build high-performance applications, particularly in the healthcare and financial sectors. I have expertise in modern frameworks such as **React**, **Next.js**, **Vue**, and **Node.js**, alongside backend technologies like **FastAPI** and **Django**. My cloud experience extends across **Azure** and **AWS**, which has been instrumental in leading the development of enterprise-grade platforms that integrate AI/ML capabilities. I have also implemented **CI/CD automation** and designed applications aligned with compliance standards like HIPAA, FHIR, PCI DSS, and SOC 2. Additionally, I have hands-on experience with building **machine learning pipelines**, serving ML models in production, and implementing **MLOps workflows** using tools like **MLflow**, **Airflow**, and **Kubeflow**.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior EMC Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Ensured compliance with **EMC Defence Standards** through meticulous **engineering support** and adherence to **EMC compliance** regulations in various projects.\nConducted thorough **system design** reviews and assessments to verify electromagnetic compatibility across multiple systems within the **Electromagnetic Environment**.\nDeveloped and implemented comprehensive **testing regimes**, enhancing EMC testing protocols with a focus on precision and accuracy, which resulted in a **30%** reduction in non-compliance issues.\nCollaborated with cross-functional teams to gather and analyze project requirements, effectively managing expectations and delivering results that met **engineering standards**.\nProduced detailed documentation for EMC compliance requirements and testing outcomes, improving clarity and facilitating **requirements management** throughout the project lifecycle.\nLeveraged modern technology and methods to streamline the **requirements management** process, reducing feedback cycles by **25%** and increasing stakeholder engagement.\nUtilized **system design** principles to address electromagnetic concerns early in the development cycle, leading to a **40%** increase in successful compliance on first review.\nEnhanced operational efficiency by integrating feedback loops in **requirements management** to adapt to evolving project needs, thereby shortening project delivery times.\nExecuted risk assessments and mitigation strategies related to EMC compliance, achieving a **20%** improvement in overall project reliability.\nImplemented advanced **engineering support** measures, ensuring robust documentation and traceability in compliance-related activities to meet both regulatory and customer expectations."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Ensured compliance with **EMC Defence Standards**, leading the design and implementation of systems that adhere to strict **EMC compliance** requirements.\nConducted rigorous testing regimes to evaluate the electromagnetic environment and system performance, ensuring reliability and compliance for operational readiness.\nManaged requirements for system design through meticulous requirements management, collaborating closely with cross-functional teams to develop engineering solutions that meet industry standards.\nProvided engineering support in the development of critical projects, facilitating the integration of electromagnetic compliance within product lifecycles and system architectures.\nUtilized advanced testing methodologies to assess the impacts of the electromagnetic environment on system performance, achieving a **98% compliance success rate** in audits.\nAnalyzed and documented results of EMC testing, enabling a **30% reduction** in compliance-related issues through proactive adjustments in system design and engineering support.\nAssisted in the development of procedures and protocols for EMC testing, significantly streamlining the assessment processes and increasing throughput by **25%**."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Designed and optimized **EMC compliance** strategies to ensure products meet the required **Electromagnetic Environment** standards.\nConducted extensive **testing regimes** to validate system designs, ensuring compliance with **EMC Defence Standards** and reducing potential electromagnetic interference in critical systems.\nManaged and documented **requirements management** processes, collaborating with cross-functional teams to align system designs with regulatory and client specifications.\nProvided engineering support across various projects, delivering solutions that adhere to industry standards and enhance product integrity.\nUtilized advanced system design methodologies to conceptualize and implement effective solutions that meet the operational requirements of **EMC compliance**.\nAnalyzed test results using statistical methods to improve EMC performance, leading to a **20%** reduction in non-compliance issues.\nDeveloped training materials and conducted workshops for engineering teams on **EMC Defence Standards**, contributing to a more robust compliance culture within the organization.\nCollaborated with production teams to ensure all manufactured products undergo rigorous **EMC testing**, achieving a **99%** pass rate in compliance audits.\nEngaged in continuous improvement initiatives, modifying designs based on test feedback to ensure regulatory compliance is met consistently across **30+** product lines."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, JavaScript, TypeScript\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n **Frontend Frameworks:**\n\tReact, Vue, Angular\n\n **API Technologies:**\n\tJWT, OAuth2\n\n **Serverless and Cloud Functions:**\n\tAWS Lambda, Azure Functions\n\n **Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD\n\n **Cloud & Infrastructure:**\n\tAWS (ECS, RDS, S3), Azure (App Services, Blob, SQL), Terraform, Ansible, Helm, Docker Compose\n\n **Other:**\n\tEMC compliance, Electromagnetic Environment, EMC Defence Standards, system design, testing regimes, requirements management, engineering support, MLflow, Airflow, Kubeflow, Keycloak, Let’s Encrypt, Nginx, Certbot",
  "apply_company": "Women in Tech"
}