{
  "name": "Damian Franciszek Pospiech",
  "role_name": "QA Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-187801395/",
  "profile_summary": "QA Engineer with 13+ years of comprehensive experience in delivering high-quality applications, specializing in test automation and Quality Assurance methodologies. Proficient in **JavaScript**, **TypeScript**, and **Python**, with a strong background in functional testing, regression testing, integration testing, and API testing. Experienced in utilizing defect-tracking tools to ensure thorough quality analysis and streamline the software development lifecycle (SDLC) processes.\nDemonstrated expertise in deploying testing strategies for AI/ML-powered platforms, ensuring compliance with key standards. Skilled in utilizing **automation tools** to enhance testing efficiency and achieve faster release cycles. Familiar with Agile and Scrum methodologies, and proficient in load testing and stress testing to optimize application performance. Additionally, have worked with technologies such as **Golang** and **Blockchain technology**, ensuring robust, high-performance systems.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "QA Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Executed rigorous **test automation** strategies to ensure seamless functionality across multiple platforms, utilizing tools such as **Jest** and **Cypress** for automated testing processes.\nConducted **API testing** to validate integration points and data exchange between services, leveraging tools like **Postman** to facilitate accurate and functional results.\nPerformed comprehensive **functional testing**, **regression testing**, and **integration testing** to confirm end-to-end system performance and reliability, ensuring all updates adhered to **Quality Assurance methodologies**.\nImplemented load and stress testing frameworks to evaluate system thresholds and performance under concurrent user loads, ensuring robust scalability and resilience against potential defects.\nParticipated actively in the SDLC, collaborating in **Agile** and **Scrum** environments to enhance team communication and project efficiency, ensuring product quality from development through release.\nMonitored and reported defects through effective use of **defect-tracking tools**, facilitating swift resolution and contributing to overall product stability.\nSupported CI/CD pipelines incorporating **automation tools** like **GitHub Actions** and **CircleCI**, aimed at reducing deployment times and enhancing testing capabilities through continuous integration practices.\nLeveraged **JavaScript** and **TypeScript** to contribute to automation scripts, improving testing workflow while enhancing overall code quality and maintainability.\nUtilized **Python** for various internal testing tools, streamlining the testing processes and making them more efficient.\nPioneered the testing of innovative features like blockchain implementations to ensure they met security standards and functional requirements.\nIntegrated best practices in testing throughout the project lifecycle, ensuring a proactive approach to quality management, and identifying improvements based on testing feedback and regression analysis."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Implemented **Quality Assurance methodologies** throughout the **SDLC** process, ensuring adherence to industry standards for software quality in high-traffic financial applications.\nExecuted comprehensive **functional testing**, **regression testing**, and **integration testing** on microservices architectures built with **Node.js (NestJS/Express)** and **Python (FastAPI, Django)**, achieving a **99% defect-free** deliverable rate.\nUtilized **test automation** tools to streamline testing processes, enhancing the efficiency of test execution by up to **40%** and reducing manual intervention.\nConducted **API testing** and performance evaluations on key financial interfaces, resulting in optimized response times with an improvement of **30%** under peak loads.\nParticipated in Agile and Scrum methodologies, effectively collaborating within cross-functional teams to achieve project milestones within **2-week sprints**.\nDeveloped and executed **load testing** and **stress testing** scenarios to validate system capacities against expected transaction volumes, employing scripts in **JavaScript** and **Golang** to simulate user interactions.\nPromoted the use of **defect-tracking tools** to monitor, document, and drive issues to resolution, increasing team accountability and visibility on project status.\nContributed to the development of a blockchain-driven feature for enhanced transaction security, paving the way for innovative solutions in financial technology."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "- Conducted **API testing** for robust backend services written in **Python** (FastAPI, Django) and **Node.js** (NestJS, Express), ensuring high availability and scalability across **9** key modules like checkout and order fulfillment.\n- Developed comprehensive **test automation** strategies using **JavaScript**, **Typescript**, and **Golang** to streamline functional, regression, and integration testing processes across **3** different platforms.\n- Utilized **defect-tracking tools** to manage and report on issues with an emphasis on quality assurance methodologies, contributing to a **30%** reduction in critical defects pre-release.\n- Designed and executed **load testing** and **stress testing** protocols on e-commerce APIs to assess performance under high traffic conditions, leading to optimization of resources and increased user satisfaction.\n- Implemented a structured **Quality Assurance** framework aligned with the **SDLC** and best practices in **Agile** methodologies, ensuring timely releases and adherence to project timelines.\n- Collaborated with cross-functional teams in a **Scrum** environment to facilitate continuous integration and delivery, ensuring rapid response to emerging application requirements.\n- Conducted manual and automated functional testing for a suite of applications built on **React** (18), **Vue 3**, and **Angular**, enhancing user experience and functionality.\n- Engaged with real-time feature implementations powered by event-driven architecture, leveraging tools like **Kafka** and **RabbitMQ** for comprehensive testing scenarios.\n- Ensured compliance with GDPR and security best practices by applying **role-based access control (RBAC)** and **OAuth 2.0** for all testing environments.\n- Drove the adoption of **Blockchain technology** in testing environments for enhanced data security, ensuring the integrity of test processes and systems."
    }
  ],
  "skills": " **Programming Languages**\n\tPython, JavaScript, TypeScript, Golang\n\n **Backend Frameworks**\n\tFastAPI, Flask, Django\n\n **Frontend Frameworks**\n\tReact, Vue, Angular\n\n **API Technologies**\n\tAPI testing\n\n **Serverless and Cloud Functions**\n\tAWS: ECS, Lambda, RDS, S3\n\tAzure: App Services, Blob Storage, SQL Database\n\n **Databases**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n **DevOps**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure**\n\tQuality Assurance methodologies, SDLC, automation tools\n\n **Other**\n\ttest automation, defect-tracking tools, functional testing, regression testing, integration testing, load testing, stress testing, Scrum, Agile, Blockchain technology"
}