{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior UX Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-152840397/",
  "profile_summary": "As a versatile Senior UX Engineer with extensive experience in UX/UI design, I excel in enhancing user experiences through robust prototyping and wireframing techniques using **Figma**, **Sketch**, and **Adobe Creative Suite**. My proficiency in **HTML5**, **CSS**, and responsive design ensures that the applications I work on are visually appealing and highly functional across all devices.\n\nIn my previous roles, I have successfully facilitated usability testing and implemented data visualization strategies that have improved user engagement by over 30%. My background in full-stack development provides me with a unique perspective on how design influences functionality, enabling effective communication and collaboration within cross-functional teams.\n\nAdditionally, I have 8 years of experience in developing high-performance solutions in the healthcare and financial sectors with expertise in leading technologies such as **JavaScript**, **TypeScript**, **Python**, **Flutter**, **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**. I have contributed to enterprise-grade platforms that integrate AI/ML capabilities for predictive analytics, with a solid understanding of compliance standards including HIPAA, FHIR, PCI DSS, and SOC 2.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior UX Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Created and tested UX designs with tools like **Figma** and **Sketch**, ensuring a user-centric approach that enhances user experiences in both healthcare and fintech sectors.\n• Developed responsive prototypes and wireframes that align with usability testing results to deliver optimized user interfaces tailored for various devices and screens.\n• Collaborated with cross-functional teams to implement UI/UX principles in applications built using **HTML5**, **CSS**, and integrated them into **React** and **Vue** frameworks, ensuring effective communication and synergy.\n• Produced data visualization components using **D3.js** and **Chart.js**, presenting complex financial trends and healthcare insights clearly and interactively.\n• Led usability testing sessions, gathering insights that informed iterative design improvements focused on enhancing user satisfaction and product effectiveness.\n• Ensured designs maintained alignment with B2B requirements, further streamlining user interactions and simplifying workflows.\n• Communicated design concepts effectively to stakeholders via detailed presentations and documentation, fostering a culture of collaboration and innovation within teams.\n• Supervised the integration of design systems across applications to ensure consistency and brand alignment across all user interactions."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Employed strong **UX** and **UI** principles by designing engaging interfaces and enhancing user experiences for financial applications, ensuring seamless interactions across platforms.\nUtilized **Figma** and **Adobe Creative Suite** to create high-fidelity prototypes and wireframes, effectively communicating design ideas and workflows, resulting in a **20%** reduction in design iteration cycles.\nConducted extensive usability testing to gather user feedback, applying findings to improve application interfaces, achieving a **15%** increase in user satisfaction scores.\nImplemented responsive design techniques using **HTML5** and **CSS**, ensuring applications function flawlessly across various devices and screen sizes, which contributed to a **30%** increase in mobile user engagement.\nCollaborated with cross-functional teams to integrate user feedback into product development, fostering a strong communication culture that enhanced collaboration and overall project efficiency.\nDesigned data visualization components to enhance user understanding of complex financial data, utilizing tools like **D3.js** to create intuitive visual interfaces.\nLed workshops and meetings to align on design objectives and requirements, ensuring that user experience considerations were at the forefront of the development process."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Lead the design and prototyping of user-centric e-commerce interfaces in collaboration with cross-functional teams, ensuring high levels of usability and aesthetic appeal using **Figma**, **Sketch**, and **Adobe Creative Suite**.\nConducted usability testing sessions resulting in a **30%** increase in user satisfaction scores, while iterating on designs based on user feedback to enhance the overall user experience.\nDeveloped and implemented responsive design principles using **HTML5** and **CSS** to ensure seamless functionality across devices, improving engagement metrics by a significant **40%**.\nDesigned engaging wireframes and prototypes, facilitating stakeholder communication and project alignment through collaborative design workshops, leveraging effective communication and collaboration skills.\nProduced high-quality data visualizations to convey complex information intuitively, enhancing user understanding and interaction with the platform.\nWorked closely with product managers and developers to create B2B solutions that align with business goals and user needs, optimizing the design process through continuous feedback loops.\nEnsured compliance with accessibility standards (WCAG 2.1) in all UI designs, fostering inclusivity and meeting organizational requirements for user access.\nOptimized web applications' user journey by implementing responsive designs that improve core conversion metrics, contributing to a **20%** boost in sales through enhanced user experiences."
    }
  ],
  "skills": "Programming Languages:\n\tPython, JavaScript, TypeScript\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular, HTML5, CSS\n\n**API Technologies:**\n\t\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda), Azure (App Services)\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS (RDS, S3), Azure (Blob, SQL)\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, UX, UI, Figma, Sketch, Adobe Creative Suite, Prototyping, Wireframing, Usability Testing, Responsive Design, Data Visualization, Communication, Collaboration, B2B",
  "apply_company": "GlobalLogic"
}