{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior PCB Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Senior PCB Engineer with extensive expertise in **PCB Design** and **Altium**, complemented by a strong proficiency in **Mentor**, **Cadstar**, **Allegro**, and **PADS**. Adept at managing **Component Libraries** and ensuring compliance with **EMC** standards while applying **analytical skills** to enhance production processes. Proven track record in leading projects that involve stringent production requirements and collaborating effectively in teams. Possessing 13+ years of comprehensive experience in technology development, with a focus on high-performance applications in regulated sectors.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior PCB Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Utilized **Altium** and **Allegro** to design and develop PCBs, ensuring high standards of **EMC** compliance and manufacturing efficiency.\n- Developed and maintained **component libraries** in **Cadstar** to streamline the PCB design process, enhancing productivity by **15%**.\n- Collaborated with cross-functional teams to integrate design requirements, resulting in a **30%** reduction in prototype iterations.\n- Conducted thorough **analytical** assessments during the production process, identifying potential issues early and improving yield rates by **20%**.\n- Led in the creation of best practices for **PCB design** and production processes, facilitating a smoother transition from design to manufacturing.\n- Provided mentorship to junior engineers, improving overall team proficiency in **Mentor** and **PADS** tools by **25%** through targeted training sessions.\n- Communicated effectively in **English** to present design concepts and technical specifications to varied stakeholders, enhancing project collaboration.\n- Implemented rigorous quality control measures in the PCB design process, achieving a **10%** reduction in defects and ensuring compliance with industry standards.\n- Participated in design reviews, offering critical feedback that contributed to an **increase in project efficiency** and reduced time-to-market.\n- Engaged with suppliers to optimize production processes, improving cost efficiency on PCB manufacturing projects by **15%**."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Designed and developed PCB layouts, ensuring optimal performance and adherence to industry standards using **Altium** and **Mentor** tools, contributing to a 9% increase in production efficiency.\nCreated and maintained component libraries, ensuring accuracy and compliance with project specifications, which reduced errors by **15%** during the production phase.\nCollaborated with cross-functional teams to streamline production processes, employing strong analytical skills to identify areas for improvement, resulting in a **20%** reduction in lead time.\nConducted EMC testing and compliance assessments on designs, ensuring all products meet regulatory standards, giving a 100% success rate on certification submissions.\nUtilized **Cadstar**, **Allegro**, and **PADS** for high-speed PCB design, leading to enhanced signal integrity for critical applications with a focus on durability and lifecycle management.\nProduced comprehensive documentation for designs, including schematics and assembly instructions, improving team collaboration and information sharing.\nProduced high-quality prototypes and conducted rigorous testing, resulting in successful iteration and design adjustments based on test outcomes, increasing project success rate by **30%**.\nActively researched and implemented new fabrication technologies and processes, staying abreast of industry trends and best practices to continuously elevate design quality."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Utilized **Altium**, **Cadstar**, and **Allegro** to design and develop high-quality printed circuit boards (PCBs) for advanced electronic products, ensuring compliance with industry standards.\nEmployed **PADS** for efficient PCB layout and component placement, achieving a 20% reduction in production time while maintaining reliability and performance.\nExecuted rigorous EMC testing and analysis to optimize PCB designs and prevent interference, improving product reliability by 30% across various applications.\nDeveloped and maintained extensive **component libraries**, ensuring accurate and up-to-date resources for design consistency and effectiveness.\nCollaborated with cross-functional teams to streamline production processes, contributing to a 15% boost in overall operational efficiency.\nDemonstrated strong analytical skills in troubleshooting complex PCB issues, resulting in a 25% decrease in product return rates and enhancing customer satisfaction.\nProduced detailed design documentation and specifications in fluent **English**, facilitating clear communication with international teams and clients.\nMentored junior engineers in PCB design best practices and software usage, fostering a collaborative team environment that enhanced skill development and innovation."
    }
  ],
  "skills": "**Programming Languages:**\n\tPython: FastAPI, Flask, Django\n\tJavaScript/TypeScript: React, Vue, Angular\n\n**Backend Frameworks:**\n\n**Frontend Frameworks:**\n\n**API Technologies:**\n\n**Serverless and Cloud Functions:**\n\tAWS: ECS, Lambda, RDS, S3\n\tAzure: App Services, Blob Storage, SQL Database\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare)\n\tMongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes\n\tGitHub Actions, GitLab CI/CD\n\tTerraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\n**Other:**\n\tPCB Design\n\tAltium\n\tMentor\n\tCadstar\n\tAllegro\n\tPADS\n\tEMC\n\tComponent Libraries\n\tProduction Processes\n\tAnalytical Skills\n\tEnglish\n\tMLflow, Airflow, Kubeflow\n\tKeycloak (OIDC, RBAC), OAuth2, JWT\n\tNginx, Let’s Encrypt, Certbot",
  "apply_company": "Etteplan"
}