{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Technical Support Specialist",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-623a26390/",
  "profile_summary": "Technical Support Specialist with 13+ years of experience, proficient in **HTML**, **CSS**, **JavaScript**, and skilled in **Shopify** and **Liquid**. Adept at providing **technical support** and ensuring customer satisfaction through effective communication in **written English** and **empathy**. Demonstrated reliability and calmness under pressure, with a strong background in delivering high-performance applications across the healthcare and financial industries. Experienced in employing **SaaS** solutions and translating complex technical issues into user-friendly terms. Additionally, well-versed in compliance-driven development and knowledgeable in deploying cloud-native systems on **AWS** and **Azure**.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Technical Support Specialist",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Provided technical support for web applications using **HTML**, **CSS**, and **JavaScript**, assisting clients in troubleshooting and resolving issues effectively.\nEnsured smooth operations of **SaaS** platforms, delivering exceptional user experiences while maintaining reliability and responsiveness under pressure.\nDeveloped user-friendly documentation and guides that enhanced customer understanding of **Shopify** and **Liquid**, improving overall client satisfaction ratings by **25%**.\nEmployed strong written communication skills to convey complex technical information clearly, fostering empathy and understanding in client interactions.\nMaintained high levels of customer engagement through proactive follow-up strategies, resulting in a **15%** increase in customer retention over a **6-month** period.\nCollaborated with cross-functional teams to deliver feature enhancements, ensuring customer feedback was integrated into product development cycles.\nUtilized tools to track and analyze support requests, achieving a resolution time of less than **60 minutes** for critical issues.\nEngaged in continuous learning to keep abreast of the latest web technologies, enhancing the effectiveness of technical support provided."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "- Provided technical support for web applications using **HTML**, **CSS**, and **JavaScript** to resolve client issues and enhance user experience, ensuring timely and effective communication.\n- Assisted clients in navigating and optimizing their online stores built on **Shopify** and **Liquid**, applying knowledge of best practices in **SaaS** solutions to improve operational efficiency.\n- Demonstrated exceptional written English skills to prepare detailed documentation and troubleshooting guides, fostering user confidence and facilitating smoother interactions.\n- Exhibited empathy while addressing customer concerns, maintaining calmness under pressure to ensure high levels of customer satisfaction.\n- Conducted thorough reliability assessments and implemented solutions that improved system uptime by **20%**, significantly enhancing client trust in support services.\n- Delivered hands-on support for platform integration and configuration, utilizing strong interpersonal skills to train users and enable them to maximize the benefits of technical offerings."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Provided **technical support** to clients utilizing **Shopify** and **Liquid**, ensuring smooth user experiences while leveraging **HTML**, **CSS**, and **JavaScript** for customized solutions.\nMaintained **reliability** in support services, handling an average of **50** customer inquiries per day, demonstrating **calmness under pressure** during peak periods.\nCommunicated effectively in **written English**, creating support documentation and FAQs to enhance user understanding of platform functionalities and troubleshooting steps.\nDemonstrated **empathy** in resolving client issues, contributing to a customer satisfaction rate of **95%** through personalized support and follow-up.\nImplemented **SaaS** solutions for clients, providing guidance on best practices to increase usage and decrease operational bottlenecks.\nConsistently ensured timely responses to technical inquiries, maintaining an average resolution time of **4 hours**.\nCollaborated with development teams to escalate and prioritize technical challenges, enhancing system reliability and user satisfaction.\nConducted training sessions for clients on effective use of platforms, resulting in a **20%** increase in user engagement and confidence in utilizing the tools provided."
    }
  ],
  "skills": "Programming Languages:\n\tHTML, CSS, JavaScript, Python, JavaScript/TypeScript\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tKeycloak (OIDC, RBAC), OAuth2, JWT\n\n**Serverless and Cloud Functions:**\n\tAWS: Lambda, Azure: App Services\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, CI/CD & Infrastructure as Code: Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS: ECS, RDS, S3, Azure: Blob Storage, SQL Database\n\n**Other:**\n\tShopify, Liquid, SaaS, Technical support, Written English, Empathy, Reliability, Calmness under pressure"
}