{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Software Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-187801395/",
  "profile_summary": "Skilled Software Engineer with 13+ years of experience in delivering high-performance applications specializing in **Python**, **Node.js**, **Flask**, and **VueJS**. Proficient in modern data architectures and distributed systems, with a strong focus on code simplicity and performance optimization.\nDemonstrated expertise in collaborating with cross-functional teams to troubleshoot complex problems and implement effective solutions. Experienced in developing cloud-based applications on **AWS** and **Azure**, ensuring the scalability and reliability of projects. Adept at building applications that adhere to industry standards and compliance, while leveraging advanced programming languages like **Java** and **Scala**. Passionate about creating efficient solutions through solid coding practices and innovative designs.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Software Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Utilized **Python** and **Node.js** to develop full-stack applications for diverse sectors, focusing on **code simplicity** and **performance**.\nImplemented **VueJS** for interactive front-end solutions, ensuring engaging user experiences and high levels of collaboration across multidisciplinary teams.\nDesigned distributed systems to handle scalable workloads effectively, enhancing application resilience and performance metrics by **25%** in high-demand scenarios.\nIntegrated cloud platforms such as AWS and Azure to support **modern data architectures**, optimizing data flow and storage management across applications.\nEngaged in problem-solving initiatives to streamline existing processes, reducing operational inefficiencies by **30%** through the adoption of efficient coding practices and architecture refinements.\nCollaborated with cross-functional teams to identify requirements and deliver timely software releases, achieving up to **99%** uptime in deployed applications.\nEmployed Flask for lightweight web service deployment, enhancing backend connectivity and network performance in tandem with modern front-end frameworks.\nContributed to the development and maintenance of distributed systems, ensuring high availability and scalability through **cloud-native** principles and practices.\nParticipated in code reviews and pair programming sessions, fostering a culture of continuous improvement and knowledge sharing among team members.\nActively sought and applied feedback to enhance software functionality and user satisfaction, maintaining focus on **collaboration** and positive team dynamics."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "• Developed and maintained scalable distributed systems using **Python** (FastAPI, Django) and **Node.js** (NestJS/Express), improving performance and responsiveness for high-volume financial transactions.\n• Collaborated effectively with cross-functional teams to modernize and enhance financial platforms through the implementation of **microservices architecture**.\n• Built interactive front-end applications using **Vue.js** (3) and **React** (18), applying **TypeScript**, **Redux Toolkit**, and **Tailwind CSS** to deliver user-friendly interfaces for financial tools and admin panels.\n• Implemented real-time analytics dashboards utilizing **D3.js** and **Power BI Embedded**, providing operational teams with insights into transactions with a refresh rate of **every 5 seconds**.\n• Designed and deployed an event-driven architecture with **Kafka**, **RabbitMQ**, and **Azure Service Bus**, facilitating asynchronous communication for workflows like payments and compliance, achieving a **20% reduction** in processing time.\n• Developed ETL pipelines with **Apache Airflow** and **Azure Data Factory** for processing both batch and real-time financial data from various sources, handling millions of records efficiently.\n• Engineered and deployed machine learning models for fraud detection using **scikit-learn** and **XGBoost**, which increased detection accuracy by **15%** based on user behavior patterns.\n• Created ML pipelines for real-time scoring and predictions, integrating them into backend services using **MLflow** and **Airflow**, thereby streamlining analytics workflows."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Utilized **Python** with **Flask** and **Node.js** to design and optimize backend services for a global e-commerce platform, ensuring high availability, low latency, and scalability across 9 key modules like checkout and order fulfillment.\nEngineered distributed systems using **Kafka** and **RabbitMQ** for real-time features such as responsive order updates and dynamic inventory tracking.\nImplemented modern data architectures leveraging **MongoDB**, **PostgreSQL**, and **Redis**, ensuring 99% uptime and fast data access for high-traffic workflows.\nCollaborated with cross-functional teams to enhance platform performance, focusing on code simplicity and best practices to reduce response times by over 40%.\nDeveloped and maintained user interfaces using **VueJS** and **Next.js**, delivering a mobile-first experience compliant with WCAG 2.1 standards, resulting in a 30% improvement in user engagement.\nEmployed cloud platforms and containerization strategies through **Kubernetes**, facilitating blue-green deployments and continuous integration, ensuring seamless updates with minimal downtime.\nApplied problem-solving skills to integrate AI/ML-based recommendation engines using **TensorFlow**, leading to a 25% increase in conversion rates based on real-time behavioral data.\nEnhanced application security implementing role-based access control (RBAC) and **OAuth 2.0** for customer and admin access, ensuring compliance with GDPR and safeguarding sensitive data."
    }
  ],
  "skills": "  **Programming Languages:**\n\tPython, Java, Scala, JavaScript/TypeScript  \n\n  **Backend Frameworks:**\n\tFlask, FastAPI  \n\n  **Frontend Frameworks:**\n\tVue, React, Angular, VueJS  \n\n  **API Technologies:**\n\t  \n\n  **Serverless and Cloud Functions:**\n\tAWS: Lambda, Azure: App Services  \n\n  **Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis  \n\n  **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD  \n\n  **Cloud & Infrastructure:**\n\tAWS: ECS, RDS, S3, Azure: Blob Storage, SQL Database, Terraform, Ansible, Helm, Docker Compose  \n\n  **Other:**\n\tAuthentication & Security: Keycloak (OIDC, RBAC), OAuth2, JWT, Nginx, Let’s Encrypt, Certbot, collaboration, problem-solving, distributed systems, modern data architectures, code simplicity, performance"
}