{
  "name": "Mariusz Jan Skobel",
  "role_name": "Senior Generative AI Engineer",
  "email": "mariuszskobel15@outlook.com",
  "phone": "+48 735 343 548",
  "address": "Katowice, Poland",
  "linkedin": "https://www.linkedin.com/in/mariusz-skobel-789557397/",
  "profile_summary": "Senior Generative AI Engineer with 10+ years of experience in delivering cutting-edge software solutions, specializing in **Python**, **MLOps**, and **cloud services (AWS, GCP, Azure)**. Adept at leveraging **PyTorch**, **TensorFlow**, **transformers**, **GANs**, and **VAEs** to develop innovative AI models that drive significant business outcomes. Proficient in **CI/CD** methodologies including **GitHub Actions**, **Jenkins**, and container orchestration using **Docker** and **Kubernetes**, ensuring efficient deployment and scalability of applications. Experienced in the full software development lifecycle using **JavaScript**, **React**, and other modern frameworks, with a strong focus on creating secure, maintainable systems that comply with industry standards.\n\nWith a solid background in enterprise platform development and real-time analytics, I am passionate about integrating AI/ML solutions that facilitate automation and intelligent decision-making, making a tangible impact in the healthcare and finance sectors.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2012",
      "to_year": "2015",
      "location": "UK",
      "university": "University of Bristol"
    }
  ],
  "experience": [
    {
      "role": "Senior Generative AI Engineer",
      "company": "EitBiz",
      "from_date": "Oct 2022",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Developed and deployed advanced generative AI models using **PyTorch** and **TensorFlow** for various applications, including patient risk prediction and financial fraud detection.\n• Implemented MLOps best practices utilizing tools like **MLflow**, **DVC**, and **GitHub Actions**, streamlining model training, validation, and deployment across different environments.\n• Created robust CI/CD pipelines with **Jenkins**, ensuring seamless integration and continuous delivery for AI-driven solutions in cloud environments such as **AWS** and **Azure**.\n• Architected scalable solutions leveraging **Docker** and **Kubernetes** environments, increasing deployment efficiency by **40%** and enhancing system reliability.\n• Designed and optimized high-performing frontend web applications using **React**, which incorporated AI components, for real-time data visualization and user interaction across both web and mobile platforms.\n• Ensured high-quality code delivery by establishing comprehensive testing frameworks using **Jest** and **Cypress**, achieving a **95%** code coverage for critical services.\n• Enhanced machine learning model performance by implementing advanced generative techniques such as **GANs** and **VAEs**, improving prediction accuracy by **20%** over baseline models.\n• Collaborated with data scientists to integrate **transformers** for natural language processing tasks, enhancing document parsing efficiency for healthcare applications.\n• Employed cloud-native services in **GCP** and **Azure** for scalable storage and computing, leading to optimized data management of large-scale healthcare and financial datasets.\n• Leveraged **HTML**, **CSS**, and **JavaScript** technologies for building user interfaces that effectively present machine learning insights, substantially improving user engagement rates by **30%**."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Tvn S.A.",
      "from_date": "Oct 2019",
      "to_date": "Sep 2022",
      "location": "Poland",
      "responsibilities": "Developed and deployed generative AI models using **PyTorch** and **TensorFlow**, focusing on real-time applications within financial systems to enhance predictive capabilities.\nIntegrated **transformers** for natural language processing tasks, generating insights and improving user interactions in financial dashboards.\nLeveraged **Generative Adversarial Networks (GANs)** and **Variational Autoencoders (VAEs)** for advanced data augmentation, increasing dataset size by **3x** and enhancing model robustness.\nUtilized **AWS**, **GCP**, and **Azure** services for cloud deployment, ensuring scalable and cost-effective solutions for AI model hosting with a focus on high availability.\nDesigned CI/CD pipelines utilizing **GitHub Actions** and **Jenkins**, streamlining the deployment process and reducing release time by **40%**.\nContainerized applications using **Docker** and orchestrated with **Kubernetes**, facilitating seamless scaling and management of microservices in production environments.\nEnhanced front-end applications through integrations with **React** (18), ensuring that user interfaces are not only functional but also optimized for performance metrics, achieving **90+** on Lighthouse scores.\nMaintained high standards of code quality and collaboration through version control management with **GitHub**, fostering an agile development environment.\nImplemented MLOps best practices to automate model training and deployment, enabling timely updates to machine learning systems in response to evolving data and business needs."
    },
    {
      "role": "Software Engineer",
      "company": "Timspark",
      "from_date": "Sep 2015",
      "to_date": "Aug 2019",
      "location": "UK",
      "responsibilities": "Applied deep learning frameworks such as **TensorFlow** and **PyTorch** to develop, train, and deploy state-of-the-art generative models, including GANs and VAEs, resulting in a **30%** improvement in content generation quality.\nImplemented CI/CD pipelines using **GitHub Actions** and **Jenkins** for efficient model deployment and version control, reducing deployment time by **50%**.\nUtilized **AWS**, **GCP**, and **Azure** cloud services for scalable infrastructure to support training of complex models on large datasets, ensuring high availability and reliability.\nDeveloped and maintained containerized applications using **Docker** and orchestrated using **Kubernetes**, improving deployment consistency and resource management by **40%**.\nEngineered frontend solutions using **React** alongside modern web technologies like **HTML**, **CSS**, and **JavaScript** to create intuitive user interfaces for AI-driven applications, prioritized for responsiveness and user experience.\nCollaborated cross-functionally on MLOps processes, streamlining workflows for model training, validation, and deployment, leading to faster delivery of new features based on user feedback.\nIntroduced and integrated advanced model serving strategies with an emphasis on scalability and latency optimization, driving faster inference times for users utilizing generative capabilities.\nDesigned and implemented secure API endpoints for model interactions, adhering to best practices in **OAuth 2.0** for user authentication and data protection, contributing to increased platform security and user trust.\nConducted thorough performance evaluations to enhance model accuracy and efficiency, leveraging metrics to drive continuous improvement in AI solutions offered to clients."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, JavaScript, TypeScript\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n **Frontend Frameworks:**\n\tReact, Vue, Angular, HTML, CSS\n\n **API Technologies:**\n\tMLOps, GitHub Actions, JSON Web Tokens (JWT), OAuth2\n\n **Serverless and Cloud Functions:**\n\tAWS, GCP, Azure\n\n **Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n **DevOps:**\n\tDocker, Kubernetes, Jenkins, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n **Other:**\n\tArtificial Intelligence, Machine Learning, PyTorch, TensorFlow, transformers, GANs, VAEs, MLflow, Airflow, Kubeflow, Nginx, Let’s Encrypt, Keycloak (OIDC, RBAC)"
}