{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior AI Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Senior AI Engineer with 13+ years of experience in developing high-performance applications with a strong emphasis on **Python** and MLOps. Demonstrated expertise in leveraging AI/ML technologies, particularly with **OpenAI** and **Anthropic**, to create predictive models and intelligent applications. Proficient in using frameworks and tools such as **LangChain**, **LangGraph**, **Agno**, **CrewAI**, **Qdrant**, **Milvus**, **Pinecone**, and **pgvector** to drive innovation in AI solutions. \nExperienced in deploying scalable cloud-native systems on **AWS**, including the use of **AWS Bedrock** for enhanced AI capabilities. Skilled in implementing modern software development practices such as CI/CD pipelines and microservices architecture. \nAdept at ensuring compliance with industry standards like HIPAA and PCI DSS while developing solutions. Strong background in orchestrating MLOps for model training and deployment using tools such as **MLflow**, **Airflow**, and **Kubeflow**. Committed to delivering impactful software solutions across the healthcare and financial sectors.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior AI Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Developed and deployed advanced AI solutions utilizing **Python** alongside cutting-edge frameworks such as **LangChain** and **LangGraph** to enhance data processing efficiency and support high-performance applications.\n- Integrated powerful machine learning models leveraging **OpenAI**, **Anthropic**, and **Gemini** for natural language processing and AI-driven insights tailored for both health and finance sectors.\n- Implemented MLOps best practices using **Qdrant**, **Milvus**, and **Pinecone** to manage model training, versioning, and deployment pipelines, enhancing delivery speed by **30%**.\n- Designed scalable data storage solutions with vector databases like **pgvector** for optimized retrieval of embeddings and semantic search functionalities.\n- Collaborated with cross-functional teams to deliver end-to-end AI features, directly impacting user experience and operational metrics by improving user engagement by **25%**.\n- Conducted performance tuning of machine learning models deployed on **AWS** platforms, utilizing services such as **AWS Bedrock** to ensure low-latency inference.\n- Developed monitoring tools for AI workflows, emphasizing continuous improvement in training accuracy and model responsiveness, achieving a **20%** increase in performance benchmarks.\n- Engaged in rigorous testing strategies across AI deployments, ensuring robustness and reliability using frameworks like **pytest** and **Postman** for comprehensive coverage and validation.\n- Spearheaded integration efforts with enterprise applications, enhancing functionality through seamless data exchange and API interactions, resulting in operational cost reductions of up to **15%**.\n- Actively researched and adopted new AI technologies, ensuring continuous evolution of the technical stack and alignment with the latest industry standards."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "- Leveraged **Python** to develop and optimize AI models, utilizing frameworks such as **LangChain** and **LangGraph** for enhanced natural language processing capabilities.\n- Implemented efficient data retrieval and embedding storage solutions using **Qdrant**, **Milvus**, **Pinecone**, and **pgvector** to support AI-driven applications and improve data access speed.\n- Designed and deployed machine learning workflows using **AWS** services for robust MLOps, facilitating seamless integration of models into production environments.\n- Created AI-powered solutions utilizing tools like **OpenAI** and **Anthropic**, aligning with the latest advancements offered by technologies such as **Gemini** and **AWS Bedrock**.\n- Managed large-scale projects, successfully achieving a **30%** increase in processing efficiency through intelligent architecture re-design and driving continuous improvements in AI model performance.\n- Collaborated in cross-functional teams to innovate and implement AI strategies, ensuring alignment with business goals and enhancing product offerings effectively.\n- Developed comprehensive documentation and best practices for AI model deployment using **LangFuse** and **LangSmith** to streamline upcoming projects and facilitate knowledge transfer among team members."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Utilized **Python** to design and optimize AI-driven backend services for a global e-commerce platform, ensuring high availability, low latency, and scalability across key modules like checkout, cart, and order fulfillment using frameworks like FastAPI and Django.\nImplemented LLM techniques leveraging tools such as **LangChain**, **LangGraph**, and **Pinecone** to enhance natural language understanding and processing capabilities, driving improved customer interactions and automated responses.\nDeveloped and integrated recommendation systems using AI frameworks, specifically **OpenAI** and **Anthropic**, to personalize user experiences and optimize product search relevance, boosting conversion rates by over **15%**.\nEngineered real-time features using event-driven architecture with **Kafka** and **RabbitMQ** for responsive customer support and dynamic inventory management, resulting in reduced latency by **30%**.\nLeveraged cloud services like **AWS** for deployment of machine learning models and optimized workflows, achieving increased scalability and reduced operational costs.\nCollaborated with teams to implement MLOps practices, streamlining the lifecycle management of machine learning projects to improve deployment efficiency by **25%**.\nActivated feature flags with **LaunchDarkly** and maintained seamless deployment processes through **Kubernetes**, ensuring stable rollouts and minimized downtime during updates.\nDesigned data storage solutions employing **MongoDB**, **PostgreSQL**, and caching with **Redis** to manage high-volume product data efficiently and improve application responsiveness by **40%**.\nApplied role-based access control (RBAC) and OAuth 2.0 for secure user authentication and authorization, ensuring compliance with GDPR and bolstering data protection across platforms.\nCreated responsive, SEO-friendly UI components for the e-commerce platform using **Next.js**, enhancing accessibility compliance and mobile-first engagement (WCAG 2.1 standards).\n"
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, LLM\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n **Frontend Frameworks:**\n\tJavaScript/TypeScript: React, Vue, Angular\n\n **API Technologies:**\n\tOpenAI, Anthropic, Gemini, LangChain, LangGraph, Agno, CrewAI, LangFuse, LangSmith\n\n **Serverless and Cloud Functions:**\n\tAWS: Lambda, Bedrock\n\n **Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis, Qdrant, Milvus, Pinecone, pgvector\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD\n\n **Cloud & Infrastructure:**\n\tAWS: ECS, RDS, S3, Azure: App Services, Blob Storage, SQL Database\n\n **Other:**\n\tMLflow, Airflow, Kubeflow, Authentication & Security: Keycloak (OIDC, RBAC), OAuth2, JWT, Nginx, Let’s Encrypt, Certbot, CI/CD & Infrastructure as Code: Terraform, Ansible, Helm, Docker Compose\n",
  "apply_company": "Tymit"
}