{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Software Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "Results-driven Senior Software Engineer with 8 years of experience in developing secure and compliant applications leveraging **Python**, **Golang**, **AWS**, **Azure**, **Docker**, **Kubernetes**, **Terraform**, and industry-standard **DevOps** practices. My extensive background in full-stack development includes building high-performance solutions in healthcare and finance, utilizing technologies such as **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**. I excel in implementing **Automated Testing**, ensuring code quality and system reliability while adhering to compliance standards like HIPAA and PCI DSS. \nI possess deep expertise in microservices architecture and event-driven systems, alongside hands-on experience in developing machine learning pipelines and MLOps workflows with tools such as MLflow, Airflow, and Kubeflow. My focus is on delivering enterprise-grade platforms that harness AI/ML capabilities for predictive analytics and intelligent automation.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Software Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Developed and maintained high-performance applications utilizing **Python**, ensuring adherence to security standards and compliance with regulations such as HIPAA and GDPR.\n- Designed and implemented containerized applications using **Docker** and orchestration with **Kubernetes**, enhancing deployment efficiency and scalability.\n- Led the transition of infrastructure as code using **Terraform** for cloud resource management on **AWS** and **Azure**, streamlining deployment processes.\n- Established CI/CD pipelines that incorporate automated testing frameworks within **DevOps** practices, ensuring robust quality assurance across all software releases.\n- Implemented security best practices, conducting regular audits and compliance checks to align with industry standards.\n- Collaborated with cross-functional teams to integrate security measures throughout the software development lifecycle, promoting secure coding practices.\n- Developed automation scripts using **Python** for operational tasks, increasing efficiency and reducing manual errors by up to **30%**.\n- Optimized application performance and scalability, achieving system uptime of **99.9%** in production environments.\n- Participated in Agile development processes, contributing to sprint planning and retrospectives to continuously improve project delivery and team collaboration."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Leveraged **Python** and implemented **Golang** to enhance backend functionalities while adopting a microservices-based architecture, increasing system performance and scalability for high-volume transaction applications.\nUtilized **AWS** and **Azure** services to deploy and manage applications, leading to improved availability and reduced operational costs by **30%**.\nDesigned and maintained containerized applications using **Docker** and orchestrated deployments with **Kubernetes**, enabling faster development cycles and streamlined CI/CD processes.\nImplemented **Terraform** for infrastructure as code, resulting in consistent and repeatable deployments across environments and reducing setup time by **40%**.\nDeveloped automated testing strategies to enhance application reliability and security, ensuring compliance with industry standards and regulations.\nIntegrated continuous security practices into the DevOps pipeline to proactively identify and mitigate vulnerabilities, maintaining a secure software environment.\nCollaborated in cross-functional teams focused on building scalable solutions while improving system performance and operational efficiencies, driving a **20%** increase in transaction processing capabilities.\nContinuously monitored application performance and security compliance, addressing issues to ensure optimal functionality and adherence to regulatory requirements.\n"
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Utilized **Python** and **Golang** to design and optimize backend services for a global e-commerce platform, ensuring high availability, low latency, and scalability across key modules like checkout, cart, and order fulfillment.\nEngineered automated testing frameworks applying **DevOps** practices, resulting in a **30%** reduction in deployment times and enhancing overall software quality.\nImplemented security measures, utilizing role-based access control (RBAC) and OAuth 2.0, to maintain user data protection and **GDPR** compliance across the platform.\nLeveraged cloud services like **AWS** and **Azure** for efficient infrastructure management, deploying applications with **Kubernetes** and **Docker** to improve scalability and reliability in a multi-cloud setup.\nDeveloped infrastructure as code using **Terraform**, facilitating consistent environment setups and configuration management, reducing onboarding time for new applications by **40%**.\nEmployed continuous integration and continuous deployment (CI/CD) pipelines, streamlining the software delivery process and enabling faster feature rollouts and updates.\nCreated responsive, SEO-friendly e-commerce UIs utilizing **Next.js**, **Vue 3 + Nuxt**, and HTML5/CSS3, focused on mobile-first engagement and accessibility compliance (WCAG 2.1).\nIntegrated AI/ML-based recommendation engines to personalize product listings and optimize search relevance using **TensorFlow** to boost conversion rates based on real-time behavioral data.\nCollaborated cross-functionally to ensure compliance and security standards were met throughout the software lifecycle."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, Golang\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n **Frontend Frameworks:**\n\tJavaScript/TypeScript (React, Vue, Angular)\n\n **API Technologies:**\n\t\n\n **Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n **Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:**\n\tAWS, Azure\n\n **Other:**\n\tMLflow, Airflow, Kubeflow, Authentication & Security (Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot), Automated Testing, Compliance",
  "apply_company": "Babel"
}