{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Programming Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Senior Programming Engineer with 13+ years of experience in delivering high-performance applications, blending strong programming expertise in **C#**, **Java**, **Python**, and **C++**. Demonstrated proficiency in developing robust solutions alongside a passion for teaching and fostering creativity within teams. Skilled in architectural principles, leveraging advanced technologies including **JavaScript/TypeScript**, **Flutter**, and backend frameworks such as **Node.js** and **FastAPI**.\nAdept at creating AI/ML-powered platforms that drive predictive analytics and real-time processing. Proven track record in cloud-native deployments on **AWS** and **Azure**, integrating microservices and event-driven architectures, along with implementation of CI/CD pipelines.\nFocused on compliance-driven development, successfully aligning projects with standards like HIPAA and PCI DSS, with extensive hands-on experience in MLOps, utilizing tools such as **MLflow**, **Airflow**, and **Kubeflow**.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Programming Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Utilized **C#**, **Java**, and **Python** to design and develop robust software solutions, ensuring code quality and maintainability through effective unit and integration testing strategies.\nLeveraged strong problem-solving skills to refactor legacy codebases, enhancing performance and scalability for various applications, including game development and educational tools.\nImplemented agile methodologies to manage project timelines, ensuring on-time delivery for **9+** high-impact projects across diverse domains.\nFostered a collaborative environment by mentoring junior developers in programming best practices and technologies.\nCreated interactive and educational user experiences using **Unity** for game development, integrating **Minecraft** mechanics to enhance learning outcomes for students.\nDemonstrated creativity in developing engaging educational content using **Scratch**, emphasizing a hands-on approach to programming concepts.\nApplied patience and empathy while teaching complex technical subjects, leading to improved understanding and skill development for learners.\nProduced documentation for code and systems to facilitate knowledge sharing and onboarding of new team members.\nParticipated in code reviews to maintain high standards of quality and adherence to industry best practices across the development team."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "- Leveraged **Python** for backend development, delivering scalable solutions in core financial systems through modern programming practices.\n- Developed and optimized software components using **C#** and **Java** for various applications, ensuring efficient performance and adherence to best coding standards.\n- Collaborated with cross-functional teams to enhance system functionalities, exhibiting strong **creativity** and **patience** in problem-solving.\n- Mentored junior engineers and conducted **Unity** workshops to foster a culture of learning and innovation in software development.\n- Streamlined development processes by introducing best practices, reducing project delivery times by **20%** while maintaining high code quality.\n- Managed projects effectively with a focus on **teaching** and refining team skills, resulting in enhanced productivity across diverse teams.\n- Applied **C++** in the development of high-performance modules, improving transaction processing speeds by up to **50%**.\n- Engaged with stakeholders to gather requirements, ensuring system designs met user expectations and business objectives."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Developed robust software solutions leveraging **C#** and **Java** within a high-performance environment, ensuring optimal functionality and reliability.\nUtilized **Python** to design backend services, streamlining processes and enhancing overall system efficiency.\nEngineered interactive applications using **Unity** to facilitate engaging learning experiences and educational tools.\nEmployed creativity in designing intuitive interfaces for software aimed at educational purposes, making complex programming concepts accessible.\nImplemented educational programs using **Scratch** to teach programming fundamentals, enhancing student engagement and understanding.\nDemonstrated patience while mentoring and guiding learners through programming challenges, fostering a supportive learning environment.\nConducted sessions that encouraged curiosity and creativity in coding, helping students develop critical thinking and problem-solving skills.\nCollaborated on projects using **Minecraft** as a platform to engage students in programming activities, demonstrating real-world applications of coding skills.\nParticipated in team discussions to brainstorm and implement innovative solutions in software development, promoting a culture of teamwork and collaboration.\n"
    }
  ],
  "skills": "**Programming Languages:**\n\tC#, Java, Python, C++, JavaScript/TypeScript\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tKeycloak (OIDC, RBAC), OAuth2, JWT\n\n**Serverless and Cloud Functions:**\n\tAWS: Lambda\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD\n\n**Cloud & Infrastructure:**\n\tAWS: ECS, RDS, S3, Azure: App Services, Blob Storage, SQL Database\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, Terraform, Ansible, Helm, Docker Compose, Minecraft, Scratch, Unity, Teaching, Creativity, Patience",
  "apply_company": "Coding Giants España"
}