{
  "name": "Patryk Zaslawski",
  "role_name": "DevOps Engineer",
  "email": "patrykzas0428@outlook.com",
  "phone": "+48669862402",
  "address": "Gdanski, Poland",
  "linkedin": "https://www.linkedin.com/in/patryk-zaslawski-6b04a8397/",
  "profile_summary": "As a proficient DevOps Engineer with over 8 years of experience, I specialize in cloud technologies, particularly **Google Cloud Platform**, **AWS**, and automation tools such as **Terraform** and **Kubernetes**. I have successfully implemented CI/CD pipelines using **CircleCI**, **Jenkins**, and **Docker** to streamline deployment processes. My strong coding skills in **Python** and experience with **SQL** and **NoSQL** databases, including **MongoDB**, enable me to optimize systems effectively. I leverage monitoring tools like **Prometheus**, **Grafana**, and **Datadog** to ensure high system reliability and performance. With a solid foundation in Agile methodologies, I am adept at collaborating in fast-paced environments to deliver scalable and secure infrastructures, grounded in my extensive background in software development and full-stack solutions.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2014",
      "to_year": "2017",
      "location": "United Kingdom",
      "university": "The University of Manchester"
    }
  ],
  "experience": [
    {
      "role": "DevOps Engineer",
      "company": "Binary Studio",
      "from_date": "Aug 2023",
      "to_date": "Present",
      "location": "United Kingdom (Remote)",
      "responsibilities": "Implemented and managed CI/CD pipelines using **CircleCI**, **Jenkins**, and **Docker**, ensuring automated testing, linting, and multi-environment releases for Python microservices in a cloud environment.\nDesigned and provisioned infrastructure with **Terraform** and **Helm** for managing deployment processes on **Kubernetes**, improving efficiency and reducing configuration drift by **30%**.\nLeveraged **Google Cloud Platform** and **AWS** to create hybrid cloud solutions, integrating services like **RDS** and **Cloud SQL** to optimize costs and scalability across systems.\nDeveloped and maintained databases with **SQL** and **NoSQL** services, including **MongoDB** and **PostgreSQL**, incorporating indexing and partitioning techniques that improved query performance by **50%**.\nMonitored system performance and reliability using **Prometheus** and **Grafana**, ensuring proactive issue detection and resolution, which reduced downtime by **20%**.\nAdopted Agile methodologies within cross-functional teams, leading to consistent on-time project deliveries and increased collaboration.\nAutomated deployment workflows and operational tasks using **Bash** scripts and Python, enhancing efficiency in infrastructure management and application deployments.\nCollaborated with development teams to refine and deploy infrastructure as code practices using **Terraform**, ensuring reproducibility and consistency in environments.\nOptimized service performance and reliability by implementing monitoring and alerting solutions utilizing **Datadog** and ensuring observability in all deployed microservices.\nSpearheaded training sessions for junior engineers to promote understanding of DevOps principles, focusing on cloud-native patterns and infrastructure management using **Kubernetes** and **Docker**."
    },
    {
      "role": "Software Engineer",
      "company": "Ardigen",
      "from_date": "Mar 2020",
      "to_date": "Aug 2023",
      "location": "Poland",
      "responsibilities": "Implemented CI/CD pipelines using **CircleCI** and **Jenkins** for automated deployments, enhancing development efficiency with a deployment frequency of up to **10** times per day.\nManaged and orchestrated **Kubernetes** clusters for seamless deployment of **Python** microservices, ensuring high availability and scalability with **95%** uptime.\nDeveloped Infrastructure as Code (IaC) solutions with **Terraform** to provision and manage cloud resources on **Google Cloud Platform** and **AWS**, reducing deployment time by **50%**.\nUtilized **Docker** for containerization of applications, significantly improving consistency across development and production environments.\nMonitored system performance with **Prometheus**, **Grafana**, and **Datadog**, establishing monitoring dashboards that track key performance indicators (KPIs) in real-time, ensuring optimal operational performance.\nCollaborated with development teams in an **Agile** environment to facilitate smooth deployment processes and improve release cycles.\nDeveloped backend APIs using **Python**, leveraging frameworks such as **Flask** and **Django**, and ensured database interactions with **SQL** (including **Cloud SQL** and **RDS**) and **NoSQL** databases like **MongoDB**.\nExecuted automated testing strategies using **Bash** and Python test frameworks, enhancing code quality and service reliability.\nArchitected and maintained a secure, scalable logging infrastructure with the **ELK stack** for centralized monitoring and troubleshooting of services.\nContributed to the automation of infrastructure provisioning and application deployments using tools like **Helm** for **Kubernetes**, improving operational efficiency and consistency across environments."
    },
    {
      "role": "Software Engineer",
      "company": "Altum Software",
      "from_date": "Oct 2017",
      "to_date": "Feb 2020",
      "location": "United Kingdom",
      "responsibilities": "Implemented **Google Cloud Platform** and **AWS** solutions for scalable infrastructure, ensuring high availability and resilience in service delivery.\nManaged infrastructure as code using **Terraform** to automate provisioning and configurations across **Kubernetes** clusters.\nDeveloped containerized applications with **Docker**, enabling consistent deployments and operations across various environments.\nAutomated continuous integration and deployment workflows using **Jenkins** and **CircleCI**, enhancing the efficiency and reliability of software delivery processes by **30%**.\nLeveraged **Kubernetes** for orchestrating containerized applications, ensuring seamless scaling and management of microservices architecture.\nUtilized **Bash** scripts for automating routine tasks, thereby reducing manual intervention and increasing operational efficiency by **25%**.\nDesigned efficient data structures and optimized queries in **SQL** and **NoSQL** databases including **MongoDB** to facilitate quick data retrieval, enhancing application performance.\nConstructed CI/CD pipelines that integrate testing and deployment processes, resulting in a **40%** reduction in overall deployment time.\nImplemented monitoring solutions with **Prometheus** and **Grafana** to track application performance and system health, leading to a **20%** improvement in response times.\nCreated infrastructure monitoring dashboards using **Datadog** to ensure proactive management of application metrics and error tracking.\nAdopted Agile methodologies in project management to deliver features iteratively and incrementally, improving team collaboration and project visibility.\nDeveloped and maintained database solutions in **Cloud SQL** and **RDS**, ensuring optimal data management and availability.\nHandled cache management using Redis to optimize response times for frequently accessed resources, yielding a **15%** increase in load times.\nContributed to the overall security posture by implementing network policies and access controls in managed environments, aligning with industry standards."
    }
  ],
  "skills": " **Programming Languages:** \n\tPython, SQL\n\n **Backend Frameworks:** \n\tFastAPI, Django, Flask, Spring Boot\n\n **Frontend Frameworks:** \n\tAngular (1–16), React (15–18), Next.js, Vue.js (2/3), Blazor\n\n **API Technologies:** \n\tREST & gRPC APIs, Kong\n\n **Serverless and Cloud Functions:** \n\tAWS (ECS, Lambda, RDS, S3), Google Cloud Platform, Azure (App Services, Blob, SQL)\n\n **Databases:** \n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis, NoSQL, Cloud SQL\n\n **DevOps:** \n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, CircleCI, Jenkins, Helm, Terraform, Bash, CI/CD, Agile, Prometheus, Grafana, Datadog\n\n **Cloud & Infrastructure:** \n\tAWS, Azure\n\n **Other:** \n\tSQLAlchemy, Pydantic, Celery, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot"
}