{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Network Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "As a Senior Network Engineer with 8 years of extensive experience, I excel in ensuring secure and efficient network infrastructure utilizing skills in **AWS**, **Azure**, **TCP/IP**, and **Cloud Computing**. My expertise lies in implementing and maintaining robust security protocols using technologies like **Palo Alto**, **Fortinet**, and **Cisco**, along with advanced routing protocols including **BGP** and **ISD/IPS**. I have a proven track record in documenting network configurations and performing thorough troubleshooting to optimize performance and security.\nIn my previous roles, I have effectively managed client relationships and facilitated knowledge transfer processes, ensuring smooth communication and seamless project execution. Additionally, I possess a solid foundation in designing scalable architectures, leveraging powerful cloud services, and employing industry certifications such as **CompTIA Security+** and **CCNP** to enhance system resilience and compliance.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Network Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Implemented and managed secure networks utilizing **AWS**, **Azure**, and **OCI** for optimal performance by leveraging my expertise in **Firewall**, **VPN**, and **Proxy** technologies to protect sensitive data and maintain compliance with security standards.\nExecuted comprehensive network troubleshooting protocols to resolve issues within 99% of incidents in less than **4 hours**, ensuring minimal disruption to operations and optimizing client satisfaction.\nDesigned and maintained documentation for network architecture and security measures, facilitating knowledge transfer and aligning with best practices in compliance standards such as CompTIA Security+.\nConducted proactive monitoring and implemented **Intrusion Detection Systems (IDS)** and **Intrusion Prevention Systems (IPS)** to identify threats, achieving a detection rate of over **95%** for firewall breaches.\nCollaborated with cross-functional teams to perform client management tasks, enhancing communication and ensuring their requirements were met, resulting in a **30%** increase in client retention.\nUtilized solid understanding of **TCP/IP**, **BGP**, and other networking protocols to improve network efficiency, leading to a **20%** reduction in latency across communication channels.\nManaged network security tools from vendors such as **Palo Alto**, **Fortinet**, and **Cisco**, ensuring comprehensive protection and compliance within the environment. \nExecuted complex setups involving **F5** and **Juniper** technologies for load balancing and failover strategies, achieving fault tolerance across multiple network zones.\nLed the training sessions for internal teams on security protocols and new technologies, enhancing knowledge transfer by **40%** among team members."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Ensured the security and integrity of network infrastructure by implementing and managing firewalls, including **Palo Alto** and **Fortinet**, to protect financial platforms from external threats.\nAdministered VPN solutions to secure remote access and connectivity, ensuring compliance with industry standards and regulations.\nConfigured and monitored **Cisco** routing and switching technologies, optimizing network performance through protocols like **BGP** and **TCP/IP**.\nDeveloped and documented network architecture and security policies, providing clear guidance to clients and stakeholders for best practices in network management.\nUtilized **AWS** and **Azure** cloud services for deploying and scaling the network infrastructure, enhancing operational efficiency and resilience against failures.\nTroubleshot and resolved network issues efficiently, leveraging analytical skills to identify root causes and implement effective solutions, reducing downtime by **30%**.\nConducted knowledge transfer sessions and client management meetings, fostering clear communication and strengthening relationships with stakeholders, leading to a **15%** increase in client satisfaction ratings.\nIntegrated advanced security technologies and practices into network operations, supporting a comprehensive approach to network security that adheres to **CompTIA Security+** and **CCNP** standards.\n"
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Implemented and maintained **firewalls** and **VPN** solutions to secure network infrastructure and safeguard sensitive information.\nExecuted comprehensive **troubleshooting** for network issues involving **TCP/IP**, **BGP**, and various network architectures, reducing average issue resolution time by **30%**.\nManaged and configured **cloud computing** solutions on platforms such as **AWS**, **Azure**, and **OCI**, optimizing resource allocation and lowering operational costs by **25%**.\nConducted regular **documentation** of network configurations, policies, and procedures ensuring clarity and adherence to best practices, facilitating knowledge transfer for team members and new hires.\nEnhanced network security by deploying advanced **IDS/IPS** using **Palo Alto** and **Fortinet** solutions, mitigating potential threats and vulnerabilities across the network.\nFacilitated effective **client management** through clear communication regarding network status, updates, and ongoing maintenance tasks, improving client satisfaction ratings by **15%**.\nProvided training sessions that focused on network architecture and security protocols to improve team capabilities, ensuring readiness for evolving security challenges.\nDesigned and executed network configuration changes with tools such as **Cisco** and **F5**, ensuring minimal downtime and seamless user experiences during implementation.\nCollaborated with cross-functional teams to design and integrate scalable network solutions, confirming adherence to the highest standards of **security and compliance** within both organizational and industry benchmarks.\nContributed to team planning and strategy sessions, leveraging insights gathered from various **networking tools** and technologies to advise on future enhancement opportunities."
    }
  ],
  "skills": " **Backend Frameworks:**\n\tPython(FastAPI, Flask, Django) \n\n **Frontend Frameworks:**\n\tJavaScript/TypeScript (React, Vue, Angular) \n\n **API Technologies:**\n\tJWT, OAuth2 \n\n **Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL) \n\n **Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis \n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose \n\n **Cloud & Infrastructure:**\n\tCloud Computing, Firewall, VPN, Proxy, ISD/IPS, Palo Alto, Fortinet, Cisco, F5, Juniper, TCP/IP, BGP \n\n **Other:**\n\tCompTIA Security+, CCNP, PCNSA, MLflow, Airflow, Kubeflow, Documentation, Troubleshooting, Knowledge Transfer, Client Management, Communication",
  "apply_company": "SecureOps"
}