{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior QA Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Detail-oriented Senior QA Engineer with 13+ years of experience in software testing and quality assurance processes. Skilled in manual testing, API testing, and utilizing tools such as **Postman** and **Swagger** for effective test management. Proficient in **Jira** for tracking defects and facilitating communication across teams. Equipped with a strong understanding of QA processes and methodologies to deliver high-quality software in compliance-driven environments. \nAdditionally, I possess full-stack development experience in **JavaScript/TypeScript**, **Python**, and **Flutter**, alongside a solid foundation in both frontend and backend frameworks such as **React**, **Next.js**, and **Django**. I've contributed to building AI/ML-powered applications for predictive analytics and have expertise in deploying cloud-native systems on **AWS** and **Azure**, further enhancing the robustness of software solutions.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior QA Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Executed comprehensive **QA processes** and **test management** for high-quality software development using **Jira** to track bugs and enhancements.\nConducted **manual testing** and **API testing** to validate the functionality of applications developed with **FastAPI**, **Node.js**, **React**, and **Flutter**, ensuring cross-platform reliability and performance.\nDeveloped and executed detailed test cases and scripts using **Postman** and **Swagger**, guaranteeing robust functionality and security in both healthcare and fintech applications.\nCollaborated with cross-functional teams to communicate testing results and provided timely feedback to developers, enhancing the development cycle efficiency by **20%**.\nImplemented comprehensive testing strategies, covering unit, integration, and end-to-end tests utilizing **PyTest**, **Cypress**, and **Jest**, ensuring full stack quality assurance.\nParticipated in design and code reviews to uphold best practices in quality while providing constructive feedback that resulted in a **30%** reduction in post-release defects.\nManaged defect lifecycle using **Jira**, prioritizing and tracking bug resolutions to align with project delivery timelines, leading to an increased delivery speed of **15%**.\nUtilized **Elasticsearch** for backend testing to verify the accuracy and performance of search capabilities within applications, enhancing user experience.\nEnsured seamless integration of secure **REST APIs** by performing thorough regression testing and load testing in partnership with dev teams to mitigate performance risks in production environments.\nMaintained documentation of test cases, testing results, and QA best practices, fostering continuous improvement initiatives within the team."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Implemented comprehensive **QA processes** to ensure high-quality software delivery, utilizing **Jira** for tracking defects and managing tasks effectively.\nConducted **manual testing** and **API testing** using **Postman** and **Swagger**, ensuring all functionalities met the specified requirements with a testing coverage of over **90%**.\nCollaborated with cross-functional teams to enhance **communication** and streamline testing workflows, maintaining a clear channel for feedback and updates throughout the development cycle.\nDeveloped and executed test plans and test cases to validate core features and functionalities of financial platforms, achieving a **25%** reduction in critical bugs post-release.\nParticipated in continuous improvement activities to optimize the **test management** process and enhance the overall **QA** strategy, aligning with agile methodologies and best practices.\nTrained junior QA members on **manual testing** and efficient use of testing tools, fostering a culture of quality assurance within the team.\nReviewed requirements and specifications with stakeholders to identify testable conditions early, contributing to a smoother development and testing lifecycle."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Conducted comprehensive software testing to ensure high-quality deliverables through robust **QA processes**, including **manual testing** and **API testing** to identify and resolve issues pre-release.\nManaged test cases and defect tracking using **Jira**, facilitating effective **test management** and streamlined communication across development teams.\nDesigned and executed test plans for both backend and frontend features to cover critical functionalities, employing tools such as **Postman** and **Swagger** for thorough API validation.\nPresented detailed reports on test results and identified defects, utilizing metrics to enhance testing processes and improve overall product quality.\nCollaborated with cross-functional teams to uphold best practices in quality assurance, ensuring adherence to project timelines and compliance with industry standards.\nFostered transparent communication across departments, effectively reporting testing progress and providing insights to stakeholders regarding quality metrics.\nEnhanced existing QA methodologies by introducing new strategies and tools, aiming for continuous improvement in the testing lifecycle and overall software quality."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython: FastAPI, Flask, Django\n\tJavaScript/TypeScript: React, Vue, Angular\n\n **Backend Frameworks:**\n\tFastAPI\n\tFlask\n\tDjango\n\n **Frontend Frameworks:**\n\tReact\n\tVue\n\tAngular\n\n **API Technologies:**\n\tPostman\n\tSwagger\n\n **Serverless and Cloud Functions:**\n\tAWS: ECS, Lambda, RDS, S3\n\tAzure: App Services, Blob Storage, SQL Database\n\n **Databases:**\n\tPostgreSQL (Fintech)\n\tMySQL (Healthcare)\n\tMongoDB (Gaming)\n\tRedis\n\n **DevOps:**\n\tDocker\n\tKubernetes\n\tGitHub Actions\n\tGitLab CI/CD\n\tTerraform\n\tAnsible\n\tHelm\n\tDocker Compose\n\n **Cloud & Infrastructure:**\n\tAWS\n\tAzure\n\n **Other:**\n\tsoftware testing\n\tJira\n\ttest management\n\tQA processes\n\tmanual testing\n\tAPI testing\n\tcommunication\n",
  "apply_company": "Amusnet"
}