{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Backend Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "As a dedicated Senior Backend Engineer with 8 years of experience, I excel in utilizing **Python** and cloud platforms such as **AWS** to design and implement robust backend systems in support of scalable, reliable applications. My proficiency in distributed systems architecture includes expertise in **Kafka**, **RabbitMQ**, and **NATS** for efficient messaging, alongside experience with **gRPC** for high-performance communication. \nI bring a strong foundation in system design and a proven record of integrating applications using tools like **Workato**. My skills extend to problem-solving and fostering effective collaboration through clear communication. Additionally, I have hands-on experience in developing machine learning pipelines and supporting AI/ML capabilities across various sectors, which aligns well with the demands of modern backend systems.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Backend Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Designed and implemented robust and scalable backend systems using **Python** and **Golang**, ensuring high availability and reliability across distributed systems.\nDeveloped integration applications using **Kafka**, **RabbitMQ**, and **NATS** to facilitate seamless communication between microservices and enhance system performance.\nArchitected high-performance computing solutions, focusing on distributed system design principles to achieve maximum scalability under varying loads, with an emphasis on reliability and fault tolerance.\nUtilized **AWS** for cloud-based deployments, leveraging services such as AWS Lambda and EC2 to optimize resource management and reduce operational costs by **30%**.\nConducted problem-solving sessions with cross-functional teams to troubleshoot system issues, geared towards enhancing user experience and operational efficiency, resulting in a **20%** decrease in response time.\nCollaborated effectively with team members, utilizing strong communication skills to bridge gaps between technical and non-technical stakeholders and facilitate successful project outcomes.\nParticipated in system design workshops to draw architectural blueprints aimed at supporting a growing microservices architecture, ensuring alignment with business objectives and technology strategies.\nImplemented continuous integration and delivery (CI/CD) pipelines using tools like **GitHub Actions** and **CircleCI**, improving deployment frequency and reliability by up to **40%**.\nEnsured code quality and maintainability through rigorous testing protocols, employing testing frameworks and practices, while emphasizing systematic debugging and problem-resolution approaches.\nMonitored system performance through logging and metric systems to identify bottlenecks, proactively addressing potential issues ahead of time to enhance system reliability."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Utilized **Python** for implementing scalable and reliable microservices, enhancing system design in a distributed architecture to improve throughput for high-volume transaction systems.\nEmployed **Kafka** and **RabbitMQ** for establishing resilient event-driven architectures, fostering effective asynchronous communication and real-time event handling for transactions and alerts.\nLeveraged **AWS** services for cloud-based solutions, ensuring reliable integrations with various third-party applications and data sources.\nAnalyzed system requirements and designed solutions that prioritized scalability and reliability, tackling complex problem-solving challenges in backend development.\nDemonstrated proficient communication skills in cross-functional teams while articulating technical concepts and ensuring the successful integration of new features.\nDeveloped dynamic backend services that support high-load applications, utilizing frameworks such as **Django** and **FastAPI** for optimal performance in financial environments.\nImplemented asynchronous processing with **gRPC** to enhance response times in distributed systems, delivering reliable and efficient services.\nDriven to innovate backend solutions through the application of modern software engineering practices, achieving a **30%** reduction in response times and improving overall system performance by **25%**."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Developed robust backend systems using **Python** and **Java**, with a focus on **scalability**, **reliability**, and **system design** to support a global e-commerce platform.\nEngineered distributed systems leveraging **Kafka** and **RabbitMQ** for real-time data processing, facilitating responsive order updates and enhancing customer experience with a **99.9%** uptime.\nImplemented cloud solutions on **AWS**, ensuring high availability and optimizing resources for **high-traffic** e-commerce workflows, resulting in a **40%** reduction in latency.\nUtilized best practices for **problem-solving** and communication, collaborating effectively with cross-functional teams to align technical objectives with business goals.\nDesigned and maintained RESTful APIs, supporting integration with third-party services and internal tools, resulting in streamlined processes and improved data flow by **30%**.\nApplied knowledge of **NATS** and **gRPC** to enhance microservices communication, enabling efficient service-to-service interactions and reducing operational overhead by **25%**.\nConducted performance testing and troubleshooting, identifying bottlenecks in backend processes, and implementing optimizations that improved system response times by **50%**.\nLed architectural design reviews, advocating for best practices in code quality and infrastructure management, nurturing a culture of innovation and continuous improvement within the team.\nMentored junior engineers, providing guidance on software development methodologies and fostering an environment that encourages learning and professional growth."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, Java, Golang\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tJavaScript, TypeScript, React, Vue, Angular\n\n**API Technologies:**\n\tgRPC, RabbitMQ, Kafka, NATS\n\n**Serverless and Cloud Functions:**\n\tAWS, Azure\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, Workato, Integration App, distributed systems, scalability, reliability, system design, problem-solving, communication, Keycloak, JWT, OAuth2, Let’s Encrypt, Nginx, Certbot",
  "apply_company": "PandaDoc"
}