{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Backend Developer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-187801395/",
  "profile_summary": "Backend Developer with 13+ years of experience in delivering high-performance applications, particularly in the healthcare and financial industries. Proficient in **PHP**, building robust **APIs**, and managing **Databases** to ensure seamless data integration and retrieval. Skilled in using **Docker** for containerization and deployment, thus enhancing application scalability and maintainability.\nExperienced in developing **clean and maintainable code**, with a strong emphasis on **high-performance code** and **end-to-end feature development**. Well-versed in testing and deploying applications, with a focus on effective **monitoring** and ongoing optimization. Excellent **collaboration** and **communication skills**, facilitating teamwork in fast-paced environments.\nAdditionally, knowledgeable in AI/ML applications using **Python** and **Flutter**, with hands-on experience in **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django** for full-stack development. Familiar with **AWS** and **Azure** cloud services, as well as implementing microservices and CI/CD pipelines, ensuring compliance across industry standards such as HIPAA and PCI DSS.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Backend Developer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Developed robust APIs and backend services using **PHP**, ensuring high-performance code that adheres to clean and maintainable coding standards.\nDesigned and optimized databases for scalable data storage and retrieval, employing relational and NoSQL databases, to support efficient data operations and interactions.\nImplemented messaging brokers for seamless communication between services, ensuring reliable event-driven architectures in high-traffic environments.\nLed end-to-end feature development, collaborating with frontend teams to deliver fully integrated solutions that enhance user experience.\nExecuted deployment strategies that include containerization with **Docker**, streamlining processes to ensure continuous integration and delivery.\nEstablished comprehensive monitoring solutions to maintain system health and performance, utilizing various tools for real-time analytics and logging.\nDeveloped and enforced rigorous testing protocols, covering unit, integration, and end-to-end tests to guarantee code quality before deployment.\nCollaborated across teams to promote effective communication and knowledge sharing, enhancing project coordination and delivery timelines.\nIntegrated e-commerce functionalities within the backend systems, leveraging industry best practices to optimize user transactions and data security.\nAnalyzed and refined existing backend code to enhance performance metrics, aiming for **30%** improvement in load times and resource utilization compared to previous benchmarks."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Implemented and maintained **PHP** back-end services utilizing **APIs** to ensure seamless connectivity with front-end applications and third-party integrations, enhancing overall system interoperability.\nDesigned and optimized databases for high availability and performance, ensuring that data access and storage utilize best practices, yielding a **50%** improvement in query response time.\nDeveloped messaging solutions using **Kafka** and **RabbitMQ** for asynchronous communication between services, leading to reduced latency in transaction processing and improved system scalability.\nSupported containerization and orchestration of applications using **Docker**, leading to streamlined deployments and easier management of application environments across **5** different development teams.\nEnsured adherence to **Clean Code** principles while developing high-performance and maintainable code, resulting in a **30%** reduction in technical debt over the project lifecycle.\nCollaborated closely with cross-functional teams to define and prioritize product features, delivering end-to-end solutions that enhance user experience in e-commerce platforms.\nConducted rigorous testing and monitoring for systems deployed in production to maintain service reliability and performance, achieving an uptime increase to **99.9%**.\nFacilitated open communication skills within the team to enhance collaboration and improve project cycle efficiency by **25%** across the board."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Developed and maintained **high-performance backend services** using **PHP** and robust **APIs**, ensuring optimal data flow and seamless integration across various e-commerce functionalities.\nExecuted database management and optimization strategies with **Databases** such as **MongoDB** and **PostgreSQL**, achieving a **30%** improvement in data retrieval speed for high-traffic scenarios.\nLeveraged **Messaging Brokers** like **Kafka** and **RabbitMQ** to implement asynchronous messaging, enhancing responsiveness and enabling real-time updates for customer transactions and inventory management.\nUtilized **Docker** for containerization, streamlining deployment processes and ensuring consistency across development and production environments while reducing deployment time by **50%**.\nEmployed **Clean Code** practices to write maintainable and scalable code, achieving a **25%** reduction in bug frequencies during testing phases.\nConducted comprehensive testing and monitoring to ensure application reliability and performance, utilizing tools to enhance code quality and **end-to-end feature development**.\nCollaborated with cross-functional teams, employing strong **communication skills** to align project objectives, timelines, and solutions effectively in a fast-paced environment.\nParticipated in the deployment of features with a focus on maintaining clean and organized code base, enabling smoother updates and better team collaboration.\nImplemented robust security practices and adhered to e-commerce standards, ensuring customer data protection and enhancing the overall user experience."
    }
  ],
  "skills": "  **Programming Languages:** \n\tPHP, Python, JavaScript/TypeScript\n\n  **Backend Frameworks:** \n\tFastAPI, Flask, Django\n\n  **Frontend Frameworks:** \n\tReact, Vue, Angular\n\n  **API Technologies:** \n\tAPIs\n\n  **Serverless and Cloud Functions:** \n\tAWS: Lambda, Azure: App Services\n\n  **Databases:** \n\tPostgreSQL, MySQL, MongoDB, Redis\n\n  **Messaging Brokers:** \n\t\n\n  **DevOps:** \n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n  **Cloud & Infrastructure:** \n\tAWS: ECS, RDS, S3, Azure: Blob Storage, SQL Database\n\n  **Other:** \n\tMLflow, Airflow, Kubeflow, Clean Code, Maintainable Code, High-Performance Code, End-to-End Feature Development, Testing, Deployment, Monitoring, Collaboration, Communication Skills, E-commerce Knowledge, Authentication & Security: Keycloak, OAuth2, JWT, Nginx, Let’s Encrypt, Certbot"
}