{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Field Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "Accomplished Senior Field Engineer with 8 years of expertise in **lab automation**, **robotics**, and **electro-opto-mechanical systems**. I excel in delivering high-performance solutions and providing exceptional **customer support**, leveraging a strong foundation in **technical communication** and **problem-solving**. My technical toolkit includes **Salesforce** for streamlined client interactions and support operations.\nAdditionally, I have significant experience in **microservices architecture**, **event-driven systems**, and **CI/CD** automation, ensuring the development of robust and compliant applications. I have contributed to enterprise-scale projects integrating AI/ML capabilities and have hands-on experience in preventative maintenance to enhance system reliability and performance.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Field Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Provided technical communication and support for lab automation and robotics systems, ensuring seamless operation of **electro-opto-mechanical systems** with effective troubleshooting and problem-solving techniques.\nCollaborated with cross-functional teams to implement preventative maintenance schedules, reducing system downtime by **15%** and optimizing overall efficiency.\nLed the integration of **Salesforce** for improved customer relationship management, enhancing customer support workflows and increasing client satisfaction ratings by **20%**.\nDeveloped training materials and conducted workshops for team members and clients on best practices for lab automation and robotic systems.\nMonitored system performance metrics and generated reports to identify areas for improvement, successfully boosting operational productivity by **30%**.\nConducted regular site visits to assess equipment functionality and execute repair protocols, ensuring adherence to safety and quality standards.\nDesigned and executed customer support strategies that improved response times and resolution rates, achieving an average satisfaction score of **95%**.\nImplemented system upgrades and modifications in line with evolving industry standards and customer feedback, maintaining competitive advantage in service delivery."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Provided exceptional **customer support** to ensure seamless operation of **electro-opto-mechanical systems** in the field, addressing issues promptly and effectively.\nLeveraged strong **problem-solving** skills to diagnose technical issues and implement **preventative maintenance** strategies, reducing system failures by **25%**.\nUtilized effective **technical communication** to educate clients on proper system operation and troubleshooting, enhancing user satisfaction scores by **30%**.\nCollaborated with cross-functional teams to integrate **Salesforce** for tracking customer interactions and service requests, improving response times by **15%**.\nLed initiatives in **lab automation** projects, optimizing workflows and increasing productivity through innovative robotics solutions.\nDocumented technical processes and developed training materials for maintenance procedures, ensuring consistent knowledge transfer to team members and clients alike."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Applied strong technical communication skills to effectively collaborate with cross-functional teams while leveraging **Salesforce** for managing customer relationships.\nUtilized problem-solving expertise to troubleshoot and optimize lab automation processes and electro-opto-mechanical systems, enhancing operational efficiency by **30%**.\nExecuted preventative maintenance schedules for robotics systems, ensuring **99.9%** uptime and operational reliability through meticulous attention to detail.\nConducted training sessions for customer support teams on the proper handling and maintenance of advanced robotics equipment, improving client satisfaction scores by **25%**.\nDeveloped and managed technical documentation related to robotic systems and automation processes, facilitating clear communication and understanding among team members and stakeholders.\nEngaged proactively with customers to resolve issues, leading to a **40%** reduction in service downtime through effective solutions and support.\nDesigned and implemented comprehensive training materials for customers regarding robotics systems, incorporating feedback and practical examples to enhance learning outcomes.\nEvaluated and integrated new technologies into existing workflows, driving innovation and improving system performance by **15%**."
    }
  ],
  "skills": "Programming Languages:\n\tPython, JavaScript, TypeScript\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, lab automation, robotics, electro-opto-mechanical systems, Salesforce, customer support, problem-solving, technical communication, preventative maintenance",
  "apply_company": "Unchained Labs"
}