{
  "name": "Rei Taro",
  "role_name": "Senior Golang Engineer",
  "email": "rei515@outlook.com",
  "phone": "+48732529451",
  "address": "Warszawa, Poland",
  "linkedin": "https://www.linkedin.com/in/rei-taro-81a410391/",
  "profile_summary": "Results-driven Senior Golang Engineer with over 10 years of experience in backend system design and development, focused on delivering robust and scalable solutions using **Go**. Proficient in cloud platforms, including **AWS**, **Azure**, and **GCP**, and experienced with **Kubernetes**, **Terraform**, and **CI/CD** practices. Skilled in creating high-performance APIs and automation tools, with a strong emphasis on **Linux**, **Observability**, and **Security**. Recognized for effective **collaboration**, **communication**, and problem-solving abilities, having successfully contributed to major projects for esteemed organizations such as VISA, Sii Poland, and Reply Polska.",
  "education": [
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2010",
      "to_year": "2015",
      "location": "Japan",
      "university": "Keio University"
    }
  ],
  "experience": [
    {
      "role": "Senior Golang Engineer",
      "company": "Leobit",
      "from_date": "Aug 2022",
      "to_date": "Present",
      "location": "Poland",
      "responsibilities": "Utilized **Go** to engineer robust backend services focused on scalability and performance, optimizing document automation and user onboarding workflows.\nImplemented cloud solutions on **AWS**, **Azure**, and **GCP** to enhance system reliability and accessibility for diverse projects.\nDesigned and managed infrastructure using **Terraform**, guaranteeing efficiency and compliance across **Kubernetes** deployments.\nLeveraged CI/CD practices and GitOps methodologies to streamline software delivery, reducing deployment times by **30%**.\nExecuted security protocols, ensuring compliance with IAM frameworks, and integrated observability tools to monitor system health and troubleshoot effectively.\nDeveloped cross-functional collaboration strategies to tackle complex technical challenges, maintaining open lines of communication with stakeholders.\nEmployed **Linux** environments to optimize performance, boost system reliability, and enhance debugging capabilities, achieving a **99.9%** uptime.\nLed innovative problem-solving sessions to enhance overall team productivity and implement effective solutions for project roadblocks."
    },
    {
      "role": "Software Engineer",
      "company": "Innovature",
      "from_date": "Nov 2018",
      "to_date": "Jun 2022",
      "location": "Japan",
      "responsibilities": "Developed backend systems using **Go** and **FastAPI**, facilitating efficient document workflows and enhancing user onboarding processes.\nCreated event-driven microservices employing **Celery** and **Redis**, resulting in a **30%** increase in asynchronous processing capabilities for financial data and transaction requests.\nManaged the deployment of microservices on **Azure App Services**, utilizing **Terraform** for infrastructure automation, achieving consistent and scalable environments across **5** application instances.\nEngineered secure data pipelines utilizing **Apache Airflow** and **Azure Functions**, automating regulatory data exchanges while reducing manual processing time by **40%**.\nPerformed comprehensive security audits to ensure compliance with industry standards and integrated **OAuth2** and **Azure AD B2C** for robust authentication and access controls.\nCollaborated effectively with cross-functional teams to ensure seamless system integration, regulatory compliance, and successful release management, consistently receiving positive feedback for communication and teamwork skills."
    },
    {
      "role": "Software Developer",
      "company": "Wizcorp",
      "from_date": "Apr 2015",
      "to_date": "Nov 2018",
      "location": "Japan",
      "responsibilities": "Developed highly scalable backend services using **Go** and **AWS** for trade execution, portfolio management, and account tracking to enhance trading operations.\nEngineered real-time price feed processors leveraging **Kubernetes** and **Redis** to handle over **100,000** transactions per minute, ensuring up-to-the-minute trading data availability.\nCollaborated closely with frontend teams to deliver data through REST APIs and WebSocket channels, ensuring smooth user interaction with the platform.\nEnsured the platform met regulatory requirements, including MiFID II and GDPR, while adhering to internal data security protocols.\nImplemented comprehensive test suites with **CI/CD** practices and monitoring tools for improved observability, streamlining development cycles and reducing deployment times by **30%**.\nIntroduced job queuing and scheduling solutions using **Terraform** and **RabbitMQ**, optimizing backend task execution with a **50%** reduction in processing time and improved resource management.\nDemonstrated strong problem-solving and debugging skills, quickly addressing and resolving issues in production environments while maintaining high system reliability."
    }
  ],
  "skills": "**Programming Languages**\n\tPython (3.8+), SQL, Bash, JavaScript, Go\n\n**Backend Frameworks**\n\tFastAPI, Flask, Django, Celery\n\n**Frontend Frameworks**\n\t\n\n**API Technologies**\n\tREST/gRPC APIs, Microservices\n\n**Serverless and Cloud Functions**\n\tAWS (EC2, S3, Lambda), Azure, GCP\n\n**Databases**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps**\n\tDocker, Kubernetes, GitHub Actions, Azure DevOps, CI/CD, GitOps\n\n**Cloud & Infrastructure**\n\tTerraform, Linux, Observability, Security, IAM\n\n**Other**\n\tPandas, NumPy, scikit-learn, TensorFlow, Airflow, MLflow, Kafka, PyTest, Debugging, Problem-solving, Collaboration, Communication",
  "apply_company": "Elastic"
}