{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Programming Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "As a Senior Programming Engineer, I leverage expertise in **Python** to develop robust solutions while also proficiently working with **C#** and **Java**. My 8 years of experience enable me to implement high-performance applications with a deep understanding of software architecture principles. I excel in creating learning-focused environments, utilizing my teaching skills to mentor teams effectively.\n\nMy original strengths include a strong creative approach to problem-solving, patience in addressing complex coding challenges, and a commitment to developing intuitive and user-friendly applications. I possess a solid foundation in various development methodologies and have a knack for fostering collaborative teamwork, ensuring that project goals are met with excellence.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Programming Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Designed and developed applications using **C#**, **Java**, and **Python**, enhancing functionality and user experience for diverse projects.\n- Utilized **Unity** to create engaging and interactive learning environments, leveraging creativity and technical skills to foster student engagement in programming.\n- Implemented curriculum and programming workshops utilizing **Scratch** and **Minecraft** as teaching tools, demonstrating patience and effective communication to foster learning.\n- Developed game mechanics and educational models, showcasing creativity in problem-solving and active participation in team discussions.\n- Collaborated with cross-functional teams to develop innovative solutions, employing strong programming skills to address diverse challenges.\n- Mentored junior developers in coding practices and design patterns, enhancing team skill levels in **C#**, **Java**, and **Python** programming.\n- Led projects from conception through to deployment, delivering high-quality software products on time and within budget, achieving a **95%** project success rate.\n- Conducted code reviews and guided best practices, ensuring the highest standards in software development and quality assurance across teams.\n- Developed and enforced testing strategies leading to a **30%** increase in code efficiency and a reduction in error rates across applications.\n- Engaged in continuous professional development to stay current with industry trends, contributing to team innovation and the integration of new technologies."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Utilized **C#** and **Java** to develop robust software solutions, enhancing system performance and maintainability by implementing design patterns and clean code principles.\nEmployed **Python** for building scalable applications, leveraging frameworks such as FastAPI and Django to meet complex project requirements effectively.\nDemonstrated creativity in problem-solving while mentoring junior developers, fostering a collaborative environment that enhanced team productivity.\nDesigned and maintained interactive applications utilizing **C++**, focusing on optimizing performance and ensuring code quality through rigorous testing protocols.\nCreated engaging educational content on software development concepts, employing platforms like **Scratch** and **Minecraft** to teach programming fundamentals in an accessible manner.\nExercised patience and adaptability to tailor learning experiences for diverse audiences, ensuring a clear understanding of technical topics.\nAn orchestrated implementation of various technologies, building applications that served over **10,000** users and reduced page load times by **30%**.\nEngaged in continuous learning and development, contributing to team meetings with innovative ideas and solutions based on hands-on experience with the latest industry tools and practices."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Developed and optimized robust applications using **Python** and **C#**, leveraging frameworks to ensure high performance and reliability in coding.\nDesigned engaging learning experiences through programming languages, including **Java** and **C++**, fostering creativity and problem-solving skills among students.\nImplemented interactive projects utilizing **Minecraft** and **Unity** to teach complex programming concepts in an accessible manner, enhancing students' practical understanding of technology.\nUtilized **Scratch** to introduce beginner programmers to fundamental coding principles through gamification, ensuring a fun and effective learning environment.\nHarnessed creativity and patience to adapt teaching methods for various learning styles, optimizing the educational journey for over **100+ students** across different age groups.\nConducted workshops and one-on-one sessions, achieving an **85%+** increase in student engagement and understanding in programming fundamentals.\nEncouraged collaborative projects that emphasized teamwork and communication, leading to successful completion of over **30 projects** by students in real-world coding challenges.\nMentored junior instructors, sharing best practices and innovative teaching strategies, driving improvements in overall course delivery and student satisfaction ratings by **20%**."
    }
  ],
  "skills": " **Programming Languages:**\n\tC#, Java, Python, C++, JavaScript/TypeScript\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n **Frontend Frameworks:**\n\tReact, Vue, Angular\n\n **API Technologies:**\n\tJWT, OIDC, OAuth2\n\n **Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda), Azure (App Services)\n\n **Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD\n\n **Cloud & Infrastructure:**\n\tTerraform, Ansible, Helm, Docker Compose, AWS (RDS, S3), Azure (Blob, SQL)\n\n **Other:**\n\tMLflow, Airflow, Kubeflow, Keycloak, Let’s Encrypt, Nginx, Certbot, Minecraft, Scratch, Unity, Teaching, Creativity, Patience",
  "apply_company": "Coding Giants España"
}