{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Engineer Software",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Accomplished Full Stack Developer with 13+ years of experience focused on delivering high-performance applications in agile environments. Proficient in **C#**, implementing **CI/CD** pipelines, and optimizing system performance. Strong expertise in system architecture, code reviews, and testing frameworks, ensuring software reliability and efficiency. Skilled in JavaScript/TypeScript, Python, and Flutter, with hands-on expertise in frontend and backend development using **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**. Experienced in building AI/ML-powered platforms that support predictive analytics, automation, and real-time processing. Proficient in deploying cloud-native systems on **AWS** and **Azure**, and implementing microservices and event-driven architectures. Well-versed in compliance-driven development aligning solutions with HIPAA, FHIR, PCI DSS, and SOC 2 standards. Strong background in MLOps, including model training, serving, and orchestration using **MLflow**, **Airflow**, and **Kubeflow**.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Engineer Software",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Focused on **C#** development to enhance system architecture and performance optimization for various projects, ensuring robust and scalable software solutions.\nEmployed **agile** methodologies to facilitate collaborative team environments, enhancing project delivery timelines by **25%** through iterative development practices.\nImplemented comprehensive **CI/CD** pipelines that reduced deployment time by up to **40%**, utilizing tools like GitHub Actions, CircleCI, and Azure DevOps to ensure seamless integration and delivery.\nConducted thorough **code reviews** and utilized **testing frameworks** such as Jest, Cypress, and PyTest, improving code quality and coverage by over **30%** across all projects.\nChampioned collaborative efforts between cross-functional teams to align project goals and ensure stakeholder satisfaction, leveraging effective communication and negotiation skills.\nOptimized existing application performance through ongoing analysis and improvement strategies, achieving a **15%** increase in efficiency across key functionalities.\nLed initiatives for robust system architecture transformations that minimized technical debt and facilitated future scalability, fostering better software resilience and maintainability.\nFostered a culture of continuous improvement and innovation within the team, leading to the adoption of new technologies and best practices for enhanced development workflows."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Ensured high-performance optimization of financial systems through systematic code reviews and collaboration with cross-functional teams, elevating software quality to meet rigorous standards.\nImplemented and maintained **CI/CD** pipelines, streamlining integration and deployment processes to reduce time to market by up to **30%**.\nLed the design of scalable system architectures, applying **agile** methodologies to enhance project efficiency and responsiveness, resulting in a **25%** reduction in development timeframes.\nModernized core financial platforms by migrating to microservices architecture using **Node.js** (NestJS/Express) and **Python** (FastAPI, Django), enhancing scalability and performance for high-volume transactional systems.\nDelivered high-performance front-end applications with **React** (18), **Vue 3**, **Next.js**, and **TypeScript**, utilizing **Redux Toolkit** and **Tailwind CSS** to create sleek, responsive interfaces for financial tools and admin panels.\nDesigned and deployed a robust event-driven architecture using **Kafka**, **RabbitMQ**, and **Azure Service Bus**, ensuring asynchronous communication across critical workflows such as payments, alerts, and compliance.\nDeveloped ETL pipelines for ingesting financial data from internal and third-party sources using **Python**, **Apache Airflow**, and **Azure Data Factory**, supporting both batch and real-time processing.\nCreated and deployed machine learning models for fraud detection using **scikit-learn**, **XGBoost**, and **Azure ML**, enabling proactive detection of suspicious activity based on user behavior and transaction patterns.\nCreated ML pipelines for real-time credit scoring, churn prediction, and transaction classification, leveraging **MLflow** and **Airflow** to integrate model inference into backend services."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Utilized **C#** in an Agile environment to design and implement high-performance software applications, achieving a 30% increase in system efficiency and reducing latency.\nParticipated in **CI/CD** pipeline development to automate deployment processes, resulting in a 40% decrease in release times and enhanced overall productivity.\nConducted thorough code reviews and implemented robust testing frameworks to ensure code quality, significantly reducing bugs by 25% and improving application reliability.\nCollaborated with cross-functional teams to optimize system architecture, successfully scaling applications to handle a **200,000+** user base without degradation in performance.\nImplemented performance optimization strategies, including load balancing and caching mechanisms, achieving a speed improvement of **50%** in response times.\nFacilitated Agile ceremonies and supported sprint planning, enhancing team collaboration and aligning development with business goals.\nEngaged in collaborative development sessions, sharing knowledge and best practices to foster a culture of continuous improvement within the team."
    }
  ],
  "skills": "**Programming Languages:**\n\tC#, Python, JavaScript, TypeScript\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\t\n\n**Serverless and Cloud Functions:**\n\tAWS: Lambda, Azure: App Services\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS: ECS, RDS, S3, Azure: Blob Storage, SQL Database\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, keycloak, OAuth2, JWT, Nginx, Let’s Encrypt, Certbot, agile, performance optimization, system architecture, testing frameworks, code reviews, collaboration",
  "apply_company": "Paylocity"
}