{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior System Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "As a proactive Senior System Engineer with 8 years of experience, I have a strong background in managing and optimizing systems using technologies such as **PowerShell**, **REST API**, **Windows Server**, and **Active Directory**. My hands-on expertise in enterprise-level deployment and systems integration ensures that operations are seamless and efficient, fostering robust team collaboration.\nFluent in both German and English, I emphasize cross-cultural communication in diverse working environments. I leverage my extensive knowledge to implement and support Exchange configurations while utilizing tools like **Baramundi** for effective IT asset management. I can rapidly troubleshoot and resolve system issues, ensuring high availability and performance for critical applications.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior System Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Maintained and optimized **Windows Server** environments, ensuring reliable system performance and availability for enterprise applications.\n- Developed and implemented **REST API** solutions for integrating various systems and applications, enhancing data accessibility and interoperability.\n- Managed Active Directory and Exchange services to ensure secure, efficient user authentication and email communication across the organization.\n- Utilized **PowerShell** scripting to automate system administration tasks, improving operational efficiency and reducing manual intervention by approximately **30%**.\n- Led team collaboration efforts, fostering an environment that promotes effective communication and problem-solving across cross-functional teams. \n- Translated technical documentation and provided support in both **German** and **English**, facilitating effective communication with diverse stakeholders.\n- Deployed and managed **Baramundi** for endpoint management, ensuring compliance and security across all client devices within the corporate network.\n- Collaborated with IT teams on incident management, achieving a resolution rate of **95%** on first-call incidents through enhanced troubleshooting practices.\n- Designed and executed system upgrade projects that reduced downtime by **40%**, employing structured project management methodologies and team coordination."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Facilitated team collaboration in the design and implementation of **REST API** services to enhance system interoperability across platforms and applications.\nManaged Windows Server environments, ensuring the deployment and installation of necessary updates while leveraging **PowerShell** scripting for efficient system administration.\nAdministered **Active Directory** for user management and permissions, supporting seamless access control within multi-language environments, including **German** and **English**.\nExecuted the integration of **Exchange** for optimized email communication, enabling efficient collaboration within teams through aligned workflows.\nUtilized **Baramundi** for automated management of end-user devices, ensuring a consistent and secure system across various endpoints.\nParticipated in documenting procedures and system changes, fostering knowledge sharing and helping to streamline operations within engineering teams.\nSupported troubleshooting and resolution of technical issues, applying strong analytical skills to maintain high system uptime and performance for end-users."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "- Implemented **REST API** services to enhance system integration and communication, improving interoperability within the e-commerce platform.\n- Collaborated effectively with cross-functional teams, fostering **Team Collaboration** to drive project success and optimizations.\n- Managed and maintained **Windows Server** environments, ensuring high availability and performance across multiple applications.\n- Utilized **PowerShell** scripting for automation tasks, streamlining repetitive processes and reducing manual workload by **30%**.\n- Administered **Active Directory** for user management and access control, facilitating robust security measures and compliance with data protection regulations.\n- Configured and supported **Exchange** services for seamless email communication, enhancing organizational efficiency and response times.\n- Provided technical documentation and support in both **German** and **English**, ensuring clarity and understanding among diverse stakeholders throughout the project lifecycle.\n- Leveraged **Baramundi** for endpoint management, streamlining deployment and configuration processes for improved efficiency and reduced downtime.\n"
    }
  ],
  "skills": "Programming Languages:\n\tPython(FastAPI, Flask, Django), JavaScript/TypeScript (React, Vue, Angular)\n\n**Backend Frameworks:**\n\t\n\n**Frontend Frameworks:**\n\t\n\n**API Technologies:**\n\tREST API\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\t\n\n**Other:**\n\tPowerShell, Baramundi, Windows Server, Active Directory, Exchange, Team Collaboration, German, English, MLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot",
  "apply_company": "netgo"
}