{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-152840397/",
  "profile_summary": "Results-oriented Senior Engineer with 8 years of experience specializing in **TypeScript**, **React**, and **Node.js**, with a strong foundation in developing enterprise-grade applications. Proficient in employing **CI/CD** practices and Agile methodologies to ensure efficient deployment and project management. Demonstrated expertise in designing scalable systems utilizing **Postgres** and **Redis**, while fostering collaboration and communication among cross-functional teams.\nAdditionally, I leverage modern technologies such as **GraphQL** for seamless data fetching and management, and I’m committed to optimizing performance in high-demand environments. My background in full-stack development includes significant experience with **Python** and **Flutter**, along with proficiency in integrating AI/ML capabilities into applications. I have hands-on experience in the cloud with **AWS** and **Azure**, as well as implementing secure, compliant solutions for healthcare and finance sectors using protocols like HIPAA, FHIR, PCI DSS, and SOC 2.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Developed scalable applications using **TypeScript**, **Node.js**, and **React (17-18)**, ensuring adherence to Agile methodologies for consistent delivery and collaboration.\n• Managed data architecture with **PostgreSQL** and **Redis**, optimizing performance for data-intensive applications and ensuring effective communication with cross-functional teams.\n• Implemented **CI/CD** pipelines with tools like GitHub Actions, enhancing deployment efficiency and reliability while fostering a culture of shared responsibility through **SRE** practices.\n• Crafted and maintained **GraphQL** APIs for seamless data interaction in applications, utilizing Design Systems to ensure consistency in UI/UX across teams.\n• Led Agile ceremonies to enhance team collaboration and communication, resulting in a structured approach to project management and delivery timelines.\n• Collaborated closely with stakeholders to translate business requirements into technical solutions, maintaining open channels for feedback and improvement.\n• Designed responsive and dynamic interfaces with **React**, ensuring compatibility with web standards and enhancing user experience.\n• Worked on performance optimization of applications, achieving a 30% reduction in load time through effective coding practices and resource management.\n• Enhanced visibility into operational KPIs and transaction trends through data visualization tools, achieving a 25% increase in reporting efficiency.\n• Established rigorous testing methodologies using Jest and Cypress, achieving comprehensive coverage and reducing production bugs by 40% over a 6-month period."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Utilized **TypeScript** and **React** (18) to build dynamic, user-focused front-end applications for financial dashboards, employing **Design System** principles to enhance user experience and accessibility.\nLeveraged **Node.js** (NestJS/Express) to develop and modernize financial platforms, enhancing scalability and maintainability with a microservices-based architecture, resulting in a **50% improvement** in system throughput for high-volume transaction processing.\nImplemented agile methodologies and CI/CD practices to streamline development processes, achieving a **30% reduction** in deployment times and improving team collaboration across cross-functional projects.\nEmployed **Postgres** and **Redis** for efficient data storage and retrieval in transaction monitoring systems, optimizing performance by **40%** and enabling real-time analytics capabilities.\nIntegrated **GraphQL** to provide flexible APIs for front-end applications, enhancing data fetching efficiency and reducing the number of network requests by **60%**.\nCollaborated closely with product and design teams to align on project goals, ensuring clear communication and a cohesive project vision throughout the development lifecycle.\nChampioned SRE best practices to improve system reliability, establishing monitoring and alerting mechanisms that reduced downtime incidents by **35%** in production environments."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "• Utilized **TypeScript** and **React** (v18) to develop dynamic, user-centric frontend applications, enhancing user engagement and overall usability in alignment with design systems.\n• Implemented **Node.js** (NestJS, Express) for building robust backend services, ensuring efficient data processing and seamless integration with databases like **Postgres** and **Redis**.\n• Designed and maintained **GraphQL** APIs, improving data retrieval efficiency and enabling more flexible interactions for front-end components.\n• Led Agile methodologies to promote rapid iteration and continuous delivery, fostering a collaborative environment among cross-functional teams.\n• Employed **Continuous Integration/Continuous Deployment (CI/CD)** practices, streamlining release cycles and enhancing deployment efficiency while maintaining high-quality standards.\n• Collaborated closely with stakeholders to communicate progress and gather requirements, ensuring alignment with project goals and user needs.\n• Optimized application performance using techniques such as caching and load balancing, significantly enhancing system responsiveness under high traffic conditions (up to **90%** improvement in data access time).\n• Applied principles of **Site Reliability Engineering (SRE)** to monitor system health and improve uptime, achieving a service availability rate of **99.9%**.\n• Fostered teamwork and cooperation through effective communication strategies and regular collaboration sessions, driving project success and team morale.\n• Contributed to overall system architecture and design systems, ensuring consistency and scalability in development processes."
    }
  ],
  "skills": " **Programming Languages:**\n\tTypeScript, Python, JavaScript\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django, Node.js\n\n**API Technologies:**\n\tGraphQL\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, Agile, SRE, Design System, Communication, Collaboration",
  "apply_company": "Ashby"
}