{
  "name": "Tomasz Lee",
  "role_name": "Senior HubSpot Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Results-driven Senior HubSpot Engineer with 9+ years of experience in API integrations and CRM solutions. Proficient in designing and implementing **HubSpot** workflows, **custom objects**, and automation processes that enhance customer engagement and streamline operational efficiencies. Skilled in REST APIs, **Zapier**, and **Workato** for seamless data connections. Additionally, possess a strong foundation in frontend technologies, including **HTML**, **CSS**, and **JavaScript**, along with backend proficiency in SQL. Leverage my expertise to lead projects and collaborate effectively across diverse teams, ensuring successful delivery of innovative solutions.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Senior HubSpot Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Designed and developed custom CRM solutions using **HubSpot** to optimize workflow design and automation, leading to a 25% increase in user satisfaction.\nBuilt and integrated **REST APIs** for seamless interaction between **HubSpot** and external systems, enhancing data accessibility and operational efficiency.\nDeveloped custom objects in **HubSpot** to improve data structure and support specific business requirements.\nImplemented automated workflows within **HubSpot**, resulting in a 30% reduction in manual processes.\nUtilized **Zapier** and **Workato** for efficient data integration and task automation, enhancing overall productivity by 20%.\nCreated dynamic and responsive interfaces using **HTML**, **CSS**, and **JavaScript**, leading to an improved user experience across devices.\nExecuted SQL queries to retrieve and manipulate data within **HubSpot**, optimizing performance and supporting reporting needs.\nCollaborated with cross-functional teams to enhance the functionality of the **HubSpot** platform, fostering efficient project delivery.\nStabilized and secured application integrations by implementing robust API authentication protocols.\nEnsured compliance with CRM best practices through rigorous testing and user feedback integration."
    },
    {
      "role": "Software Engineer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "Developed and implemented **REST APIs** within **HubSpot** to enhance CRM functionalities and automation processes, significantly improving workflow efficiency by 20%.\nEstablished custom objects within **HubSpot** to tailor the CRM experience, ensuring alignment with customer requirements and business goals.\nDesigned workflow automation using **Zapier** and **Workato**, resulting in a **30%** reduction in manual tasks and streamlining operations.\nCreated engaging user interfaces using **HTML**, **CSS**, and **JavaScript**, increasing user satisfaction scores by **15%**.\nCollaborated with cross-functional teams to gather and define system requirements, adhering to project timelines for successful project delivery.\nOptimized SQL queries for performance improvement, leading to faster data retrieval and enhanced reporting capabilities.\nConducted training sessions on **HubSpot**features for team members, fostering a knowledge-sharing culture within the organization.\nUtilized **HubL** for dynamic content creation, enhancing the customization capabilities of the platform.\nLed code reviews and provided mentorship to junior developers, contributing to a **25%** increase in team productivity."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "Utilized **HubSpot** to design and implement custom objects, enhancing CRM functionality and enabling tailored solutions for clients.\nLeveraged **REST APIs** to facilitate data integration between HubSpot and external systems, improving workflow automation by 25%.\nDeveloped custom workflows using **Zapier** and **Workato** to streamline operational processes, reducing manual tasks and increasing efficiency.\nCrafted visually appealing user interfaces with **HTML**, **CSS**, and **JavaScript** for enhanced user engagement and experience.\nIntegrated third-party APIs to enrich HubSpot data, enabling smarter marketing strategies and improved analytics.\nManaged data with **SQL** to ensure accurate reporting and seamless access to customer insights, reducing data retrieval time by 30%.\nParticipated in the design of automation strategies within HubSpot, aligning marketing and sales processes for better lead management.\nContributed to the development of technical documentation, leading to a 15% decrease in onboarding time for new team members.\nCollaborated in cross-functional teams for daily standups and code reviews, ensuring project goals were met consistently.\n"
    }
  ],
  "skills": "**Programming Languages**\n\tHTML, CSS, JavaScript, TypeScript, Python, SQL\n\n**Backend Frameworks**\n\tNodeJS, ExpressJS, NestJS, C#, .NET, Entity Framework, Microservices\n\n**Frontend Frameworks**\n\tReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n**API Technologies**\n\tREST APIs, GraphQL, API, HubL\n\n**Serverless and Cloud Functions**\n\tAWS, Azure, CI/CD pipelines\n\n**Databases**\n\tMSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB\n\n**DevOps**\n\tGit, GitHub\n\n**Cloud & Infrastructure**\n\tCRM, workflow design, automation, custom objects, Zapier, Workato\n\n**Other**\n\tMessaging & Caching: Apache Kafka, RabbitMQ, Redis, Testing Tools: NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest, Blockchain: Solidity, Ether.js, Web3.js, Ethereum, UX/UI Design",
  "apply_company": "Somewhere"
}