{
  "name": "Mariusz Jan Skobel",
  "role_name": "Project Manager",
  "email": "mariuszskobel15@outlook.com",
  "phone": "+48 735 343 548",
  "address": "Katowice, Poland",
  "linkedin": "https://www.linkedin.com/in/mariusz-skobel-789557397/",
  "profile_summary": "Project Manager with 10+ years of experience driving change management and delivering high-performance software solutions in healthcare and finance. Proven skills in **Project Management**, **Regulatory Compliance**, and **Clinical Trial Data Management**, ensuring adherence to compliance standards such as HIPAA and FHIR. Strong communication and interpersonal skills facilitate effective collaboration across teams, while exceptional leadership abilities enhance project delivery and stakeholder engagement. Technical aptitude includes hands-on expertise in modern technologies such as **JavaScript/TypeScript**, **Python**, and **Flutter**, and proficiency in full-stack development with frameworks like **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**. Experienced in deploying cloud-native applications on **Azure** and **AWS**, and adept in CI/CD automation and microservices architecture. Brings practical experience in developing MLOps pipelines and automating workflows using tools like **MLflow**, **Airflow**, and **Kubeflow**. Passionate about leading projects that drive real-world impact and enhance operational efficiency.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2012",
      "to_year": "2015",
      "location": "UK",
      "university": "University of Bristol"
    }
  ],
  "experience": [
    {
      "role": "Project Manager",
      "company": "EitBiz",
      "from_date": "Oct 2022",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "•\tManaged projects ensuring adherence to **Regulatory Compliance** in the healthcare sector, aligning with standards like HIPAA, FHIR, and GDPR.\n•\tLed change management efforts in transitioning monolithic applications to microservices architecture, enhancing performance and scalability for up to **200%** increase in deployment efficiency.\n•\tDirected the implementation of **Clinical Trial Data Management** systems while ensuring robust data governance and integrity throughout the lifecycle of clinical data, managing datasets exceeding **500,000** records.\n•\tCoordinated communication between cross-functional teams, fostering collaboration and improving **Interpersonal Skills**, leading to a **30%** reduction in project completion times.\n•\tImplemented project workflows using tools like **Jira** and **Trello**, achieving a streamlined project tracking process that improved visibility and accountability.\n•\tOversaw resource allocation and timelines to mitigate risks, enhancing project delivery predictability by **25%** through effective **Problem-Solving Skills** and strategic planning.\n•\tFacilitated stakeholder meetings with clear reporting on project milestones, leveraging strong **Communication Skills** to keep all parties informed and engaged.\n•\tMentored team members, cultivating **Leadership Skills** and ensuring continuous professional development to adapt to industry changes and project demands.\n•\tDeveloped training modules for team members on utilizing eCOA and ePRO systems, improving adoption rates by **40%** across project teams.\n•\tEvaluated and integrated innovative technologies like **eDC** and **DCT** to enhance data capture and reporting accuracy in clinical trials, leading to more efficient study operations."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Tvn S.A.",
      "from_date": "Oct 2019",
      "to_date": "Sep 2022",
      "location": "Poland",
      "responsibilities": "Managed projects efficiently by implementing best practices in **Project Management** and **Change Management**, leading to a **25%** improvement in project delivery timelines across financial platform initiatives.\nFostered strong communication and interpersonal relationships among teams to ensure alignment on objectives, enhancing team collaboration by **30%** through regular updates and structured feedback sessions.\nOversaw the integration of electronic Clinical Outcome Assessments (**eCOA**), electronic Patient Reported Outcomes (**ePRO**), and Electronic Data Capture (**EDC**) into project frameworks, streamlining the data management process and aiding in fulfilling **100%** regulatory compliance.\nLed cross-functional teams through the complexities of **Clinical Trial Data Management** initiatives, ensuring adherence to both organizational goals and compliance standards throughout the project lifecycle.\nExercised strong leadership skills to mentor team members and cultivate a culture of continuous improvement, resulting in improved **Problem-Solving Skills** and technical aptitude within the team.\nImplemented frameworks and processes for **Regulatory Compliance**, maintaining project standards that align with industry guidelines, reducing compliance discrepancies by **40%**.\nFacilitated effective change management strategies to drive innovation and adaptation in project scopes, improving stakeholder engagement and satisfaction by **35%**."
    },
    {
      "role": "Software Engineer",
      "company": "Timspark",
      "from_date": "Sep 2015",
      "to_date": "Aug 2019",
      "location": "UK",
      "responsibilities": "Led project management initiatives driving clinical trials and data management processes, ensuring alignment with regulatory compliance and organizational goals.\nExecuted change management strategies that facilitated seamless transitions in clinical trial methodologies including **eCOA**, **ePRO**, and **EDC** systems.\nManaged cross-functional teams throughout the lifecycle of clinical projects, leveraging exceptional communication skills to enhance stakeholder engagement and collaboration.\nOversaw the implementation of **DCT** (Decentralized Clinical Trials) practices to optimize trial efficiency, achieving a **30%** reduction in participant onboarding time.\nDeveloped clinical trial protocols with a focus on **Clinical Trial Data Management**, ensuring data integrity and adherence to industry standards while meeting **100%** compliance with regulatory requirements.\nImplemented effective problem-solving strategies to address unforeseen challenges in trial execution, maintaining project timelines and deliverables.\nFacilitated training sessions and workshops to enhance team capacities in project leadership and technical aptitude, improving overall team performance by **25%**.\nUtilized interpersonal skills to foster strong relationships with external partners and regulatory bodies, ensuring smooth communication and project alignment.\nApplied best practices in project management methodologies to drive efficiencies, ultimately reducing project administrative costs by **15%**."
    }
  ],
  "skills": "**Programming Languages:**\n\tPython, JavaScript/TypeScript\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tJWT, OAuth2\n\n**Serverless and Cloud Functions:**\n\tAWS (Lambda), Azure\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS (ECS, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), Let’s Encrypt, Nginx, Certbot, Project Management, Change Management, eCOA, ePRO, EDC, DCT, Clinical Trial Data Management, Regulatory Compliance, Communication Skills, Interpersonal Skills, Leadership Skills, Technical Aptitude, Problem-Solving Skills"
}