{
  "name": "Tomasz Lee",
  "role_name": "Senior Backend Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Results-driven Senior Backend Engineer with 9+ years of robust experience in microservices architecture, leveraging cutting-edge technologies such as **Kotlin**, **AWS**, **Kubernetes**, and **PostgreSQL**. Demonstrated expertise in developing and implementing scalable backend solutions and utilizing tools like **JUnit** and **Testcontainers** for efficient testing and deployment. Proficient in collaboration and problem-solving, with a strong background in distributed systems. Adept at leading cross-functional teams and delivering high-quality projects on time, ensuring performance optimization and streamlined development processes.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Senior Backend Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Designed and implemented a **microservices** architecture for a web-based platform, enhancing scalability and maintainability.\nUtilized **Kubernetes** for efficient container orchestration, improving deployment processes.\nLeveraged AWS cloud services to optimize application performance and ensure high availability.\nDeveloped and maintained **PostgreSQL** databases, enhancing data integrity and performance monitoring.\nEmployed **JUnit** and **Testcontainers** for unit testing and integration testing, achieving **95%** code coverage throughout the project.\nIntegrated **Grafana** for monitoring and visualizing service performance metrics, improving operational visibility by **40%**.\nOptimized existing services, resolving performance bottlenecks through strategic problem-solving techniques.\nCollaborated with cross-functional teams to enhance overall system architecture, leading to better project alignment and delivery timelines.\nAdvanced the reporting capabilities of the platform by implementing interactive visualizations and comprehensive analytics.\nEnsured code quality through peer code reviews and instituted best practices, fostering a culture of collaboration."
    },
    {
      "role": "Full Stack Developer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "• Developed microservices architecture using **AWS** and **Kubernetes** to enhance scalability and maintainability, leading to a system uptime of **99.9%**.\n• Implemented data storage solutions with **PostgreSQL** for efficient retrieval, resulting in a latency increase of over **20%** compared to previous systems.\n• Utilized **JUnit** and **Testcontainers** for comprehensive unit testing, boosting code coverage to **85%**, ensuring robust application performance.\n• Designed and developed backend services in **Kotlin**, focusing on high-performance and low-latency data processing to meet project requirements.\n• Employed **Grafana** to monitor application health and performance metrics, enabling proactive issue resolution and optimizing server resource usage.\n• Actively participated in collaborative efforts with cross-functional teams to define project scopes and delivery schedules, showcasing strong problem-solving and teamwork abilities.\n• Conducted code reviews and provided mentorship to junior developers, fostering a culture of continuous improvement and skill enhancement within the team.\n• Collaborated with front-end teams to integrate backend APIs effectively, ensuring seamless user experiences across applications."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "Utilized **microservices** architecture to develop robust backend services, enhancing scalability and maintainability of applications.\nImplemented cloud solutions using **AWS** to optimize deployment and resource management across services, achieving a reduction in operational costs by **15%**.\nDesigned and maintained databases using **PostgreSQL**, improving data retrieval times by **25%** through optimized query structures and indexing techniques.\nEmployed **Kubernetes** for orchestrating containerized applications, ensuring high availability and automated deployment pipelines.\nDeveloped and executed unit and integration tests using **JUnit** and **Testcontainers**, achieving a code coverage rate of over **85%** for new features.\nMonitored application performance and user metrics through **Grafana**, leading to proactive resolutions of potential issues before they impacted users.\nCollaborated effectively with cross-functional teams to address complex technical challenges, fostering an environment of **problem-solving** and **collaboration**.\nParticipated actively in code reviews, mentoring junior developers in best practices to ensure high standards of code quality and team cohesion.\nLed discussions in daily standups for project coordination, enhancing team communication and alignment with project objectives.\nDelivered comprehensive documentation for microservices APIs, facilitating easier onboarding for new team members and improving overall team efficiency."
    }
  ],
  "skills": "  **Programming Languages**\n\tKotlin, Python, JavaScript, TypeScript\n\n  **Backend Frameworks**\n\tNodeJS, ExpressJS, NestJS, C#, .NET, Microservices\n\n  **Frontend Frameworks**\n\tReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n  **API Technologies**\n\tRESTful API, GraphQL\n\n  **Serverless and Cloud Functions**\n\tAWS, Azure\n\n  **Databases**\n\tMSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB\n\n  **DevOps**\n\tCI/CD pipelines, Kubernetes\n\n  **Cloud & Infrastructure**\n\tGrafana\n\n  **Other**\n\tUX/UI Design, Git, GitHub, Testing Tools: NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest, Problem-solving, Collaboration, Testcontainers, Blockchain: Solidity, Ether.js, Web3.js, Ethereum, Redis, Apache Kafka, RabbitMQ",
  "apply_company": "Pleo"
}