{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Engineer - Applied AI",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-karol-kotlinski-bb2520397/",
  "profile_summary": "Results-driven Engineer - Applied AI with 8 years of experience, specializing in **Python**, **TypeScript**, and **React** for developing advanced AI-driven applications. I possess a strong command of **GraphQL** and have hands-on experience with cloud platforms such as **GCP** and utilities including **Terraform** and **Kubernetes**. My proficiency extends to machine learning and natural language processing (NLP), enabling me to develop and deploy LLM solutions efficiently.\n\nWith a history of building high-performance applications in healthcare and finance, I leverage modern frameworks and tools to enhance Developer Experience and streamline CI/CD processes. I have a proven track record in rapid prototyping, ensuring alignment with compliance standards like HIPAA and PCI DSS while integrating robust security practices. My communication skills facilitate collaborative project environments, and I am adept at translating complex technical concepts into actionable strategies.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Engineer - Applied AI",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Developed and integrated advanced **NLP** models using Python, enhancing healthcare document parsing and financial anomaly detection, while embedding them into core services through RESTful APIs.\n- Engineered scalable **Python** applications utilizing **FastAPI**, ensuring high performance for various healthcare and fintech platforms while adhering to industry-specific regulations including HIPAA and PCI DSS.\n- Built robust full-stack applications leveraging **TypeScript** and **React** (17-18), enabling responsive design and efficient user interfaces for both healthcare and financial sectors.\n- Designed and maintained efficient data architectures leveraging **Postgres** and **GraphQL**, optimizing large-scale data ingestion, storage, and querying processes essential for critical healthcare and financial applications.\n- Implemented comprehensive **DevOps** practices using **Kubernetes** and **Terraform**, establishing CI/CD pipelines that supported multi-environment deployments and ensured software reliability across the board.\n- Collaborated with cross-functional teams to drive **cloud services** integration using AWS and GCP, enhancing application performance and scalability while reducing operational costs.\n- Developed and deployed **machine learning** models for various use cases, including patient risk prediction and financial fraud detection, employing **scikit-learn**, **PyTorch**, and **TensorFlow** for advanced analytics.\n- Integrated advanced **AI-based features** into client-facing applications, such as personalized health recommendations and predictive alerts, utilizing APIs hosted on **Azure ML**.\n- Established robust test strategies using **Jest**, **Cypress**, **PyTest**, and **Postman**, ensuring comprehensive coverage across unit, integration, and E2E testing protocols for both front-end and backend services.\n- Delivered intricate financial data visualizations using **D3.js** and **Power BI Embedded**, providing real-time insights into transaction trends and operational KPIs, crucial for decision-making processes.\n- Enhanced developer experience through rapid prototyping, employing various frameworks and tools to streamline development workflows and improve communication across teams.\n- Spearheaded the transition from monolithic architectures to microservices utilizing **Docker** and **Kubernetes (AKS/EKS)**, improving system resilience and scalability."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Utilized **Python** and **TypeScript** to develop innovative AI-driven solutions in compliance with applied AI strategies, enhancing user experience and operational efficiency across financial platforms.\nEmployed **React (18)** and **GraphQL** for building versatile front-end applications, ensuring responsiveness and user-focus while increasing adoption rates by **30%**.\nLeveraged **Postgres** for achieving seamless data storage solutions that support dynamic queries and optimize performance, resulting in faster access to transaction data by **25%**.\nImplemented **Kubernetes** and **Terraform** for orchestrating cloud services, significantly enhancing deployment efficiency and scalability in a **GCP** environment.\nApplied **DevOps** practices to streamline development pipelines, reducing time to market for new features by **40%** through improved developer experience and collaboration.\nDeveloped and deployed complex **NLP** algorithms for processing transaction data, resulting in a more intelligent decision-making framework within the organization.\nConducted rapid prototyping sessions to iterate on AI/ML models powered by **LLM**, ensuring alignment with business goals and significantly reducing development cycles.\nDesigned and implemented integrated communication channels for teams through AI-assisted tools, enhancing information flow and collaborative efforts across departments."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Leveraged **Python** for developing and optimizing AI-driven backend solutions utilizing **NLP** and **LLM** technologies, ensuring scalability and responsiveness in e-commerce AI applications.\nEngineered automated solutions with **GraphQL** to streamline data retrieval, enhancing performance and user experience while reducing unnecessary data load by up to **40%**.\nDeveloped rapid prototypes with **TypeScript**, **React** (18), and **Postgres**, delivering interactive interfaces to facilitate user engagement and effective communication between platforms.\nUtilized **GCP** for deploying AI models, ensuring high availability and efficient resource management that improved processing times by **25%**.\nImplemented **DevOps** practices using **Kubernetes** for container orchestration, achieving seamless deployment processes and reducing downtime during feature rollouts by **30%**.\nCreated dynamic user experiences through integration of cloud services and AI capabilities, improving conversion rates by leveraging data-driven insights and user feedback.\nEngaged in effective communication with cross-functional teams to align AI application features with customer needs, enhancing developer experience through clear documentation and collaborative practices.\nEmployed **Terraform** for infrastructure as code, ensuring consistent and reliable environment setups for AI applications, speeding up deployment cycles significantly.\nBuilt and supported applications focusing on **rapid prototyping**, allowing iterative development and faster delivery of user-driven solutions in a highly competitive market.\nEngaged in continuous learning and adaptation of emerging technologies, remaining adaptable to new tools and frameworks to enhance product offerings and user satisfaction."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, Kotlin, Swift, TypeScript\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n **Frontend Frameworks:**\n\tReact, Vue, Angular\n\n **API Technologies:**\n\tGraphQL\n\n **Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL), GCP\n\n **Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:**\n\tAWS, Azure, GCP\n\n **Other:**\n\tMLflow, Airflow, Kubeflow, LLM, NLP, DevOps, Developer Experience, Rapid Prototyping, Communication, Authentication & Security (Keycloak, JWT, OAuth2, Let’s Encrypt, Nginx, Certbot)"
}