{
  "name": "Tomasz Lee",
  "role_name": "Senior iOS Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Results-driven Senior iOS Engineer with 9+ years of comprehensive experience in developing high-quality applications using **Swift**, **SwiftUI**, and **Kotlin**. Proficient in leveraging **GraphQL** and **TypeScript** for seamless data handling and UI implementation. Expertise in cloud solutions utilizing **GCP** and infrastructure management with **Terraform** and **Kubernetes**. Proven track record of delivering high-performance applications and optimizing system designs. Strong collaborator, skilled at leading cross-functional teams to drive projects from concept through to successful deployment.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Senior iOS Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Designed and developed mobile applications using **Swift** and **SwiftUI** to enhance user engagement and performance.\nImplemented **Kotlin** and **Jetpack** to streamline the development process, introducing modular components and improving code maintainability by **30%**.\nIntegrated **GraphQL** for efficient data fetching, optimizing API usage and reducing overall data transfer by **20%**.\nEnhanced front-end development with **TypeScript** and **React**, leading to a more robust and type-safe codebase, reducing bugs by **25%**.\nUtilized resources on **GCP** for cloud hosting, ensuring high availability and scalability of the applications.\nEmployed **Terraform** for infrastructure as code, automating deployment processes and consistent environment setup across staging and production by **50%**.\nImplemented **Kubernetes** for container orchestration, enhancing application deployment speed and reliability.\nCollaborated with cross-functional teams to ensure seamless integration of backend services with front-end applications, maintaining a consistent user experience.\nDeveloped comprehensive RESTful APIs, ensuring high throughput and responsiveness, and lead code reviews to maintain code quality.\nKept abreast of emerging technologies and incorporated best practices, contributing to high-performance applications."
    },
    {
      "role": "Software Engineer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "Developed native iOS applications using **Swift** and **SwiftUI**, resulting in a 30% increase in app usability as measured by user satisfaction surveys.\nUtilized **Kotlin** for Android development, effectively creating feature parity across platforms.\nImplemented GraphQL APIs to optimize data retrieval speeds, leading to a 40% reduction in response times for user requests.\nBuilt interactive components with **React** and **TypeScript**, enhancing front-end user experience by 25%.\nDesigned and maintained scalable databases with **Postgres**, ensuring high availability and performance through optimized query execution.\nDeployed applications on **GCP** using **Terraform** for infrastructure as code, achieving smoother deployment processes and a 20% reduction in infrastructure costs.\nOrchestrated containerized applications on **Kubernetes**, allowing for efficient resource management and automated scaling based on demand.\nCollaborated with cross-functional teams to establish development standards and timelines, leading to a 15% improvement in project delivery time.\nConducted code reviews and mentoring for junior developers, fostering skill growth and enhancing team collaboration efficiency by 10%.\nLed an initiative to implement CI/CD practices, reducing deployment errors by 30% and improving software quality."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "Utilized **Swift** and **SwiftUI** to develop high-performance iOS applications, improving user engagement by 30%.\nImplemented **Kotlin** and **Jetpack** for Android app integrations, enhancing cross-platform compatibility.\nDeveloped GraphQL APIs for efficient data fetching, reducing loading times by 15%.\nCollaborated with backend developers using **Python** and **Postgres** to optimize database queries, achieving a 25% improvement in response time.\nIntegrated GCP services to enable cloud storage and compute solutions, supporting scale for over **1,000** daily users.\nEmployed **Terraform** for infrastructure as code, significantly reducing deployment time by **30%**.\nDeployed applications using **Kubernetes**, ensuring high availability and streamlined operations.\nConducted code reviews and paired programming sessions to maintain code quality and adherence to best practices.\nDelivered comprehensive technical documentation and user guides, enhancing team onboarding by **40%**.\nEngaged in Agile methodologies through regular sprints and standups to align project progress with team objectives."
    }
  ],
  "skills": " **Programming Languages**\n\tSwift, SwiftUI, Kotlin, TypeScript, JavaScript, Python\n\n**Backend Frameworks**\n\tNodeJS, ExpressJS, NestJS, C#, .NET, Entity Framework\n\n**Frontend Frameworks**\n\tReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n**API Technologies**\n\tRESTful API, GraphQL\n\n**Serverless and Cloud Functions**\n\tGCP, AWS, Azure\n\n**Databases**\n\tPostgreSQL, MySQL, MongoDB, DynamoDB, CosmosDB, MSSQL Server\n\n**DevOps**\n\tCI/CD pipelines, Terraform, Kubernetes\n\n**Cloud & Infrastructure**\n\tAWS, Azure, GCP\n\n**Other**\n\tUX/UI Design, Git, GitHub, Messaging & Caching: Apache Kafka, RabbitMQ, Redis, Blockchain: Solidity, Ether.js, Web3.js, Ethereum, Testing Tools: NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest, Microservices",
  "apply_company": "Wave Mobile Money"
}