{
  "name": "Rei Taro",
  "role_name": "Senior Field Engineer",
  "email": "rei515@outlook.com",
  "phone": "+48732529451",
  "address": "Warszawa, Poland",
  "linkedin": "https://www.linkedin.com/in/rei-taro-81a410391/",
  "profile_summary": "Results-driven Senior Field Engineer with over 10 years of experience in troubleshooting and delivering complex solutions within Biomedical, Electrical, and Mechanical systems. Proficient in Networking and Database management, showcasing a strong ability to resolve technical issues efficiently. Skilled in leveraging **Windows** to enhance system performance and functionality. Proven track record of successful contributions to projects across varied sectors, including top-tier organizations such as VISA, Sii Poland, and Reply Polska, utilizing a tech stack that emphasizes automation and system optimization.",
  "education": [
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2010",
      "to_year": "2015",
      "location": "Japan",
      "university": "Keio University"
    }
  ],
  "experience": [
    {
      "role": "Senior Field Engineer",
      "company": "Leobit",
      "from_date": "Aug 2022",
      "to_date": "Present",
      "location": "Poland",
      "responsibilities": "Leveraged expertise in **Windows** and **Networking** to troubleshoot and resolve field issues, enhancing system operation for clients.\nUtilized strong **Database** skills to manage and optimize data storage solutions, ensuring efficient access and reliability in client systems.\nExecuted **Troubleshooting** strategies to diagnose and repair malfunctioning equipment, achieving a **95%** first-time fix rate.\nCollaborated with **Electrical** and **Mechanical** teams to integrate solutions that adhered to industry standards, improving project delivery timelines by **20%**.\nProvided insights and solutions to **Biomedical** equipment issues, focusing on compliance with regulatory standards and enhancing patient safety.\nDeveloped and maintained client relationships, resulting in a **30%** increase in sales and service contracts in the past year.\nTrained junior engineers on advanced troubleshooting methods, contributing to a **40%** improvement in team response times."
    },
    {
      "role": "Software Engineer",
      "company": "Innovature",
      "from_date": "Nov 2018",
      "to_date": "Jun 2022",
      "location": "Japan",
      "responsibilities": "Managed and troubleshot complex electrical and mechanical systems, ensuring operational excellence and compliance with industry standards.\n- Developed comprehensive **networking** solutions to enhance system connectivity and data exchange across biomedical devices.\n- Implemented advanced **database** strategies to store and analyze operational data, improving data retrieval times by **30%**.\n- Collaborated with cross-functional engineering teams to integrate **biomedical** technologies with existing systems, enhancing user experience during device onboarding.\n- Provided technical support for Windows-based applications and systems, reducing downtime by ensuring **95%** successful troubleshooting on first call.\n- Conducted training sessions for sales and engineering teams to understand product capabilities and troubleshoot technical issues effectively.\n- Fostered strong relationships with clients by delivering exceptional on-site support and demonstrating **mechanical** and **electrical** expertise in field operations."
    },
    {
      "role": "Software Developer",
      "company": "Wizcorp",
      "from_date": "Apr 2015",
      "to_date": "Nov 2018",
      "location": "Japan",
      "responsibilities": "• Troubleshot and resolved technical issues for clients in the Biomedical, Electrical, and Mechanical fields, ensuring optimal performance and client satisfaction.\n• Provided support for Windows-based systems, ensuring reliability and efficient networking solutions tailored to client environments.\n• Managed database systems effectively, ensuring data integrity and accessibility for sales insights and operational efficiency.\n• Developed and maintained client relationships, driving sales initiatives and promoting technical solutions within the Biomedical sector.\n• Engineered comprehensive solutions that adhered to regulatory compliance, improving service delivery standards by **15%**.\n• Collaborated with cross-functional teams to implement **3** key service upgrades, enhancing client delivery systems.\n• Conducted field tests and technical demonstrations, securing an average product adoption rate of **75%** among pilot programs."
    }
  ],
  "skills": " **Programming Languages**\n\tPython (3.8+), SQL, Bash, JavaScript\n\n **Backend Frameworks**\n\tFastAPI, Flask, Django, Celery\n\n **Frontend Frameworks**\n\t\n\n **API Technologies**\n\tREST/gRPC APIs, Microservices, Kafka\n\n **Serverless and Cloud Functions**\n\tAWS (EC2, S3, Lambda), Azure\n\n **Databases**\n\tPostgreSQL, MySQL, MongoDB, Redis, Database\n\n **DevOps**\n\tDocker, Kubernetes, GitHub Actions, Azure DevOps, CI/CD, PyTest, Git\n\n **Cloud & Infrastructure**\n\t\n\n **Other**\n\tBiomedical, Electrical, Mechanical, Troubleshooting, Windows, Networking, Sales",
  "apply_company": "myGwork - LGBTQ+ Business Community"
}