{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior HubSpot Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Senior HubSpot Engineer with 13+ years of comprehensive experience driving high-performance application development, focusing on CRM solutions and automation in the healthcare and financial sectors. Proficient in **JavaScript**, **HTML**, **CSS**, **SQL**, and integrating with **REST APIs**. Demonstrated expertise in workflow design, including custom object creation and deal pipeline management within **HubSpot** alongside automation solutions using tools like **Zapier** and **Workato**.\n\nStrong problem-solving capabilities with a keen attention to detail, ensuring high-quality data entry and reporting through insightful dashboards. Adept at fostering collaboration and communication within cross-functional teams to achieve business objectives. Additionally, well-versed in building AI/ML-powered platforms and deploying cloud-native systems utilizing AWS and Azure, which enhance overall system capabilities.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior HubSpot Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Developed and integrated APIs to facilitate seamless data exchange between **HubSpot** and other applications, ensuring effective communication and automation in workflows.\nDesigned and implemented workflow automation using **Zapier** and **Workato**, optimizing deal pipelines and reducing manual data entry by **30%**.\nCreated and customized **HubL** for dynamic content presentation in **HubSpot**, enhancing user engagement through tailored messaging and effective reporting.\nUtilized **HTML**, **CSS**, and **JavaScript** to design responsive and intuitive dashboards that provided real-time insights into sales metrics and performance indicators.\nLed the migration of existing CRM data to **HubSpot**, ensuring data integrity and accuracy through meticulous attention to detail in data entry processes.\nCollaborated with cross-functional teams to define requirements for new features and enhancements, leveraging strong communication and problem-solving skills to drive project success.\nDeveloped reporting tools within **HubSpot** that enabled team members to track performance metrics and visualize data trends, resulting in improved decision-making capabilities.\nExecuted advanced SQL queries to analyze data from **HubSpot**, providing insights that guided strategic initiatives and operational improvements.\nDesigned and built custom objects in **HubSpot** to better align the CRM with business processes, boosting workflow efficiency by **25%**.\nRegularly conducted training sessions for team members on CRM best practices and the effective use of **HubSpot** tools for increased collaboration and productivity."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "• Developed and integrated **API** solutions for HubSpot tools, enhancing data entry workflows and allowing seamless information sharing across platforms.\n• Designed and implemented **workflow design** strategies within HubSpot to automate processes, improving efficiency and accuracy.\n• Managed **deal pipelines** using **SQL** queries to ensure data integrity and optimize CRM operations.\n• Built and customized **dashboards** in HubSpot for reporting and analytics, enabling real-time insights into marketing and sales performance.\n• Leveraged **JavaScript** and **HTML/CSS** to create engaging and user-friendly interfaces for clients, enhancing user experience with the CRM system.\n• Utilized **Zapier** and **Workato** for automation of repetitive tasks across various business applications, streamlining team collaboration.\n• Conducted thorough testing of **custom objects** and **APIs**, ensuring robust system performance and attention to detail in deployments.\n• Communicated effectively with cross-functional teams, utilizing strong problem-solving skills to troubleshoot issues and enhance system functionalities.\n• Enhanced reporting processes and dashboards within HubSpot, leading to a **15% increase** in data accessibility for stakeholders."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Designed and optimized API integrations within HubSpot leveraging **REST**ful services, enhancing workflows and automating processes across **CRM** functions.\nDeveloped custom objects and workflows in **HubL** to streamline deal pipelines and improve data entry accuracy, contributing to a **25%** increase in operational efficiency.\nImplemented automation strategies using **Zapier** and **Workato** to minimize manual tasks, allowing for a **30%** reduction in errors and enhanced team collaboration and reporting capabilities.\nCreated visually appealing, responsive dashboards using **HTML, CSS**, and **JavaScript** to provide insights into sales flows and CRM metrics, facilitating data-informed decision-making for stakeholders.\nCollaborated with cross-functional teams to identify and resolve problems, demonstrating strong problem-solving skills and attention to detail, enhancing overall project outcomes by **15%**.\nDesigned and executed a comprehensive communication plan for stakeholders, ensuring timely updates and fostering collaboration on project deliverables.\nLeveraged SQL for advanced data extraction and reporting, enabling real-time insights into customer interactions and facilitating targeted marketing efforts, significantly boosting engagement rates.\n"
    }
  ],
  "skills": "**API Technologies:**\n\tAPI, REST\n\n**Programming Languages:**\n\tPython, JavaScript\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular, HTML, CSS\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD\n\n**Cloud & Infrastructure:**\n\tAWS: ECS, Lambda, RDS, S3, Azure: App Services, Blob Storage, SQL Database, Terraform, Ansible, Helm\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis, SQL\n\n**Other:**\n\tHubSpot, HubL, Zapier, Workato, custom objects, workflow design, CRM, automation, deal pipelines, data entry, reporting, dashboards, collaboration, communication, problem-solving, attention to detail, MLflow, Airflow, Kubeflow, Nginx, Let’s Encrypt, Certbot",
  "apply_company": "Somewhere"
}