{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Rust Developer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-187801395/",
  "profile_summary": "Rust Developer with 13+ years of software development experience, specializing in TypeScript and proficient in **Rust** and **Golang**. Demonstrated expertise in implementing strong access management strategies, including **OAuth** and **OIDC** for secure authentication and authorization. Adept at problem solving and continual learning, bringing a deep commitment to code quality through thorough code reviews and collaboration.\nProven track record in delivering high-performance applications across the healthcare and financial sectors, leveraging technologies like **JavaScript**, **Python**, **Flutter**, and backend frameworks such as **Node.js**, **FastAPI**, and **Django**. Experienced in deploying cloud-native systems on **AWS** and **Azure**, while implementing microservices, event-driven architectures, and CI/CD pipelines.\nStrong background in compliance-driven development, ensuring alignment with standards such as HIPAA, FHIR, PCI DSS, and SOC 2. Additionally, well-versed in building AI/ML-powered platforms supporting predictive analytics, automation, and real-time processing, with MLOps proficiency using **MLflow**, **Airflow**, and **Kubeflow**.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Rust Developer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Utilized **Rust** alongside **TypeScript** for secure software development, enhancing authentication and authorization mechanisms by implementing **OAuth** and **OIDC** protocols in applications.\nLed code reviews and collaborated with cross-functional teams, fostering a culture of continual learning and mentorship within the development environment.\nImplemented robust access management strategies, ensuring compliance with security best practices while addressing complex problem-solving scenarios.\nDesigned resilient systems leveraging **WASM** for performance optimization, driving improvements in application loading and execution times by **30%**.\nParticipated in agile development practices, contributing to sprint planning and retrospectives, and improving team efficiency by implementing feedback loops resulting in a **20%** reduction in delivery timelines.\nContributed to the open-source community by sharing expertise in **Rust** and **Golang**, actively mentoring junior developers through code workshops and collaborative sessions.\nApplied continuous integration and deployment methodologies, optimizing workflows to enhance the release cycle speed by **40%**.\nChampioned the adoption of modern development tools and frameworks to streamline development processes, focusing on enhancing code quality and maintainability."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Utilized **Rust** to develop and maintain robust, high-performance software applications, enhancing security and efficiency in access management.\nImplemented authentication and authorization strategies using **OAuth** and **OIDC**, ensuring secure user access and data protection in application workflows.\nCollaborated with cross-functional teams to conduct code reviews, fostering a culture of quality and continual learning within the development process.\nLeveraged **TypeScript** to enhance code quality and maintainability in projects, ensuring compliance with modern software development practices.\nEmployed problem-solving skills to troubleshoot complex issues within the software stack, reducing bug resolution time by **30%**.\nMentored junior developers in best practices for software development, code optimization, and effective use of modern technologies.\nActively engaged in collaboration with stakeholders to define software requirements, resulting in a **20%** increase in feature delivery efficiency.\nDrove the integration of **WASM** for performance-critical applications, resulting in a **15%** performance increase during testing.\nLed efforts in continual improvement of software development workflows, contributing to a reduction in deployment times by **25%**."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Applied **Rust** and **Golang** to design and optimize backend services for high-performance applications, ensuring robust software development and problem-solving skills in complex scenarios.\nEnhanced application security through **OAuth** and **OIDC** implementations, focusing on access management for user authentication and authorization across platforms.\nUtilized **TypeScript** to develop and maintain scalable applications, ensuring code quality through comprehensive code reviews and collaboration with team members.\nPromoted continual learning by sharing knowledge and mentoring junior developers, fostering a culture of growth and improvement within the team.\nEngineered and integrated real-time features using **WebSockets** and event-driven architecture, significantly improving user engagement and responsiveness.\nLed the optimization of distributed data storage systems with **MongoDB** and **PostgreSQL**, ensuring application stability and performance for up to **100,000** concurrent users.\nImplemented caching strategies with **Redis**, realizing a **40%** decrease in response time for frequently accessed data, thus enhancing application performance.\nCollaborated with frontend teams to create dynamic UIs using frameworks like **React** and **Vue 3**, ensuring seamless experiences for end-users across devices.\nParticipated in feature flag deployments via **LaunchDarkly**, enabling controlled rollouts that improved system stability and reduced deployment risks during updates. \nDelivered secure payment workflows integrated with various platforms, ensuring **PCI** compliance and protection of sensitive user data throughout the application lifecycle."
    }
  ],
  "skills": " **Programming Languages:**\n\tRust, Golang, TypeScript, Python\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n **Frontend Frameworks:**\n\tReact, Vue, Angular\n\n **API Technologies:**\n\tOAuth, OIDC, JWT\n\n **Serverless and Cloud Functions:**\n\tAWS: Lambda, Azure: App Services\n\n **Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD\n\n **Cloud & Infrastructure:**\n\tAWS: ECS, RDS, S3, Azure: Blob Storage, SQL Database, Terraform, Ansible, Helm, Docker Compose\n\n **Other:**\n\tArtificial Intelligence & Machine Learning: MLflow, Airflow, Kubeflow, code review, collaboration, mentoring, access management, authentication, authorization, continual learning, software development, problem solving"
}