{
  "name": "Tomasz Lee",
  "role_name": "Staff Engineer – Internal Technology",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Results-driven Staff Engineer with 9+ years of experience in **IAM principles**, **SaaS management**, and **automation**. Proficient in **scripting** and utilizing **integration tooling** such as **Okta Workflows**, **Workato**, and **Boomi** to streamline operations. Demonstrated expertise in enhancing workflows and system integrations for platforms like **Google Workspace**, **HiBob**, **Netsuite**, and **Notion**. Strong capabilities in cross-functional collaboration and technical mentoring, ensuring adherence to documentation standards. A dedicated professional adept at leading development projects and delivering high-quality, efficient solutions.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Staff Engineer – Internal Technology",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "• Developed automation solutions by leveraging **Okta Workflows**, **Workato**, and **Boomi**, streamlining IAM processes by 30%.\n• Engaged in scripting efforts to automate repetitive tasks, improving operational efficiency across multiple teams.\n• Managed SaaS integration processes with applications such as **Google Workspace**, **HiBob**, and **Netsuite**, enhancing cross-platform connectivity.\n• Created and maintained comprehensive documentation standards for integration processes and workflows, resulting in a 50% reduction in onboarding time for new team members.\n• Led cross-functional collaboration across teams to enhance automation strategies and solution design, resulting in a unified approach to software development.\n• Provided technical mentoring to junior engineers on integration tooling and development best practices, boosting team productivity by 15%.\n• Spearheaded the design and development of a web-based customer management platform using **.NET 7** and **ReactJS**, improving user satisfaction by 25%.\n• Integrated **Apache Kafka** for real-time data streaming and **RabbitMQ** for task queuing, resulting in improved system resilience and throughput.\n• Developed RESTful APIs with **.NET**, integrated with a **MongoDB** database to provide seamless data access for various services.\n• Implemented CI/CD pipelines on **Azure DevOps**, reducing deployment time by 40% and increasing deployment frequency to **3 times a week**.\n• Optimized **MSSQL** database queries and indexing, reducing average query execution time by 20%, contributing to enhanced application performance."
    },
    {
      "role": "Full Stack Developer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "Implemented **IAM principles** across a cloud-based project management tool, enhancing security and user access management without compromising functionality.\nAutomated integration workflows using **Workato** and **Boomi**, resulting in a seamless data flow that improved operational efficiency by **20%**.\nDeveloped custom scripts for automation, reducing manual processes significantly and improving team productivity by **15%**.\nCreated and maintained integration tooling for **Okta Workflows**, ensuring secure and efficient user management and onboarding processes.\nCollaborated cross-functionally with teams using **Google Workspace**, **Slack**, and **Notion** for improved communication and documentation standards.\nMentored junior developers on scripting best practices and **automation** tools, enhancing the overall skill set of the team.\nConducted thorough documentation to meet industry standards, thereby ensuring clarity in project goals and processes.\nFostered a culture of technical mentoring by guiding less experienced engineers through complex automation and integration projects.\nDrove SaaS management initiatives by integrating platforms such as **HiBob** and **Netsuite**, leading to streamlined operations and improved service delivery.\nEngaged with stakeholders to align on system requirements and project timelines, ensuring successful delivery of technology solutions."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "Implemented **IAM principles** to enhance security across internal systems, ensuring compliance with industry standards.\nManaged **SaaS** applications including **Okta Workflows**, **Workato**, and **Boomi** for seamless user access and integration across various platforms.\nAutomated processes using **scripting** techniques, resulting in a **30%** reduction in manual intervention time.\nLeveraged **Google Workspace**, **HiBob**, and **Netsuite** for effective team collaboration and data management, improving workflow efficiency by **25%**.\nDeveloped integration tooling that facilitated data synchronization between core systems, enhancing overall operational effectiveness.\nPlayed a key role in cross-functional collaboration by working closely with development and operations teams, improving project delivery timelines by **15%**.\nConducted technical mentoring sessions that improved team knowledge in **documentation standards** and best practices, fostering a culture of continuous learning.\nParticipated in process automation projects that reduced operational costs by **10%** through effective resource management.\nUtilized **Slack** for real-time communication and project updates, increasing team responsiveness and collaboration.\nDelivered clear and concise technical documentation to support implementation and maintenance efforts, aiding in knowledge transfer.\n"
    }
  ],
  "skills": "**Programming Languages**\n\tPython, JavaScript, TypeScript, C#, Solidity\n\n**Frontend Frameworks**\n\tReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n**Backend Frameworks**\n\tNodeJS, ExpressJS, NestJS, .NET, Entity Framework, Microservices\n\n**API Technologies**\n\tRESTful API, GraphQL\n\n**Database Systems**\n\tMSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB\n\n**Cloud & Infrastructure**\n\tAWS, Azure, Google Workspace, SaaS management\n\n**Serverless and Cloud Functions**\n\tIAM principles\n\n**DevOps**\n\tCI/CD pipelines, Automation, Scripting, Technical mentoring, Cross-functional collaboration\n\n**Messaging & Caching**\n\tApache Kafka, RabbitMQ, Redis\n\n**Integration Tools**\n\tOkta Workflows, Workato, Boomi, Slack, HiBob, Netsuite, Notion\n\n**Other Skills**\n\tGit, GitHub, UX/UI Design, Testing Tools: NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest, Documentation standards"
}