{
  "name": "Tomasz Lee",
  "role_name": "Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Detail-oriented Engineer with 9+ years of experience in cloud-native software development and infrastructure automation. Proficient in managing multi-cloud deployments using **AWS** and **GCP**, and skilled in Kubernetes technologies including **Kubernetes Operators**, **Kubebuilder**, and **Controller-Runtime**. Expertise in developing robust applications with backend technologies such as **.NET**, **C#**, and **Go**, alongside frontend frameworks like **ReactJS** and **NextJS**. Strong background in implementing microservices architecture and leveraging tools like **Apache Kafka**, **RabbitMQ**, and **Redis** for distributed systems. A proven track record in collaboration and problem-solving, driving automation to enhance productivity and optimize development processes.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Utilized **AWS** and **GCP** for cloud-native software development, enhancing scalability and flexibility across multiple environments.\nDesigned and implemented **Kubernetes** operators using **Kubebuilder**, facilitating automated deployment and management of applications in diverse infrastructure setups.\nDeveloped **Go** applications for improved performance and enhanced system functionalities, leading to a 30% increase in overall efficiency.\nExecuted infrastructure automation strategies to streamline deployments, reducing manual intervention by 50% and improving consistency across multi-cloud environments.\nCollaborated effectively with cross-functional teams to drive project success, leveraging strong problem-solving skills to address challenges and deliver results.\nInitiated the use of **Crossplane** for managing cloud resources declaratively, ensuring optimal utilization and reducing costs by 15%.\nLed the transformation of monolithic applications to microservices architecture, improving system maintainability and enabling quicker feature releases.\nOptimized cloud resource management techniques, resulting in a 25% reduction in operational costs.\nImplemented automated testing and deployment pipelines, increasing the development velocity by 40%.\nConducted workshops and training sessions to enhance team capabilities in **Infrastructure Automation** and **Cloud Native Software Development**."
    },
    {
      "role": "Full Stack Developer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "Implemented **Kubernetes** for orchestrating containerized applications, enhancing deployment efficiency across multi-cloud environments.\nDeveloped cloud-native solutions on **AWS** and **GCP**, focusing on infrastructure automation that led to a **20%** reduction in deployment times.\nUtilized **Go** for building microservices that improved system interoperability and reduced processing time by **25%**.\nDesigned and deployed **Kubernetes Operators** using **Controller-Runtime** and **Kubebuilder**, facilitating seamless integration of custom applications within **Kubernetes** clusters.\nIntegrated **Crossplane** for managing infrastructure as code, which streamlined multi-cloud deployments for various project components.\nCollaborated with cross-functional teams, utilizing effective communication skills to solve complex problems, resulting in a **30%** improvement in project delivery times.\nAutomated workflows and processes using scripts to enhance operational efficiency and reduce manual tasks, achieving a **15%** increase in team productivity.\nConducted code reviews and provided mentoring sessions for junior developers, promoting collaboration and skill development within the engineering team.\nSpearheaded the documentation of project infrastructures and workflows, improving the onboarding process for new engineers.\nUtilized **collaboration tools** to manage project requirements and ensure alignment with stakeholder expectations, leading to successful project completions."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "Applied cloud-native software development principles utilizing **AWS** and **GCP** to enhance system reliability and scalability.\nUtilized **Kubernetes** for automation in multi-cloud deployments, significantly improving deployment efficiency by **30%**.\nDeveloped custom **Kubernetes Operators** using **Go** to simplify the management of cloud resources and ensure operational consistency.\nExecuted infrastructure automation strategies that resulted in a **25%** reduction in manual provisioning time.\nCollaborated with cross-functional teams to identify and solve problems, fostering a culture of teamwork and effective communication.\nImplemented **Crossplane** for resource management across multiple cloud environments, enhancing flexibility and resource utilization.\nEngaged in regular code reviews and daily stand-ups to maintain code quality and adherence to project timelines.\nContributed to the development of internal tools that improved collaboration and knowledge-sharing among engineering teams.\nDelivered comprehensive documentation and user guides to support trained operations of developed solutions, enhancing team onboarding process.\nProvided ongoing support and troubleshooting for automated systems, ensuring minimal downtime and maximum efficiency."
    }
  ],
  "skills": " **Programming Languages:**\n\t Go, Python, JavaScript, TypeScript\n\n**Backend Frameworks:**\n\t NodeJS, ExpressJS, NestJS, C#, .NET, Entity Framework, Microservices\n\n**Frontend Frameworks:**\n\t ReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n**API Technologies:**\n\t RESTful API, GraphQL\n\n**Serverless and Cloud Functions:**\n\t AWS, GCP\n\n**Databases:**\n\t MSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB\n\n**DevOps:**\n\t CI/CD pipelines, Kubernetes, Kubernetes Operators, Controller-Runtime, Kubebuilder, Crossplane, Infrastructure Automation, Multi-cloud Deployments\n\n**Cloud & Infrastructure:**\n\t AWS, Azure\n\n**Other:**\n\t Collaboration, Problem Solving, Automation, UX/UI Design, Git, GitHub, Messaging & Caching, Apache Kafka, RabbitMQ, Redis, Testing Tools, NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest, Blockchain, Solidity, Ether.js, Web3.js, Ethereum, Microservices"
}