{
  "name": "Damian Franciszek Pospiech",
  "role_name": "DevOps Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-187801395/",
  "profile_summary": "DevOps Engineer with 13+ years of experience specializing in cloud-native systems and infrastructure management. Proficient in **AWS** (including **EKS**, **RDS**, **IAM**, **VPC**, **S3**), **Docker**, **Kubernetes**, and **Terraform**, ensuring high-performance and secure deployment environments. Experienced in implementing CI/CD pipelines and monitoring solutions using **GitLab**, **Prometheus**, **Grafana**, and **CloudWatch**. Skilled in disaster recovery and business continuity planning, with a solid understanding of networking and security controls, including private networking and least privilege principles.\n\nAs a quick learner and flexible team player, I excel in multitasking and problem-solving, successfully delivering AI/ML-powered applications that support automation and predictive analytics in compliance with standards such as HIPAA and PCI DSS. My technical proficiency extends to **JavaScript/TypeScript**, **Python**, and **Flutter**, with backend development expertise in **Node.js**, **FastAPI**, and **Django**.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "DevOps Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Utilized **AWS** services including **EKS**, **RDS**, **IAM**, **VPC**, and **S3** for building highly available and secure cloud infrastructure tailored for healthcare and fintech applications.\nImplemented container orchestration with **Docker** and **Kubernetes**, optimizing deployment processes and ensuring high availability across **9+** environments.\nStreamlined infrastructure as code using **Terraform** and **OpenTofu**, leading to a **30%** reduction in deployment time and enhancing reproducibility.\nManaged observability and monitoring with tools like **Prometheus**, **Grafana**, and **CloudWatch** to ensure system reliability and performance, achieving **99.9%** uptime.\nLed disaster recovery and business continuity planning initiatives to ensure the organization's resilience and operational continuity, incorporating security controls and private networking strategies.\nIntegrated CI/CD pipelines using **GitLab** and **Flux** for continuous delivery of applications with automated testing, improving deployment frequency by **40%**.\nDeveloped Bash scripts for system automation and task scheduling, enhancing operational efficiency among cross-functional teams.\nExercised ownership and flexibility in resolving multifaceted issues across application stacks, applying problem-solving skills to maintain robust service delivery.\nFostered team collaboration and ownership through agile methodologies, ensuring smooth communication and quick learning across DevOps processes and technical frameworks.\nImplemented service mesh architectures with **Linkerd** and **Istio** to enhance microservices communication and management, optimizing security controls and reducing latency across the system."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Designed and implemented automated workflows in **AWS (EKS, RDS, IAM, VPC, S3)**, improving infrastructure deployment efficiency and reducing provisioning time by **50%**.\nManaged containerized microservices using **Docker** and **Kubernetes**, ensuring high availability and scalability of applications with an uptime of **99.9%**.\nDeveloped and maintained Infrastructure as Code (IaC) using **Terraform** and **OpenTofu**, enabling consistent environment setup across development, testing, and production stages.\nMonitored system performance and health via **Prometheus**, **Grafana**, and **CloudWatch**, reducing incident response time by **30%** through proactive alerts and logging.\nImplemented security controls and best practices in cloud environments, ensuring compliance with the **least privilege** principle and enhancing overall system security.\nFacilitated disaster recovery and business continuity planning, achieving recovery time objectives (RTO) of **1 hour** and recovery point objectives (RPO) of **15 minutes**.\nCollaborated in cross-functional teams, exercising multitasking and problem-solving skills to address and resolve operational incidents swiftly while ensuring continuous service delivery.\nLeveraged **GitLab** for CI/CD pipelines, enhancing deployment frequency by **40%**.\nUtilized **Bash** scripting and **Go** to automate routine tasks, improving operational efficiency and team productivity.\nAdapted quickly to emerging technologies and frameworks, showcasing flexibility and a commitment to continuous learning in fast-paced environments."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Managed and deployed cloud infrastructure on **AWS** using **EKS**, **RDS**, and **VPC**, ensuring high availability and disaster recovery for production-grade applications across multiple environments.\nImplemented container orchestration with **Kubernetes** and **Docker**, optimizing deployment workflows and enabling seamless scaling of backend services.\nUtilized **Terraform** and **OpenTofu** for infrastructure as code (IaC) solutions, facilitating efficient provisioning and management of cloud resources, resulting in a **30%** reduction in deployment time.\nConfigured monitoring and logging solutions with **Prometheus**, **Grafana**, and **CloudWatch**, improving system observability and facilitating proactive incident response by achieving a **95%** reduction in mean time to recovery (MTTR).\nEnhanced security controls by implementing **IAM** roles and policies, adopting the principle of least privilege, and establishing private networking with **Linkerd** and **Istio**, ensuring compliance with GDPR and organizational security standards.\nConducted robust business continuity planning and disaster recovery drills to ensure operational resilience and availability of services in a production environment.\nAutomated CI/CD pipelines using **GitLab** and **Flux**, increasing deployment frequency by **40%** while maintaining high standards of code quality and stability.\nDeveloped resource monitoring strategies leveraging **Sentry** for application performance tracking, enhancing user experience through prompt error resolution and continuous performance improvements.\nEngaged in multitasking and flexible problem-solving to troubleshoot issues across multiple teams and workflows, showcasing ownership and quick learning in fast-paced environments.\n"
    }
  ],
  "skills": "Programming Languages:\n\tPython: FastAPI, Flask, Django, Go, Bash\n\n**Backend Frameworks:**\n\tN/A\n\n**Frontend Frameworks:**\n\tJavaScript/TypeScript: React, Vue, Angular\n\n**API Technologies:**\n\tN/A\n\n**Serverless and Cloud Functions:**\n\tAWS: ECS, Lambda, RDS, S3, IAM, VPC\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, OpenTofu, Crossplane, Prometheus, Grafana, CloudWatch, Sentry, Flux\n\n**Cloud & Infrastructure:**\n\tAWS, Azure: App Services, Blob Storage, SQL Database\n\n**Other:**\n\tAuthentication & Security: Keycloak (OIDC, RBAC), OAuth2, JWT, Nginx, Let’s Encrypt, Certbot, multitasking, problem-solving, ownership, flexibility, quick learner, service mesh, Linkerd, Istio, disaster recovery, business continuity planning, networking, security controls, private networking, least privilege, workload identity"
}