{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Software Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "As a Senior Software Engineer with 8 years of comprehensive expertise, I specialize in developing robust solutions utilizing **TypeScript**, **React**, **C#**, and **.NET**, while leveraging cloud services like **Azure** and **AWS**. My proficiency in CI/CD processes and tools, including **Terraform**, ensures efficient deployment and maintenance of applications, while my experience with **Kubernetes** enhances scalability and orchestration of applications.\n\nI excel in designing and implementing asynchronous services and stream processing architectures that meet the unique demands of digital identity, open banking, and compliance with industry standards. My background in integrating AI capabilities into applications positions me as a proactive contributor to innovative projects, driving intelligent automation and data processing.\n\nIn addition to my technical skills, I possess a strong foundation in Agile methodologies, allowing me to effectively collaborate with cross-functional teams through user stories and design documents. My strong communication skills complement my technical strengths, enabling seamless collaboration and the delivery of enterprise-grade solutions in fast-paced environments.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Software Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Developed scalable, full-stack applications leveraging **TypeScript**, **React** (17-18), and **.NET** to create responsive and efficient user interfaces, ensuring alignment with business logic and application workflows.\n• Designed and implemented CI/CD pipelines with **Azure DevOps** and **GitHub Actions**, automating build, test, and deployment processes to enhance productivity by **30%** and decrease time-to-market for new features.\n• Architected cloud solutions on **Azure** and **AWS**, utilizing services such as **Kubernetes** (for container orchestration) and serverless architectures (e.g., **AWS Lambda**) to achieve elasticity and scalability in deployments.\n• Integrated **CI/CD** practices with **Terraform** for infrastructure as code, enabling consistent environment setup and management across development and production.\n• Developed asynchronous services to optimize data flow and processing efficiency, yielding a **20%** reduction in latency for real-time applications.\n• Collaborated with cross-functional teams to articulate user stories and create detailed design documents, enhancing communication and clarity around project requirements.\n• Employed **Rust**, **Go**, and **C++** for developing performance-critical systems, improving processing speed for backend services by **40%**.\n• Implemented features supporting digital identity management and **verifiable credentials**, reinforcing security for user authentication and data integrity.\n• Explored and integrated **open banking** APIs to facilitate seamless financial transactions, adhering to regulatory standards within the development lifecycle.\n• Utilized AI to develop intelligent features for applications, enhancing user engagement through personalized experiences and insights.\n• Conducted comprehensive code reviews and provided mentorship to junior developers, fostering a culture of continuous learning and maintaining high standards in code quality."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "• Utilized **TypeScript**, **React (18)**, and **.NET** to develop and maintain dynamic, user-centric applications for financial services, enhancing user experience and engagement.\n• Designed and implemented CI/CD pipelines using **Azure** and **AWS**, streamlining deployment processes and enabling faster delivery of software updates by **30%**.\n• Developed and optimized asynchronous services leveraging **Kafka** and **RabbitMQ**, facilitating real-time event processing and improving transaction handling efficiency by **25%**.\n• Collaborated on user stories and created design documents to define application requirements, ensuring clear communication and alignment with stakeholders on critical projects.\n• Managed cloud infrastructure using **Terraform**, ensuring scalability and resilience of applications deployed on **Kubernetes** clusters.\n• Engaged in stream processing techniques with technologies like **Azure Service Bus**, enhancing the reliability of data flow in financial systems, including alerting and compliance workflows.\n• Implemented AI solutions for fraud detection utilizing **AI** methodologies, helping to flag **95%** of suspicious activities accurately, resulting in reduced financial loss.\n• Communicated effectively with cross-functional teams, fostering collaboration to tackle complex problems and deliver high-quality software solutions in a timely manner."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "• Developed robust backend services using **TypeScript**, **C#**, and the **.NET** framework to enhance system performance and maintainability in line with user stories and design documents.\n• Designed and implemented CI/CD pipelines in **Azure** and **AWS**, ensuring seamless integration and delivery of code with minimal downtime through automated deployment strategies.\n• Engineered asynchronous services and stream processing to support real-time data flows and enhance system responsiveness for critical features.\n• Leveraged **Kubernetes** for orchestration and management of containerized applications, optimizing resource utilization and scaling for high-load scenarios.\n• Collaborated in cross-functional teams to transform user stories into technical specifications, ensuring clear communication and alignment of project goals.\n• Created secure and efficient digital identity solutions through the integration of verifiable credentials, enhancing user trust and system integrity.\n• Contributed to open banking initiatives to allow secure and scalable financial transactions, applying industry standards and protocols.\n• Wrote and maintained code in **Rust**, **Go**, and **C++** ensuring high-performance execution and compliance with architectural best practices.\n• Supported project management efforts with tools for backlog prioritization and sprint planning, resulting in a **20%** increase in team productivity.\n• Participated in design and code reviews to uphold coding standards and promote best practices, fostering a culture of quality and continuous improvement in software development."
    }
  ],
  "skills": "Programming Languages:\n\tTypeScript, Python, C#, Rust, Go, C++, JavaScript\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django, .NET\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tJWT, OAuth2, Keycloak (OIDC, RBAC)\n\n**Serverless and Cloud Functions:**\n\tAWS (Lambda, ECS), Azure (App Services)\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS, Azure\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, digital identity, verifiable credentials, open banking, AI, user stories, design documents, communication, asynchronous services, stream processing",
  "apply_company": "Propellerhead"
}