{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Backend Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "Results-oriented Senior Backend Engineer with 8 years of extensive experience in crafting high-performance backend solutions primarily using **Python**, **Go**, and robust databases like **PostgreSQL** and **MongoDB**. Proficient in leveraging cloud services such as **AWS**, **Azure**, and **Google Cloud**, complemented by a strong understanding of container orchestration with **Kubernetes**. Adept at implementing **MLOps** strategies, integrating AI functionalities, and ensuring data governance and compliance with industry standards.\n\nMy technical skills are enhanced by deep experience in building scalable microservices and event-driven architectures, alongside expertise in managing observability with **OpenTelemetry** and improving application performance. Demonstrated success in fostering communication across teams to deliver solutions that meet business needs. Committed to continuous improvement and delivering secure applications aligned with compliance protocols.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Backend Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Developed and maintained backend services using **Python**, ensuring high performance and scalability for healthcare and financial platforms.\n- Deployed applications on **Kubernetes** clusters to manage scaling and orchestration, leveraging version **1.21** for optimal performance.\n- Designed robust data solutions utilizing **PostgreSQL**, ensuring data integrity and efficient querying for high-volume transactions.\n- Integrated **MongoDB** for flexible data storage, allowing for quick retrieval of unstructured data, streamlining data processing by over **30%**.\n- Implemented **ElasticSearch** to enhance search capability across large datasets, improving response times by an average of **40%**.\n- Collaborated in cross-functional teams, applying **Linux** server management, which ensured reliable service uptime of **99.9%** across production environments.\n- Employed advanced monitoring and tracing strategies using **OpenTelemetry** to enhance application observability and performance insights.\n- Developed MLOps pipelines that facilitate continuous model training and deployment, reducing model deployment times by **50%**.\n- Integrated AI features into backend services to drive predictive analytics, improving decision-making processes in patient care and fraud detection.\n- Engaged with stakeholders to align on data governance best practices, ensuring compliance with regulations and fostering effective communication across departments.\n- Actively participated in code reviews and knowledge-sharing sessions to promote best practices and enhance team collaboration."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "• Designed scalable backend solutions leveraging **Python** for developing robust microservices and enhanced system architecture, achieving a 30% increase in transaction throughput.\n• Deployed applications in **Kubernetes** environments to streamline container orchestration, enhancing workload management by 25% and improving deployment times by 15%.\n• Configured and maintained databases using **PostgreSQL** and **MongoDB**, ensuring high availability and low-latency access to transaction data, with a focus on performance optimization.\n• Integrated **OpenTelemetry** for observability in services, facilitating improved monitoring and traceability across distributed systems, reducing response time for critical operations by 40%.\n• Utilized cloud platforms (**AWS**, **Azure**, **Google Cloud**) for hosting, improving resource management, and ensuring uptime of 99.9% for financial services.\n• Collaborated effectively in team environments, enhancing communication and cross-functional collaboration, leading to a reduction in project turnaround time by 20%.\n• Conducted system optimization tasks on **Linux** platforms to enhance resource allocation and performance of backend services in production environments.\n• Developed MLOps strategies for integrating **AI** and machine learning models into backend workflows, contributing to a 50% reduction in fraud detection latency.\n• Implemented data governance practices ensuring data integrity and compliance, critical for handling sensitive financial data across all platforms."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Utilized **Python** and **Go** to design and optimize backend services for a global e-commerce platform, ensuring high availability, low latency, and scalability across core modules including checkout, cart, and order fulfillment.\nImplemented microservices architecture with **Kubernetes** for deployment management, achieving a **30%** increase in system resilience and deployment efficiency.\nDeveloped and maintained databases using **PostgreSQL** and **MongoDB**, ensuring fault-tolerant data access and achieving up to **99.9%** uptime for high-traffic e-commerce workflows.\nEmbraced **AWS** and **Azure** for cloud services, optimizing cost efficiency by **15%** through resource management and autoscaling practices.\nEngineered real-time features using **WebSockets** along with **Kafka** and **RabbitMQ**, resulting in enhanced order updates and a **40%** reduction in customer inquiry response time.\nApplied **MLOps** to integrate AI-based recommendation engines utilizing **TensorFlow** and **scikit-learn**, improving product listing relevance and boosting conversion rates by **20%** based on real-time behavioral data.\nEstablished robust data governance practices for user data protection, ensuring GDPR compliance through strict application of role-based access control (**RBAC**) and **OAuth 2.0**.\nCommunicated effectively with cross-functional teams to align on project requirements, leveraging strong technical skills in **Linux** and **OpenTelemetry** for performance monitoring and debugging.\n\nDeveloped frontend applications using **React (18)** and **Vue 3**, ensuring a fast and responsive user experience across both web and mobile platforms.\nImplemented caching strategies utilizing **Redis**, resulting in improved response times and reduced read pressure on databases.\nManaged feature flags and blue-green deployments using LaunchDarkly, enhancing controlled rollouts and allowing for effective A/B testing during platform updates.\nBuilt secure payment workflows in compliance with PCI standards, integrating with **Stripe**, **PayPal**, and **Razorpay** to handle sensitive transaction data."
    }
  ],
  "skills": "**Programming Languages:**\n\tPython, Go\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tJavaScript/TypeScript (React, Vue, Angular)\n\n**API Technologies:**\n\tOpenTelemetry, JWT, OAuth2\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL), Google Cloud\n\n**Databases:**\n\tPostgreSQL, MongoDB, Redis, MySQL\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS, Azure, Google Cloud, Linux\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, MLOps, AI, Data Governance, Communication, Keycloak (OIDC, RBAC), Let’s Encrypt, Nginx, Certbot, ElasticSearch",
  "apply_company": "DataRobot"
}