{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior .NET Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Senior .NET Engineer with 13+ years of experience in high-performance application development, specializing in **.NET**, **C#**, **SQL Server**, and **.NET Core**. Demonstrated expertise in application lifecycle management using **Visual Studio** and maintaining code quality through **Sonar**. Proven ability in designing ETL processes and enhancing data workflows, with a commitment to building scalable solutions in compliance with industry standards. Adept at leveraging a strong foundation in technology to deliver impactful software solutions. Additionally proficient in frontend technologies including **JavaScript**, **JQuery**, and **Flutter**, coupled with robust backend capabilities utilizing frameworks such as **FastAPI** and **Django**.  Highly experienced in cloud-native development and continuously driven to expand knowledge in emerging technologies.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior .NET Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Developed and maintained applications using **.NET**, **C#**, and **.NET Core** to fulfill business requirements while ensuring high code quality and performance standards across numerous projects.\n- Created data-driven applications leveraging **SQL Server** for efficient data management and retrieval, optimizing query performance by **30%** through careful schema design and indexing strategies.\n- Implemented ETL processes to transform and load data into the database, ensuring seamless integration with external systems while maintaining data integrity across environments.\n- Conducted code reviews and utilized tools like **Sonar** to enforce coding standards and detect potential vulnerabilities, resulting in a **25%** reduction in code smells and technical debt.\n- Collaborated in an Agile environment using **Visual Studio** to streamline the development workflow, contributing to a **15%** decrease in cycle times for feature delivery.\n- Enhanced user interfaces with **jQuery** to ensure a dynamic and responsive user experience, aligning application features with client needs and industry best practices.\n- Communicated effectively in English with cross-functional teams to gather requirements, provide updates, and resolve issues in a timely manner, ensuring alignment with project goals.\n- Led training sessions for new team members focusing on **.NET** best practices, fostering a culture of knowledge sharing and continuous improvement."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Developed and maintained robust financial applications using **.NET**, **C#**, and **.NET Core**, enhancing overall system performance and reliability for processing high-volume transactions.\nDesigned and managed complex database schemas and queries with **SQL Server**, ensuring efficient data storage and retrieval for various financial operations.\nLeveraged **Visual Studio** for debugging and testing, optimizing code through implementation of **Sonar** to maintain code quality and reduce technical debt.\nImplemented ETL processes for data integration and transformation from multiple sources, ensuring smooth and efficient data flow for analytical operations.\nCollaborated with cross-functional teams to design and build responsive user interfaces using **JQuery**, providing enhanced user experiences for clients and stakeholders.\nConducted technical mentoring and training sessions on .NET technologies and best practices to elevate team performance and productivity.\nProduced thorough documentation for system architecture and code, enhancing maintainability and knowledge sharing across the team.\nDrove the adoption of Agile methodologies, facilitating sprint planning and retrospectives to improve project outcomes and team collaboration."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Engineered robust backend applications using **.NET Core** and **C#**, ensuring high availability, performance, and scalability for enterprise-level solutions in complex environments.\nLeveraged **SQL Server** for efficient data management and optimized query performance, enhancing operational efficiency with a focus on ETL processes and seamless data integration.\nUtilized **Visual Studio** alongside **Sonar** for code quality analysis, driving best practices in software development and continuous improvement of coding standards.\nDesigned and implemented web services using **WCF**, maintaining strong communication protocols and service-oriented architectures to support complex application interactions.\nEmployed **jQuery** for dynamic user interface components, enhancing interactivity and user experience across multiple client applications.\nCollaborated with cross-functional teams to gather requirements and manage project timelines, ensuring delivery of solutions that align with business objectives and customer needs.\nParticipated in Agile methodologies, contributing to sprint planning and retrospectives, and ensuring iterative delivery of functional software features.\nConducted thorough debugging and troubleshooting of applications, successfully reducing defect rates by **25%** through meticulous code review and quality assurance practices."
    }
  ],
  "skills": "**Programming Languages:**\n\tC#, .NET, Python, JavaScript, TypeScript\n\n**Backend Frameworks:**\n\t.NET Core, WCF, FastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular, Jquery\n\n**API Technologies:**\n\tOAuth2, JWT\n\n**Serverless and Cloud Functions:**\n\tAWS: Lambda, Azure: App Services\n\n**Databases:**\n\tSQL Server, PostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Sonar\n\n**Cloud & Infrastructure:**\n\tAWS: ECS, RDS, S3, Azure: Blob Storage, SQL Database, Terraform, Ansible, Helm, Docker Compose\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, ETL, English, Keycloak (OIDC, RBAC), Nginx, Let’s Encrypt, Certbot",
  "apply_company": "KAIROS DIGITAL SOLUTIONS"
}