{
  "name": "Tomasz Lee",
  "role_name": "Senior Test Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Detail-oriented Senior Test Engineer with 9+ years of experience in quality assurance and software testing across various environments. Proficient in automation testing frameworks and tools such as **Playwright**, **Selenium**, **Cypress**, and **Pytest**, ensuring high-quality deliverables. Skilled in cloud platforms including **AWS**, **GCP**, and **Azure**, complemented by strong knowledge of **GitHub** for version control. Expertise in the Software Development Life Cycle (SDLC) allows for collaboration with development teams to integrate testing into the workflow efficiently. Strong analytical and problem-solving skills, coupled with excellent teamwork and communication abilities, enhance project outcomes and support cross-functional collaboration for seamless project execution.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Senior Test Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Developed and executed automated test scripts using **TypeScript**, **Selenium**, and **Cypress**, ensuring software reliability and quality across platforms, improving test coverage by 30%.\nImplemented testing strategies for various environments on **AWS** and **Azure**, aligning with best practices in **SDLC** and enhancing deployment efficiency.\nDesigned and maintained automated test frameworks using **Playwright** and **Pytest** for continuous integration, resulting in a 40% reduction in manual testing time.\nConducted thorough quality assurance and debugging processes, leading to a decrease in bug leakage by 25%.\nCollaborated effectively with multiple teams through excellent communication and teamwork, ensuring alignment on project goals and timelines.\nUtilized **GitHub** for version control, streamlining collaboration and code review of test scripts and strategies.\nExecuted performance testing and integration testing to validate system functionalities, maintaining system integrity and responding to system issues in real time.\nParticipated in problem-solving sessions to identify pain points in the application, leading to actionable insights that improved overall product quality.\nProvided training and mentorship to junior engineers on testing methodologies and tools, fostering knowledge sharing within the team.\n"
    },
    {
      "role": "Full Stack Developer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "• Developed automated test scripts using **Python** and **Playwright** to ensure software quality, enhancing testing efficiency by 40%.\n• Leveraged **Selenium** and **Cypress** for end-to-end testing, reducing regression testing time by 30% on **version 3.0** of the application.\n• Implemented effective quality assurance strategies in line with SDLC best practices, leading to a 20% decrease in bugs reported post-release.\n• Utilized **AWS** and **GCP** cloud services for deploying test environments, successfully improving resource scalability by **5x**.\n• Collaborated with cross-functional teams to gather requirements and ensure comprehensive test coverage, meeting project deadlines by **100%**.\n• Conducted thorough code reviews, mentoring junior team members on testing methodologies, contributing to a 15% increase in team performance.\n• Created detailed test documentation in **GitHub**, enhancing team communication and collaboration on the project.\n• Engaged in problem-solving sessions to troubleshoot and resolve critical testing issues, improving software reliability.\n• Actively participated in sprint planning and retrospectives, boosting team engagement and productivity through effective communication."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "Utilized **TypeScript** to enhance test automation scripts, ensuring high-quality standards in software releases.\nImplemented testing frameworks such as **Selenium**, **Cypress**, and **Playwright** to conduct thorough automated UI testing, identifying issues before they reach production.\nDeveloped comprehensive test cases using **Python** and **Pytest**, achieving a code coverage of 95% across multiple applications.\nApplied **AWS** and **Azure** services for cloud-based test environments, enabling more flexible and scalable testing solutions.\nCollaborated in an Agile team environment, participating in daily standups and actively contributing to SDLC processes to ensure timely delivery of projects.\nMaintained and documented all testing processes and outcomes in **GitHub**, ensuring consistency and traceability of test results throughout the project lifecycle.\nConducted quality assurance reviews, utilizing effective problem-solving skills to address and rectify software defects, enhancing user satisfaction by 30%.\nFacilitated communication between development teams and stakeholders, improving collaboration and understanding of test objectives and requirements.\nActively participated in code reviews to uphold code quality and adherence to best practices, fostering a culture of continuous improvement within the development team.\nDelivered training sessions for team members on modern testing tools and methodologies, enhancing the overall quality assurance capabilities within the organization."
    }
  ],
  "skills": "Programming Languages:\n\t**TypeScript, Python**\n\n**Backend Frameworks:**\n\t**NodeJS, ExpressJS, NestJS, C#, .NET, Entity Framework, Microservices**\n\n**Frontend Frameworks:**\n\t**HTML, CSS, JavaScript, ReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS**\n\n**API Technologies:**\n\t**RESTful API, GraphQL**\n\n**Serverless and Cloud Functions:**\n\t**AWS, Azure, GCP**\n\n**Databases:**\n\t**MSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB**\n\n**DevOps:**\n\t**CI/CD pipelines, Git, GitHub**\n\n**Cloud & Infrastructure:**\n\t**AWS, Azure, GCP**\n\n**Other:**\n\t**Messaging & Caching: Apache Kafka, RabbitMQ, Redis, Testing Tools: NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest, Blockchain: Solidity, Ether.js, Web3.js, Ethereum, UX/UI Design, Quality Assurance, Problem Solving, Teamwork, Communication**",
  "apply_company": "SentinelOne"
}