{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Lead Android Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-187801395/",
  "profile_summary": "Lead Android Engineer with 13+ years of experience specializing in **Android**, **Kotlin**, and **Java** development, delivering high-performance applications across various sectors. Proficient in **RESTful APIs** for effective third-party integrations and skilled in applying coding standards within **Agile** methodologies to ensure top-notch development practices.\nDemonstrated technical leadership in solution design while upholding compliance requirements in software development. Strong background in utilizing design patterns such as **MVC**, **MVVM**, and **MVP** to create scalable and maintainable applications. Experienced in fostering a collaborative team environment that drives innovative solutions.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Lead Android Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Delivered robust mobile applications on both **iOS** and **Android** platforms utilizing **Kotlin** and **Java**, ensuring adherence to coding standards and compliance requirements.\n• Executed agile methodologies to foster an efficient development process, enhancing team collaboration and project delivery timelines by **30%**.\n• Designed and implemented **RESTful APIs** for seamless **third-party integrations**, optimizing performance and user experience across the application stack.\n• Led technical architecture decisions following **MVC**, **MVVM**, and **MVP** design patterns to ensure scalable and maintainable codebases.\n• Managed technical leadership initiatives, mentoring junior developers and promoting best practices within the teams to strengthen coding standards and compliance adherence.\n• Spearheaded solution design strategies, incorporating advanced technical specifications and user feedback to elevate product offerings, resulting in a **15%** increase in user satisfaction.\n• Complied with all necessary compliance requirements, reducing potential risks and ensuring a trustworthy platform for users.\n• Established clear documentation and code review processes to uphold coding standards across the development lifecycle, enhancing software quality by **20%**."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Led the design and development of Android applications using **Java** and **Kotlin**, ensuring adherence to coding standards and best practices in software development.\nChampioned Agile methodologies within the team to enhance project efficiency and delivery speed by **30%**.\nArchitected robust MVVM and MVP patterns for application design, promoting scalable and maintainable codebases for **Android** applications.\nIntegrated third-party APIs and libraries to enhance application functionality, resulting in a **25%** increase in user engagement.\nProvided technical leadership and mentorship to junior developers, facilitating knowledge sharing and improving team capabilities.\nDesigned and implemented RESTful APIs to enable seamless communication between front-end interfaces and back-end systems, leading to improved data accessibility for users.\nEnsured compliance with industry standards and regulatory requirements, performing thorough code reviews and maintaining quality assurance protocols.\nCollaborated with cross-functional teams to define solution designs that align with business objectives and technical feasibility, achieving an alignment rate of **95%** on delivered software features."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Led the design and implementation of mobile applications for Android using **Kotlin** and **Java**, adhering to best practices and coding standards, which resulted in a **30%** increase in user engagement.\nEnsured adherence to **Agile** methodologies and fostered a collaborative team environment, improving project delivery timelines by **25%** through effective sprint planning and execution.\nDeveloped and maintained **RESTful APIs** for seamless integration with backend services, optimizing data exchange and reducing latency by **40%** in mobile transactions.\nImplemented architectural patterns such as **MVVM** and **MVP** to facilitate scalable codebases, enhancing maintainability and enabling rapid feature deployment across multiple Android versions.\nApplied **technical leadership** in steering team discussions regarding compliance requirements, ensuring adherence to industry standards and enhancing application security.\nCollaborated with cross-functional teams to execute 3rd-party integrations, enabling enhanced functionalities and services like payment gateways, social media sharing, and analytics, which led to a **20%** lift in conversion rates.\nEngineered robust solution designs that addressed user needs and business goals while complying with industry regulations and best practices.\nEvaluated and enforced coding standards throughout the development lifecycle, reducing bugs in production by **15%** and improving overall code quality.\nMentored junior developers and provided guidance on clean architecture and design principles, fostering professional growth and improving team capabilities."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, Java, JavaScript/TypeScript, Kotlin, \n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django, \n\n **Frontend Frameworks:**\n\tReact, Vue, Angular, \n\n **API Technologies:**\n\tRESTful APIs, third-party integrations, \n\n **Serverless and Cloud Functions:**\n\tAWS: Lambda, Azure: App Services, \n\n **Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis, \n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, CI/CD & Infrastructure as Code: Terraform, Ansible, Helm, Docker Compose, \n\n **Cloud & Infrastructure:**\n\tAWS: ECS, RDS, S3, Azure: Blob Storage, SQL Database, \n\n **Other:**\n\tAgile, MVC, MVVM, MVP, coding standards, technical leadership, solution design, compliance requirements "
}