{
  "name": "Tomasz Lee",
  "role_name": "Senior Flight Dynamics Software Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Results-driven Senior Flight Dynamics Software Engineer with 9+ years of robust experience in designing and developing high-precision algorithms and mission control systems. Proficient in **Python**, **Java**, **C++**, and **Fortran**, offering deep expertise in flight dynamics, astrodynamics, and spacecraft operations. Demonstrated capability in space traffic management and surveillance, utilizing advanced techniques in sensor fusion and catalog maintenance. Skilled in **microservices architecture**, **Docker**, and **CI/CD** for cloud-based deployments, ensuring quality through rigorous testing and verification (V&V). Proven record of streamlining development processes, enhancing collaboration across teams, and leading complex projects to successful outcomes.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Senior Flight Dynamics Software Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Leveraged **Python** and **C++** to develop high-precision algorithms for Flight Dynamics, optimizing spacecraft operations and enhancing mission control capabilities.\nImplemented **microservices architecture** using **Docker** for scalable and maintainable ground segment software, which improved deployment efficiency by **30%**.\nDeveloped and maintained automated mission planning tools integrating with **CI/CD** pipelines, decreasing deployment times by **40%**.\nDesigned and executed verification and validation (V&V) processes for SSA/SST systems, improving accuracy and reliability by **25%**.\nCollaborated with cross-functional teams to enhance Space Surveillance and Tracking (SST) capabilities, improving sensor fusion metrics by **15%**.\nConducted thorough testing and verification of telemetry/telecommand workflows, ensuring compliance with mission control systems standards.\nImplemented robust catalog maintenance practices, ensuring updated orbital mechanics data availability, leading to enhanced mission planning.\nUsed **version control** to manage software releases effectively, enabling seamless integration across diverse teams and systems.\nLed initiatives to improve user experience within flight dynamics software, collaborating with UX/UI designers to refine interfaces and functionalities for ground segment operations.\nManaged high-impact projects within a fast-paced environment, demonstrating strong leadership and collaboration to drive success."
    },
    {
      "role": "Full Stack Developer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "Developed high-precision algorithms for **orbital mechanics** and **astrodynamics**, ensuring accuracy in spacecraft operations and improving mission success rates by **20%**.\nDesigned and implemented **space traffic management** systems integrating **Python** and **C++**, contributing to efficient mission control workflows.\nLed efforts in the integration of **microservices architecture** using **Docker** to enhance system scalability for mission-critical applications, resulting in a **30%** reduction in system latency.\nManaged **version control** processes including CI/CD for continuous testing and deployment, achieving a **25%** decrease in deployment errors across projects.\nCollaborated with multidisciplinary teams for sensor fusion and **SSA/SST systems** development, ensuring real-time tracking capabilities and improving situational awareness.\nImplemented **testing** and **verification and validation (V&V)** protocols for spacecraft operations and ground segment software, ensuring compliance with operational standards.\nDeveloped mission planning tools that streamlined automated mission planning processes, increasing team productivity by **15%**.\nEngaged in catalog maintenance for surveillance and tracking systems, ensuring data accuracy and integrity.\nMentored junior engineers in mission control systems while enhancing teamwork and collaboration, fostering a positive and productive work environment."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "Developed high-precision algorithms for **orbital mechanics** and **astrodynamics** to ensure optimal spacecraft operations in mission control environments, achieving an operational efficiency improvement of **25%**.\nUtilized **Python**, **Java**, and **C++** to create robust mission planning tools that enhance decision-making capabilities during spacecraft operations.\nDesigned and implemented **microservices architecture** to support scalable and maintainable ground segment software, reducing deployment time by **30%**.\nManaged version control systems to maintain code integrity across multiple team members and projects, ensuring streamlined collaboration and adherence to standards.\nConducted rigorous testing, verification, and validation (V&V) protocols to ensure the reliability of **SSA/SST systems**, resulting in a **15%** reduction in error rates during operations.\nDeveloped tools for space traffic management that integrate **sensor fusion** techniques to improve catalog maintenance accuracy and efficiency.\nLed automation initiatives in CI/CD processes for cloud-based deployments, significantly speeding up development cycles by up to **40%**.\nCollaborated with multidisciplinary teams in Ground Segment Operations to enhance telemetry/telecommand workflows, facilitating seamless communication between spacecraft and mission control.\nProvided mentorship and leadership to junior engineers, fostering a culture of collaboration and continuous improvement within the team."
    }
  ],
  "skills": "**Programming Languages**\n\tPython, Java, C++, Fortran, JavaScript, TypeScript\n\n**Backend Frameworks**\n\tNodeJS, ExpressJS, NestJS, C#, .NET, Entity Framework, Microservices, Microservices Architecture\n\n**Frontend Frameworks**\n\tReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, TailwindCSS, Three.js, D3.js, React Native, Flutter, Chakra UI\n\n**API Technologies**\n\tRESTful API, GraphQL\n\n**Serverless and Cloud Functions**\n\tAWS, Azure, Cloud-based deployments\n\n**Databases**\n\tMSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB\n\n**DevOps**\n\tCI/CD, CI/CD pipelines, Docker, version control\n\n**Cloud & Infrastructure**\n\tGround segment software, ground segment operations, automated mission planning\n\n**Other**\n\tFlight Dynamics, Mission Control, Space Traffic Management, Space Surveillance and Tracking, orbital mechanics, astrodynamics, spacecraft operations, high-precision algorithms, testing, verification and validation (V&V), SSA/SST systems, sensor fusion, catalog maintenance, mission planning tools, telemetry/telecommand workflows, leadership, collaboration, UX/UI Design, Git, GitHub"
}