{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Fullstack Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-152840397/",
  "profile_summary": "Dynamic Senior Fullstack Engineer with 8 years of extensive experience, specializing in high-performance applications using **JavaScript**, **TypeScript**, and **Node.js**, along with **React**, **Next.js**, and **NestJS** for seamless front-end and back-end integration. Proficient in developing maintainable and secure applications with a solid foundation in **PostgreSQL** for robust data management. I have a strong background in performance optimization and security best practices, ensuring compliance with industry standards. My experience extends to leveraging **AWS** and **Kubernetes** for cloud solutions, enhancing scalability and efficiency.\n\nNotably, I have led the development of versatile platforms in the healthcare and financial sectors, integrating cutting-edge technologies for user experience (UX) and user interface (UI) design. With a focus on microservices architecture and CI/CD automation, I am dedicated to delivering high-quality code that minimizes downtime and enhances maintainability.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Fullstack Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Developed and maintained robust applications utilizing **JavaScript**, **TypeScript**, **Node.js**, and **React** (versions **17-18**) to enhance performance, maintainability, and security best practices in line with modern development standards.\n- Collaborated in the design and implementation of APIs using **GraphQL** and **PostgreSQL**, ensuring efficient data retrieval and manipulation while optimizing application performance.\n- Utilized **Next.js** for server-side rendering, enhancing the user experience (UX) through faster load times and improved UI design across various applications.\n- Enhanced application security by implementing best practices and frameworks alongside effective testing strategies using tools like Jest and Cypress.\n- Spearheaded initiatives for cross-platform mobile applications developed on frameworks like **Node.js** and **React Native**, ensuring seamless integration and performance across iOS and Android platforms.\n- Leveraged **Kubernetes** for orchestrating containerized applications, improving deployment efficiency and scalability in operational settings.\n- Conducted performance optimization strategies for both front-end and back-end components ensuring high reliability and speed, significantly decreasing load times by **30%**.\n- Implemented CI/CD practices integrating **AWS** and **Azure** tools to streamline deployment processes, enhancing productivity and reducing release times by **25%**.\n- Designed and managed complex cloud infrastructures utilizing **AWS** and **Kubernetes**, focusing on elasticity and fault tolerance to handle scale efficiently.\n- Worked extensively with UX/UI principles, ensuring applications are designed with user-centered practices, improving user satisfaction scores by **20%**.\n- Collaborated with cross-functional teams to ensure the integration of additional functionalities, while adhering to best practices in performance optimization and maintainability."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Utilized **JavaScript**, **TypeScript**, and **Node.js** (NestJS/Express) to lead the development of scalable financial platforms, implementing a microservices architecture that improved throughput for systems handling over **1 million** transactions daily.\nDesigned and developed high-performance front-end applications using **React** (18) and **Next.js**, ensuring optimal **UX** and **UI design** for financial dashboards that improved user satisfaction scores by **30%**.\nOptimized database interactions with **PostgreSQL**, enhancing query performance by **40%** to support real-time analytics and reporting for financial data.\nImplemented robust security best practices, ensuring compliance with industry standards and protecting sensitive financial data.\nCreated dynamic dashboards with **React** and **D3.js**, enabling operational teams to monitor transaction flows and detect anomalies in real time, enhancing operational efficiency by **25%**.\nIncorporated **GraphQL** to streamline API interactions, reducing request size and load times by **50%**, improving overall application performance.\nManaged deployment and scaling of applications using **AWS** and **Kubernetes**, ensuring high availability and resilience for financial services.\nConducted performance optimization across the stack, employing best practices that reduced latency for critical transactions by **35%**."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "• Engineered robust full-stack applications using **JavaScript**, **TypeScript**, **Node.js** (NestJS), and **React** (18) to deliver high-performance, scalable, and maintainable solutions across various modules enhancing user experience and functionality within a **Senior Fullstack Engineer** role.\n• Optimized database handling using **PostgreSQL** along with advanced techniques for performance optimization, maintaining responsive data access for high-traffic scenarios, boosting efficiency by **30%**.\n• Developed SEO-friendly, responsive interfaces through **Next.js** and **React**, adhering to accessibility standards (WCAG 2.1) and improving UI engagement metrics by **15%**.\n• Implemented **Kubernetes** for container orchestration, ensuring microservices sustainability and enabling rapid deployment cycles, which reduced deployment time from **2 hours** to **30 minutes**.\n• Designed and integrated secure APIs utilizing **GraphQL** for efficient data retrieval, enhancing client-server communication and reducing network payloads by **25%**.\n• Adopted security best practices including role-based access control (RBAC) and OAuth 2.0 for data security, ensuring compliance with GDPR and safeguarding user information.\n• Collaborated on UI design processes, utilizing feedback loops focusing on UX improvements to increase user satisfaction ratings from **75%** to **90%**.\n• Enhanced maintainability and performance of applications through code reviews and adherence to clean coding standards, fostering a culture of continuous improvement within the team.\n• Actively participated in code debugging sessions and system optimization discussions to maintain a streamlined development workflow, supporting project timelines with efficient task management."
    }
  ],
  "skills": " **Programming Languages:**\n\tJavaScript, TypeScript, Python\n\n**Backend Frameworks:**\n\tNode.js, FastAPI, Flask, Django, NestJS\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular, Next.js\n\n**API Technologies:**\n\tGraphQL\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3)\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS, Azure (App Services, Blob, SQL)\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, performance optimization, maintainability, security best practices, UX, UI design, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot",
  "apply_company": "Maze"
}