{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Odoo Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Senior Odoo Engineer with 13+ years of experience in **Python** programming and **ERP** systems, specializing in **Odoo** implementations and customization. Demonstrated expertise in **Data Migration**, **Integration**, and **Database Management**, ensuring seamless transitions and optimized data flows. Adept at **Business Process Analysis**, providing insights to enhance operational efficiencies.\n\nAdditionally, I bring strong skills in system administration and documentation, ensuring robust solutions that are well-documented and maintainable. Excellent communication abilities, facilitating successful collaboration with stakeholders and team members. My comprehensive technical background includes hands-on experience in full stack development with **JavaScript/TypeScript**, **Flutter**, and frameworks such as **React**, **Node.js**, and **Django**, enabling me to drive innovative solutions for complex business needs.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Odoo Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Leveraged **Python** to integrate **Odoo** ERP systems, enhancing operational efficiency through meticulous **Business Process Analysis** and effective **Data Migration** strategies.\nConducted thorough **Documentation** practices to ensure streamlined **System Administration** and effective communication among stakeholders, improving project transparency and overall impact.\nManaged and optimized **Database Management** tasks for Odoo deployments, ensuring data integrity and system performance across **ERP** solutions for various industries.\nFacilitated the integration of third-party services and modules into Odoo, utilizing REST APIs and webhooks to enhance functionality and user experience.\nPerformed rigorous testing and validation on data migration processes, ensuring a seamless transition from legacy systems to **Odoo**, reducing migration time by **30%**.\nCollaborated with cross-functional teams to define business requirements and translate them into technical specifications, resulting in a **20%** increase in process automation efficiency.\nDesigned and implemented data-driven solutions to optimize business workflows, contributing to an overall productivity increase of **15%** within the first quarter post-implementation.\nDeveloped training materials and conducted workshops for end-users to facilitate change management and ensure successful adoption of the new system features.\nUtilized version control systems for all project deliveries, maintaining robust version history and enabling easy rollback capabilities as needed."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Conducted data migration and integration strategies for the Odoo ERP system, ensuring seamless transitions and minimal disruption to existing workflows and business processes.\nUtilized **Python** for backend development and customization of Odoo modules, enhancing functionality to meet specific business needs and requirements.\nManaged database systems to ensure optimal performance and stability, employing best practices in **Database Management** and system administration across Odoo implementations.\nPerformed comprehensive business process analysis, identifying opportunities for system enhancements and streamlined operations within the Odoo environment.\nProduced detailed documentation on system configurations, integration points, and user manuals for Odoo ERP processes, facilitating knowledge transfer and onboarding for stakeholders.\nFacilitated effective communication with cross-functional teams and clients, ensuring project specifications are met and adjustments are made in accordance with feedback and business objectives.\nImplemented robust system administration practices, monitoring and maintaining production environments to support high availability and reliability of the Odoo platform.\nLeveraged tools like **PostgreSQL** for database management and optimization, maintaining data integrity and security across **Odoo** implementations."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Leveraged **Odoo** ERP to manage data migration and optimize business processes, ensuring seamless integration of new features and modules.\nUtilized **Python** for custom module development and system administration, enhancing the functionality of the Odoo platform and facilitating efficient software operation.\nConducted thorough business process analysis to identify areas for improvement, leading to a **25%** increase in operational efficiency across the organization.\nManaged database systems ensuring data integrity and implementing effective backup strategies with a focus on **PostgreSQL**.\nAuthored and maintained comprehensive documentation to facilitate smoother transitions during system updates, enhancing team communication and knowledge transfer.\nImplemented successful integration strategies for external systems, ensuring a **30%** reduction in data redundancy and enhancing overall system performance.\nFostered strong communication with stakeholders to gather requirements, providing clear insights into the capabilities of **Odoo** and its potential to streamline operations.\nDeveloped and executed training sessions for end-users, improving adoption and satisfaction rates by **40%** among staff interacting with the ERP system.\nEnsured compliance with data management protocols and best practices, contributing to a more secure and reliable operational framework."
    }
  ],
  "skills": "**Programming Languages:**\n\tPython\n\n**Backend Frameworks:**\n\tFastAPI\n\tFlask\n\tDjango\n\n**Frontend Frameworks:**\n\tJavaScript/TypeScript\n\tReact\n\tVue\n\tAngular\n\n**API Technologies:**\n\tOdoo\n\n**Serverless and Cloud Functions:**\n\tAWS: ECS\n\tAWS: Lambda\n\tAWS: RDS\n\tAWS: S3\n\tAzure: App Services\n\tAzure: Blob Storage\n\tAzure: SQL Database\n\n**Databases:**\n\tPostgreSQL (Fintech)\n\tMySQL (Healthcare)\n\tMongoDB (Gaming)\n\tRedis\n\tDatabase Management\n\n**DevOps:**\n\tDocker\n\tKubernetes\n\tGitHub Actions\n\tGitLab CI/CD\n\tTerraform\n\tAnsible\n\tHelm\n\tDocker Compose\n\n**Cloud & Infrastructure:**\n\tDocumentation\n\tSystem Administration\n\n**Other:**\n\tData Migration\n\tERP\n\tIntegration\n\tBusiness Process Analysis\n\tAuthentication & Security: Keycloak (OIDC, RBAC), OAuth2, JWT\n\tNginx\n\tLet’s Encrypt\n\tCertbot\n\tCommunication",
  "apply_company": "Twine"
}