{
  "name": "Tomasz Lee",
  "role_name": "Cloud Software Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Results-driven Cloud Software Engineer with 9+ years of extensive experience in cloud ecosystems, specializing in **AWS** components such as **S3**, **EC2**, and **IAM**. Proficient in microservices architecture and development, with hands-on expertise in **Docker**, **Kubernetes**, and leveraging messaging platforms including **Kafka** and **Redis**. Demonstrated capability in coding quality, collaborative programming, and continuous integration, ensuring robust and maintainable solutions. Solid understanding of data engineering principles, complemented by experience with **Cassandra** and **ElasticSearch**. A committed team player, adept at optimizing performance and enhancing development processes through innovative problem-solving.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Cloud Software Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Utilized **AWS** services including **EC2**, **S3**, and **IAM** to enhance cloud infrastructure for application deployment and management.\nDeveloped and maintained microservices architecture using **Golang** for scalability and effective resource utilization.\nIntegrated **Kafka** for real-time data processing, ensuring timely and reliable communication between distributed services.\nImplemented **Docker** and **Kubernetes** for efficient containerization and orchestration of microservices, improving deployment consistency by **30%**.\nLeveraged **Redis** for caching mechanisms, improving response times by **35%** and optimizing overall system performance.\nCollaborated in a team environment to promote collaborative programming practices, leading to improvements in coding quality and team functionality.\nEngaged in continuous integration practices using **Git** for version control, streamlining the deployment process and reducing integration issues.\nDesigned data solutions leveraging **Cassandra** and **ElasticSearch** for scalable storage and fast querying of large datasets.\nParticipated in the development of machine learning models incorporating **Large Language Models** for improved data insights and analytics.\nEnsured robust application security through effective implementation of authentication and authorization methods.\n"
    },
    {
      "role": "Full Stack Developer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "Utilized **Golang** for developing scalable cloud applications, contributing to a **20%** improvement in processing speed.\nImplemented **AWS** services including **EC2**, **S3**, and **IAM** for resource management and deployment, enhancing application robustness and security.\nDesigned a microservices architecture leveraging **Kafka** and **Redis** for efficient task orchestration and data caching, resulting in a **30%** reduction in response times.\nCreated and maintained containerized applications using **Docker** and orchestrated deployments via **Kubernetes**, achieving seamless scalability.\nDeveloped RESTful APIs with strong emphasis on coding quality and collaborative programming practices, leading to a **15%** decrease in bug reports.\nExecuted CI/CD pipelines using **GIT** and automated testing, which improved deployment frequency by **40%** and reduced integration issues.\nCollaborated extensively with cross-functional teams to gather requirements and drive iterative development practices, ensuring alignment with project goals.\nContributed to data engineering initiatives by integrating **Cassandra** and **ElasticSearch** for advanced data querying and analytics, enriching data insights.\nEngaged in continuous learning and application of **Large Language Models** in designing innovative solutions, optimizing user experiences.\nMentored junior developers in coding best practices, fostering a culture of quality and teamwork within the engineering department."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "Utilized **AWS** services such as **S3** and **EC2** to develop scalable cloud-based applications, enhancing performance and reliability.\nImplemented containerization strategies using **Docker** and **Kubernetes** to streamline deployment processes and improve application efficiency.\nDesigned microservices architecture leveraging **Golang** to ensure modularity and ease of maintenance, achieving a reduction in deployment time by **30%**.\nDeveloped and maintained CI/CD pipelines with **GIT** integration, facilitating continuous integration and delivery across the development lifecycle.\nEmployed **Redis** for caching strategies to optimize data retrieval times, resulting in a **15%** decrease in latency for user requests.\nIntegrated **Kafka** for real-time data processing, improving system responsiveness and throughput.\nCollaborated with cross-functional teams in a **collaborative programming** setting to enhance coding quality and ensure alignment with project goals.\nEngaged in **team player** initiatives, actively participating in daily standups and code reviews to foster a cohesive working environment and uphold coding standards.\nDelivered technical documentation and data architecture designs leveraging **Cassandra** and **ElasticSearch** for effective data management, improving team knowledge transfer.\nApplied data science techniques for analytics and insights, contributing to informed decision-making and strategy development."
    }
  ],
  "skills": "  **Programming Languages**\n\t Golang, JavaScript, TypeScript, Python, C#, Solidity\n\n  **Backend Frameworks**\n\t NodeJS, ExpressJS, NestJS, .NET, Microservices\n\n  **Frontend Frameworks**\n\t ReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n  **API Technologies**\n\t RESTful API, GraphQL\n\n  **Serverless and Cloud Functions**\n\t AWS, S3, EC2, IAM, Azure\n\n  **Databases**\n\t MSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB, Cassandra, ElasticSearch\n\n  **DevOps**\n\t Docker, Kubernetes, CI/CD pipelines\n\n  **Cloud & Infrastructure**\n\t AWS, Azure, Cloud ecosystems\n\n  **Other**\n\t UX/UI Design, Git, GitHub, Redis, Apache Kafka, RabbitMQ, Selenium, Moq, Postman, Cypress, JMeter, Jest, Team player, Coding quality, Collaborative programming, Continuous integration, Data Science, Data Engineering, Large Language Models"
}