{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Cloud Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-152840397/",
  "profile_summary": "Results-driven Senior Cloud Engineer with 8 years of extensive experience in **IT Operations**, **Systems Administration**, and **Database Management**. Proficient in **Linux**, with strong capabilities in **Shell Scripting** and **Bash** for automation tasks. Skilled in **Network Monitoring** and **Network Security** to ensure systems remain secure and efficient. Experienced in **Performance Tuning** to optimize application and system performance. Exceptionally capable in **Incident Management** and **Customer Support**, focusing on delivering high-quality solutions for clients.\n\nIn addition to my foundational proficiencies, I am a seasoned Full Stack Developer utilizing **Python**, and having expertise in building high-performance solutions in the healthcare and financial sectors. Proficient with modern frameworks such as **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**, and adept in working with **cloud services** including **Azure** and **AWS**. I have successfully led the development of enterprise-grade platforms that integrate AI/ML capabilities for predictive analytics and intelligent automation, while maintaining compliance with standards like HIPAA and PCI DSS.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Cloud Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Utilized **Linux** for system administration and management, ensuring optimal performance across servers with **performance tuning** strategies.\nConducted thorough **server auditing** to enhance **network security**, identifying vulnerabilities and optimizing configurations.\nImplemented **shell scripting** and **Bash** scripts for automating routine tasks, increasing efficiency in **IT operations** by 30%.\nManaged databases ensuring robust **database management** practices, leading to uptime metrics of over **99.9%**.\nProvided technical support and customer assistance, resolving incidents and queries with a resolution rate of **95%** on first contact.\nConfigured and monitored **network monitoring** tools to track system performance, achieving a **20%** reduction in downtime.\nPrepared and maintained comprehensive **technical documentation** for systems and procedures, improving team understanding and knowledge sharing.\nLed **incident management** processes to ensure swift team response to service outages, effectively restoring services within **1 hour** of incidents.\nCollaborated closely with cross-functional teams to ensure seamless deployment and integration of cloud solutions, aligning with organizational goals for the **Senior Cloud Engineer** role.\nDesigned and implemented scalable cloud infrastructures utilizing **AWS**, **Azure**, and **Docker**, facilitating high availability and fault tolerance for enterprise applications."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Executed IT Operations by managing server environments utilizing **Linux** for performance tuning and network security, ensuring high availability and reliability of production systems.\nCrafted and maintained technical documentation for systematic server auditing, incident management, and network monitoring procedures, promoting transparency and knowledge-sharing across the team.\nImplemented **Shell Scripting** and **Bash** for automation of routine tasks, streamlining the maintenance of servers and optimizing operational efficiency, reducing downtime by **20%**.\nManaged database systems with a focus on **Database Management** best practices, ensuring data integrity and security while achieving a **30%** improvement in query performance.\nProvided expert **Customer Support** by troubleshooting and resolving complex technical issues, enhancing end-user satisfaction and reducing incident resolution time by **15%**.\nOrchestrated **Network Monitoring** strategies to proactively identify and mitigate risks, ensuring compliance with internal and external security standards, leading to a **25%** decrease in vulnerabilities.\nActed as a liaison for change management, facilitating communication between technical teams and stakeholders, thereby aligning IT operations with business objectives and adapting to evolving requirements."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Implemented and maintained **Linux** server environments to optimize system performance and ensure robust infrastructure for high-volume e-commerce applications.\nExecuted **Shell Scripting** and **Bash** for automation of IT operations, enhancing operational efficiency and reducing manual intervention time by **30%**.\nConducted detailed **Server Auditing** to identify vulnerabilities and ensure compliance with security standards, increasing system reliability and trust by conducting audits every **quarter**.\nMonitored and improved **Network Monitoring** systems to ensure uptime and performance metrics remained above **99.9%**, leading to enhanced user experience across the platform.\nManaged **Database Management** systems such as **PostgreSQL**, ensuring data integrity and optimal performance for high-traffic workflows, achieving data access speeds improved by a factor of **5**.\nImplemented **Network Security** protocols and measures, reducing potential security breaches by **40%** through proactive threat detection and response strategies.\nEnhanced system performance through continuous **Performance Tuning**, ensuring backend services could handle spikes in traffic during peak sales periods with minimal latency.\nSupported **IT Operations** and **Systems Administration** efforts, implementing best practices that reduced downtime during maintenance by **50%**.\nFostered excellent **Customer Support** by establishing a swift incident management process, shortening ticket resolution time by **60%**.\nCreated and maintained comprehensive **Technical Documentation** ensuring knowledge-sharing within teams and transparency in IT processes, updated semi-annually.\nSpearheaded **Incident Management** initiatives to resolve operational issues swiftly, reducing system outage durations by **20%** through effective response protocols."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, PHP, JavaScript/TypeScript\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n **Frontend Frameworks:**\n\tReact, Vue, Angular\n\n **API Technologies:**\n\tJWT, OAuth2, Keycloak (OIDC, RBAC)\n\n **Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n **Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, CI/CD & Infrastructure as Code (Terraform, Ansible, Helm, Docker Compose)\n\n **Cloud & Infrastructure:**\n\tNetwork Monitoring, Server Auditing, Systems Administration\n\n **Other:**\n\tShell Scripting, Bash, IT Operations, Performance Tuning, Customer Support, Network Security, Technical Documentation, Incident Management",
  "apply_company": "Jamf"
}