{
  "name": "Tomasz Lee",
  "role_name": "Senior Backend Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Results-driven Senior Backend Engineer with 9+ years of experience in designing and implementing scalable applications. Proficient in leveraging **Node.js**, **TypeScript**, **AWS**, **Docker**, **Kubernetes**, **REST APIs**, and **GraphQL APIs** to create high-performance backend solutions. Expertise in database management with **SQL** and **NoSQL** databases to ensure data integrity and availability. Demonstrated ability to optimize development processes and enhance application performance. Strong collaboration skills, capable of leading cross-functional teams to deliver projects on time and to specification.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Senior Backend Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "• Developed and maintained REST APIs and GraphQL APIs, ensuring seamless integration with frontend technologies and a smooth user experience.\n• Leveraged **Node.js** and **TypeScript** to build efficient backend services, enhancing application performance by 30%.\n• Utilized **AWS** for cloud service deployment, managing resources effectively to scale applications based on user demand, achieving uptime of **99.9%**.\n• Implemented **Docker** containers for microservices architecture, facilitating easy deployment and environment consistency.\n• Orchestrated containerized applications using **Kubernetes**, improving system orchestration and resource management, which reduced overhead costs by **15%**.\n• Optimized **SQL** and **NoSQL** databases for data retrieval and storage, enhancing data access speeds by **25%**.\n• Developed automated CI/CD pipelines on **Azure DevOps**, speeding up the deployment process by **40%** and minimizing production downtime.\n• Analyzed and improved legacy services to integrate with modern frameworks and technologies, ensuring a smooth transition and improved maintainability.\n• Collaborated with frontend developers and designers to ensure cohesive and responsive application layouts, increasing customer satisfaction ratings by **20%**.\n• Implemented security protocols, prioritizing user authentication and data encryption, reducing vulnerabilities by **50%**."
    },
    {
      "role": "Software Engineer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "Developed and implemented **Node.js** applications following best practices to ensure high performance and responsiveness across platforms.\nUtilized **TypeScript** for robust web applications, enhancing code maintainability and reducing bugs by 20%.\nDeployed services in **Docker** containers, enabling a repeatable environment setup and speeding up the development lifecycle.\nOrchestrated containerized applications with **Kubernetes**, effectively managing scaling and orchestration of microservices architecture.\nDesigned and integrated **REST APIs** and **GraphQL APIs** for seamless communication between the frontend and backend, achieving a 30% reduction in response time.\nOptimized SQL and **NoSQL databases**, specifically **PostgreSQL** and **MongoDB**, improving data retrieval speeds by 40%.\nImplemented CI/CD practices, utilizing **AWS** services, leading to a 25% decrease in deployment times.\nConducted thorough code reviews and provided mentorship to junior developers, resulting in a noticeable improvement in team job satisfaction and engagement.\nParticipated in stakeholder meetings to gather requirements and prioritize development tasks, ensuring alignment with project goals and timelines.\nMaintained system documentation and created custom solutions with **D3.js** for reporting tools, enhancing project tracking capabilities."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "• Developed REST APIs using **Node.js** and **TypeScript** to enhance backend functionality, contributing to a **25%** increase in application responsiveness.\n• Designed and implemented **Docker** containers for application deployment, improving consistency across environments by **40%**.\n• Managed cloud services in **AWS**, optimizing resource usage and reducing costs by **15%** through efficient cloud architecture.\n• Utilized **Kubernetes** for orchestration, ensuring high availability and scalability of applications, resulting in a **30%** reduction in downtime.\n• Collaborated on project requirements and architecture using **SQL databases** and **NoSQL databases**, enhancing data retrieval time by **20%**.\n• Created and maintained documentation for **REST APIs** and **GraphQL APIs**, facilitating easier integration for front-end teams.\n• Participated in code reviews and daily standups, ensuring best practices and continuous improvement in software development.\n• Mentored junior developers in using modern frameworks and tools, contributing to increased team productivity and skill enhancement.\n• Assisted in the migration of legacy systems to modern architecture, streamlining processes and reducing technical debt by **50%**."
    }
  ],
  "skills": " **Programming Languages**\n\t Node.js, TypeScript, Python\n\n **Backend Frameworks**\n\t ExpressJS, NestJS, C#, .NET, Entity Framework, Microservices\n\n **Frontend Frameworks**\n\t HTML, CSS, JavaScript, ReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n **API Technologies**\n\t REST APIs, GraphQL APIs\n\n **Serverless and Cloud Functions**\n\t AWS, Docker, Kubernetes\n\n **Databases**\n\t MSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB, SQL databases, NoSQL databases\n\n **DevOps**\n\t CI/CD pipelines\n\n **Cloud & Infrastructure**\n\t Azure\n\n **Other**\n\t Apache Kafka, RabbitMQ, Redis, NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest, Blockchain: Solidity, Ether.js, Web3.js, Ethereum, UX/UI Design, Git, GitHub, Redux",
  "apply_company": "TechTree"
}