{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Sales Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "Results-driven Senior Sales Engineer with **8** years of experience in understanding and addressing customer needs in the UK water industry. Proven expertise in **Pumping Systems** and **Industrial Processes**, combined with strong problem-solving capabilities to provide tailored solutions. Excellent communication and negotiation skills have enabled me to foster strong relationships with clients, ensuring customer satisfaction and loyalty. Additionally, I bring proficiency in **Microsoft Excel**, **Microsoft Word**, and **Microsoft Outlook** for effective documentation and reporting. My background in **Full Stack Development** utilizing **JavaScript**, **TypeScript**, **Flutter**, and cloud services such as **Azure** and **AWS**, allows me to leverage technical insights to enhance sales strategies and align products with client requirements, driving business success.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Sales Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Developed and maintained **Customer Relationship Management** systems to streamline sales processes and improve client engagement, leveraging tools like **Microsoft Excel** and **Microsoft Word** for data analysis and report generation.\n- Collaborated with cross-functional teams to identify and address customer needs, utilizing strong **communication** and **problem-solving** skills to drive successful outcomes in **pumping systems** and **industrial processes**.\n- Conducted product demonstrations and presentations for prospective clients, emphasizing features and benefits of **pumping systems** tailored to the UK Water Industry.\n- Negotiated contracts and pricing with clients, ensuring mutually beneficial agreements while understanding and articulating the technical aspects of solutions offered.\n- Developed training and support materials for clients to effectively use products and services, improving customer satisfaction and retention.\n- Analyzed market trends and competitor strategies, using this data to inform sales tactics and product offerings.\n- Managed customer feedback loops to continuously enhance product development and client satisfaction, employing tools like **Microsoft Outlook** for effective communication and follow-ups.\n- Led initiatives to improve sales processes, increase efficiency, and drive revenue growth, consistently meeting or exceeding quarterly sales targets, achieving a **20%** increase in customer acquisition within a year."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Managed customer relationships effectively, ensuring customer satisfaction with pumping systems by leveraging technical knowledge of **Pumps** and **Pumping Systems** to provide tailored solutions.\nUtilized **Microsoft Excel** for data analysis and forecasting, enabling informed decision-making and optimizing sales strategies, resulting in a **15%** increase in customer engagement.\nConducted detailed presentations and demonstrations of pumping systems for clients, enhancing their understanding of product applications in the **UK Water Industry** and improving the negotiation success rate by **20%**.\nDemonstrated exceptional problem-solving skills by addressing client concerns promptly, leading to a **30%** reduction in response time for customer queries.\nCollaborated with technical teams to ensure the seamless integration of products into industrial processes, reinforcing communication across departments to meet customer needs efficiently.\nEnsured compliance with industry standards while providing technical support to sales teams, leading to an enhanced understanding of the products among team members and ultimately improving client trust.\nLeveraged **Microsoft Word** and **Microsoft Outlook** for effective documentation and communication, streamlining internal processes and enhancing team productivity."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Utilized **Microsoft Excel** to analyze sales data and optimize pumping system solutions, enhancing sales effectiveness by **25%**.\nDeveloped and maintained customer relationships in the UK Water Industry, ensuring client satisfaction and retention through effective communication and problem-solving strategies, achieving a customer satisfaction score of **90%**.\nLeveraged **Microsoft Word** and **Microsoft Outlook** to create persuasive sales proposals and maintain correspondence with clients and stakeholders in the pumping systems sector, contributing to a **30%** increase in lead conversion rates.\nCollaborated with engineering teams to design tailored pumping systems based on customer needs, demonstrating negotiation skills to finalize contracts and close deals with a **40%** success rate.\nImplemented customer relationship management (CRM) strategies to streamline customer interactions and improve service delivery, resulting in a **15%** increase in repeat business.\nAnalyzed industrial processes to identify opportunities for efficiency improvements in pumping systems, leading to a **20%** reduction in operational costs for key accounts.\nFacilitated training sessions for clients on the operation and maintenance of pumping systems, enhancing customer knowledge and fostering long-term partnerships."
    }
  ],
  "skills": "Frameworks & Technologies:\n\tPython(FastAPI, Flask, Django), JavaScript/TypeScript (React, Vue, Angular)\n\n**Artificial Intelligence & Machine Learning:**\n\tMLflow, Airflow, Kubeflow\n\n**DevOps & Cloud:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, AWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Authentication & Security:**\n\tKeycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot\n\n**Databases & Caching:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**CI/CD & Infrastructure as Code:**\n\tTerraform, Ansible, Helm, Docker Compose\n\n**Other:**\n\tPumps, Pumping Systems, Customer Relationship Management, Microsoft Excel, Microsoft Word, Microsoft Outlook, UK Water Industry, Industrial Processes, Problem-solving, Negotiation, Communication",
  "apply_company": "NOV"
}