{
  "name": "Patryk Zaslawski",
  "role_name": "Senior AI Engineer",
  "email": "patrykzas0428@outlook.com",
  "phone": "+48669862402",
  "address": "Gdanski, Poland",
  "linkedin": "https://www.linkedin.com/in/patryk-z-107978395/",
  "profile_summary": "As a Senior AI Engineer with 8+ years of experience in software engineering, I excel in leveraging **Python** for developing innovative AI solutions, with particular expertise in **LLM**, **Langchain**, and **LlamaIndex**. I am skilled in creating interactive applications using **Streamlit** and **Gradio**, while ensuring deployment is seamless with **Docker**. My proficiency extends to cloud platforms, notably **AWS**, **Azure**, and **GCP**, applying best practices in **IaC** and **CI/CD** to ensure scalability and maintainability. With a solid foundation in problem-solving and critical thinking, I have a proven track record of delivering high-performance solutions tailored to meet business objectives in e-commerce, finance, and healthcare. My technical experience is complemented by a strong focus on creating efficient, secure systems through modern software design principles.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2014",
      "to_year": "2017",
      "location": "United Kingdom",
      "university": "The University of Manchester"
    }
  ],
  "experience": [
    {
      "role": "Senior AI Engineer",
      "company": "Binary Studio",
      "from_date": "Aug 2023",
      "to_date": "Present",
      "location": "United Kingdom (Remote)",
      "responsibilities": "• Developed AI-driven applications leveraging **Python** and frameworks like **Streamlit** and **Gradio** to enhance user experience and interactivity in healthcare solutions.\n• Designed and implemented scalable architectures on **AWS**, **Azure**, and **GCP**, ensuring seamless integration of machine learning models and data processing pipelines.\n• Led the deployment of containerized applications using **Docker**, optimizing resource utilization and system performance across cloud platforms.\n• Spearheaded CI/CD initiatives incorporating **Git**, automated testing, and deployment pipelines, reducing release times by **30%**.\n• Integrated **LLM**, **Langchain**, and **LlamaIndex** technologies to enable advanced natural language processing capabilities for patient interaction and data analysis.\n• Engaged in prompt engineering to enhance model performance, leveraging advanced techniques in **Python** to facilitate Natural Language Understanding (NLU) tasks.\n• Applied critical thinking and problem-solving skills to identify areas for optimization in existing systems, leading to improved processing speeds by up to **25%**.\n• Collaborated with cross-functional teams to promote best practices in AI, including model training, validation, and deployment, mentoring junior engineers in effective use of **Python** and cloud services.\n• Established observability frameworks using tools like Prometheus and Grafana for proactive monitoring and performance tuning of AI systems.\n• Championed Infrastructure as Code (IaC) practices to ensure consistent and repeatable deployment processes across environments, significantly reducing configuration drift.\n• Strengthened security posture in AI applications by embedding compliance checks for SOC 2, HIPAA, and PCI DSS, ensuring data privacy and protection.\n• Researched and evaluated emerging technologies in AI and cloud computing, driving innovation and continuous improvement in product offerings."
    },
    {
      "role": "Software Engineer",
      "company": "Ardigen",
      "from_date": "Mar 2020",
      "to_date": "Aug 2023",
      "location": "Poland",
      "responsibilities": "• Developed and deployed scalable **Python**-based applications leveraging **LLM**, **Langchain**, and **LlamaIndex** for optimal performance as a **Senior AI Engineer**.\n• Built and optimized various **Cloud** architectures on **AWS**, **Azure**, and **GCP** to ensure system reliability and high availability while managing costs efficiently.\n• Designed innovative user interfaces using **Streamlit** and **Gradio**, enhancing user experience and engagement through responsive and dynamic features.\n• Containerized applications using **Docker**, streamlining the deployment process and improving development workflows across various environments.\n• Established CI/CD pipelines to automate testing and deployment, ensuring high-quality software delivery and reducing time-to-market by **40%**.\n• Collaborated with cross-functional teams to produce well-documented and maintainable code, applying best practices in version control with **Git**.\n• Utilized Infrastructure as Code (**IaC**) solutions for consistent and reproducible deployments, facilitating better infrastructure management.\n• Implemented robust problem-solving techniques to address complex challenges in AI model integration and deployment, ensuring successful project outcomes.\n• Applied prompt engineering strategies to optimize AI model performance, achieving an **80%** improvement in response accuracy.\n• Engaged in critical thinking exercises to analyze system architecture and identify areas for enhancement, improving overall functionality.\n• Conducted training sessions on **Python** best practices, fostering a culture of learning and knowledge sharing within software development teams.\n• Championed initiatives to increase code efficiency, achieving a **30%** reduction in execution time for key algorithms."
    },
    {
      "role": "Software Engineer",
      "company": "Altum Software",
      "from_date": "Oct 2017",
      "to_date": "Feb 2020",
      "location": "United Kingdom",
      "responsibilities": "Utilized **Python** frameworks (FastAPI, Django, Flask) to design and optimize scalable **backend services** for AI-driven applications, enhancing performance and user experience across various modules.\nImplemented **Docker** for containerization of Python applications, ensuring smooth deployments and scalability across **cloud** environments like **AWS**, **Azure**, and **GCP**.\nDeveloped and maintained CI/CD pipelines using **Git** and automation tools, ensuring consistent and efficient delivery of features with notable deployments in **version 2.0**.\nLeveraged **Langchain** and **LlamaIndex** to build advanced features in AI applications, focusing on enhancing **prompt engineering** capabilities.\nCreated dynamic and responsive interfaces using **Streamlit** and **Gradio**, integrating them seamlessly with **Python** backends for a rich user experience across platforms.\nEngaged in problem-solving and critical thinking to troubleshoot and optimize performance issues within AI systems, demonstrating strong analytical skills in a fast-paced environment.\nConducted thorough performance testing with tools like **Apache JMeter** and **k6**, identifying bottlenecks and optimizing AI services to handle traffic volumes exceeding **10,000** simultaneous users.\nImplemented Infrastructure as Code (IaC) strategies to automate deployment processes and manage cloud resources efficiently, increasing deployment speed by **30%**.\nCollaborated with cross-functional teams to refine AI models and enhance system capabilities, focusing on iterative improvements and adaptation to user feedback.\nDesigned algorithms for real-time data processing, contributing to lower latency transactions by **25%** and enhanced customer interactions.\nBuilt secure authentication mechanisms with RBAC and OAuth 2.0 in AI applications, ensuring robust user data protection and privacy compliance."
    }
  ],
  "skills": "**Programming Languages:**\n\tPython, LLM\n\n**Backend Frameworks:**\n\tFastAPI, Django, Flask, Spring Boot, Langchain, LlamaIndex\n\n**Frontend Frameworks:**\n\tAngular (1–16), React (15–18), Next.js, Vue.js (2/3), Streamlit, Gradio\n\n**API Technologies:**\n\tREST & gRPC APIs\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL), GCP\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, IaC, CI/CD\n\n**Cloud & Infrastructure:**\n\tCloud, AWS, Azure\n\n**Other:**\n\tSQLAlchemy, Pydantic, Celery, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, Scalability, Problem-Solving, Critical Thinking, English",
  "apply_company": "dLocal"
}