{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior System Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "As a skilled Senior System Engineer with 8 years of experience, I excel in **DevOps**, **CI/CD**, and **Infrastructure as Code** methodologies, utilizing tools like **Ansible** and **Linux** for automation and efficient system management. My proficiency in **Python** enhances my ability to develop and optimize cloud solutions on **GCP**, and I have a solid understanding of **Networking** that supports enterprise-level infrastructure.\nAdditionally, my background in full stack development allows me to bridge the gap between development and operations, ensuring seamless collaboration and deployment. With experience in high-performance solutions across diverse sectors, I bring strong problem-solving skills and a commitment to compliance with standards such as HIPAA and PCI DSS. I am dedicated to leveraging technology to drive operational excellence and seamless system integration.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior System Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Managed **Linux** servers and maintained high availability architectures to support scalable applications in line with industry best practices.\nImplemented **Infrastructure as Code** using **Ansible** for automated provisioning and configuration management, reducing deployment times by **40%**.\nDeveloped and optimized CI/CD pipelines for deployment scalability and reliability, utilizing tools such as **GCP** for cloud resources and GitHub Actions for version control and workflow automation.\nConfigured and monitored networking solutions to ensure ease of access and security for applications, including **Encryption** and **Firewall** rules.\nDesigned and deployed multi-environment infrastructures, implementing **DevOps** principles to encourage collaboration and efficiency between development and operations teams.\nExecuted system updates, performance tuning, and troubleshooting, achieving a system uptime rate of **99.9%**.\nFacilitated the migration of legacy applications to modern environments, utilizing **Go** for robust back-end service improvements.\nMaintained documentation of procedures, system architectures, and configurations, supporting knowledge transfer and operational continuity.\nEnsured compliance with security policies, standards, and regulatory requirements, aligning processes with best practices in the **DevOps** landscape.\nConducted system audits and vulnerability assessments to identify and mitigate potential risks, increasing system security by **25%**."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Implemented **Linux** environments and deployed applications with **Ansible** to automate system configuration and maintain infrastructure as code for seamless integration and delivery.\nEngineered reliable and scalable applications using **Python** to optimize system performance and streamline operations in a **DevOps** culture with a focus on **CI/CD** methodologies.\nAdministered and managed **GCP** services, ensuring robust network configurations and high availability for critical systems.\nDesigned and executed deployment strategies utilizing **Go** to enhance system processes, achieving a deployment efficiency increase of **30%**.\nConfigured and maintained secure networking protocols to ensure data integrity across multiple platforms, facilitating compliance with industry standards.\nObtained **RHCSA** and **RHCE** certifications to validate expertise in managing enterprise-level systems and automating administrative tasks within the infrastructure.\nCollaborated cross-functionally to integrate and optimize continuous integration pipelines that reduced deployment times by **50%**, enhancing overall project delivery timelines.\nUtilized clear documentation and monitoring strategies to improve system reliability and performance tracking, leading to a **20%** reduction in downtime."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Utilized **Linux** for server management and deployment of backend systems, ensuring a stable and secure environment for e-commerce applications.\nEmployed **Ansible** for configuration management and automation of deployment processes, optimizing operational efficiency.\nDeveloped and optimized backend services using **Python** to support high traffic workloads, ensuring scalability for modules like checkout and order fulfillment.\nApplied **Infrastructure as Code** principles, integrating tools like Terraform and **GCP** services to streamline infrastructure management and provisioning.\nImplemented **DevOps** practices by integrating **CI/CD** pipelines for continuous integration and deployment, reducing release times by **30%**.\nLeveraged **Networking** techniques to troubleshoot and optimize performance issues in the network layer, ensuring high availability.\nAchieved **RHCSA** and **RHCE** certifications, demonstrating advanced skills in Linux systems administration and configuration, improving overall system reliability and employee proficiency.\nFocused on enhancing system security by implementing role-based access controls, aligning with industry standards and compliance requirements.\nEngineered automated solutions that decreased uptime during deployments by implementing **blue-green** deployments and CI/CD pipelines, ensuring seamless updates.\nActively monitored system performance and availability, leading to a **40%** improvement in incident response time through proactive remediation strategies."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, Go\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n **Frontend Frameworks:**\n\tJavaScript/TypeScript (React, Vue, Angular)\n\n **API Technologies:**\n\tJWT, OAuth2\n\n **Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL), GCP\n\n **Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Ansible, CI/CD, Infrastructure as Code\n\n **Cloud & Infrastructure:**\n\tTerraform, Helm, Docker Compose, Linux, Networking, RHCSA, RHCE\n\n **Other:**\n\tMLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), Let’s Encrypt, Nginx, Certbot",
  "apply_company": "Hostinger"
}