{
  "name": "Mariusz Jan Skobel",
  "role_name": "Senior Go Engineer",
  "email": "mariuszskobel15@outlook.com",
  "phone": "+48 735 343 548",
  "address": "Katowice, Poland",
  "linkedin": "https://www.linkedin.com/in/mariusz-skobel-927764397/",
  "profile_summary": "Senior Go Engineer with over 10 years of experience in developing high-performance software solutions for healthcare and finance sectors. Proficient in **Go**, with a strong foundation in **Microservices**, **Distributed Systems**, and **Event-driven architecture**. Adept in CI/CD practices and utilizing **Version Control** systems, ensuring smooth development workflows and efficient product delivery. Experienced in **Kubernetes** for orchestrating containerized applications and managing scalable microservices. Skilled in API design and integration, enhancing inter-service communication and functionality across systems. Demonstrated ability to adapt to a **Startup Mindset**, prioritizing tasks effectively within dynamic teams to drive outcomes.\n\nTechnical expertise also includes modern technologies like JavaScript/TypeScript, Python, and Flutter, with hands-on proficiency across the full stack utilizing frameworks such as **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**. Experienced in building and deploying **cloud-native applications** on **Azure** and **AWS**, leading the development of enterprise platforms that leverage AI/ML capabilities for real-time analytics and intelligent decision-making. Strong background in ensuring compliance with standards like HIPAA, FHIR, PCI DSS, and SOC 2, while maintaining secure and maintainable solutions.\n\nPassionate about driving impactful systems development with a blend of technical expertise and real-world application.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2012",
      "to_year": "2015",
      "location": "UK",
      "university": "University of Bristol"
    }
  ],
  "experience": [
    {
      "role": "Senior Go Engineer",
      "company": "EitBiz",
      "from_date": "Oct 2022",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Utilized **Go** to design and implement efficient microservices architectures, enhancing application scalability and maintainability in distributed systems.\n• Collaborated actively with cross-functional teams, displaying strong team collaboration and task prioritization skills to deliver impactful solutions on time and within budget.\n• Engineered and maintained CI/CD pipelines using **Kubernetes** for container orchestration, facilitating seamless application deployment and version control for multiple services.\n• Developed and optimized RESTful APIs to enable smooth communication between microservices, ensuring robust integration with existing systems.\n• Employed event-driven architecture principles to improve the reliability and responsiveness of applications, resulting in a **30%** increase in performance metrics.\n• Championed the use of open-source tools and frameworks, fostering innovation and resourcefulness in application development and maintenance.\n• Achieved **95%** unit test coverage by implementing test-driven development practices, enhancing code quality and reliability.\n• Played a key role in building distributed systems that handle **1 million+** transactions daily, ensuring high availability and fault tolerance.\n• Participated in code reviews and contributed to improving team practices with a startup mindset, aiming for rapid iteration and deployment of features.\n• Managed multiple project priorities, leveraging strong organizational skills to ensure timely delivery of mission-critical features and enhancements."
    },
    {
      "role": "Software Engineer",
      "company": "Tvn S.A.",
      "from_date": "Oct 2019",
      "to_date": "Sep 2022",
      "location": "Poland",
      "responsibilities": "Utilized **Go** for developing and modernizing financial platforms, focusing on **microservices** and **distributed systems** to enhance scalability and throughput for high-volume transaction environments.\nImplemented CI/CD pipelines to streamline the development process, improving deployment efficiency by **30%** and reducing downtime to less than **2%**.\nCollaborated with cross-functional teams, applying open-source solutions and integrating **API** services to foster agile development and enhance system interoperability.\nManaged container orchestration using **Kubernetes**, ensuring a reliable and scalable infrastructure to support event-driven applications and real-time data processing.\nAdopted **version control** practices to maintain code integrity, enabling streamlined collaboration and helping to reduce code conflicts by more than **40%**.\nPrioritized tasks effectively in a fast-paced startup environment, leading the team to successfully deliver project milestones ahead of schedule by **15%**.\nExpanded system capabilities with event-driven architecture by integrating services like Kafka and RabbitMQ, enhancing real-time event processing for financial operations.\nFostered team collaboration through frequent code reviews and knowledge sharing sessions, strengthening the development lifecycle and improving code quality and project outcomes."
    },
    {
      "role": "Software Engineer",
      "company": "Timspark",
      "from_date": "Sep 2015",
      "to_date": "Aug 2019",
      "location": "UK",
      "responsibilities": "Developed and optimized **microservices** architecture using **Go**, ensuring robust scalability and high availability for all backend services in a global e-commerce platform.\nUtilized **Kubernetes** for orchestrating containerized applications, enabling seamless deployment, management, and scaling of services with **CI/CD** pipelines for continuous integration and delivery.\nDesigned and implemented **API** endpoints for various functionalities including checkout, order fulfillment, and user authentication, ensuring efficient communication between frontend and backend systems.\nManaged version control with **Git**, facilitating collaborative development and maintaining code integrity across multiple teams while leveraging **open-source** solutions to enhance project flexibility.\nEmployed **event-driven** architecture for processing real-time data, improving order update notifications and customer interactions through efficient use of **message brokers** like Kafka and RabbitMQ.\nCollaborated with cross-functional teams to prioritize tasks effectively, ensuring optimal performance and timely delivery of features within the agile development cycle, embracing a **startup mindset** to drive innovation and adaptability.\nOptimized distributed systems using technologies like **Redis** and **PostgreSQL** for efficient data handling, thereby enhancing application performance under high traffic volumes.\nImplemented thorough testing and quality assurance processes to maintain code quality and reliability in production environments, supporting seamless user experiences across web and mobile applications.\nDrove discussions and decisions about the architecture roadmap with team members, advocating for best practices in software development, security, and performance optimization."
    }
  ],
  "skills": "**Programming Languages:**\n\tPython, JavaScript/TypeScript, Go\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tAPI\n\n**Serverless and Cloud Functions:**\n\tAWS (Lambda), Azure (App Services)\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS (ECS, RDS, S3), Azure (Blob, SQL)\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, Open Source, Microservices, Distributed Systems, Event-driven, Version Control, Team Collaboration, Task Prioritization, Startup Mindset",
  "apply_company": "Stacklok"
}