{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Middle Full-Stack Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-karol-kotlinski-bb2520397/",
  "profile_summary": "As a dedicated Middle Full-Stack Engineer with 8 years of experience, I excel in developing dynamic, high-performance applications using **React.js**, **.NET**, **C#**, and **ASP.NET Core**. My skill set includes building intuitive user interfaces with **JavaScript**, **HTML5**, and **CSS3**, alongside implementing state management solutions with **Redux** and crafting **RESTful APIs**. I have a strong command of **SQL** databases like **MS SQL Server**, **PostgreSQL**, and **MySQL**, ensuring data integrity and efficiency. \nI also possess experience in cloud environments, particularly **Azure**, and containerization with **Docker**, which enhances deployment and scalability. My expertise in Agile methodologies includes proficiency in **Scrum**, enabling effective collaboration within cross-functional teams. \nAdditionally, I bring robust problem-solving abilities and enhance teamwork through clear communication, striving to deliver compliant and secure software solutions.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Middle Full-Stack Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Developed responsive user interfaces with **React.js** and **Redux**, contributing to a significant improvement in user engagement by **25%** across multiple financial and healthcare applications.\nImplemented server-side logic using **C#** and **ASP.NET Core**, ensuring robust performance and scalability, accommodating over **10,000** simultaneous users without performance degradation.\nManaged and optimized database operations using **SQL**, **MS SQL Server**, and **PostgreSQL**, resulting in a **40%** improvement in query performance and data retrieval speed.\nCollaborated with cross-functional teams in an **Agile** environment, enhancing team communication and accelerating product delivery by **30%** through effective use of **Scrum** methodologies.\nArchitected and maintained RESTful APIs to connect front-end applications with back-end services, achieving a seamless data flow across applications and improving accessibility.\nUtilized **Docker** for containerization of applications, enabling rapid deployment and efficient environment management, reducing deployment time by **50%**.\nDeveloped and deployed high-quality web applications with **HTML5**, **CSS3**, and **JavaScript**, focusing on clean coding practices and responsive design, leading to a **15%** increase in user satisfaction ratings.\nIntegrated testing frameworks like Jest and Postman, establishing thorough testing strategies to ensure code quality and performance across full-stack features.\nContributed to CI/CD processes using **Git** and appropriate pipelines, streamlining code integration and delivery workflows to enhance release efficiency.\nParticipated in team problem-solving sessions, fostering a collaborative atmosphere that promoted innovation and improved overall project outcomes."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Developed and maintained full-stack applications using **.NET** technologies, including **C#**, **ASP.NET Core**, and **EF Core**, ensuring high-performance and high-availability for user-centric features.\nImplemented dynamic, interactive user interfaces utilizing **React.js** alongside modern **JavaScript** frameworks, enhancing user experience and optimizing application responsiveness across devices.\nDesigned RESTful APIs to support seamless communication between front-end and back-end components, enabling efficient data retrieval and manipulation while adhering to best practices in API design.\nConducted database management and optimization using **MS SQL Server**, **PostgreSQL**, and **MySQL**, achieving a 30% increase in query performance through indexing and optimized stored procedures.\nCollaborated with cross-functional teams in an **Agile** environment, engaging in **Scrum** ceremonies to ensure timely delivery of product features and enhancements, fostering effective communication and teamwork.\nUtilized **Git** for version control, ensuring efficient code collaboration and facilitating robust software development processes with seamless integration of multiple team contributions.\nEngaged in problem-solving and provided technical guidance throughout development cycles, enhancing code quality and supporting continuous integration practices.\nDesigned responsive web designs using **HTML5**, **CSS3**, and **Redux**, leading to improved user engagement and a 25% reduction in bounce rates across deployed applications."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Developed and optimized full-stack applications using **.NET** and **C#**, ensuring robust backend services paired with seamless frontend experiences.\nUtilized **React.js** with state management through **Redux** to create dynamic, user-centric interfaces that offer responsive design and high interactivity across web platforms.\nDesigned and implemented **RESTful APIs** for efficient communication between frontend and backend services, leveraging **ASP.NET Core** for improved performance in data handling and service interaction.\nManaged and maintained databases such as **MS SQL Server**, **PostgreSQL**, and **MySQL**, ensuring data integrity and optimized query performance for high-volume transaction processing.\nEmployed containerization through **Docker** for streamlined development, testing, and deployment processes, which enhanced team collaboration and operational consistency.\nEngaged in Agile and Scrum methodologies to foster a culture of teamwork and effective communication, enabling quicker adaptation to project changes and stakeholder feedback.\nConducted code reviews and mentorship, enhancing problem-solving skills across the team and improving overall code quality.\nLed migration of existing applications to **Azure**, enhancing scalability and reliability while maintaining security best practices and compliance standards, including **GDPR**.\nImplemented responsive designs following **HTML5/CSS3** standards, ensuring cross-browser compatibility and superior mobile performance for user engagement.\nMaintained version control and collaboration using **Git**, facilitating efficient workflow management and project tracking across the development team."
    }
  ],
  "skills": " **Programming Languages:** \n\tC#, JavaScript, Python\n\n **Frontend Frameworks:** \n\tReact, React.js, Vue, Angular, HTML5, CSS3, Redux\n\n **Backend Frameworks:** \n\tASP.NET Core, FastAPI, Flask, Django\n\n **API Technologies:** \n\tRESTful APIs\n\n **Databases:** \n\tPostgreSQL, MySQL, MS SQL Server, MongoDB, Redis\n\n **DevOps:** \n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:** \n\tAWS, Azure, ECS, Lambda, RDS, S3, App Services, Blob, SQL\n\n **Other:** \n\tAgile, Scrum, MLflow, Airflow, Kubeflow, problem-solving, communication, teamwork, English proficiency, Keycloak, JWT, OAuth2, Let’s Encrypt, Nginx, Certbot"
}