{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Software Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "As a Senior Software Engineer with 8 years of experience, I excel in developing scalable and secure applications using **Java**, **Spring**, and **REST** APIs, alongside a strong proficiency in **MySQL** for database management. I bring hands-on expertise in deploying applications using **Docker** and optimizing workflows through **CI/CD** practices, ensuring rapid and reliable software delivery. My experience in **AWS** enables me to implement cloud-native solutions that achieve high performance and availability.\nIn addition to my core skills, I have a comprehensive background in the healthcare and financial sectors, building high-performance solutions that comply with standards like HIPAA and PCI DSS. My capabilities extend to integrating **ElasticStack** and **Elasticsearch** into applications for improved logging and search functionalities. I leverage Agile methodologies to foster collaborative development environments, and I am committed to driving innovation and efficiency in SaaS applications.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Software Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Utilized **Java** and **Spring** frameworks to architect and develop robust, scalable web applications, ensuring adherence to best practices in software design and Agile methodologies.\nImplemented **REST**ful services for seamless integration between various services, enhancing system interoperability and ensuring high performance.\nManaged relational databases utilizing **MySQL** to ensure efficient data storage, retrieval, and transactional integrity that supports high-volume applications.\nDeployed containerized applications using **Docker**, contributing to a consistent environment across development and production, increasing deployment efficiency by **30%**.\nDeveloped CI/CD pipelines to automate the deployment process using tools such as **GitHub Actions** and **CircleCI**, reducing downtime and streamlining release management.\nEmployed **ElasticStack** to create real-time data analytics and log management systems that enhance operational visibility and troubleshooting.\nConducted code reviews and mentored junior engineers, fostering a culture of collaboration and continuous improvement that led to a **20%** improvement in team productivity.\nLed agile sprints and managed project timelines effectively to ensure timely delivery of high-quality software products aligned with business objectives.\nDesigned and implemented SaaS solutions that meet client needs, providing features such as multi-tenancy, scalability, and security compliance, which increased customer satisfaction scores by **25%**.\nCollaborated with cross-functional teams to define requirements and deliver innovative solutions that drive business success."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Designed and implemented RESTful APIs using **Java** and **Spring** to enhance the functionality and scalability of financial applications, increasing throughput by **30%**.\nDeveloped and maintained robust backend services integrated with **MySQL** databases, ensuring data integrity and availability for high-volume financial transactions.\nManaged deployments using **Docker** and orchestrated CI/CD pipelines to streamline the software release process, reducing deployment times by **50%**.\nUtilized **AWS** services for cloud infrastructure, enhancing application resilience and reliability while optimizing costs by **20%**.\nImplemented data monitoring and analytics solutions with **ElasticStack** and **Elasticsearch**, improving the insights derived from transaction data and supporting compliance efforts.\nCollaborated within an **Agile** team, employing best practices to deliver high-quality software solutions in a customer-centric approach, contributing to a **15%** increase in customer satisfaction ratings.\nDeveloped **SaaS** solutions that catered to the unique needs of financial clients, tailoring applications to fit specific business requirements and ensuring rapid deployment and adaptability.\nActively contributed to code reviews and mentoring juniors, fostering a culture of continuous learning and improvement.\n"
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Developed and maintained RESTful APIs using **Java** and **Spring**, ensuring robust integration and seamless communication within the e-commerce ecosystem.\nEngineered cloud-native applications deployed on **AWS**, utilizing **Docker** for containerization and enhancing CI/CD processes to accelerate application deployment cycles by **30%**.\nOptimized database interactions with **MySQL**, enhancing query performance and data retrieval speed, contributing to reduced load times by **25%** during peak traffic.\nImplemented real-time monitoring and logging solutions using **ElasticStack**, ensuring high availability and rapid issue resolution across production environments.\nCollaborated in an Agile environment, participating actively in sprint planning and retrospectives, enhancing team efficiency, and delivering features on time, leading to a **15%** improvement in project delivery timelines.\nDesigned and developed SaaS solutions that offer scalable services, allowing for rapid growth and significant user engagement increases by **40%** in the last quarter.\nIntegrated advanced search capabilities using **Elasticsearch** to improve product discovery, achieving a **50%** reduction in search latency for end users.\nFacilitated the implementation of feature flags and automated testing practices in CI/CD pipelines, enhancing deployment reliability and efficiency.\nUtilized advanced design patterns and REST principles to build microservices architecture, ensuring modularity and ease of maintenance of high-traffic applications.\nImplemented security best practices including role-based access control (RBAC) and user authentication frameworks, ensuring compliance with industry standards."
    }
  ],
  "skills": " **Programming Languages:**\n\tJava, Python, JavaScript/TypeScript\n\n**Backend Frameworks:**\n\tSpring, FastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tREST\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda), Azure (App Services)\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS (RDS, S3), Azure (Blob, SQL)\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, Authentication & Security, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, ElasticStack, Elasticsearch, Agile, SaaS",
  "apply_company": "Brightflag"
}