{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Software Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "As a Senior Software Engineer with 8 years of experience, I specialize in full-stack development and possess strong proficiency in **HTML**, **CSS**, **JavaScript**, **Node.js**, and **Python**. I am well-versed in modern front-end frameworks such as **React** and **Angular**, and have a comprehensive understanding of database technologies including **MySQL** and **PostgreSQL**. My experience extends to using **Git** for version control and developing robust APIs that drive seamless application performance.\n\nI have demonstrated expertise in cloud services, particularly with **AWS** and **Azure**, enabling me to design and implement scalable serverless architectures. Additionally, I have integrated CRM solutions, including **HubSpot**, **Salesforce**, and **Dynamics** into enterprise-grade applications.\n\nMy background in building high-performance solutions across healthcare and financial sectors is complemented by my strong foundation in microservices architecture, event-driven systems, and CI/CD automation. I have successfully led the development of platforms incorporating AI/ML capabilities, predictive analytics, and real-time data processing, ensuring compliance with standards such as HIPAA and PCI DSS. My hands-on experience with machine learning pipelines using tools like **MLflow**, **Airflow**, and **Kubeflow** further enhances my ability to deliver secure and efficient applications.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Software Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Developed scalable, full-stack applications utilizing **JavaScript** (Node.js), **Python**, and modern frameworks like **React** (17-18) and **Angular**, aligning with best practices and standards.\n• Architected and maintained database systems using **PostgreSQL** and **MySQL**, ensuring optimal performance and data integrity for applications handling large-scale transactions.\n• Created robust APIs that enable integration with various third-party services, ensuring secure communication and data exchange across platforms.\n• Implemented serverless architectures utilizing **AWS** and **Azure**, enhancing application scalability and reliability by leveraging cloud capabilities.\n• Collaborated on cross-platform development projects using **HTML**, **CSS**, and JavaScript frameworks for seamless user experience across devices, employing responsive design principles.\n• Led the adoption and integration of CI/CD practices with **Git** and **Firebase**, streamlining deployment processes and enhancing development workflow efficiency.\n• Drove the implementation of comprehensive testing strategies using **Jest** and **Cypress**, achieving at least **90%** test coverage for critical application components.\n• Spearheaded the integration of advanced analytics and reporting features into applications utilizing **Power BI** and **Firebase**, enabling real-time data insights and decision-making.\n• Fostered collaboration with cross-functional teams, including DevOps and product management, facilitating the successful delivery of multiple **versions** of high-impact software solutions on schedule.\n• Engaged in continuous learning and application of best practices in software engineering, ensuring familiarity with emerging technologies and updating tech stack prowess accordingly."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Utilized **Node.js** and **Python** to lead the development and modernization of financial platforms, implementing a microservices-based architecture that enhanced scalability and maintainability for systems handling **9 million** transactions daily.\nDesigned and developed responsive web applications using **React (18)**, **TypeScript**, and **Vue 3**, leveraging **Tailwind CSS** and **Redux Toolkit** to create interfaces that improved user engagement and performance by **25%**.\nEngineered real-time transaction monitoring dashboards with **React**, **D3.js**, and **Power BI Embedded**, facilitating operational teams to track activities and detect anomalies, which resulted in a **15%** decrease in fraud incidents.\nImplemented robust event-driven architectures by integrating **Kafka**, **RabbitMQ**, and **Azure Service Bus**, supporting more than **1,000** real-time events processed per second.\nDeveloped ETL pipelines utilizing **Python**, **Apache Airflow**, and **Azure Data Factory** for efficient data ingestion, managing both batch and real-time data from internal and third-party sources, and ensuring data accuracy within **98%**.\nApplied **AI/ML** techniques for fraud detection using **scikit-learn**, **XGBoost**, and **Azure Machine Learning**, achieving a model accuracy of **92%** for detecting suspicious banking transactions.\nCreated machine learning pipelines for applications such as credit scoring and churn prediction using **MLflow** and **Airflow**, enabling real-time model inference that improved decision-making efficiency by **30%**."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Developed and optimized web applications and services using **HTML**, **CSS**, **JavaScript**, **Python** (**FastAPI**, **Django**), and **Node.js** (**NestJS**, **Express**), ensuring robust, scalable, and maintainable code across platforms.\nEngineered backend services that enhance performance and reliability for high-traffic e-commerce platforms, with a focus on modular architecture and **API** design.\nCreated responsive, SEO-friendly user interfaces utilizing **React** (version **18**), **Angular**, and enhanced with **TypeScript** and **Tailwind CSS**, achieving fast, engaging web experiences that support mobile accessibility.\nImplemented secure and efficient data management solutions using **PostgreSQL** and **MySQL**, ensuring fault tolerance and quick data retrieval across multiple services, thereby optimizing response times during peak operations.\nUtilized version control and collaboration tools like **Git** to manage codebase effectively, supporting team projects and continuous integration/continuous deployment (CI/CD) practices.\nArchitected real-time data processing features utilizing event-driven platforms like **Kafka** and **RabbitMQ** to enable instantaneous updates and notifications across the e-commerce infrastructure.\nFacilitated cloud-based deployment and scaling strategies using **AWS** and **Azure**, ensuring high availability and resilience of applications across multiple environments.\nCreated secure payment integration workflows with **Stripe**, **PayPal**, and **Razorpay**, emphasizing compliance with PCI standards to protect transaction data.\nManaged user authentication and session integrity through **OAuth 2.0** and implemented role-based access control (RBAC) for secure interactions within the application.\n"
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, JavaScript, TypeScript\n\n **Frontend Frameworks:**\n\tReact, Angular, HTML, CSS\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django, NodeJS\n\n **API Technologies:**\n\tAPI\n\n **Serverless and Cloud Functions:**\n\tAWS, GCP, Firebase, Azure\n\n **Databases:**\n\tPostgreSQL, MySQL\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD\n\n **Cloud & Infrastructure:**\n\tTerraform, Ansible, Helm, Docker Compose, AWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n **Other:**\n\tKeycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, MLflow, Airflow, Kubeflow, Redis, HubSpot, Salesforce, Dynamics, Git",
  "apply_company": "WE7 Digital GmbH"
}