{
  "name": "Rei Taro",
  "role_name": "Senior Frontend Engineer",
  "email": "rei515@outlook.com",
  "phone": "+48732529451",
  "address": "Warszawa, Poland",
  "linkedin": "https://www.linkedin.com/in/rei-taro-81a410391/",
  "profile_summary": "Results-driven Senior Frontend Engineer with over 10 years of experience in developing dynamic and responsive web applications. Proficient in **Angular**, **JavaScript**, **HTML5**, and **CSS3**, with a strong focus on creating high-quality **RESTful APIs** and optimizing web performance. Skilled in implementing **CI/CD** practices and utilizing **Git** for version control. Demonstrated ability to enhance web architecture and ensure responsive design across various platforms. Strong background in backend development, with experience in **Python** (FastAPI, Django, Flask) and cloud technologies including **AWS** and **Azure**. Proven success in delivering impactful projects for leading organizations such as VISA, Sii Poland, and Reply Polska.",
  "education": [
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2010",
      "to_year": "2015",
      "location": "Japan",
      "university": "Keio University"
    }
  ],
  "experience": [
    {
      "role": "Senior Frontend Engineer",
      "company": "Leobit",
      "from_date": "Aug 2022",
      "to_date": "Present",
      "location": "Poland",
      "responsibilities": "Developed user-friendly interfaces and interactive components in **Angular** to enhance the frontend experience adhering to **Responsive Design** principles.\nImplemented **JavaScript** and **HTML5** for dynamic content rendering, optimizing performance to achieve a **30%** improvement in load times.\nUtilized **CSS3** for styling components and ensuring a seamless user experience across multiple devices.\nDesigned and integrated **RESTful APIs** to efficiently communicate between backend services and the frontend, managing data flow and user interactions.\nEmployed **Git** for version control and collaborating on codebases, ensuring smooth CI/CD pipelines for consistent deployment.\nOptimized web architecture strategy to improve the overall performance of applications, leading to a **25%** reduction in server response times.\nImplemented **NgRx** for state management, streamlining data handling within applications and enhancing maintainability.\nConducted code reviews and user testing, resulting in a decrease of **15%** in reported post-launch bugs, significantly improving user satisfaction.\n"
    },
    {
      "role": "Software Engineer",
      "company": "Innovature",
      "from_date": "Nov 2018",
      "to_date": "Jun 2022",
      "location": "Japan",
      "responsibilities": "Implemented responsive web design principles using **HTML5**, **CSS3**, and **JavaScript** to enhance user experience and accessibility, achieving a **95%** user satisfaction rate.\nDeveloped and maintained **RESTful APIs** to facilitate efficient data exchange between frontend applications and backend services, reducing load time by **30%**.\nUtilized **Angular** and **NgRx** to create dynamic, high-performance user interfaces, resulting in a **25%** increase in app responsiveness.\nEmployed **Git** for version control and collaborated on a **CI/CD** pipeline to streamline deployment processes, reducing release cycles by **40%**.\nOptimized web architecture for performance improvements, achieving a **50%** decrease in page load times through advanced caching strategies.\nConducted performance optimization tests and integrated results into the development process, enhancing overall application efficiency.\nCollaborated with backend teams to ensure smooth integration of frontend components, aligning with project deadlines and regulatory requirements."
    },
    {
      "role": "Software Developer",
      "company": "Wizcorp",
      "from_date": "Apr 2015",
      "to_date": "Nov 2018",
      "location": "Japan",
      "responsibilities": "Implemented and optimized **Angular** applications, leveraging **JavaScript**, **HTML5**, and **CSS3** to enhance user interface and experience for clients promoting seamless interaction with trading platforms.\nDesigned and integrated robust **RESTful APIs** ensuring reliable communication between frontend and backend services, crucial for data exchange in real-time trading.\nUtilized **Git** for version control, improving collaborative development efforts while maintaining code integrity across multiple projects.\nEnhanced project delivery efficiency by establishing **CI/CD** pipelines using industry-standard practices, minimizing deployment time and increasing release frequency by **50%**.\nFocused on **performance optimization** through proactive monitoring and load testing, achieving a **30%** reduction in page load times and improving overall user satisfaction.\nDeveloped responsive design principles to ensure **100%** compatibility across various devices and screen sizes, catering to a diverse user base.\nCollaborated with cross-functional teams to offer innovative solutions in **web architecture**, enhancing system scalability and maintainability as project demands increased."
    }
  ],
  "skills": "Programming Languages:\n\t**JavaScript**, **Python (3.8+)**, **SQL**, **Bash**\n\n**Frontend Frameworks:**\n\t**Angular**, **HTML5**, **CSS3**\n\n**Backend Frameworks:**\n\t**FastAPI**, **Flask**, **Django**, **Celery**\n\n**API Technologies:**\n\t**RESTful APIs**, **REST/gRPC APIs**\n\n**Serverless and Cloud Functions:**\n\t**AWS (EC2, S3, Lambda)**, **Azure**\n\n**Databases:**\n\t**PostgreSQL**, **MySQL**, **MongoDB**, **Redis**\n\n**DevOps:**\n\t**Docker**, **Kubernetes**, **Git**, **GitHub Actions**, **Azure DevOps**, **CI/CD**\n\n**Cloud & Infrastructure:**\n\t**Performance Optimization**, **Web Architecture**, **Microservices**, **Kafka**\n\n**Other:**\n\t**AI/ML Tools: Pandas**, **NumPy**, **scikit-learn**, **TensorFlow**, **Airflow**, **MLflow**, **PyTest**, **Responsive Design**",
  "apply_company": "EPAM Systems"
}