{
  "name": "Tomasz Lee",
  "role_name": "Senior Full-Stack Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Results-driven Senior Full-Stack Engineer with 9+ years of expertise in developing scalable and secure web applications. Proficient in **Python**, **TypeScript**, and a variety of APIs, with a strong focus on creating fault-tolerant systems and ensuring compliance in payroll systems and HR Tech. Experienced in integrations and customization, leveraging technologies like **ReactJS**, **NextJS**, **.NET**, and **C#** to deliver robust, user-centric solutions. Demonstrated ability to optimize performance, streamline development processes, and lead projects to successful completion while collaborating effectively across teams.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Senior Full-Stack Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Utilized **Python** and **TypeScript** for developing robust web applications and APIs, ensuring compliance with industry standards.\nDesigned and built scalable systems architecture capable of handling high volume transactions, enhancing system reliability and fault tolerance by **30%**.\nSpearheaded the integration of payroll systems with existing applications, leveraging **Temporol** for efficient data management and custom reporting.\nImplemented security best practices, including JWT-based authentication and authorization, to protect sensitive user data and maintain application integrity.\nCollaborated with cross-functional teams to customize web applications tailored to client specifications, resulting in a **20%** increase in customer satisfaction.\nDeveloped and executed integration strategies to streamline various HR Tech tools, ensuring seamless communication across platforms and improving operational efficiency.\nEnhanced system scalability by adopting microservices architecture patterns, resulting in reduced system downtime by **15%**.\nEnsured compliance with relevant regulations and standards throughout the development lifecycle, mitigating risks associated with non-compliance.\nConducted regular system audits and performance testing, achieving an average server response time of under **200ms**."
    },
    {
      "role": "Full Stack Developer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "• Developed scalable web applications using **TypeScript** and **Python**, enhancing application performance and user experience.\n• Designed and implemented robust APIs to ensure seamless integrations with various payroll systems and HR tech solutions, maintaining a compliance rate of 100%.\n• Created fault-tolerant systems leveraging cloud services, increasing system resilience and uptime metrics to **99.9%**.\n• Integrated custom solutions into existing applications, achieving a **20%** reduction in operational costs through effective process optimization.\n• Led the development of a microservices architecture utilizing **RabbitMQ** and **Kafka**, which improved data handling capabilities for high-volume transactions by **40%**.\n• Constructed real-time reporting systems with interactive charts using **D3.js**, resulting in improved visibility of project statuses across teams.\n• Implemented advanced security measures in web applications, achieving full compliance with industry standards and enhancing data protection.\n• Conducted thorough code reviews and mentor sessions, fostering a culture of learning and improving team productivity by **15%**.\n• Define system requirements through collaboration with stakeholders, ensuring projects are delivered on time and within budget constraints."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "• Developed scalable web applications using **Python** and **TypeScript**, ensuring high availability and fault tolerance, which led to a **20%** increase in user engagement.\n• Created robust APIs for smooth integrations with payroll systems and third-party services, enhancing the platform's customisation capabilities.\n• Implemented compliance measures in code to secure sensitive HR data, maintaining industry standards for security and data privacy.\n• Utilized **Temporal** for managing complex workflows within applications, leading to a more efficient processing of **10,000+** requests per hour.\n• Engineered fault-tolerant architecture for HR tech solutions, resulting in system reliability metrics improving to **99.9%** uptime.\n• Collaborated with cross-functional teams in daily standups to ensure timely delivery of features and compliance across multiple projects.\n• Delivered technical documentation and user guides to facilitate knowledge transfer and adherence to compliance protocols within teams.\n• Engaged with the project to enhance frontend experiences using frameworks like **Vue.js**, directly contributing to a **15%** increase in user satisfaction on client dashboards."
    }
  ],
  "skills": " **Programming Languages**\n\tPython, TypeScript\n\n**Backend Frameworks**\n\tNodeJS, ExpressJS, NestJS, C#, .NET, Entity Framework, Microservices\n\n**Frontend Frameworks**\n\tHTML, CSS, JavaScript, ReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n**API Technologies**\n\tRESTful API, GraphQL, APIs, Integrations\n\n**Serverless and Cloud Functions**\n\tAWS, Azure\n\n**Databases**\n\tMSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB\n\n**DevOps**\n\tCI/CD pipelines\n\n**Cloud & Infrastructure**\n\tSecurity, Compliance\n\n**Other**\n\tUX/UI Design, Git, GitHub, Web Applications, Payroll Systems, Scalable Systems, Fault Tolerance, Customisation, Temporal, Blockchain, Solidity, Ether.js, Web3.js, Ethereum, Messaging & Caching: Apache Kafka, RabbitMQ, Redis, Testing Tools: NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest, Redux\n",
  "apply_company": "Ben"
}