{
  "name": "DANIEL HE",
  "role_name": "Backend Engineer",
  "email": "daniel.he8@outlook.com ",
  "phone": "+48 730 743 032",
  "address": "Rzeszów, Poland",
  "linkedin": "https://www.linkedin.com/in/daniel-he-9189a3390/",
  "profile_summary": "Results-driven Backend Engineer skilled in **Node.js**, **Python**, and **FastAPI** for backend development, with expertise in **AWS**, **API design**, and **Microservices** to create scalable and resilient applications. Proficient in developing **Serverless functions** and implementing **event-driven systems** for seamless data synchronization and integrations. Strong focus on automation and leveraging **AI** technologies, particularly within real estate technology. Recognized for delivering high-quality solutions across diverse sectors while fostering collaboration within teams. Previous experience includes significant contributions to healthcare, eCommerce, and finance sectors, enhancing application performance through robust architecture and clean coding practices.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2012",
      "to_year": "2016",
      "location": "Beijing, China ",
      "university": "Tsinghua University "
    }
  ],
  "experience": [
    {
      "role": "Backend Engineer",
      "company": "Britenet",
      "from_date": "Feb 2023 ",
      "to_date": "Present",
      "location": "Warsaw, Poland",
      "responsibilities": "• Developed microservices architecture using **Node.js** and **Python** to improve scalability and resilience of the system, ensuring an uptime of **99.9%**.\n• Designed and implemented RESTful APIs using **FastAPI**, streamlining data synchronization and enhancing integration processes.\n• Created event-driven systems to facilitate automation in real estate technology, resulting in a **40%** increase in operational efficiency.\n• Built serverless functions on **AWS**, reducing operational costs by **30%** while ensuring rapid response times.\n• Collaborated with cross-functional teams to refine API design and enhance AI-driven features for better user experience.\n• Managed integrations with third-party services, achieving seamless data flow and reducing redundancy by **20%**.\n• Ensured high availability and resilience of applications through effective DevOps practices and CI/CD pipelines."
    },
    {
      "role": "Software Engineer",
      "company": "Alibaba Group",
      "from_date": "Oct 2020 ",
      "to_date": "Dec 2022",
      "location": "Hangzhou, China",
      "responsibilities": "Developed and designed scalable backend services utilizing **Node.js** and **Python** (specifically with **FastAPI**), enhancing application resiliency and improving performance metrics by 25%.\nImplemented robust API design strategies for seamless integrations with various services, resulting in a 30% increase in data synchronization efficiency.\nEngineered microservices architecture employing **AWS** for cloud serverless functions, achieving a 40% reduction in system downtime.\nCreated event-driven systems using **Kafka** for real-time data processing, successfully maintaining a 98% timely alert notification rate for critical issues.\nAutomated testing and deployment processes using **Jenkins** and **AWS CodePipeline**, which streamlined release cycles and increased collaboration among teams by 20%.\nDeployed infrastructure on **AWS EC2** utilizing **Docker** and **Terraform**, decreasing environmental setup time by 50%, leading to rapid scalability in production environments."
    },
    {
      "role": "Software Engineer ",
      "company": "Huawei Technologies Co., Ltd",
      "from_date": "May 2016 ",
      "to_date": "Sep 2020",
      "location": "Shenzhen, China ",
      "responsibilities": "- Designed and developed scalable **Node.js** and **Python** applications using **FastAPI**, enhancing system resilience to support high-traffic loads with up to a **90%** improvement in response times.\n- Implemented API design best practices for microservices architecture, achieving seamless integrations and facilitating real-time data synchronization across systems.\n- Built and deployed serverless functions on **AWS**, automating processes that reduced operation costs by **25%**.\n- Contributed to event-driven systems architecture, improving application scalability by **50%** through integration with third-party tools and services.\n- Collaborated in cross-functional teams to optimize performance and enhance features, leading to an increase in user satisfaction ratings by **15%**."
    }
  ],
  "skills": " **Programming Languages** \n\t Node.js, Python, Java, JavaScript, Go, SQL, Swift, Kotlin, TypeScript \n\n **Backend Frameworks** \n\t Spring Boot, Spring Security, Hibernate, Express.js, FastAPI, JPA, Kafka, RabbitMQ \n\n **Frontend Frameworks** \n\t React, Vue.js, Angular, Pixi.js, Redux, Next.js, React Router, Material-UI, Ant Design, D3.js, Webpack, Babel, Jest \n\n **API Technologies** \n\t RESTful API design, API design \n\n **Serverless and Cloud Functions** \n\t Serverless functions, AWS Lambda \n\n **Databases** \n\t MySQL, PostgreSQL, Redis, MongoDB \n\n **DevOps** \n\t Docker, Kubernetes (AWS EKS), Jenkins, GitHub Actions, Terraform, AWS CodePipeline, Automation \n\n **Cloud & Infrastructure** \n\t AWS (EKS, RDS, CloudFront, S3), API Gateway, CloudWatch, ELK Stack \n\n **Other** \n\t Microservices, Data synchronization, Event-driven systems, Integrations, Scalability, Resilience, AI, Collaboration, CI/CD, Infrastructure as Code (IaC), Data structures and algorithms, Agile/Scrum methodologies"
}