{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Applications Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Results-driven Senior Applications Engineer with over 13 years of experience in process optimization and technical reporting within the healthcare and financial sectors. Proficient in CNC programming and tooling, with a solid foundation in material science. Highly skilled in customer service and sales support, ensuring client satisfaction and successful project outcomes. Focused on problem-solving and delivering innovative solutions. Strong technical proficiency in **JavaScript**, **TypeScript**, **Python**, and **Flutter**, with extensive experience developing high-performance applications leveraging **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**. Demonstrated expertise in deploying cloud-native systems on **AWS** and **Azure**, implementing microservices, event-driven architectures, and CI/CD pipelines. Experienced in MLOps practices using **MLflow**, **Airflow**, and **Kubeflow**, and committed to compliance-driven development in alignment with industry standards.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Applications Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Optimized CNC machining processes through advanced tooling techniques, utilizing knowledge in material science to enhance efficiency in production environments.\n- Developed and implemented SAP solutions to streamline operations, improving workflow efficiency by **30%** and reducing processing times.\n- Conducted technical reporting to support sales teams, generating comprehensive documentation that contributed to a **15%** increase in customer satisfaction ratings.\n- Collaborated with cross-functional teams to deliver exceptional customer service, leveraging problem-solving skills to address technical challenges effectively.\n- Trained and supported team members on MS Office tools, improving their proficiency and productivity, leading to a **20%** reduction in project turnaround times.\n- Spearheaded process optimization initiatives, successfully resulting in material waste reduction by **25%** and enhancing overall production quality.\n- Engaged with customers to gain feedback, further refining tooling and process methodologies to align with client needs and expectations.\n- Leveraged technical expertise to assist in the interpretation and translation of complex engineering concepts to non-technical stakeholders, bridging gaps in communication."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Utilized **SAP** for managing CNC machining processes and tooling, ensuring efficient operation and optimization of material science applications in **manufacturing**.\nConducted thorough **technical reporting** on manufacturing metrics, leveraging MS Office to present findings to stakeholders effectively, facilitating data-driven decision-making.\nStreamlined processes through optimization techniques, enhancing operational efficiency by **15%** across various projects.\nProvided exemplary **customer service** by addressing client inquiries regarding technical specifications and product support, thereby fostering long-term relationships that increased **sales support** effectiveness by **20%**.\nLed problem-solving sessions to troubleshoot complex manufacturing issues, employing analytical skills and innovative solutions that minimized downtime by **30%**.\nCollaborated with cross-functional teams to implement tooling improvements, enhancing product quality standards and compliance with industry regulations.\nDeveloped training materials and documentation to support technical knowledge transfer within teams, aiding in process standardization and efficiency."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Utilized **SAP** for process optimization and tooling design, ensuring precision in CNC manufacturing processes and compliance with material science specifications.\nProvided exceptional customer service and sales support by effectively communicating technical aspects and solutions to clients, enhancing overall satisfaction and engagement.\nConducted detailed technical reporting, leveraging **MS Office** to present data-driven insights on manufacturing processes and CNC machine performance to stakeholders.\nImplemented problem-solving strategies to optimize production workflows, achieving a **15%** increase in efficiency across manufacturing operations.\nCollaborated with cross-functional teams to analyze customer requirements and develop tailored applications that meet specific technological needs in the CNC sector.\nManaged project timelines and deliverables through proactive communication and organization, ensuring milestones were met with a dedicated focus on quality.\nTrained and coached junior engineers on CNC techniques and technology, fostering a culture of continuous improvement and knowledge sharing within the team.\nAssured seamless transition and updates to applications, increasing stakeholder confidence through meticulous testing and validation processes."
    }
  ],
  "skills": "Programming Languages:\n\tPython: FastAPI, Flask, Django\n\tJavaScript/TypeScript: React, Vue, Angular\n\n**Backend Frameworks:**\n\t\n\n**Frontend Frameworks:**\n\t\n\n**API Technologies:**\n\t\n\n**Serverless and Cloud Functions:**\n\tAWS: ECS, Lambda, RDS, S3\n\tAzure: App Services, Blob Storage, SQL Database\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare)\n\tMongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes\n\tGitHub Actions, GitLab CI/CD\n\n**Cloud & Infrastructure:**\n\tTerraform, Ansible, Helm, Docker Compose\n\n**Other:**\n\tCNC\n\ttooling\n\tmaterial science\n\tSAP\n\tMS Office\n\tprocess optimization\n\tcustomer service\n\tsales support\n\ttechnical reporting\n\tproblem solving\n\tEnglish\n\tMLflow, Airflow, Kubeflow\n\tKeycloak (OIDC, RBAC), OAuth2, JWT\n\tNginx, Let’s Encrypt, Certbot",
  "apply_company": "Kennametal"
}