{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior AI Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Results-driven Senior AI Engineer with 13+ years of experience in designing and implementing AI/ML solutions, adept in **Python**, **TensorFlow**, **PyTorch**, **HuggingFace**, and **LangChain**. Proficient in data manipulation and analysis using **Pandas** and **NumPy**, enhancing model training and deployment for intelligent applications.\nSkilled in MLOps methodologies, ensuring efficient model lifecycle management through tools like **MLflow** and **Kubeflow**. Strong background in AI ethics and data privacy, ensuring compliance with rigorous industry standards.\nExpert in delivering high-performance applications within healthcare and financial sectors, utilizing cutting-edge technologies such as **React**, **Next.js**, and **FastAPI**. Proven ability to deploy scalable systems on cloud platforms like **AWS** and **Azure**, along with a solid grasp of microservices architecture and CI/CD practices. Strong analytical and problem-solving skills with a commitment to applying agile methodologies for continuous improvement.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior AI Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Developed advanced AI solutions utilizing **Python** and libraries such as **Pandas**, **NumPy**, **TensorFlow**, and **PyTorch** to enhance data processing and machine learning capabilities.\n- Designed and implemented MLOps workflows incorporating **HuggingFace**, **LangChain**, and **ONNX** for efficient model training, validation, and deployment.\n- Ensured compliance with data privacy regulations and ethical standards while managing AI models and data handling in all projects.\n- Collaborated in agile teams to solve complex problems, deploying state-of-the-art large language models (LLMs) for enhanced data analysis and decision-making.\n- Led integrations of intelligent features such as predictive analytics and automation in various applications, optimizing processes in dynamic environments.\n- Maintained high coding standards and testing protocols, applying robust methodologies to ensure software quality and reliability.\n- Provided mentorship in using cutting-edge AI tools and techniques, building a knowledgeable team capable of tackling advanced AI projects effectively."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Utilized **Python** to develop machine learning models focused on fraud detection, leveraging libraries such as **scikit-learn**, **XGBoost**, and **TensorFlow** to enable proactive identification of suspicious activities based on user behavior with over **95% accuracy**.\nDesigned and implemented ML pipelines for real-time credit scoring and transaction classification, integrating with backend services using **MLflow** and **Airflow** to streamline machine learning processes and reduce latency by **20%**.\nImplemented advanced data manipulation and analysis using **Pandas** and **NumPy** for processing large datasets, ensuring high data quality and integrity for machine learning workflows.\nCollaborated with cross-functional teams to adhere to **AI ethics** and **data privacy** standards while developing AI solutions, reducing compliance risks by **30%**.\nLed agile project management practices, ensuring timely delivery of features and iterative improvements to maintain product relevance and performance.\nActively engaged in problem-solving to optimize algorithms and enhance model performance, achieving a training time reduction from **48 hours** to **12 hours** using optimized hyperparameter tuning and deployment strategies with **MLOps**.\nEnsured successful integration of generative models from **HuggingFace** and **LangChain** for natural language processing tasks to enhance user interaction and experience across AI applications."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Leveraged **Python** and **TensorFlow** to develop AI models and algorithms, enhancing e-commerce platform functionalities through data-driven insights and automating decision-making processes.\nEngineered machine learning pipelines using **Pandas** and **NumPy**, ensuring efficient data preprocessing, feature extraction, and model training for large datasets.\nImplemented AI-driven solutions utilizing **HuggingFace** and **LangChain**, revolutionizing customer interactions with intelligent chatbots and personalized recommendations.\nApplied **MLOps** practices for model deployment and monitoring, ensuring high availability and performance of AI systems across the e-commerce platform.\nConducted thorough assessments of AI ethics and data privacy measures to align with GDPR compliance, safeguarding user data and maintaining transparency in AI-driven decisions.\nCollaborated within an **Agile** environment, fostering cross-functional teamwork to facilitate continuous improvement and iterative development of AI capabilities.\nDeveloped and optimized backend services using **Python** (FastAPI, Django) and **Node.js** (NestJS, Express) that provide seamless integration with AI features while ensuring high availability and scalability.\nEngineered real-time features using **WebSockets** and event-driven architecture powered by **Kafka** and **RabbitMQ**, enabling responsive AI-driven updates to the user experience.\nCreated responsive UIs optimized for AI application features using **Next.js**, **Vue 3** + **Nuxt**, and **HTML5/CSS3**, enhancing user engagement and accessibility (WCAG 2.1).\nIntegrated secure payment workflows with **Stripe**, **PayPal**, and **Razorpay**, employing tokenized transactions that protect sensitive information while utilizing AI-driven fraud detection mechanisms."
    }
  ],
  "skills": "****Programming Languages:****\n\tPython, JavaScript/TypeScript\n\n****Backend Frameworks:****\n\tFastAPI, Flask, Django\n\n****Frontend Frameworks:****\n\tReact, Vue, Angular\n\n****API Technologies:****\n\tOAuth2, JWT\n\n****Serverless and Cloud Functions:****\n\tAWS: Lambda, ECS, RDS, S3\n\tAzure: App Services, Blob Storage, SQL Database\n\n****Databases:****\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n****DevOps:****\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD\n\tTerraform, Ansible, Helm, Docker Compose\n\n****Cloud & Infrastructure:****\n\tNginx, Let’s Encrypt, Certbot\n\n****Other:****\n\tPandas, NumPy, TensorFlow, PyTorch, HuggingFace, LangChain, ONNX, MLOps, AI ethics, data privacy, problem-solving, agile, MLflow, Airflow, Kubeflow",
  "apply_company": "Resolve To Save Lives"
}